{
  "title":"Development Workflows with Collin Jilbert",
  "date":"2022-10-28T20:16:16.000000Z",
  "author":null,
  "id":"8388f44a-dcce-43de-b484-62e46cca0184",
  "link":"https://share.transistor.fm/s/5496e424",
  "content":"\n        <p>[00:00:39] Go Rails and Discord went crazy for Go Rails this morning, Collin talks about putting out the fires. This reminds Andrew of the issue he had with his dotfiles once. Admit it, we’ve all been there before! </p><p><br></p><p>[00:05:31] Collin is enjoying his minimal config setup lately. Andrew talks about how he likes using Znap! to help him with his dot files and reduce his shell’s startup time.</p><p><br></p><p>[00:06:43] Andrew talks more about minimalizing his setup by getting rid of aliases he’s not using every couple months, as well as plugins. It’s hard to stop hoarding those plugins! </p><p><br></p><p>[00:07:13] Collin really only uses Vim but has a lot of theme plugins, and the plugins he does have tend to be from Tim Pope.  </p><p><br></p><p>[00:08:26] Both Collin and Andrew dive deeper into aliases. Collin, he’s runs his pretty lean and just uses some mnemonics for Rails commands. Andrew did a lot of house cleaning and now just has a handful for very basic things for Rails and Git.</p><p><br></p><p>[00:14:06] Andrew discusses functions and thinning the herd. One that he does love is the GitHub labels he made. Andrew talks about how great the GitHub CLI is, and if you haven’t checked it out in a while, PLEASE DO.</p><p><br></p><p>[00:17:59] Andrew recently switched his terminal to Warp, a Rust based terminal. Find out why he’s almost as excited about Warp as he is when DoorDash shows up with Chick-fil-a. </p><p><br></p><p>[00:19:48] The boys talk tmux and Andrew tells us the NUMBER 1 reason why he uses it. Tell us if you’ve had this happen. Ha! And have we told you how much Andrew loves Warp? He tells us more things it can do to make your life easier.</p><p><br></p><p>[00:25:39] Collin moved to Vim about six months ago and talks about making the move over to it. Andrew tried it in the past, and he thinks it’s time to board the Vim train again. Like he says, and this applies to anything new you bring into your workflow, “You just need to dive in, take your time, and you’re gonna be moving slow at first.”</p><p><br></p><p>[00:28:11] The whole Vim talk evolves into remapping your keyboard to prevent your fingers from contorting.  </p><p><br></p><p>[00:34:49] After Andrew talks about some of his go to VSCode plugins, Collin wants to know more about his VSCode setup and layout. Andrew talks more about some of the plugins he likes, like Customize UI, and how he likes to keep his VSCode looking clean.</p><p><br></p><p>[00:36:31] Let’s talk monitor setups: Multiple, single, full screen. Find out Collin and Andrew’s setup. Collin shares a keyboard shortcut he uses to manage his windows.</p><p><br></p><p>[00:40:00] One last thing…whether you prefer Alfred or Raycast, it’s time to replace your Spotlight. Andrew talks about the benefits it has in his workflow and Collin, who doesn’t need another tool, is intrigued. </p><p><br></p><p>[00:43:23] So, let’s summarize it for you. If you’re new to coding…bookmark this spot. Learn it, know it, live it. </p><p><strong>Panelist:</strong></p><p>Andrew Mason</p><p><br></p><p><strong>Guest/Panelist:</strong></p><p>Collin Jilbert</p><p><br></p><p><strong>Sponsor:  </strong></p><p><a href=\"https://www.honeybadger.io/\">Honeybadger</a></p><p><br></p><p><strong>Links:</strong></p><p><a href=\"https://twitter.com/jmcharnes?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\">Jason Charnes Twitter</a></p><p><a href=\"https://twitter.com/excid3?lang=en\">Chris Oliver Twitter</a></p><p><a href=\"https://twitter.com/andrewmcodes?lang=en\">Andrew Mason Twitter</a></p><p><a href=\"https://twitter.com/collin_jilbert?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\">Collin Jilbert Twitter</a></p><p><a href=\"https://github.com/marlonrichert/zsh-snap\">Znap!</a></p><p><a href=\"https://github.com/vim/vim\">Vim</a></p><p><a href=\"https://github.com/tpope\">tpope</a></p><p><a href=\"https://github.com/warpdotdev/Warp\">warp</a></p><p><a href=\"https://github.com/tmux/tmux/wiki\">tmux</a></p><p><a href=\"https://github.com/jemmyw/vscode-rails-fast-nav\">Rails Fast Nav</a></p><p><a href=\"https://github.com/bweave/rails-flip-flop\">Rails Flip-Flop</a></p><p><a href=\"https://makevscodeawesome.com/\">Make VSCode Awesome E-Book</a></p><p><a href=\"https://github.com/iocave/customize-ui\">Customize UI</a></p><p><a href=\"https://folivora.ai/\">BetterTouchTool</a></p><p><a href=\"https://github.com/alfredapp\">Alfred</a></p><p><a href=\"https://github.com/raycast\">Raycast</a></p>\n      "
}