{
  "title":"Liberating Women to Serve Men",
  "date":"2022-11-14T07:00:00.000000Z",
  "author":null,
  "id":"1276 at https://www.undergroundthomist.org",
  "link":"https://www.undergroundthomist.org/liberating-women-to-serve-men",
  "content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"> <p><img alt=\"\" class=\"media-image\" height=\"320\" width=\"480\" src=\"https://undergroundthomist.org/sites/default/files/styles/large/public/Tired-mom-at-office.jpg?itok=xCDyqwrt\"></p>\n<p> </p>\n<p>Business headlines prattle that the long range trend of women entering into the labor force is slowing down, and that they aren’t coming back fast enough from the pandemic.  Writers fret about what’s holding them back.  A common claim is that there isn’t enough day care.</p>\n<p>Maybe some of those moms don’t want their kids in day care.  Nobody asks them whether they want to enter the labor force.  Maybe they wish they had more choice.</p>\n<p>Decades ago, one of the targets of economic policy was that a man should be able to earn a “living wage” – a wage at which he could support his family by his own labor.  The mass entrance of women into the work force and the disappearance of the idea of the living wage have gone hand in hand.  Increasingly, couples find that <em>both</em> mom and dad must work in order to support the family – even if mom would rather stay at home.  Tell me whom this benefits.</p>\n<p>For many working class women, this is a real trap.  On the other hand, reasonably well-off people are not pawns of market forces.  My wife and I had a conversation one day with a pleasant couple who were much younger, and much more prosperous, than we were.  Husband and wife were both high-dollar attorneys.  She expressed strong frustration because the kids were in day care, but she wanted to stay with them herself.  “Why don’t you?” we asked.  They answered that they had expenses.  “Like what?” we asked.  Well, they had to keep up the payments on their big, expensive boat and their big, expensive house on the lake.</p>\n<p>The difference between her facial expression and his were intriguing.  She became nervous.  He became alarmed.  There was some history here, and he didn’t want his wife going down this road.  She didn’t want to displease him.  We changed the subject.</p>\n<p>To one degree or another, almost all husbands and wives divide labor, and they are generally happier doing so.  Obviously, not all women desire an exclusively domestic life, and there is nothing wrong with that.  But there is a great deal wrong with the fact that we force women to act against their domestic inclinations for reasons that have nothing to do with their fulfillment.  We call it being liberated, but it is really about serving the interests of men -- and economic managers.</p>\n<p> </p>\n<p> </p>\n </div></div></div>"
}