{
  "title":"Double Standards",
  "date":"2022-10-31T06:00:00.000000Z",
  "author":null,
  "id":"1274 at https://www.undergroundthomist.org",
  "link":"https://www.undergroundthomist.org/double-standards",
  "content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"> <p><img alt=\"\" class=\"media-image\" height=\"278\" width=\"480\" src=\"https://undergroundthomist.org/sites/default/files/styles/large/public/Double-standard.jpg?itok=-WcZ1vkT\"></p>\n<p>“The only remedy to racist discrimination is antiracist discrimination.  The only remedy to past discrimination is present discrimination.  The only remedy to present discrimination is future discrimination.”  -- Ibram X. Kendi, <em>How to Be an Antiracist</em> (2019), p. 19.</p>\n<p>This view has been digging itself in for two generations, but lately the shovel has been updated.  The old-style defenders of racial double standards still say they aren’t racist.  Since racial double standards are by definition racist, that’s been a hard line to peddle.  The new line is that they <em>are </em>racist, but in a good way:  Because only racism against whites can remedy the effects of past racism against blacks.</p>\n<p>Since this view is relentlessly drummed into the ears of the young – and since few of them have ever been taught the ancient doctrine that justice is giving to each person what is due to him, or the sacred principle that we may never do evil for the sake of good results -- perhaps it is not surprising that many of my students find the theory of good racism plausible.</p>\n<p>I find that those who do think the only cure for racism is racism tend to hold a number of similar views:  That the only cure for injustice is injustice, that the only cure for violence is violence, and even, sometimes, that the only cure for hatred is hatred.</p>\n<p>For the moment, let’s set aside the sheer injustice of discriminating again an entire category of people – whether blacks, whites, or plaids -- just because of the color of their skin.</p>\n<p>Instead let us ask:  <em>Do </em>double standards remedy the effect of past racism?  Does discrimination in favor of black people really help black people?  Consider how such policies work in colleges and universities.</p>\n<p>The double standard arouses resentment among white students who are held to the higher standard -- resentment which intensifies when they are told they are racist for wanting to be treated fairly.  That’s a good way to make them racists for real.</p>\n<p>It generates a presumption that black students may have attained their places because they were held to the lower standard, and therefore are not as well qualified.  The curse of this suspicion will follow them all of their lives.</p>\n<p>The rationale which is offered for the double standard invites a black student who does fail to attain his academic goals to blame his disappointment on supposed institutional racism.</p>\n<p>Yet it also tempts black students not to study as hard, because for some purposes they don’t have to.</p>\n<p>And that insidious presumption I mentioned seduces black students who attain their positions by sheer hard work and intelligence to doubt themselves:  “Maybe I don’t deserve to be here.  Maybe I got here only because the playing field isn’t level.  Maybe I’m not really good enough.”</p>\n<p>The first, second, and third effects threaten two generations of growth in good will between the races.  The third and fourth effects undermine advance in black achievement.  And the fifth effect poisons black self-respect.</p>\n<p>Since discrimination in favor of black students so obviously hurts black students, why would anyone promote it?  I mean apart from sheer sloppiness in thinking on the part of the promoters.</p>\n<p>Among black radicals, the chief motive seems to be an extreme predisposition to disbelieve in the good will most white people today bear toward black people, and therefore a willingness to tread on it.</p>\n<p>Among white liberals, the chief motive seems to be a secret suspicion that perhaps black people <em>really aren’t </em>equal, so they <em>need </em>to be treated by different standards -- the very thing they accuse other whites of believing.</p>\n<p>And among ordinary people of only middling courage, the chief motive seems to be fear – either turned outward (“Don’t accuse me!  Don’t smear my reputation!  Don’t get me in bad with those who have power over me!”) or turned inward (“I’m not racist, am I?  I’m a good person, aren’t I?  I don’t want to think I’m one of those bad ones!”).</p>\n<p>If you want to divide blacks and whites against each other, if you want black kids to think they are inferior, or if you want to hold them back, then go ahead -- patronize them and hold them to lower standards.  That will do it.</p>\n<p>But if, as I do, you believe that black kids are equal, you rejoice when they succeed, and you really do want to remedy the effects of past discrimination, then for God’s sake, treat them like everyone else.</p>\n<h3 align=\"right\"><strong>Related:</strong></h3>\n<h3 align=\"right\"><a href=\"https://undergroundthomist.org/enough-with-the-praise-already\"><strong>Enough with the Praise Already</strong></a></h3>\n<h3 align=\"right\"><a href=\"https://undergroundthomist.org/how-to-think-about-%E2%80%9Cinstitutional%E2%80%9D-racism\"><strong>How to Think about “Institutional” Racism</strong></a></h3>\n<h3 align=\"right\"><a href=\"https://undergroundthomist.org/search/node/racism\"><strong><em>More</em></strong></a></h3>\n<p> </p>\n<p> </p>\n </div></div></div>"
}