{
  "title":"Motives for Accepting the Chaos at Our Southern Border",
  "date":"2022-11-07T07:00:00.000000Z",
  "author":null,
  "id":"1275 at https://www.undergroundthomist.org",
  "link":"https://www.undergroundthomist.org/motives-for-accepting-the-chaos-at-our-southern-border",
  "content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"> <p><img alt=\"\" class=\"media-image\" height=\"320\" width=\"480\" src=\"https://undergroundthomist.org/sites/default/files/styles/large/public/Illegal-border-crossing.jpg?itok=fL-rsUp-\"></p>\n<p> </p>\n<p>I like immigrants and favor generous immigration policies, but also border security.  The arguments against border security escape me.  I have heard that anyone who wants safe borders must hate immigrants, but this certainly doesn’t describe me.</p>\n<p>I have also heard that the nation state itself should wither away, because it promotes conflict and hinders the common good.  But what are the alternatives?  In the present condition of the world, there seem to be only three:  (1) Utter disorder, which is what we already have in some places, (2) a world state, which would almost surely be oppressive and from which there would be no escape, and (3) a free-for-all among multinational corporations who would then develop their own paramilitary departments.</p>\n<p>The chaos at our southern border is so transparently bad for everyone that I have reluctantly given up cataloguing bad arguments, and begun to enumerate bad motives.  All of these, of course, are speculative.</p>\n<p>Desire for cheap labor.  This hardly requires explanation.</p>\n<p>Desire for docile voters who will reliably vote Democratic.  Some motive-seekers look no further.  But though this may be a strong motive, it is certainly an odd one, since Hispanics who are already here are not particularly docile and are trending conservative.   Of course those who favor insecure borders may assume what is contrary to fact.</p>\n<p>Desire to weaken nation states because they hinder the operation of those multinational corporations I mentioned.  Although one should never underestimate the cynicism of others, this would be a curious motive too, for it is hard to see how a corporate war of all against all would be good even for corporations.</p>\n<p>Desire for more people in the pews.  This may be a motivation for some bishops.  Most of the immigrants are Catholic, and church affiliation among people who are already here is trending down.</p>\n<p>Money received by private and religious agencies which contract with the government to provide social services for the immigrants.  Follow the money.  Charitable organizations pursue self-interest too.</p>\n<p>Fear of upsetting China, which is the source of most of the Fentanyl pouring over the border.  Appeasers are never in short supply (neither are chauvinistic nationalists, but that’s another story).  Besides, a lot of politicians are on the take.</p>\n<p>Which possible motives have I missed?</p>\n<p> </p>\n<p> </p>\n </div></div></div>"
}