{
  "title":"The Other Face of Child Neglect",
  "date":"2022-10-24T06:00:00.000000Z",
  "author":null,
  "id":"1273 at https://www.undergroundthomist.org",
  "link":"https://www.undergroundthomist.org/the-other-face-of-child-neglect",
  "content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"> <p><img alt=\"\" class=\"media-image\" height=\"480\" width=\"377\" src=\"https://undergroundthomist.org/sites/default/files/styles/large/public/Madonna-del-Soccorso.jpg?itok=CwoEdD8K\"></p>\n<p> </p>\n<p><em>Then the dragon was angry with the woman, and went off to make war on the rest of her offspring – </em>Revelations 12:17.</p>\n<p>Some of the lesson plans for Pride Week in my public school district this year included Coming Out and Pronouns Days for students in middle school, and promoting the idea of being non-binary to children as young as five.</p>\n<p>Although the district lies, this is not even particularly secret.  The district ignored warnings from state officials that instructing children about controversial matters of sexuality without parental consent is a violation of state law.</p>\n<p>On one occasion, one of the public schools in the district invited a male transvestite performer who had been arrested for prostitution to mingle with the children for five hours in the school library.</p>\n<p>A friend whose children attend public school in the school district next door to mine tells me that more than half of his pre-teen daughters’ school friends say that they are transgender, and pressure his girls into being “trans” too.</p>\n<p>Here are some of the reasons people close to me give for exposing the souls of their little ones to mortal danger.  They reveal an interesting hierarchy of values.</p>\n<p>“Yes, but if we send her to a new school she might lose her old friends.”</p>\n<p>“Yes, but I didn’t like the art teacher at the charter school.”</p>\n<p>“Yes, but I didn’t like the playground at the Christian school.”</p>\n<p>“Yes, but she has to get used to this stuff sometime.”</p>\n<p>“Yes, but the public school is in our neighborhood.”</p>\n<p>“Yes, but the charter school is too new.”</p>\n<p>“Yes, but all our friends send their children to the public school.”</p>\n<p>“Yes, but the teacher seemed nice and told us not to worry.”</p>\n<p>“Yes, but if we home schooled, one of us would have to teach.”</p>\n<p>And finally,</p>\n<p>“Nothing is going to happen.”</p>\n<p> </p>\n<p> </p>\n </div></div></div>"
}