{
  "title":"Laser-driven fusion’s internal energies not matching up with predictions",
  "date":"2022-11-16T15:42:19.000000Z",
  "author":null,
  "id":"https://arstechnica.com/?p=1898219",
  "link":"https://arstechnica.com/?p=1898219",
  "content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\">\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/11/targetchamber700x425-800x486.jpg\" alt=\"Image of an incredibly complex set of equipment surrounding a blue sphere.\">\n      <p class=\"caption\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/11/targetchamber700x425.jpg\" class=\"enlarge-link\">Enlarge</a> <span class=\"sep\">/</span> Where the action happens inside the National Ignition Facility. (credit: <a rel=\"nofollow\" class=\"caption-link\" href=\"https://www.llnl.gov/news/physics-world-names-national-ignition-facility-fuel-gain-top-10-breakthrough-year\">Damien Jemison/LLNL</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Monday, a paper was released that describes some confusing results from the National Ignition Facility, which uses a lot of very energetic lasers focused on a small target to begin a fusion reaction. Over the past few years, the facility has passed some key milestones, including ignition of fusion and creating what's termed a burning plasma.</p>\n<p>Now, researchers have analyzed the properties of the plasma as it experiences these high-energy states. And to their surprise, they found that burning plasmas appear to behave differently from those that have experienced ignition. At the moment, there's no obvious explanation for the difference.</p>\n<h2>Ignition vs. burning</h2>\n<p>In the experiments, the material being used for fusion is a mix of tritium and deuterium, two heavier isotopes of hydrogen. These combine to produce a helium atom, leaving a spare neutron that's emitted; the energy of the fusion reaction is released in the form of a gamma ray.</p></div><p><a href=\"https://arstechnica.com/?p=1898219#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1898219&amp;comments=1\">Comments</a></p>"
}