{
  "title":"What’s the deal with Formula 1 and sustainable fuels?",
  "date":"2022-11-16T19:27:19.000000Z",
  "author":null,
  "id":"https://arstechnica.com/?p=1898301",
  "link":"https://arstechnica.com/?p=1898301",
  "content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\">\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/11/GettyImages-1441024094-800x533.jpg\" alt=\"A colorful but blurry photo of George Russell's Mercedes F1 car at the 2022 Brazilian Grand Prix. The background is streaks of yellow and green\">\n      <p class=\"caption\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/11/GettyImages-1441024094-scaled.jpg\" class=\"enlarge-link\">Enlarge</a> <span class=\"sep\">/</span> In addition to getting faster over the years, F1 cars have also gotten far more efficient. And that's only going to increase in the coming years. (credit: Jared C. Tilton/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>When Formula 1 cars take to the track for the first time <a href=\"https://arstechnica.com/cars/2022/04/smaller-more-slippery-more-sustainable-cars-f1s-plan-for-2026/\">in 2026</a>, they'll do so powered by carbon-neutral synthetic fuels, part of the sport's &quot;net zero by 2030&quot; plan. It's a laudable goal, but, I confess, one I've sometimes questioned. After all, most of the carbon emitted during the course of an F1 weekend comes from the same sources as any other popular sport—<a href=\"https://arstechnica.com/cars/2022/09/mercedes-f1-team-cut-its-freight-emissions-by-89-with-biofuel-switch/\">the teams</a> and fans traveling to and from the event. But after speaking with Pat Symonds, Formula 1's chief technical officer, I may have been missing the forest for the trees.</p>\n<p>&quot;In essence, yes, you're quite right. The total carbon footprint of the sport—of scope 1, 2—is just over a quarter million tonnes of CO<sub>2</sub> equivalent, and the cars on the circuit represent 0.7 percent of that,&quot; Symonds explained to me. &quot;So yes, your premise is true. But we try and take a much wider view. And what I think we have in developing a sustainable fuel and putting it in our race cars is an enormous multiplier effect. The 2 billion vehicles that are out there could use this fuel, and then the 400,000 people driving to [the US Grand Prix] isn't a problem,&quot; he said.</p>\n<p>Formula 1 has changed quite a bit in the years since Liberty Media bought it at <a href=\"https://arstechnica.com/cars/2016/09/formula-1-to-be-bought-by-us-based-liberty-media-group/\">the end of 2016</a> with bigger ideas than simply sucking revenue out. Instead of pretending the Internet never happened, you can now watch races via F1's own streaming service, a service that has markedly improved over the past couple of years. In the US, a move to ESPN saw the sport <a href=\"https://arstechnica.com/cars/2018/04/formula-1-on-espn-sees-massive-improvement-indycar-thrilled-in-phoenix/\">go commercial-free</a> during the actual races. And, of course, there's the whole <em><a href=\"https://arstechnica.com/gaming/2019/03/netflixs-formula-1-drive-to-survive-finds-pressure-at-the-core-of-f1/\">Drive to Survive</a></em> phenomena, which has boosted audiences worldwide—but particularly in North America, which next year will host grands prix in Austin, Texas; Miami; and Las Vegas.</p></div><p><a href=\"https://arstechnica.com/?p=1898301#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1898301&amp;comments=1\">Comments</a></p>"
}