{
  "title":"The Snapdragon 8 Gen 2 brings Wi-Fi 7, sticks with some 32-bit support",
  "date":"2022-11-15T23:00:49.000000Z",
  "author":null,
  "id":"https://arstechnica.com/?p=1897640",
  "link":"https://arstechnica.com/?p=1897640",
  "content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\">\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/11/Snapdragon-8-Gen-2-Chip-and-QRD-1-800x497.jpg\" alt=\"The Snapdragon 8 Gen 2 brings Wi-Fi 7, sticks with some 32-bit support\">\n      <p class=\"caption\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/11/Snapdragon-8-Gen-2-Chip-and-QRD-1.jpg\" class=\"enlarge-link\">Enlarge</a> (credit: Qualcomm)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Today, Qualcomm announced the Snapdragon 8 Gen 2 SoC, the company's flagship chip that will be coming to many Android phones over the next few months. Besides the usual newer, better, hopefully faster cores, a big piece of news is the addition of Wi-Fi 7 support so you can get better home wireless—provided you invest in a new router.</p>\n<p>Qualcomm has some claims for this new chip. The company says the CPU &quot;improves performance up to 35 percent&quot; and has &quot;up to 40 percent more power efficiency.&quot; The GPU supposedly &quot;delivers up to 25 percent faster performance, with up to 45 percent better power efficiency.&quot; Take both of these claims with a grain of salt, since Qualcomm last year promised a <a href=\"https://youtu.be/3H6tfcZLHfg?t=6773\">20 percent CPU improvement</a> that <a href=\"https://arstechnica.com/gadgets/2022/03/samsung-galaxy-s22-ultra-review-the-slab-phone-retirement-plan/4/\">never manifested</a> in shipping products. Even if Qualcomm hits these performance promises, it would still be about a year behind the iPhone. The company is trying to do something about its uncompetitive performance with the (<a href=\"https://arstechnica.com/gadgets/2022/09/arm-sues-qualcomm-over-its-1-4-billion-nuvia-acquisition/\">now legally encumbered</a>) <a href=\"https://arstechnica.com/gadgets/2021/03/qualcomm-closes-nuvia-deal-promises-in-house-laptop-cpus-by-2h-2022/\">Nuvia acquisition</a>, but those chips aren't ready yet.</p>\n<p>Let's start with the basics. This is a 4 nm chip with an unusual layout containing four different CPU cores, all designed by Arm. The prime core is a 3.2 GHz Arm Cortex X3—that's all good and expected, and from here, Arm's recommended layout is three Cortex A710 CPUs for &quot;medium&quot; duty and four A510 CPUs for low-power background processing. Qualcomm isn't following the recommended layout, though, and after the Cortex X3 it has two different cores doing &quot;medium&quot; duty: a pair of Cortex-A715 CPUs and a pair of last-generation Cortex-A710 CPUs. After that, there are only three—not the expected four—Cortex A510 CPUs doing background duty.</p></div><p><a href=\"https://arstechnica.com/?p=1897640#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1897640&amp;comments=1\">Comments</a></p>"
}