{
  "title":"Study: Ötzi the Iceman probably thawed and refroze several times",
  "date":"2022-11-15T22:13:22.000000Z",
  "author":null,
  "id":"https://arstechnica.com/?p=1897727",
  "link":"https://arstechnica.com/?p=1897727",
  "content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\">\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/11/otziTOP-800x533.jpg\" alt=\"The mummified corpse of Ötzi the Iceman, discovered in 1991.\">\n      <p class=\"caption\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/11/otziTOP.jpg\" class=\"enlarge-link\">Enlarge</a> <span class=\"sep\">/</span> The mummified corpse of Ötzi the Iceman, discovered in 1991. (credit: Leopold Nekula/Sygma/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In 1991, a group of hikers found the mummified remains of <a href=\"https://en.wikipedia.org/wiki/%C3%96tzi\">Ötzi the Iceman</a> emerging from a melting glacier. The popular interpretation—given the extraordinary preservation of the body—is that Ötzi fled from the valley after being attacked and froze to death in the gully where his mummified remains were found. His body and the tools he brought with him were quickly buried beneath the ice and remained frozen under a moving glacier for the next 5,300 years. The gully served as a kind of time capsule, protecting the remains from damage by the glacier.</p>\n<p>But a <a href=\"https://journals.sagepub.com/doi/full/10.1177/09596836221126133\">new paper</a> published in the journal The Holocene challenges that interpretation, suggesting that the Ötzi died elsewhere on the mountain and that normal environmental changes gradually moved his remains down into the gully. Further, for the first 1,500 years after his death, Ötzi's remains likely thawed and refroze at least once and quite possibly several times. That means it's much more likely that another ice mummy will be discovered, since no extraordinary circumstances are required to explain Ötzi's preservation.</p>\n<p>Archaeologists have spent the last 30 years studying the wealth of information about Copper Age life that Ötzi brought with him into the present. Studies have examined his genome, skeleton, last meals, tattoos, and the microbes that lived in his gut. For instance, in 2016, scientists <a href=\"http://dx.doi.org/%2010.1038/srep31279\">used DNA sequencing</a> to identify how Ötzi's clothing was made and found that most of it was made from domesticated cattle, goats, and sheep, although his hat was made from brown bear hide and his quiver from a wild roe deer.</p></div><p><a href=\"https://arstechnica.com/?p=1897727#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1897727&amp;comments=1\">Comments</a></p>"
}