{
  "title":"John Irving, A Prayer for Owen Meany",
  "date":"2021-08-29T09:52:12.789000-07:00",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-7715084047241063672",
  "link":"http://branemrys.blogspot.com/2021/08/john-irving-prayer-for-owen-meany.html",
  "content":"<p><b><a href=\"http://branemrys.blogspot.com/2021/08/fortnightly-book-august-15.html\"> Introduction</a></b></p><p><b>Opening Passage:</b></p><p></p><blockquote>I am doomed to remember a boy with a wrecked voice -- not because of his voice, or because he was the smallest person I ever knew, or even because he was the instrument of my mother's death, but because he is the reason I believe in God; I am a Christian because of Owen Meany. I make no claims to have a life in Christ, or with Christ -- and certainly not for Christ, which I've heard some zealots claim. I'm not very sophisticated in my knowledge of the Old Testament, and I've not read the New Testament since my Sunday school days, except for those passages that I hear read aloud to me, when I go to church. I'm somewhat more familiar with the passages from the Bible that appear in The Book of Common Prayer; I read my prayer book often, and my Bible only on holy days -- the prayer book is so much more orderly. (p. 1)</blockquote><p></p><p><b>Summary:</b> John Wheelwright, from an old and important family in Gravesend, New Hampshire, is the narrator; he is narrating, from the perspective of Toronto in 1987, the events leading up to the formative event of his life, which took place July 8, 1968. The dates are quite important, first, because much of he story is concerned with an actual specific event that made it impossible for John to doubt the existence of a divine power, and second (and less successfully, I think, although the political element makes the point that religious doubts are often part of a more general miasma) it weaves events and themes of the Vietnam War with those of the Reagan Iran-Contras scandal. John's best friend growing up was Owen Meany. Owen was a weird-looking runt -- he is very short, he is strangely pale, and his ears look too big -- with a blown-out voice. His vocal chords do not work properly, and therefore everything he says is done with loud, shouted, high-pitched nasality, like a controlled scream. (At one point it is compared to the combined dying screams of thousands of mice, and when he speaks in the novels it is always in capital letters.) They are from very different parts of Gravesend society; John's family are Yankee aristocracy, Owen's are fairly successful laborers who have come to own a granite quarry and monument workshop. They are also very different in personality. John is quite bland and ordinary in many ways, but Owen is an entirely vivid and colorful personality who believes that God has chosen him as an instrument for some definite purpose. And it's increasingly hard to be skeptical of the latter, because so many things end up swirling around Owen, and they will do so more and more until that day, July 8, 1968, when everything that has ever been strange and bizarre about Owen's life suddenly jumps together.</p><p>Even in our own case, even in minor cases, if we do something 'for a reason', like, say, buying bread at the store, that one thing done 'for a reason' guarantees that other things are also done 'for a reason'. If you buy the bread for a reason, you got it off the shelf for a reason, you went to the store for a reason, even if some of these reasons are relatively undefined in themselves.  Magnify this to the size of the world. If there is one event, even one event, in which the courses of the world come together in a way that is clear 'for a reason', then for that event to be possible, many other things related to it have to be 'for a reason', and anything might be 'for a reason'. Owen knows almost from the beginning, and John comes to know in the course of time, that there is in fact such an event in Owen's life.</p><p>There are some weirdnesses in the way in which the story is told. Some of them get some kind of explanation (we learn why John is so angry at America, for instance, angry enough to become a Canadian citizen, and we learn why Owen has such a strange anti-Catholic prejudice), and some of them are connected with the weirdnesses of Yankee towns. John's view of the world is strangely sexualized, particularly given that he never actually has any sex; there's an odd incestuous tone to a lot of what he comes up. I suppose it fits the era in which the story occurs; at least, the weird mish-mash of sex, spirituality, hijinks, and politics that is treated as not only normal but as <i>the</i> normal seems very 'Boomer-ish' to me. Some of it works better, some worse. The book is quite humorous, in a tragicomic way, although the humor is very uneven: I think much of the humor surrounding John's mother and his lack of a father is not very funny, for instance, whereas some of the messes John and Owen get into are; I think the sexual humor is mostly not very good, while the religious humor usually is. The central chapter of the book is concerned with Owen's highjacking two plays, a Christmas pageant and <i>A Christmas Carol</i>, which serve as bridges to the culminating event of tale. The humor of the Christmas pageant itself is not all that great, I think (I've certainly read stories of Christmas pageants that were funnier), but the description of the aftermath is hilarious; the Dickens works better, I think. Nonetheless, it stays humorous enough to carry one through.</p><p>John is in some ways so unexceptional that someone might wonder why Owen would even be such close friends with him -- they are so different. But this is, of course, the point. There is a famous couplet from Euripides that is mentioned in passing, to the effect that what we expected never came to pass and what we did not expect the gods brought about. It is not an expression of hope. It is a terrible thing to be governed by a definite purpose that will be fulfilled, and one of the strengths of the novel is that it is one of very few stories that make this clear. (I think, of all the works I've read, only C. S. Lewis's <i>Till We Have Faces</i> does it better.) It does not matter how good the definite purpose is. Inexorable good is terrifying and unbearable. Inexorable good is something you can't outmatch, you can't outmaneuver; it comes on with a force that you can't do anything about, and thus is terrifying as you are carried along with a helplessness that is unbearable. It demands sacrifice, and seizes it from you whether you will or nill. Owen is friends with John <i>because</i> John is so ordinary; he escapes when he can to John and his family because they are the closest he will ever have to a normal life. He has an unyielding purpose, and he can't help think at times that a wide world of desirable things have been taken from him because of it. Destiny -- not a vague sense of purposefulness, but an actual destiny -- is a heavy thing for slight human shoulders. It is almost impossible to bear it well; it takes a hero to bear it at all.</p><p><b>Favorite Passage: </b>An insightful passage on a certain kind of liberal Christianity that is portrayed very sympathetically in the book, but is also criticized as inadequate in its conceptions of both faith and evidence:</p><p></p><blockquote><p>What made Mr. Merrill infinitely more attractive was that he was full of doubt; he expressed our doubt in the most eloquent and sympathetic ways. In his completely lucid and convincing view, the Bible is a book with a troubling plot, but a plot that can be understood: God creates us out of love, but we don't want God, or we don't believe in Him, or we pay very poor attention to Him. Nevertheless, God continues to love us -- at least, He continues to try to get our attention. Pastor Merrill made religion seem reasonable. And the trick of having faith, he said, was that it was necessary to believe in God without any great or even remotely reassuring evidence that we don't inhabit a godless universe.</p><p>Although he knew all the best -- or, at least, the least boring -- stories in the Bible, Mr. Merrill was most appealing because he reassured us that doubt was the essence of faith, and not faith's opposite. (p. 111)</p></blockquote><p></p><p><b>Recommendation: </b>Recommended.</p><p>***</p><p>John Irving, <i>A Prayer for Owen Meany</i>, Ballantine Books (New York: 1989).</p>"
}