{
  "title":"Cao Xueqin and Gao E, A Dream of Red Mansions",
  "date":"2021-08-14T18:36:43.788000-07:00",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-5438297798268093598",
  "link":"http://branemrys.blogspot.com/2021/08/cao-xueqin-and-gao-e-dream-of-red.html",
  "content":"<p><b><a href=\"https://branemrys.blogspot.com/2021/07/fortnightly-book-july-4.html\">Introduction</a></b></p><p><b>Opening Passage: </b>It is a feature of the novel that it blurs the main narrative with the metanarrative, so the actual story begins with what in other novels would often be preface material, in which we get a discussion of the 'author' -- but it's deliberately left entirely unclear whether this author being discussed is the actual author or a narrative persona or one of the characters through whose hands the supposed manuscript has passed, or all of them simultaneously. The name Zhen Shiyin could be read as 'true facts concealed' and the name Jia Yucun as 'fiction in rustic language'.</p><p></p><blockquote><p>This is the opening chapter of the novel. In writing this story of the Stone the author wanted to record certain of his past dreams and illusions, but he tried to hide the true facts of his experience using the allegory of the jade of &quot;Spiritual Understanding.&quot; Hence his recourse to names like Zhen Shiyin. But what are the events recorded in this book, and who are the characters? About this he said:</p><p>&quot;In this busy, dusty world, having accomplished nothing, I suddenly recalled all the girls I had known, considering each in turn, and it dawned on me that all of them surpassed me in behaviour and understanding; that I, shameful to say, for all my masculine dignity, fell short of the gentler sex. But since this could never be remedied, it was no use regretting it. There was really nothing to be done.</p><p>&quot;I decided then to make known to all how I, though dressed in silks and delicately nurtured thanks to the Imperial favour and my ancestors' virtue, had nevertheless ignored the kindly guidance of my elders as well as the good advice of teachers and friends, with the result that I had wasted half my life and not acquired a single skill. But no matter how unforgiveable my crimes, I must not let all the lovely girls I have  known pass into oblivion through my wickedness or my desire to hide my shortcomings.</p><p>&quot;Though my home is now a thatched cottage with matting windows, earthen stove and rope-bed, this shall not stop me from laying bare my heart. Indeed, the morning breeze, the dew of night, the willows by my steps and the flowers in my courtyard inspire me to wield my brush. Though I have little learning or literary talent, what does it matter if I tell a tale in rustic language to leave a record of all those lovely girls. This should divert readers too and help distract them from their cares. That is why I use the other name Jia Yucun.&quot; (pp. 1-2)</p></blockquote><p></p><p><b>Summary:</b> The goddess Nu Wa once had to repair the sky, so she melted down fine rocks to do so, making thirty-six thousand five hundred and one blocks. The repair, however, required thirty-six thousand five hundred, so the goddess threw the leftover stone down at the base of Blue Ridge Peak in the Great Waste Mountains. Because it had been tempered by a goddess, however, the stone was sentient, and it was greatly distressed and shamed that it had been made for the sky, but had turned out to be useless and discarded. One day as it lamented its face, the Buddhist Monk of Infinite Space and the Taoist Priest of Boundless Time passed by, and, taking the little stone in hand, offer to engrave characters on it so that people will know it is special and to take it to a civilized realm. They took it away, no one knows exactly where.</p><p>Eons later, a Taoist Immortal named Reverend Void came upon a large stone at the base of Blue Ridge Peak, engraved with the story of the Stone. He then gets into an argument with the Stone as to whether the story is worth telling, but the Stone convinces him that it is. Changing his name to The Passionate Monk, he copied it but changed its name from &quot;The Story of the Stone&quot; to &quot;Record of the Passionate Monk&quot;. Later another person suggests the name &quot;Precious Mirror of Love&quot;. Later, a man named Cao Xueqin, re-reading the book many times over ten years and rewriting it five times, called it &quot;The Twelve Beauties of Jinling.&quot; After all of these different beginnings of the story, I really like the next sentence, &quot;Now that the origin of the story is clear, let us see what was recorded on the Stone&quot; (p.7), particularly as we just get another beginning of the story, and indirect one, at that.<br></p><p>Zhen Shiyin happens to have a dream in which he overhears a Buddhist monk and a Taoist priest arguing about a Stone. The Buddhist monk tells the tale of a Vermilion Pearl Plant that was watered everyday by the attendant Shen Ying in the Palace of the Red Jade. The Vermilion Pearl Plant eventually takes human form, but she is unhappy that she has not been able to repay Shen Ying for his care. Meanwhile, Shen Ying decides he wants to be reincarnated in the realm of men, so he asks a favor from the Goddess of Disenchantment, who saw that this was a chance for the Vermilion Pearl Plant to pay her debt. Many others of amorous nature went with them to atone for various sins, and this is the source of the story. The Buddhist monk and Taoist priest, meanwhile, see this as a chance to save these people from their sins and follies, but they need to take the &quot;stupid object&quot; to the Goddess of Disenchantment. He greets them and asks what they are talking about, and they mostly refuse to tell him, but they do tell him that he is destined to meet the &quot;stupid object&quot;, which is a piece of translucent jade engraved with the words, &quot;Precious Jade of Spiritual Understanding&quot;, and another set of smaller lines Zhen Shiyin does not have time to read. The monk and the priest pass through an archway with the inscription, &quot;Illusory Land of Great Void&quot;. Zhen Shiyin wakes up. A Buddhist monk and a Taoist priest, both scab-covered and gibbering like crazy people, pass by and try to take his three-year-old girl Yinglian. Zhen Shiyin, of course, refuses and tries to leave, but as he is going, he hears the Taoist say to the Buddhist that they will be parting now but will meet up again in three eons to go to the Land of Illusion, and then they both vanish. When they are gone, Zhen Shiyin is met by a poor scholar named Jia Yucun, whom he convinces to take the Metropolitan Examinations. Shortly after, Zhen Shiyin loses his daughter in a crowd and his house burns down and he has to move. He meets a crazy Taoist priest who is singing a song, &quot;All Good Things Must End&quot;, and simply leaves his family to become a Taoist priest.</p><p>We are now on page 24 of 2549. But the frame story is much more important to the character of the story than many commentators seem to credit it, and in a story that is mostly told in a very realistic way, it is one of several ways that the work indicates that its realism is not reality. We will meet the Buddhist of Infinite Space and the Taoist of Boundless Time several times; we will meet the Goddess of Disenchantment; we will meet Shen Ying and the Vermilion Pearl Plant in a human reincarnation; and the whole long tale about the various mundane interrelations of a great family in decline is nonetheless at all times the Story of the Stone. The book is sometimes read as a sort of cultural encyclopedia of its day, but it itself resists such a reading, with its bewildering and sometimes indistinct layers, its explicit refusal to locate the events of the story at any particular time, and its repeated indications that the Jia family is in some ways highly atypical and, indeed, perhaps wholly a fantasy. And it is also important, I think, to take at face value that, whatever else it may be, and however it may superficially seem, the story is in great measure a story about a bunch of delightful young women.</p><p>The Jia clan is a very large clan, and the tale focuses on two closely related branches who live on great estates practically next door to each other, the Jia of Ningguo and the Jia of Rongguo. The main character of most of the tale is Jia Baoyu, the oldest heir of the second oldest heir (Jia Zheng) of the Rongguo branch. There is something special about him; he is born with an engraved jade stone in his mouth. This gives him his name, Baoyu, which means 'Precious Jade'. He is very strange throughout his life, and one of his peculiarities growing up is that he only likes the companionship of girls. Among his cousins are two of particular note. One is Lin Daiyu, a beautiful, melancholy girl who is more or less constantly ill. It is strongly hinted through most of the story that she is Vermilion Pearl Plant, repaying her watering with tears, and that she is both a perfect match for Baoyu and fated to die early. She is tutored early on by a disgraced scholar by the name of Jia Yucun, who may or may not be a distant relation on her mother's side. Lin Daiyu comes to Rongguo House because she is summoned by her grandmother, the Lady Dowager of the Jia clan, who likes to be around young people, and who, in a culture that respects age and parenthood, pretty much gets whatever she wants. Another, on his mother's side, is Xue Baochai, also beautiful and intelligent, less outspoken and more practical than Lin Daiyu. It is not an accident that the name of each shares a character with Baoyu's name; Baoyu, Daiyu, and Baochai form a sort implied love triangle, although for most of the story it is merely implied, with none of the three actually in love. It is strongly implied through much of the story that she and Baoyu will marry.</p><p>Lin Daiyu and Xue Baochai make up two of the twelve main female characters of the book, the Twelve Beauties of Jinling. Shi Xiangyun is a second cousin, good-natured, cheerful, and mischievous. Then there is the 'quartet of Spring', all girls with an element in their name that means 'Spring', Jia Yuanchun, Jia Tanchun, Jia Yingchn, and Jia Xichun. Jia Yuanchun (&quot;First Spring&quot;) is Baoyu's elder sister and an Imperial Consort; she doesn't like it much, but her family's fortunes are more tied to her, and the present Imperial connection she brings, than anyone realizes, so that when she dies the family's decline accelerates. Jia Tanchun (&quot;Seeking Spring&quot;) is Baoyu's younger half-sister, by the shrewish Concubine Zhao; she is bold, daring, and capable. Jia Yingchun (&quot;Welcoming Spring&quot;) is Baoyu's first cousin, by his father's older brother; she is very mild and inclined to avoid conflict, and, while undistinguished in terms of talents, is extremely kind. Jia Xichun (&quot;Treasuring Spring&quot;), a cousin from the Ningguo House, is artistically talented and develops a strong Buddhist devotion. Jia Qiaojie, the youngest, is Yingchun's niece; she is a child for most of the work, and the work often implies that she's destined for a very simple and somewhat rustic but very happy life. Wang Xifeng, one of my favorite characters, is he niece of Baoyu's mother and also his cousin-in-law, being married to his unreliable cousin Jia Lian; she is also Yingchun's sister-in-law and Qiaojie's mother. Xifeng's parents wanted to have a boy, and they more or less raised her as if she were; her name, Xifeng (&quot;Phoenix&quot;), was usually a boy's name. She is a beautiful, intelligent, immensely competent, utterly ruthless, deviously cunning schemer; her great talent is her capacity to maneuver other people. In practice, she controls much of the budget of Rongguo House, and while both Jia families are by now living beyond their means, her being so has slowed their decline. Many of her problems stem from the fact that her husband Lian is a promiscuous womanizer. Li Wan is Baoyu's sister-in-law, the young widow of his deceased older brother, strictly proper and devoted to the future of her young son, Jia Lan; the story occasionally implies that her adherence to propriety continually prevents her from reaching her full potential. Qin Keqing is married to Xichun's nephew, Jia Rong; she is famously the most puzzling of the Beauties, because she is portrayed as both highly sensual -- she is, not to put to fine a point on it, almost certainly having an affair with her father-in-law -- and very mysterious; she dies relatively early on, and although we don't learn much about the death itself, it is strongly implied that she hanged herself, perhaps due to something related to her affair. Miaoyu is a young, beautiful Buddhist nun, who became a nun because she was often sick and is associated with the family in a not-entirely-clear way. In addition, there are a number of young maids who are to some extent treated as members of the family: Xiren and Qingwen, Baoyu's maids; Ping'er, the hypercompetent maid of Xifeng; Ruhua, Xichun's maid; Siqi, Yingchun's maid; Daishu, Tanchun's maid; Yinger, Baochai's maid; and Zijuan and Xueyan, Daiyu's maids.</p><p>Baoyu's importance is not that he is a major driver of the events of the story but that he is the primary connecting node for this entire network of young women. Doted upon by the Lady Dowager, he is allowed mostly to do what he wants, which is spend his time with the girls. The Lady Dowager has brought most of the young people in the family together. On a visit from Yuanchun, the Ringguo House converts a significant part of its estate into an elaborately landscaped garden, the Grand View Garden. After she leaves, instead of repurposing the land, they decide to keep it, and Baoyu, his unmarried cousins, and their maids live in the pavilions in the garden. There they spend their days forming poetry clubs, having literary contests, and the like. Much of the charm of the story is its leisurely following of the lives of these young people with very different personalities, happily thrown together under ideal circumstances in their halcyon days; most are around twelve when Grand View Garden is built, and we follow their teenage years as they play and squabble and grow. But, of course, there is a tinge of sorrow to it all. Life in the Grand View Garden by its nature cannot last. Every year brings an ending closer. We see, in the married Beauties, the difficulties that await the young unmarried women when they leave the Garden. And even if none of this were so, the Jia family is in decline. They are extremely wealthy -- but their rents are declining and their expenses keep rising, so by the beginning of the work they are surviving on inadequate rents and pawning family possessions. Their inadequate rents are still quite extensive, and they have plenty of very nice family possessions that they can pawn for high price. But it is all flowing out more quickly than it flows in. They are extremely well-connected -- but they were better connected in the past, and most of them, instead of achieving new distinctions and recognitions, are frittering away their lives. Yuanchun is Imperial Consort, and that is their highest connection at this point. Jia She, the oldest of the sons of the Dowager, does very little beyond abuse both his wealth and connections. Jia Zheng, a devoted Confucian and the best male of his generation in the family, has very little practical administrative ability. Jia Zhen, the heir of the Ningguo House, and the de facto head of the Jia clan, is only slightly better than Jia She. Occasionally they are given important tasks by the Emperor, and none of them ever perform them particularly well. It's all doomed. Their wealth is mostly illusion; their prestige is mostly illusion; Grand View Garden is mostly built on these illusions. They are beautiful illusions, without doubt, but such illusions always burst like bubbles.</p><p>Cao Xueqin's text as we have it ends at Chapter 80. By this point we have reached the Lady Dowager's eightieth birthday, an extravagant event that accidentally increases the tensions between the two Houses. We have discovered that Jia Baoyou has a double, Zhen Baoyu, whose life has a number of similarities to his own but who made a different choice at a crucial moment. ('Zhen' can be read as 'Real' or 'True', highlighting the fact that the Jia live a kind of fantasy-life.) Xifeng, partly perhaps due to stress caused by her husband's infidelities, has grown ill and is slowly losing her ability to keep on top of the budget and control the servants because of it. Multiple attempts have been made to tighten the budget, but all of them increase unrest and rebelliousness among the servants, and all attempts to restore order make things worse in unexpected ways. We have lost a number of maids, some to dismissal, some to marriage, some to suicide. Rumors, sometimes false but always scandalous, have been building up about goings-on in the Grand View Garden. Baochai has had to move out of the Garden to assist her family, and her brother, Xue Pan, keeps digging himself into worse and worse troubles. Yingchun is married off; it has become clear that it is a very bad match and abusive good-for-nothing, and the Jia family, struggling as they slowly collapse, no longer have the power and influence to do anything about it. The whole dream represented by the Garden is unraveling as a crude and crass world keeps intruding upon it.</p><p>The last forty chapters in the versions we have, possibly by Gao E, although he may just be a redactor of an earlier addition, attempt to tie up everything that has happened to this point. It is often noted that it is definitely different in character from Cao Xueqin's chapters, and this is true. The ending forty chapters have an atmosphere that I can only characterize as fanfictiony. To be sure, they are very well done, but they have the kinds of features we associate with fan fiction. They are written by someone who certainly has read the first eighty chapters closely; a very great number of things that are foreshadowed or hinted at, sometimes very subtly, in those chapters come to fruition in these last forty. Nonetheless, there are many differences. The events are much more erratic and sensationalistic. You do find sensationalistic notes in the earlier chapters, such as when Xifeng's jealousies lead to two suicides, but it is all very slowly and carefully built. The sensationalism of the last chapters is always more abrupt, and as a result the character's reactions are sometimes off. We've always known that Daiyu was destined to die in the course of the story, but her very melodramatic death is hard to square with her rather clear-eyed, if sorrowful, character throughout the book. We've always known that Baoyu and Baochai were destined to marry, but the plot machinery that actually yields this result is clunky and implausible. In addition, some of the sensationalistic things that happen seem to have no other function than to move a character to the side or even off the board. Xifeng's illness doesn't just hamper her; it practically breaks her. Baoyu loses his jade and begins to go crazy. Most absurdly, Miaoyu is kidnapped by brigands and never heard of again.</p><p>There are other fanfictiony aspects. All of the characters act in ways that are just a bit exaggerated, their leading characteristics a little too obviously intensified. We also get some weakly motivated returns of characters who are probably there mostly because they are reader favorites, like Granny Liu, who is a rustic farmwoman who might-possibly-maybe-conceivably be a distant relative, or at least there's no proof she's not. In some of the most hilarious and enjoyable chapters of the book, she had originally come to try to resolve a minor problem, and, having charmed some of the ladies of the house with her good-natured rusticity, was invited for a stay. The highly well-bred and delicate Jia ladies and maidens have an immense amount of fun at her expense, although they also pretty clear enjoy having her and seeing her astonishment at how they live. Granny Liu, besides being an enjoyable character in her own right, serves to show just how infinitely far and ethereally removed the Jia family is from the people on whom their revenues ultimately depend, as well as how extraordinarily and mind-bogglingly expensive their lifestyle is. She gets a return in the last forty chapters, although not, I think, one that does much justice to her, since she doesn't get to do much more than serve as a plot device for marrying of Qiaojie, and it's unclear why she's even there beyond just having her back again for old time's sake, in the way fan fiction often brings back characters. We also get cases where characters get happy endings, or at least promises of happy endings, for what seems very little reason.</p><p>What is most notable is that it's clear that whoever wrote the last forty chapters we have was less interested in the story of the young women than in the decline of the Jia family; we get a lot more focus on Baoyu's father and uncle, for instance, and more court politics. This is, I think, the largest and most detrimental shift in the last forty chapters.</p><p>The last three paragraphs might make it sound like I didn't like the ending, but this is not true. They are very flawed in comparison to what led up to them, and they seem to fall short of what Cao Xueqin had been intending in a number of ways. But they are enjoyable. The depictions of how Imperial bureaucracy guarantees corruption even against the best intentions of those involved were fascinating. So were the narratives of how badly things could go if you fell out of the favor of the Emperor -- not having become his enemy but simply no longer being in his favor: protections start dissolving, friends start being scarce, things that had previously been easy to navigate become very complicated and technical, bare suspicions become serious weights around the neck.</p><p>And the last chapter makes a valiant attempt to give good, appropriate closure to the frame narrative, which I think deserves a lot of credit. The frame narrative has been kept alive all along by the Buddhist of Infinite Space and the Taoist of Boundless Time here and there crossing paths of some of the characters, by Baoyu's jade, and by dreams of the Goddess of Disenchantment or of the afterlife. In the last chapter, we return to Jia Yucun, who has shown up here and there, and who has now settled, after his disgrace and an eventual amnesty, into life as a common citizen rather than an Imperial official. He is heading home when he happens to stop by the Ford of Awakening in the Stream of Rapid Reversal when he sees a priest who is none other than his old acquaintance Zhen Shiyin, who has become a wise Taoist hermit. They turn to talking about Baoyu, who has vanished under mysterious circumstances, having apparently run away with a Buddhist monk and a Taoist priest, and Zhen Shiyin explains some of the allegorical features of the frame narrative for the reader obtuse enough to have missed it in 120 chapters. (That part is a little fanfictiony, although it's charmingly done.) Jia Yucun has no idea what he's talking about, but Zhen Shiyin predicts that the fortunes of the Jia families will slowly be restored. Zhen Shiyin can't talk long, however, because he is on his way to aid his daughter, who had been lost so young but had eventually received the name Xiangling and become the concubine of Xue Pan, Baochai's brother. She is dying in chidbirth, and Zhen Shiyin goes to guide her spirit. As Zhen Shiyin leaves, he sees a Buddhist monk and a Taoist priest, and has asked if they have severed all the entanglements yet; they reply that they are still working on it, but they are returning the &quot;stupid object&quot; to its place and will record its story, which they do. Jia Yucun falls asleep in Zhen Shiyin's little temple.</p><p>In the meantime, Reverend Void happens to visit Blue Ridge Peak again, and, when he sees the record of the Stone's story, he realizes that someone has added a new section (i.e., the last forty chapters). He transcribes it again &quot;to show the illusory nature of marvels, mundane matters, truth and falsehood&quot; (p. 2547). He looks for someone to circulate the story, but fails -- everyone is just absorbed in a lurid pursuit of gain. He happens, however, to come across a little Taoist temple by the Ford of Awakening in the Stream of Rapid Reversal, and there he finds a man sleeping, and concludes here, at last, is someone with the leisure to circulate the manuscript who is not simply out to get what's his. He wakes the man, who is of course Jia Yucun, and after leafing through the manuscript and noting that he knows this story, he refers Reverend Void to someone he knows will do well in circulating it, a man by the name of Cao Xueqin. Cao Xueqin accepts the manuscript in order to circulate it, and when asked by Reverend Void why he's willing to do so, Cao Xueqin dismisses the question: it's a fictitious rustic tale that will entertain and while away the hours with friends or alleviate a lonely night, so it doesn't require any justification at all.</p><p><b>Favorite Passage:</b> From the first eighty chapters by Cao Xueqin. When Granny Liu visits, they play a drinking game in the garden; tiles are drawn and described, and you have to respond with an associated classical allusion, adage, or proverb that rhymes with the tile name. Granny, of course, gives horrible rhymes and all of her answers are rustically bawdy:</p><p></p><blockquote><p>&quot;We country folk sometimes get together and play this when we've nothing better to do,&quot; the old woman said. &quot;Mind you, our answers aren't so fine-sounding as yours. Still, I suppose I must try.&quot;</p><p>&quot;It's easy,&quot; they assured her. &quot;Just go ahead, it doesn't matter.&quot;</p><p>Smiling, Yuanyang announced, &quot;On the left, 'four and four' make a man.&quot;</p><p>Granny Liu thought this over, then suggested, &quot;A farmer?&quot;</p><p>The company roared with laughter.</p><p>&quot;Good,&quot; the Lady Dowager encouraged her. &quot;That's the style.&quot;</p><p>&quot;We country people can only talk about the things we know,&quot; said Granny Liu, laughing herself. &quot;You mustn't make fun of men.&quot;</p><p>Yuanyang continued, &quot;'Three and four,' green and red, in the centre.&quot;</p><p>&quot;A big fire burns the hairy caterpillar.&quot;</p><p>The others chortled, &quot;That's right. Go on in your own way.&quot;</p><p>Yuanyang said, &quot;On the right a really fine 'double ace.'&quot;</p><p>&quot;A turnip and head of garlic in one place.&quot;</p><p>Giggles broke out again.</p><p>Yuanyang went on, &quot;They make up 'flowers' in all.&quot;</p><p>Gesturing with both hands Granny Liu responded, &quot;And a huge pumpkin forms when the flowers fall.&quot;</p><p>The others were shaking with laughter when they heard a commotion outside. What had happened will be told in the next chapter. (pp. 816-817)</p></blockquote><p></p><p>From the last forty chapters, by Gao E (or whomever):</p><p></p><blockquote><p>When this tale later came to be read, someone wrote four lines of verse to elucidate the author's meaning, as follows:</p><p>A tale of grief is told,<br>Fantasy most melancholy.<br>Since all live in a dream,<br>Why laugh at others' folly? (p. 2549)</p></blockquote><p></p><p><b>Recommendation: </b>Highly recommended, but you'll need to leave yourself some time to read through the 120 chapters.</p><p>****</p><p>Cao Xueqin and Gao E, <i>A Dream of Red Mansions</i>, Volumes I-IV, Yang and Yang, trs., Foreign Languages Press (Beijing: 2019).</p>"
}