{
  "title":"Your Teeth Are Like Washed Sheep (Re-Post)",
  "date":"2021-08-21T10:54:37.272000-07:00",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-4652947753286968322",
  "link":"http://branemrys.blogspot.com/2021/08/your-teeth-are-like-washed-sheep-re-post.html",
  "content":"<p><i> Some recent discussion in the comments box reminded me of this post from 2016, which I have lightly revised in a few parts for clarity of argument.</i></p><p>**********</p><p>The simile, of course, is a flattened version of one found in the Song of Songs (4:4,6:6). In his discussion of metaphor in <i>Semiotics and the Philosophy of Language,</i> Umberto Eco notes that our first reaction to this is to think of sheep as shaggy, dripping, bleating, smelling. But, of course, the figure of speech is not arbitrary (he also considers 5:15):<br><br></p><blockquote>Nevertheless, we can imagine how the biblical poet drops all those properties of sheep negatively identified above, so as to preserve only the characteristic of aequalitas numerosa, their splendid unity in variety -- as well as their whiteness. It is understood that the poet is able to do so because within his culture these most probably were the properties associated with sheep, at least within the poetic tradition. And it is also clear that the qualities chosen to define the beauty of a healthy and sturdy country girl, destined to tend to the flocks among the rocky Palestinian hills, single out her upright solidity (like that of columns), her unbroken state of perfection, in the same way that it is not so much the cylindrical shape of columns that is preeminently chosen as is their whiteness, instead, and their grace of line. [p. 101]</blockquote><p><br>This is plausible and, I think, not correct. Moreover, it is not correct in a way that I think sheds light on Eco's approach to metaphor in general.<br><br>I have on my shelves somewhere a book that was a required text for a theology class I took in undergrad on Old Testament wisdom literature. It's one of those books that can't just let texts be texts, but must also add on top something for 'critical distance' or 'deconstruction' (as theologians have considered, it anyway), an identification of things you have to be suspicious of, like sexism and the like. And one of the critical comments the book makes on the Song of Songs is that its language is crypto-monarchist. The first time I ever read that, I found it hilariously funny, and I find it hilariously funny every time I think of it. (This is what theology texts are good for when they are not good for theology; they are almost as good as joke books.) The Song of Songs is obviously not 'crypto-monarchist' in its language because there is absolutely nothing 'crypto-' about it. It talks about kings. It talks about accoutrements of kings. It talks especially about wealth of kings. And it does it all out in light of day without even a smidgeon of an attempt to hide it.<br><br>None of the figures of speech in the entire book are arbitrary; they all concern the things that make royalty wealthy and impressive. There is nothing in the work to suggest that aequalitas numerosa and whiteness were chosen because &quot;within his culture these most probably were the properties associated with sheep, at least within the poetic tradition.&quot; It is of course, a sign that Eco is neither stupid nor sloppy that he adds that final phrase. In a society in which pastoral activities play a major role, it would hardly be the case that anyone could talk about sheep without having a very extensive familiarity with them, far more extensive than ours usually is. Most people today know that sheep are shaggy, bleating, smelling, only by hearsay. A few more have had occasional experiences of actual sheep, like myself (I had a pet lamb when I was a little boy). Only a very few people today have a familiarity with sheep that would match the kind of familiarity with sheep that would have been quite common in the poet's milieu. He would have known that they were shaggy, bleating, smelling, and more, and to a greater extent than we do. What is more, in the poet's actual culture it is extremely unlikely that in fact &quot;unity in variety&quot; and &quot;whiteness&quot; would be the most obvious properties associated with sheep, which would be food and clothing and the difference between wealth and poverty and between being poor and having nothing. Whiteness and unity in variety could hardly be more than minor properties in comparison. But Eco, being more careful than another might be, saves the claim with the final phrase. It's indeed possible that the poetic tradition tended to emphasize these properties when talking about sheep, if whiteness and unity-in-variety independently came up in poetry a lot. But there is no reason to think that this is operative in this case.<br><br>The order of events suggested by Eco's description is: talking about a girl, talking about teeth, teeth are white and numerously equal, sheep in poetry are white and numerously equal, her teeth are like sheep. But given the consistent pattern of figurative language throughout the work, it is much more likely that the order is something like this: he wants to describe a girl in terms of how impressively beautiful and worth valuing she is; this leads him to think of her in comparison with royal splendor and wealth, which is impressively beautiful and valuable; given that, the problem is to describe the girl in figures drawn from actual royal splendor and wealth; so he describes her nose, her legs, her belly, and, of course, comes to her teeth; what, from the domain of royal splendor and/or great wealth, has something in common with teeth?; he thinks through various things from that domain and comes up with the best fit -- flocks of sheep, white and many!; and so we get our simile. And where this is all going is that the girl is more valuable and wonderful than all of these signs of royal splendor and wealth, because she matches them all in one attractive little package. Given a choice between the extraordinary wealth represented by a flock of sheep with bright wool (and, as he goes on to say, pregnant with twins, which means the rich are getting richer) and the girl's bright smile, what do you choose? The girl's bright smile, of course. (&quot;You look like a million bucks,&quot; he said, &quot;the Rolls Royce of women, and your eyes are a mansion enough for anyone; and your lips are sweeter than fine wine.&quot;) In short, the whiteness and numerous equality being selected out is almost certainly an effect of looking for an appropriate metaphor, not something simply received and applied.<br><br>This is all, of course, speculative reconstruction. There are a number of ways in which this line of thought could be varied. But, remember, we get a lot of figures of speech in the Song of Songs, and they do display thematic patterns. The explanation here easily adapts to her belly like a heap of wheat, her hair like a flock of goats, her neck and nose like a tower, her thighs like jewels, her navel like a bowl of wine, and, yes, her legs like marble columns. All of the similes develop within a larger set of metaphors, and to this extent there is a workman-like quality to them: you can identify the concern that selects what to look for.<br><br>This is precisely where Eco's account of metaphors is consistently weak. He likes to jump quickly to infinities of possibilities, and then, to handle them, run to purely cultural explanations. But this does not lead to a very good explanation of most use of figures of speech, and it misses the most important thing, which is that the poet is not making up similes at random, but for a reason. Composing poetry is an extremely teleological affair: you have your ends, and you find your means for those ends. In the process you actively discover things that you weren't really expecting, but which happened to come along with the means that were available. It's like a master sculptor: he wants to sculpt Judith with the head of Holofernes, so he looks around for a marble of the right kind, and in sculpting he discovers features in the grain of the marble that he adapts to his use, and the choice of marble and the choice of the manner of adaptation are all governed by the end in view. Why does the poet go out of his way to mention that the sheep are ewes pregnant with twins? Was that what he was looking for from the beginning? No. Is it somehow a special feature of sheep as portrayed in standard poetic diction? Maybe, but that's not what explains its role here. It's an intensifier naturally arising as a possibility given that sheep were already selected, when you consider the end he had in view.<br><br>Rarely do we consider all properties when doing metaphors. Eco realizes this, but regularly tries to offload everything into culture, as if all the properties were really on the table and it's the arbitrary choices and historical contingencies of culture that narrow the focus. But this is backwards entirely. Why bring sheep in at all? Because there is already a reason for doing so. And that reason constrains and governs the properties selected out. Culture merely gives an order to the search by making some of those properties more likely to be called to mind than others; it suggests, while the poet does the actual selecting. When we deliberately choose a metaphor or simile, we are not picking them from an endless sea of possibilities; we have an end in view, and we usually only look at the things that are appropriate to that end; and from those possibilities we select the best fit we come across for that end. Only when we take into account the end in view do we get a real understanding of similes and metaphors.<br><br>-----<br><br>Quotation from Umberto Eco, <i>Semiotics and the Philosophy of Language</i>, Indiana University Press (Bloomberg: 1984).</p>"
}