{
  "title":"The Mystery of Piety 1.2.1&2",
  "date":"2021-08-23T06:31:02.464000-07:00",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-8395579960197628043",
  "link":"http://branemrys.blogspot.com/2021/08/the-mystery-of-piety-121.html",
  "content":"<p><a href=\"http://branemrys.blogspot.com/2021/08/the-mystery-of-piety-113.html\">1.1.3&amp;4</a></p><p> <b>Second Article of the First Question</b></p> <p><b>1.2.1 On Participation</b></p> <p>In attempting to give an account of the nature of knowledge, Plato considers the fact that knowing is in some ways like recollecting. If we see two sticks and know them to be equal, our knowledge of them as equal is not wholly derived from seeing them; no sticks that we see are exactly equal, but our knowledge of equality from mathematics is precise. Thus it is more like the sight of the sticks suggests to us equality in the proper sense, which we already know. We could add a long list of the ways in which our sticks fall short of pure mathematical equality, e.g., the sticks themselves are quite changeable, whereas equality, which we attribute to them, is not. For this to be the case, it seems that we must know equality itself distinctly from the equal sticks. As Plato's Socrates puts the matter (Phaedo 74d-e), &quot;...when anyone on seeing a thing thinks, 'This thing that I see aims at being like some other thing that exists, but falls short and is unable to be like that thing, but is inferior to it,' he who thinks thus must of necessity have previous knowledge of the thing which he says the other resembles but falls short of...&quot;. We can look at the sticks and they remind us in some way of equality, so that we can say, &quot;These are equal, although only approximately so.&quot; This is quite general, however; it would apply to lines in a geometrical diagram, for instance, and to other ideas, like those of justice, beauty, and goodness. There is a deeply rooted puzzle here; we find many things such that, first, there appears in them a sort of commonality they have with each other; and, second, they exemplify this commonality imperfectly. If we apply the term 'teacher' both to Confucius and to a rookie with rudimentary teaching skills, they do have something common, but it needs to be attributed less completely to the rookie than to Confucius.</p><p>How can things imperfectly share something in common? It seems there must be some kind of source of their commonality, which establishes the commonality but to which they can be related in such a way that they can have this commonality in different degrees. Thus we are told (<a href=\"http://www.perseus.tufts.edu/hopper/text?doc=urn:cts:greekLit:tlg0059.tlg004.perseus-eng1:100\">Phaedo 100c</a>), &quot;I think that if anything is beautiful besides absolute beauty it is beautiful for no other reason than because it partakes of absolute beauty; and this applies to everything,&quot; and, a little further on, &quot;If anyone tells me that what makes a thing beautiful is its lovely color, or its shape or anything else of the sort, I let all that go, for all those things confuse me, and I hold simply and plainly and perhaps foolishly to this, that nothing else makes it beautiful but the presence,&quot; which in Greek is <i>parousia</i>, &quot;or communion,&quot; which in Greek is <i>koinonia</i>, &quot;(call it which you please) of absolute beauty, however it may have been gained; about the way in which it happens, I make no positive statement as yet, but I do insist that beautiful things are made beautiful by beauty.&quot; Beauty or the beautiful as such has something like an appearance or presence (<i>parousia</i>) in what is beautiful, but beauty and the beautiful are not the same; beautiful things have something like a commonality or community or communion (<i>koinonia</i>) in the beauty, but beauty is not the same as beautiful things generally; and when we attribute beauty to things, we do so in a graded way, recognizing that this thing is imperfectly beautiful, or approximately beautiful, or more beautiful than that. Beautiful things are beautiful by the presence of this beauty that they have in common with other beautiful things; what is capable of becoming present must actually exist (cf. <a href=\"http://www.perseus.tufts.edu/hopper/text?doc=urn:cts:greekLit:tlg0059.tlg007.perseus-eng1:247\">Sophist 247a</a>); so this beauty itself must exist.    </p><p>On the basis of considerations like these, Plato concludes that there are Forms; a Form (<i>eidos</i>) is the separate sameness in which different things share. Plato's characterizations of the Forms allows for a range of interpretations of how they are to be understood. However, an influential interpretation is heavily influenced by the picture of the Divided Line (<a href=\"http://www.perseus.tufts.edu/hopper/text?doc=urn:cts:greekLit:tlg0059.tlg030.perseus-eng1:6.509a\">Rep. 509a</a> and following). In discussing moral education, Socrates compares the Form of the Good with the sun; just as the sun by its light makes both visibility and vision possible, so the Good makes both knowability and knowing possible. He proceeds to represent this analogy by a line divided into two unequal parts, the larger of which represent the intelligible and the smaller of which represents the sensible, each of which is divided in the same proportion. To the smaller division of the sensible part of the line, Socrates assigns images, &quot;first, shadows, and then reflections in water and surfaces of dense, smooth, and bright texture, and everything of that kind&quot; (510a). The larger section of the sensible part of the line represents that of which the images are imperfect representations, namely, physical bodies both natural and artificial. The smaller part of the intelligible part of the line represents those things that we take physical objects to imitate imperfectly, namely, mathematical objects, since we use mathematics to explain physical objects, although mathematical objects are not sensible. In mathematics we draw conclusions from assumptions made. These mathematical assumptions, and all mathematical objects, then imperfectly imitate Forms, which are beyond assumption, things with which we must be acquainted even to make assumptions, and these are the larger part of the intelligent division of the line. As we go from section to section we require a more powerful kind of thinking; images and reflections require an image-thinking or picture-thinking, one that does not have to make much of a distinction between different kinds of appearances, but physical objects require belief and opinion, and by opinions of physical objects we explain images. Mathematical objects require a higher kind of knowledge, a thinking-through, and by thinking through mathematical objects we explain physical objects. Forms require a higher kind of cognition yet, understanding, and by understanding the Forms we explain mathematical objects in terms of things like harmony, proportion, good reasoning, and so forth. Highest of all is the Form of the Good, &quot;a good that is only and merely good&quot; (507b),  at the limit of what we can think, which is to the intelligible world, and the whole line, as the sun is to the visible world. As we approach the Good, we find things that can reasonably be said to be more real, as we reasonably say that the physical mountain is more real than the reflection-mountain because the physical mountain explains the reflection-mountain, and thus the Forms, and especially the Form of the Good, are those things so fundamentally real that on them the reality of all other things depends and by them all other things are explained. </p><p>Plato himself recognizes that there are puzzles about the nature of Forms; for instance, we run into puzzles when we try to consider things like 'being', 'nonbeing', 'same', and 'different' in the context of the Forms (Soph. 251-259), or when we consider how they are known or how we avoid infinite regress (Parm. 129-135). Criticism of the Forms, however, is most associated with Aristotle, whose concerns particularly associated with the assumption of the separation (<i>chorismos</i>) of the Forms, which he thinks makes the theory of Forms a self-defeating account of our knowledge, because they explain our knowledge of sensible things by things that are the same but less obviously knowable, in ways that seem to complicate and confuse and rather than clarify (cp. Met 3.2 997b). &quot;Even if they exist, they add nothing to explanation&quot; (Post. An. 1.22 83a). Aristotle's most famous argument against the Forms is that of the Third Man (Met. 990b), which is most commonly understood in the following way. If we consider Plato and Aristotle, we can say of both that they are men. For this to be of any value, we must be predicating the same thing of both, 'man'. What we are predicating of both, however, cannot be identified with either; when we say that Plato and Aristotle are both men, we are not saying that they are both the same as the same thing. To say that Plato is a man and Aristotle is a man is not to say that Plato is Aristotle. If, however, we think of 'man' as something that can be predicated of both Plato and Aristotle because they reflect or imitate it as a separate Form, it seems that Plato, Aristotle, and this Form, whether we call it the Form of Man or Manhood or Man Itself, all have to have something present in them that they share in common; which, if it is a Form, gives us yet another level of man, the Form of the Form of Man, which is the 'Third Man' from which the argument gets its most common name. This leads to exactly the kind of infinite regress that Plato himself considered a potential threat.</p><p>Much of the history of Western philosophy has divided between those who are convinced by Aristotle's criticism of the theory of Forms and those who think that it remains defensible. However, we may apply here a comment that St. Thomas makes elsewhere (Sent. De An. 1.8), that when Aristotle rejects Plato's opinions, he often does not do so with respect to Plato's intention, but with respect to Plato's way of stating it, because he regards the latter as gravely misleading. It is important to grasp that even if we accept the criticisms of Aristotle and many others, this does not at all eliminate the original considerations that led to the positing of that theory, and particularly the problem of presence and communion. That there is something two dogs have in common, for which we use the label 'dog', and that it is the presence of that which 'dog' labels that makes them so, are both reasonable claims. We cannot reason about the world if we take nothing to have anything in common with anything else. If they have nothing in common except that we speak of them or think of them as having something in common, this leaves us without an explanation of why we speak of them or think of them as so. Moreover, it does not seem that anyone actually succeeds in pretending that there are no commonalities except arbitrary imposition by minds and wills; a model or an experiment, for instance, would be useless if it had nothing in common with what it is being used to understand except the name or the bare opinion that it is the same. So there must be something really present that makes these different things to have something in common. And something like this view is accepted by Aristotle himself, who notes (Post. An. 1.11 77a) that while you do not need Forms apart from the things that share something in common, to have knowledge you do need to be able to say one thing of many things. As he somewhat obscurely puts it (Soph. Elen. 22 178b-179a), the common cannot be a 'this' but still must be 'such', i.e., if I say that Plato is a man, I am not saying that this, which is Plato, is related to this, which is Man, but that this, i.e., Plato, is himself such a thing, i.e., man. That which is common is not separate from those things that share what is common. Thus without the Forms, we still need an account of how something common can be participated by many things in varying degrees while still being common.</p> <p>Whatever belongs to something in a proper sense does so in one of three ways. A thing belongs essentially to another if it is naturally proportionate to it; a thing belongs by participation to another if it exceeds in some way the nature of what has it; and a thing belongs causally to another if it pertains to it due to its power. Thus human beings are most properly called rational animals, even though they are both intellectual and artistic as well, for to be intellectual belongs essentially to purely spiritual beings but only by participation to human beings, a sign of which is that human beings are not completely intellectual but only partially so; and to be a source of artifacts pertains to human beings causally, but human beings are essentially rational, and it is this essential rationality that is made possible by their intellectual participation and makes possible their effects as artisans and artists. </p> <p>As St. Thomas says (<a href=\"https://aquinas.cc/la/en/~DeHeb.L2.31\">In De Hebd. 1.2</a>), <i>To participate is like part-taking</i> (<i>quasi partem capere</i>);<i> </i>thus when something receives partly what belongs to another fully, it is said to participate it. From this we may define participation as partial reception of a perfection, or completeness, belonging fully to another, and there are four elements of this definition: (1) reception (2) in partial mode (3) so as to be completed (4) by something belonging to another in full mode. Participation is therefore one form of communication, understood as receiving so as in some way to share in common. It is clear from what we have said that we must conceive of the world in such a way that things can receive something in common. Without doing so, we could not classify, since classification depends on what things have in common; without doing so, we could measure nothing, since measurement depends on what things have in common; without doing so, we could not model anything for theoretical or practical purposes, since modeling depends on what things have in common; without doing so, we could not experiment, since experimentation depends on the experiment having things in common with the rest of the universe; without doing so, we could not theorize, since theory depends on theoretical structures having something in common with real structures. And without taking this to be so, we could not draw general conclusions about the world, which depend on things having something in common for reasons that they have in common, at least broadly speaking.</p><p>However, what participates does not 'share in common' in the sense of being the same but in the sense of partly doing so. All forms of participation are cases in which the less universal derives from the more universal, or in which the more determinate presupposes the less determinate, or in which the effect has in a more limited way what is in the cause in a less limited way. St. John of the Cross gives an analogy (<a href=\"https://ccel.org/ccel/john_cross/ascent/ascent.v.v.html\">Ascent of Mount Carmel 2.5.6</a>): <i>A ray of sunlight is striking a window. If the window is in any way stained or misty, the sun’s ray will be unable to illumine it and transform it into its own light, totally, as it would if it were clean of all these things, and pure; but it will illumine it to a lesser degree, in proportion as it is less free from those mists and stains; and will do so to a greater degree, in proportion as it is cleaner from them, and this will not be because of the sun’s ray, but because of itself; so much so that, if it be wholly pure and clean, the ray of sunlight will transform it and illumine it in such wise that it will itself seem to be a ray and will give the same light as the ray. Although in reality the window has a nature distinct from that of the ray itself, however much it may resemble it, yet we may say that that window is a ray of the sun or is light by participation</i>. The same idea is captured in the Dionysian works by considering a wax impressed by a seal. Many impressions participate the figure of one seal, the archetype, <i>and in each of the impressions the seal is whole and the same, and in none partial in any respect</i> (<a href=\"https://sacred-texts.com/chr/dio/dio05.htm\">DN 2.5</a>), that is, to say, the seal itself is not less for being impressed many times. But we can still recognize that there is variation among the impressions, which participate the seal's outlines in varying degrees of approximation. This is no due to the seal, but <i>the difference of the recipients makes the figures dissimilar, since the archetype is one and complete and the same</i> (DN 2.6). This is because in receiving, things can have different aptitudes for receiving. The wax might be more or less liquid; it may be of different materials that respond differently to the seal; it may be already stamped; the spot of wax may be sufficient or a little too small in quantity for the seal; that is, in short, everything receives according to its aptitude, and it is features in the nature and circumstances of the reception itself that create the variation.</p><p>There are many examples of this kind of thing. In some cases, we find the particular or individual sharing in the universal, and humanity shares in animality, or as Socrates shares in humanity. In some cases, we find the determinable sharing in the determining, as with a thing capable of being colored sharing in a particular color, or materials sharing in an organization. In other cases, we find the effect sharing in a cause or the result sharing in its reason, as the artifact shares in the idea of the artisan, or the instrument in the action of its user. In all of these cases it is important to note that 'partly receiving' is not the same as 'receiving a part', although, of course, it could be that the latter may be one way the former may occur. The artifact partly receives its common nature from the artisan's idea of it, but by approximating it in the material, not by somehow receiving a fragment of the idea in itself.</p><p>Those things that are something only partially do not have it essentially, but from another. As Aquinas says (<a href=\"https://aquinas.cc/la/en/~QDePot.Q3.A5.C.2\">QDP 3.5</a>), <i>If each one were of itself able to have it, there would be no reason why one should have it more than another</i>. That is to say, there must be something that causes it to be it partially but only partially; so what participates has something prior to it from which it receives its character. We find in the world that some things are imperfect or incomplete according to some simple perfection; namely, this being, this truth, this good, and so forth. Such imperfect participations of simple perfection are intelligible only with respect to the pure case of such a perfection, such as goodness, truth, and so forth, which is the simple perfection as such. This is, indeed, the point: there must be something present that is common but in different ways; it has to make intelligible all the different ways the common can be had. We can only make sense of different degrees of truth if we can make sense of truth as such, which the different degrees participate differently. This is fairly straightforward because simple perfection does not necessarily include any concomitant imperfection; it is such that it includes no intrinsic limitation.</p><p>Things become more complicated when we consider qualified perfections, which by their nature include some limitation and incompleteness. Thus we find this stone, that dog, and so forth. These too are drawn back to being by essence that is perfect, but this perfect being cannot be of the same qualified or partial perfection because qualified perfections are not consistent with perfection by essence. Thus what is an imperfect participation of simple perfection is drawn back to a simple perfection of the same notion, but what is a participation of a qualified perfection is drawn back to something that is by essence simple perfection, which, while different from the qualified perfection according to the formal notion, includes that perfection eminently. Thus, for instance, we trace back imperfect good to perfect good, but stones or dogs, which are imperfect are traced back to highest being, highest good, etc., which includes their perfection virtually.</p> <p>Such is participation. We can see that there must be participation by recognizing that it is found in at least three ways: by natural possession, by cognition, or by disposition. For something can receive what is proper to the nature of what it is participating, by a sort of intimate possession; or it can receive a thing insofar as it has cognition of its appearance; or it can receive a thing by becoming part of its act and thus being disposed to subserve its power like an instrument, for <i>an instrument is in a manner the cause of the principal cause’s effect, not by its own form or power, but in so far as it participates somewhat in the power of the principal cause through being moved thereby</i>, as Aquinas says (QDP 3.7). For instance, a physician, can participate the art of medicine by having it to some degree in himself and by knowing about the ins and outs of the art itself, and by service to it, as when one physician assists the exercise of another's medical art. All these are distinct. It may well be that someone who is not a physician while lacking the skill or know-how, nonetheless knows more about some facet of medical skill than a given physician; and it may well be that someone assisting a physician may share in the actual medical operation despite having no actual medical skill or knowledge himself, as sometimes happens in emergency situations. But all of these are a kind of participation.</p><p><br></p><p> <b>1.2.2 On Categorical and Transcendental Being</b></p><p>Classification is essential for practical and intellectual life; it is necessary for the effectiveness of skill or art and it is necessary for understanding the world. We interpret our observations by classifications, and classifications assist us in determining the best measurements or ways to proceed. Classifications facilitate reasoning by making it possible for us to reason at all, since we get the terms on which all reasoning is based from classifications; they condense truths that we have discovered already so that they may be more easily used in reasoning and argument; and they provide a framework and structure for further inquiry.</p><p>We classify in many different ways, attempting to classify things sometimes according to what they are, sometimes according to their possession of other relations to other things (like origin, shared environment, appearance, or use), sometimes according to whimsical principles. When we classify things according to what they are, however, we do so by sameness and difference.</p><p>In order to classify we must predicate some kind of sameness of distinct things; when our classification is concerned with what is, in particular, we are at least trying to identify the ways in which these distinct things have the same quiddity (whatness) or nature or essence (all three of which are words for the same thing, just in light of different relations). What is more, we want to distinguish this same nature from other natures. But different natures will also be in some way the same, as well. What it is to be a tree is not completely and absolutely different from what it is to be a dog, despite the fact that they are very different; we can easily recognize that they are both living organisms. An oak is a tree, and thus a plant, and thus a living organism, and thus physical entity, and thus a substance; at each stage we get a classification that is less complete and more indeterminate predication of sameness, although we need these less complete and more indeterminate predications of sameness in order to compare and contrast them with other things that we are classifying. A less complete and more indeterminate predication is known as a <u>genus</u>, with <u>genera</u> being the plural. All genera are shared universals; the more generic we get (i.e., the more inclusive our genus), the more universal the genus. Within a genus, things have to be distinguished. A predication of difference is known, unsurprisingly, as a <u>differentia</u> or a difference, with <u>differentiae</u> being the plural. Differentiae are also universals. A genus made more determinate by being united to a differentia is known as a <u>species</u>, which is why the differentia is also sometimes called a 'specific difference'. (We should not conflate 'species' in this sense with the many senses used in biological classification, in part because biological classifications often have other concerns beyond identifying what a thing is, as opposed to how it is related to other organisms, and the terminology for biological classification has often drifted from that used to account of classification in general, due to historical accident or practical requirements of biological inquiry.)  As Aristotle characterizes it, using the conception of participation (Top. 121), &quot;The individual participates the genus and species, as a particular man participates both man and animal.&quot; The species thus participates the genus, and the genus is itself a species participating a higher genus unless it is some maximal genus.</p><p>Given the usefulness of classification, it is perhaps inevitable that the human mind would wonder whether there can be a superclassification, a single classification operating on consistent and univocal principles that includes everything about which we can think in a well-defined genus, a classification with one maximal genus for everything. However, it is one of the oldest proofs in the theory of classification, going back to Aristotle, that this is impossible. No classification can be made without presupposing concepts or ideas that cannot be adequately accounted for within the classification itself. Every classification, understood as a way of understanding the world, is necessarily incomplete. Aristotle established this incompleteness result by considering being and unity, two concepts absolutely essential for understanding the world.</p><p>A genus requires differentiae that fall outside it. As St. Thomas says (<a href=\"https://aquinas.cc/la/en/~Metaph.Bk5.L9\">In Met. 5.9</a>), <i>Since a difference does not participate a genus, it lies outside the essence of a genus</i>. If being were a genus, however, the only differentiae it could have would be pure nonbeing. It is absurd to say that a genus is differentiated into species by something that does not exist in any way. Moreover, a maximal genus would have to have many different species falling under it, which require many different specific differences, and thus many distinct kinds of pure nonbeing. But it is nonsense to say that there are many distinct kinds of what has no being in any sense. The same arguments may be given for unity, as all classification presupposes being and unity in some way. Being and unity do not admit of a single classification, because neither of them is a genus, but instead something more fundamental than any genus, something that must be presupposed by any classification.</p><p>We must therefore be more modest, and in order to understand the world around us accept a plurality of classifications. And the result does not rule out having a classification of being or what is in a looser sense, namely, in having a number of non-comprehensive classifications that are nonetheless relatable to each other in definable ways (albeit according to various different sets of principles), and that cover a more narrow field than all of being or all of the intelligible. After all, we usually do not need to consider every possibility, every intelligibility, every being; we often just need classifications that give us understanding of those possibilities, intelligibilities, and beings we find in our experience, and let us talk about them and reason about them for the purposes of inquiry and practice.</p><p>Given what we have said, any classification of being into kinds or genera of being in this way, focusing on the changeable beings we find in our immediate experience, must not be a division into species but in different ways, according to the different ways something can be said to be something. When we say, X is Y, we predicate Y of X; and thus we call the primary genera of being <u>predicaments</u> or <u>categories</u>, both of which terms are concerned with predication. Despite the humbling of more expansive ambitions, having an account of categories would still be very useful; it would help us, as Aristotle notes (Soph. Elen. 4 166b) avoid certain fallacies of reasoning, by helping us to avoid treating things that are different as if they were the same, which is, for instance (Soph. Elen. 22 178b), why the theory of Forms runs into the problem identified in the Third Man argument.</p><p>If we are interested in changeable things, there are particular ways things change that must be treated as different from each other. As St. John Damascene says (Fount of Knowledge, 61), <i>Everything changed is changed either in itself, or in something within itself, or in something around itself.</i> To predicate of things that are in terms of what can change in the first way, by beginning or ceasing as existing subjects of other things, is understood in terms of a kind of genus we call <u>substance</u>. Understanding the other two gives us genera of features incident on, or inhering in subjects, which by long philosophical tradition are called <u>accidents</u>. For instance, a dog is a substance; its actual being is without qualification and, as it were, stands on its own. But a dog can also actually be black, in which case its black is qualified by being the blackness that belongs to the dog. Likewise we find something in nature potential to each of these ways a thing may actually be. When a ball that is black becomes white, we see that the ball had the potential to be white. We assign this kind of potential being to substances, which have their own actual being from themselves, not from the things they can be. Indeed, it is what gives the accident actual being.</p><p>In considering the natures of changeable things, then, there are three ways in which we can predicate something of something, when subject and predicate are not simply equivalent.</p><p>(1) We can predicate of a subject something that is essential to it, e.g., when we say, 'Fido is a dog,' or 'A dog is a mammal.' This is the category that predicates <u>substance</u>. </p><p>(2) We can predicate of a subject something that is not essential to it but nonetheless intrinsic to it in another way.  There are three ways in which we do this. (2.1) Either what is predicated follows from the matter of the subject, and this pertains to the category that predicates <u>quantity</u>, or (2.2) it follows from the form of the subject, an this pertains to the category that predicates <u>quality</u>. (2.3) In the third way, the subject is related to other things by something intrinsic, as when I call a man a father, in which I am predicating something that does not belong to the man alone, since it relates him to something outside himself, namely, a son or a daughter; but this is nonetheless in some way intrinsic to him, being the sort of thing that pertains to the man himself and not being the sort of thing that can be put on or off in the way something extrinsic is. This pertains to the category that predicates <u>relatedness</u>, which is in the most proper sense inherent reference or relativity to another.</p><p>(3) We can predicate of a subject something extrinsic to it that nonetheless pertains to it in some way so as to qualify it. This we can do either by way of extrinsic causes, or by way of extrinsic measures, or by way of something extrinsic that is 'taken on' as a quasi-part by another. Because there are six of these in the traditional list, they are sometimes known as the <u>six principles</u> (<i>sex principia</i>); they presuppose the first four categories, so are in some sense less important for metaphysics, but they are nonetheless of considerable importance for the study of the physical world and for practical life in it.</p><p> (3.1) Causes may be intrinsic or extrinsic. Intrinsic causes, also known as constituent causes, are parts of a thing, pertaining to its essence, so any predication of this sort (“A dog is a mammal,” or “A human person has a body”) will belong to the category of substance. Extrinsic causes, which are what we more often call 'causes' in English, may occur in two ways. (3.1.1) We may say that something is an effect of an efficient cause, thus qualifying its cause: and this is the category that is said to predicate <u>passion</u>. (3.1.2) We may say that something is a cause, thus qualifying it by its effect; and this is the category that is said to predicate <u>action</u>. </p><p>(3.2) Measures may also be intrinsic or extrinsic. Intrinsic measures, like length or volume, belong to the category of quantity. We can, however, also speak of how a thing is measured. To measure something by a change belongs to the category of <u>when</u>. We may use boundaries to measure a thing, in which case we are in the category of <u>where</u>, or by the disposition of its parts relative to place, as when something is sitting or standing or folded up, which belongs to the category of <u>position</u> or state. There is an asymmetry between time and space here (one time-category, two space-categories) because all temporal predications already imply a disposition of parts in time, since time is the measure of before and after, or direction, of a change. </p><p>(3.3) There is another set of predications, however, that do not apply to every kind of thing because they depend on how some things, like human beings, can in some way 'take on' other things in using them. When we say that something is clothed with fur or armed with tusks or equipped with pincers, we are qualifying them not by anything properly extrinsic but by intrinsic parts, and so these predications pertain to the category of substance. But human beings must use reason to devise external substitutes for fur, or tusks, or pincers, because we lack them in situations where they would be useful. So predicating 'clothed with silk' of a human being is not like predicated 'clothed with fur' of a mouse, despite the verbal similarity. The latter indicates a part of the mouse, but silk cloth is not a part of a human being, but something used almost as if it were a part. The predication indicates a practical appropriation of something distinct from that to which it is appropriated. In such a case we are qualifying them by something that is neither a part, nor a cause, nor a measure, and the category relevant to this we call <u>habit</u> (as in a nun's habit) or equipment or vestment. Aquinas suggests that this category strictly applies only to human beings, although it can apply to nonhuman things insofar as they are used by human beings, as when we say a horse is saddled. This is certainly true of the usual cases, but it seems that there are at least occasional cases in which we can apply this to animals without regard to human use, where instinct, animal estimation, or practical cognition allows them to take on things extrinsic to themselves as part of their immediate sphere of action, as with hermit crabs and their shells.</p><p>Nonetheless it is not essential to our purposes whether this list of categories is exhaustive, or whether there is a higher or better list of categories, for our primary concern right now is not with the categories themselves but with what may be contrasted with them. Whatever they are, categories are maximal genera for classification. But it is clear from what we have said that not all predications pertain to the categories. For what is found under the categories is some species of that kind of being. But being itself is no such thing. Thus being is said to surpass or transcend the categories, and therefore is said to be a <u>transcendental term</u> or transcendental. This follows directly from what we have previously said about being not being a genus, although being is not the only case. Some kinds of transcendentals seem to be classification-relative. A good example is that of 'accident', which does not fall under a genus, but characterizes things in multiple categories without covering the whole terrain of being. We could perhaps call these transcendentals <u>hypercategoricals</u>. Other transcendentals, however, do not seem to be so restricted; certain kinds of ways of understanding being are also such. These transcendentals are what make it possible to relate category to category at all and to construct classifications in general. We use transcendentals like being and unity to construct classifications, for we take parts of our classifications to have some kind of unity of being; we use them to relate one classification to another classification, since they must be assumed by any classification; and for both of these reasons any theory of classification must be grounded on these things that exceed all classification. Without transcendentals there can be no classifications at all. </p><p>If we focus on transcendentals that go beyond being merely hypercategorical, they seem to be related to being in different ways, due to different ways they are understood. (1) Some transcendentals involve understanding being in light of some relation. 'One' is an example. These transcendentals are said to be directly coextensive or convertible with being. I will call them <u>convertible transcendentals</u>. (2) Other transcendentals divide being by a sort of distinction or disjunction into two or more, so that the disjunction is that by virtue of which one understands being. 'Actual-or-potential' is an example. These are often called transcendental disjunctions, or as I will call them, <u>disjunctive transcendentals</u>. (3) Others are more indirectly related to being, but are concepts that do not have any intrinsic limitation that could confine them to a genus. Examples would be 'wisdom', 'omnipotence', and the like. These are usually called simple perfections or pure perfections, but I will call them <u>nobilitative transcendentals</u>.  All of these are interrelated, however, and all of them are tied to being, and all of them are fundamental for understanding the world.</p><p>(1) Definitions as well as proofs are grounded on principles accepted in themselves because they require no further middle term. Were this not the case, defining and proving would be infinite tasks, and thus knowledge or science would be impossible. Ultimately, all definitions presuppose our first notion, which is <u>being</u> or 'what is'. Every concept we have in some way adds something to being, whether it be by negation or by mode or by relation or by restriction. However, we cannot add to 'what is' anything extrinsic to it, because nothing whatsoever is extrinsic to it; this is why 'being' or 'what is' and other similar terms are not names of a genus. What these other concepts do instead is add a way or mode of being that the term 'being'  or 'what is' itself does not express directly. One way this happens is when the mode of being adds the notion of a species or genus; and in this way, for instance, 'substance' indicates a particular mode of being. Much the same can be said of the other categories, and of all genera falling under these primary genera.</p><p> However, some concepts add a way of being that is found in everything that is in some way, either in itself or as related to another. If we are speaking of the way it is in itself, the addition to what is can be either a positive mode or a negative mode. For anything you can pick out, what is positive about it in itself is the nature that makes the thing what it is. Thus every being or 'what is' can be specifically considered as a 'somewhat' or 'something'. The Latin term for this transcendental, when being or 'what is' is considered particularly as a something or 'what', is <u>res</u>, which gives us the English word 'real'. 'Res' is usually translated as 'thing', but since, in this context, the term is supposed to emphasize the 'what' in 'what is', it is better to think of it as 'something'. What is negative about beings themselves, is their being not other than what they are, which is to say, that they are <u>one</u>. Everything that is must in some way be undivided so that we mays of it that it is one in some way, and therefore 'one' in this sense applies to everything that is.</p><p>If we consider instead the way something is when considered as related to another, there are also two ways this can happen, a negative and a positive. The first way of being related to another that applies to everything belongs to it as divided from other things, as when we say one being is not another. This is, so to speak, just the flip side of the fact that it is one, for just as things are one in the sense that they are undivided in themselves, so too there is a way that they are divided from other things so as to be not one with them. Every being is an 'otherwhat', we might say, from something else that is or could be. In Latin the term for this is <u>aliquid</u>, which is usually translated as 'something', but in this context is best understood as 'other' or 'another'. Every being is an other with respect to some being that is or can be.</p><p>The second way one being can be related to another is positively, and there are two general ways this can occur. The first is as being conformed to or in conformity with being. Beings are able to be conformed to other beings, so that something of what they are is in a sense reflected in other things; for instance, one can be a copy of another. Not all of these conformities are found in every being. However, some are. We can most clearly see this by considering the intellect. The human mind is, as Aristotle said, in a sense all things. Whatever we can think of as being, we can think of as thinkable. When we contemplate what is insofar as it is related to knowledge, we consider it as <u>true</u>, although sometimes we use other terms for the same thing, like 'intelligible'. Even if there is no human intellect, even if we do not consider the relation of being to an actually existing intellect, it pertains to anything we could possibly consider as being that it could have some relation to at least some possible intellect. Because of this, 'true' in a sense includes, at least indirectly, every case of being that is understood as in conformity with other being. Thus 'true' is a transcendental convertible with being; as St. Augustine says (Solil. 2.5), <i>The true is what is</i>. </p><p>The second way one being is related to another positively is when being is disposed to or tends to being. Being does tend to being; for instance, potential being tends to actual being. Not every such tendency is universal, but it is universal to be a possible term of some being's tendency. We see this most clearly when we consider the will. As the intellect can be in some sense all things, so the will can in some sense tend to all things. And likewise, as true is related to knowing so there is something related to loving. We know and love, and everything that is can be considered insofar as it is capable of a relation to some possible thing possibly knowing and loving them in some way. When we contemplate what is insofar as it is related to love, we consider it as <u>good</u>, although sometimes we use words like 'desirable' or 'appetible' or 'lovable'.  But what can in principle be loved as good by some will includes that in things to which other tendencies tend. Thus 'good' includes, at least indirectly, every case of being that is understood as that to which other being tends. Therefore 'good' is a transcendental convertible with being. </p><p>Our mind first apprehends being, then apprehends that it understands being, and then apprehends that as understanding being it desires or tends toward it. As St. Thomas says (<a href=\"https://aquinas.cc/la/la/~QDeVer.Q21.A3\">DV 21.3</a>), <i>The order of these transcendent names, considered in themselves, is: after being comes one, after one comes true, then after true comes good</i>. And it is clear that these are transcendental rather than categorical, for the objects of our knowledge and love necessarily cut across all categories. What is more, we are capable of recognizing that, while we most clearly see the transcendentality of the true and the good in understanding and will, they do so by conformity, in the case of understanding, and tendency, in the case of will, and both of these are found even in things with neither intellect nor will. </p><p>Indeed, it seems clear that if 'good' and 'true' were not transcendental, we would not have any concept of 'being', either. Our understanding of 'what is' is quite clearly connected with our understand of 'what is true'; what something is, is what it truly is. Being is only known insofar as there is some kind of conformity to between mind and being. A similar consideration gives us the same point with good; we cannot understand something as being unless our mind can tend toward it as being, that is, as good to be understood as being. Thus Bonaventure says (It 3.3), <i>Being per se is not able to be cognized, unless it is cognized with its conditions, which are: one, true, good</i>. The same is true of being per aliud, allowing for the relevant qualifications on the conditions to match 'per aliud'.</p><p>Res and aliquid are often not considered; Pico della Mirandola suggests (<a href=\"http://www.esotericarchives.com/pico/beinguni.htm\">On Being and Unity 8</a>) that this is because res is particularly linked to being and aliquid to one, which has a certain plausibility from what we have said above; we can think of res as being when thought a certain way, and one and aliquid related as 'one' and 'another one'. Regardless, the convertible transcendentals that are consistently treated as the most fundamental are being, one, true, and good.</p><p>These are not the only convertible transcendentals; indeed, there are possibly infinitely many. This is clear enough, since to be transcendental is not to fall under a genus, and to be a convertible transcendental is to be being regarded under a particular rational relation. Therefore, unless one held that there were very few rational relations under which we could regard being, there will be many convertible transcendentals. However, there are many rational relations that are applicable to being, and many more than can be assumed to be simply equated with those given above. All convertible transcendentals are related to being by mode, negation, or relation. But negations and relations can be strung together. Thus, we can not only consider beings insofar as they are not divided (one), and insofar as they relatable to intellect (true), we can also consider them insofar as they are not divided in such a way as to be relatable to intellect. We can not only consider beings insofar as they are relatable to intellect (true) and insofar as they are relatable to will (good), but insofar as they are relatable to both in cooperation. We can find transcendental terms in this way for which we have no exact words in English or any other natural language; there is no definite limit to our ability to do this. Therefore there seems to be no finite number of convertible transcendentals. Practically speaking, of course, it is pointless to try to go through infinite convertible transcendentals; and there are only a few practical situations in which it would be worthwhile to consider these more complicated transcendentals rather than the more basic ones of being, one, true, good, because these are both more closely and directly linked with being and more easy to understand.</p><p>We can see this as well by looking at plausible examples. The example of another convertible transcendental that is most often considered is beauty or the beautiful, the beautiful being in some way transcendental like the good, but with a notional difference. As the Dionysian says (DN 4), <i>There is no being that does not participate the good and the beautiful</i>. For since the good is that which all desire, it is of the nature of the good that appetite finds in it its rest. But it belongs to the notion of the beautiful that apprehension finds its rest in its sight or cognition. Hence the sense particularly related to the beautiful are those whose apprehensions are particularly cognitive, namely, sight and hearing. Thus it appears that the beautiful adds, over and above the good, a new reference to a cognitive ability, so that we call good what simply pleases the appetite, but we call beautiful that whose very apprehension pleases. Beauty, then, is related to goodness. But because it adds something to do with cognition, it clearly has to do with cognition as well, and therefore is related to truth; thus beauty is often called the splendor of truth. As St. Thomas says (De Div. Nom. 4.5), <i>beautiful adds on top of good, being ordered to a cognitive capability of some sort</i>. For this reason, it is an inevitable feature of intellectual life to come to think of beauty as indicating truth; indeed, intellectuals must often be wary of the temptation to think of intellectual beauty as simply truth as such, when it really is some particular kind of truth (which may or may not be relevant to our inquiry) insofar as our mind finds rest in it due to its 'fit' with or proportion to our mind or other things. Thus, for instance, as we see in the case of Kepler and many others, while physical scientists have made great discoveries pursuing theoretical beauty, they have also sometimes taken the beauty associated with mathematical truth or even metaphysical truth for the beauty associated with physical truth, which is not purely mathematical or metaphysical.</p><p>From this we can see that those who wish to deny that the beautiful is a convertible transcendental are wrong; it has both the essential features, that it transcends genus and may be related to being (by way of good) as the same yet notionally distinct; what is more, it requires us to commit to the absurdity that what is convertible with what is convertible with being (as beautiful is convertible with good, which is itself convertible with being) is not convertible with being. Nonetheless, the objectors do get in the vicinity of a genuine truth, because beautiful can be considered a secondary transcendental, one of a vast number, and one that directly presupposes true and good, which, as far as their meaning go, have a certain priority. Moreover, it is convenient for many things to apportion things by intellect and will, to which the true and the good are most directly relevant, the beautiful being related to each in a more complicated way. In any case, this suffices to show that there are at least many convertible transcendentals, with one, true, and good being those that are most naturally associated with being.</p><p>(2) It is clear that if, to use Scotus's description (Oxon 1d 8q 3n19), <i>The transcendental is whatever has no genus under which it is contained</i>, then there are disjunctive predicates that are transcendental. For instance, if I say of something that it is either quantitative or qualitative, what I am attributing to it crosses the boundaries between categories and therefore is transcendental rather than categorical, despite the fact that each disjunct is categorical. They are, in fact, hypercategorical, to use the term introduced above. However, we can find disjunctive transcendentals that are convertible with being. These distinctions do not all work the same way, precisely because the principle of division for each is different, but whatever distinction is such that the disjunction of the distinct components can apply to any being in some way will be a coextensive attribute of being. Of these distinctions, some will be inclusive, so that it is possible for something to be more than one of the disjuncts in the same respect; others will be exclusive, so that if one of the disjuncts is truly attributed, any others cannot be truly attributed in the same respect.</p><p> That being is transcendental, and one is coextensive with it, are principles clearly found in early form in Aristotle. Philip the Chancellor and Alexander of Hales recognized that the one, the true, and the good, are especially important  coextensive attributes, although, of course, this recognition was based on the practice of various people of a broadly Platonistic sort, such as Boethius. Albert the Great (Met 1.1.2) recognizes in passing that there might be disjunctive attributes that are attributes of being itself, such as substance and accident, separate and nonseparate, and actuality and potentiality. Aquinas recognizes potential-or-actual as such (following Aristotle), as well as one-or-many and per-se-or-per-aliud. But it is to John Duns Scotus, more than anyone, that we owe serious consideration of the topic of disjunctive transcendentals in general.</p><p>Of these convertible disjunctive transcendentals, some will be more fundamental than others. One of the important features of many of the more fundamental disjunctive transcendentals is that there if something exists to which one of the disjuncts applies, something must exist to which another of the disjuncts applies. This principle, and the reason for it, was recognized by Bonaventure, who says (It 3.3, with a quotation from Averroes, De Anim. 3.25), <i>Since being is able to be cognized as diminished and as completed, as imperfect and as perfect, as potential being and as actual being, as being secundum quid and being simpliciter, as partial being and as total being, as transient being and as enduring being, as being per aliud and being per se, as being mixed with non-being and as pure being, as dependent being and as absolute being, as posterior being and as prior being, as mutable being and as immutable being, as simple being and as composite being, since 'privatives and defects in no way are able to be cognized save through positives', thus our intellect does not come to and understanding fully resolving some created being unless it is aided by understanding of purest being, most actual being, most complete and absolute being, which is simple and eternal being, in which are all natures in their purity. For in what way does the intellect known this being to be defective and incomplete, if it had not cognition of being free from all defect?*</i></p><p> In other words, when these disjunctive transcendentals are recognized, the principle on which they are based often guarantees that there is at least one disjunct to which the others refer in some way, either by some positive reference, or by privation, or by defect. As Scotus says (Oxon 1 d39 q1), <i>In disjunctive attributes</i>, i.e., of being, <i>while the entire disjunction cannot be demonstrated from being, </i>i.e., while we cannot conclude directly that all disjuncts actually are, <i>nonetheless commonly, the less noble extreme being supposed, we can conclude to the more noble extreme in some other being</i>. Thus, in general, by positing the less noble or defective distinctive of being, one can conclude that the more noble or less limited distinctive can be found in some being; thus, if there is a finite, there is an infinite; if there is something for the sake of another, something is for its own sake; if there is a contingent, there is a necessary; if there is a dependent, there is an independent; if there is being per aliud, there is being per se, for as Aquinas says (ST 1.27.5), <i>What has being per se is nobler than what has being per aliud</i> (ST 1.63.1), and <i>What is per se is the principle and cause of what is per aliud</i>; and so forth. In such cases the posterior presupposes or requires the prior. Of these, the most valuable are those in which one of the distinctives is what Bonaventure calls (Myst Trin 1.1)  a distinction or supposition per se nota, or self-evident; because where we find such in the world, we have a sure starting-point. It should not be assumed that in such cases the inference from one distinctive or disjunct to another will be easy; in fact, since the principles of the distinctions will vary from case to case, the ease or difficulty will vary considerably.</p><p> It is clear from what has been said that there are a perhaps infinitely many such disjunctive transcendentals. In every convertible disjunctive transcendental there is some kind of opposition that divides being, and therefore they will have something of a different character depending on the kind of opposition used. Wolter identifies two groups, correlative disjunctions (like prior-or-posterior, cause-or-caused) and contradictorily opposed disjunctions (like actual-or-potential, necessary-or-contingent). The difference is that in the correlative case you can have things that fall under both disjuncts, so that the disjuncts are capable of overlapping, whereas in the contradictory case, the disjuncts exclude each other. This is useful for some practical purposes, but it seems that you could have disjunctive transcendentals for every opposition that is not restricted by its nature to some genus of beings. Further, nothing strictly requires that there be only two disjuncts in our disjunctive transcendentals. Indeed, we can see that every correlative disjunctive transcendental, i.e., A-or-B where A and B can overlap, could be reframed as a three-disjunct disjunctive, A-only-or-B-only-or-both. Further, while it is most common to consider those associated directly with being, there are inevitably disjunctive transcendentals for one, true, good, and so forth. When we recognize this we can see that disjunctive transcendentals are valuable in giving a way to think through the logical structure, so to speak, of convertible transcendentals.</p><p>(3) The third kind of transcendental is what I am calling the nobilitative transcendental, which is often called a pure perfection or simple perfection because it gets its transcendental character from being a kind of completion or completeness that is not intrinsically limited (and therefore does not intrinsically fall under a generic limit). Convertible transcendentals are themselves simple perfections if we understand this broadly. But there are in addition simple perfections that are not directly convertible with being itself. There are perhaps two ways this can happen. In one way, we are considering the more noble disjunct of a disjunctive transcendental, in the sense noted above. In another way, however, we can be considering a way that something has being, where that way can be in some sense commensurate with being and its convertible attributes, even if only indirectly. The most obvious cases are perfections of intellect or will, like knowledge or love, and thus participate indirectly in the transcendental character of the good and the true. In all these cases, the shorthand description is that, as St. Anselm puts it (Mon. 15), <i>to be it is better than not to be it</i>.</p><p>'Wise' is a good example. We could use 'wisdom' to indicate a convertible transcendental, as when Bonaventure (Coll in Hex) says, <i>Wisdom is diffused in all things </i>or perhaps also as the book of Wisdom says (Wis 7:24), <i>she</i>, that is, Wisdom,<i> penetrates and pervades all things by her purity</i>. In this sense it means that everything has certain kinds of relation to wisdom that can be seen as participatory; that is, everything is wise itself, or is an effect of wisdom, or can be understood in terms of wisdom. This is similar to the way truth is a convertible transcendental, although 'wise' makes for a more complicated case. However, we might mean not wisdom in this sense of the 'wisdom-ish' or of 'pertaining to wisdom', but as wisdom itself, the intellectual perfection, the completion of mind, that a wise person has. In human beings, wisdom is a quality. But as a kind of completion of intellect, wisdom as such has no intrinsic limit, despite human beings participating it in the category of quality; the intellect has being as its object, and the intellect in being wise touches, one might say, on everything. As Aquinas says (SCG 1.44), <i>Among perfections of things, the greatest is that something be intelligent, for thereby it is in a manner all things, having within itself the perfections of all things</i>. Wisdom is the highest perfection of intellect, and thus far has a kind of limitlessness or infinity to it; indeed, we may well say that even human wisdom by its purity penetrates and pervades all things, at least after its fashion. Thus if there are intellects far greater than ours, nothing about wisdom prevents their being wise. However wise we are, something wiser could be. Thus there is nothing in 'wise' itself that requires that it be confined to a category. It has a purity or simplicity to it that does not require us to consider wisdom itself as having an intrinsic limit. And as St. Anselm says (Mon 15), <i>to be wise is better than not to be wise</i>. This is in fact connected to the fact that we could in fact use the term 'wisdom' more broadly as a convertible transcendental; that we can use the term in the convertible sense is due to the fact that it has no intrinsic limit in the nobilitative sense. We can likewise apply the disjunctive transcendentals to it, speaking of prior wisdom and posterior wisdom (or primary wisdom and secondary wisdom), infinite wisdom and finite wisdom, necessary wisdom and contingent wisdom, and so forth, which is another sign that it is transcendental.</p><p>Consideration of all transcendentals, as well as what participates such transcendentals, can lead to God, although the way is not equally short, easy, or certain for each. Our primary concern here, however, shall be with being, one, true, good, which are the fundamental ones, to which we will add orderly, beautiful, and noble, as being of value for later arguments. For the world, along with what is in it, is, and is unified, knowable, and desirable in its being; it is ordered, beautiful, and noble by nature;  and in each it utters the glory of something prior to it, that serves as a precondition for it to be these things.</p><p><br></p><p>     <b>1.2.3 On Being and One</b></p> <p>[I] We use many different words to talk about being, but being is what falls first under our capacity to understand anything at all; it is the formal object of the intellect (<i>primum cognitum</i>). Everything we know or understand or believe or suspect, we do so either as (<i>qua</i>) being or on the model of (<i>instar</i>) being. Our concepts represent what things are, in some way; even things like holes get treated as if (<i>instar</i>) they were beings. Our judgments assess the way things are. Our reasoning is based on being, because we must comply in one way or another with the principle of noncontradiction, which is ultimately based on the concept of being. Take away our capacity to think in terms of what is, and there is nothing we can conceive, nothing we can judge, no way we can reason about anything.</p><p>It is upon being that all demonstration rests. The fundamental principle underlying any demonstration must be one that excludes error, that is not a mere supposition but an immediate principle, and that is naturally known. This is the principle of noncontradiction, which in its fundamental form is that it is impossible for the same being to be and not be in the same way, or, as we may also put it, that it is necessary for what is, not to be what it is not. We require no demonstration of this; we all recognize it, and we all hold reasoning to its standard. Even those who profess to deny it, uphold it elsewhere and are usually just using unusual interpretations of particular words in a particular formulation. As all our understanding depends on being, it is clear that 'being' and similar expressions must mean something for anything to mean anything at all; we must be able to distinguish between what is and what is not. This is not to say, of course, that we cannot have make a logical system in which the principle of noncontradiction cannot be expressed; but for it to be usable and intelligible at all, it must be consistent with the principle of noncontradiction. And we can even have logical systems in which the principle seems violated; but we will always find that in such a system that 'being' is understood not simply but as relative to something. For instance, we might have a logical system that models a database, and therefore want to allow it to include contradictions; in such a case, the principle of noncontradiction is unaffected, but the logical system is looking in particular at being insofar as it can be assessed by that database. The system itself, however, cannot be consistent unless it complies with the principle of noncontradiction itself, based on being, even if it allows a restricted violation, based solely on being-as-assessible-by-database.</p><p> We can distinguish between being as divided by the categories and being as posited or proposed in judgment. Anything can be a being in the second sense if an affirmative judgment can be made of it, even if it does not indicate anything positive, but simply a privation or negation. Thus we can talk about features or properties of blindness, which is a lack of sight, just as we talk about features or properties of sight itself, by positing blindness as existing, even though it does not have any actual being. Even though we are not able to regard it as (<i>qua</i>) being, because we judge of it, we can regard it along the lines of (<i>instar</i>) being. In the categorical sense, however, something positive, actual, or real, is posited, and in this we can say that privations do not really exist. </p><p>It is common in certain circles to deny that being can be more or less had, but this is an abuse from an inadequate consideration of the fact that we do in practice regard some things as having being more fundamentally than others. If you ask a child, &quot;Where is a cow?&quot; and the child points to a picture, saying, &quot;There it is!&quot; and another child points to an bovine animal and says, &quot;There it is!&quot; nobody who is not insane takes these to be saying that the picture-cow has being as a cow in the same way as the animal-cow. Even children recognize that the latter has being more fundamentally than the former, the latter being an imitation of the former. And if we have several different picture-cows, it is entirely possible for them not to be equally related to the pure and most proper case, the animal cow, as some pictures may be distorted or inaccurate. Nor will it suffice to say that this is only the case with 'cow' and not 'being', because 'cow' is simply a clarification of 'what is' in this case; it is a way of being. Likewise, we take fictional being to be less fundamental than real being. Likewise, we speak of things being in dreams, and we recognize that this is less fundamental than being in the waking world. Further, we can recognize that accidental being is less fundamental than substantial being. Therefore, when we predicate being (and similar things) of various subjects, we clearly do so in different grades, such that something can be taken to have being in a more or less complete or fundamental way than another.  And this conforms to what we have seen, since it would appear that if being involves no gradation that it would be a genus, which we have seen is impossible. Further, it seems that if we reject this gradation for being, we are forced into an unhealthy choice, between holding that everything is a separate being without any commonality or holding that everything is one being without any differentiation, neither of which is consistent with our experience. Thus being is something common had in different ways and degrees, and therefore something we find participated.</p><p>Since every being by participation is incomplete and only that being is complete that is being by essence, every being by participation is traced back to being by essence, which is thereby complete. As Bonaventure says (Sent 1.8.1.1), <i>If there is being by participation and by another, it is because there is being by essence and by itself</i>, and as Aquinas says (In Jo 127; cf. ST 1.44.1), <i>Everything that is what it is by participation is derived from that which is such by its essence</i>. When we are speaking specifically of being, it is clear enough, however, that if something is by essence must actually be. Thus there must be something that is by essence. This thing must also be the cause of other beings, since if things have a common feature that they receive, and we find the thing that most properly has that feature, since it has it by nature rather than reception, we have found the cause of that feature in other things. As Aquinas says, borrowing a comment from Aristotle (In de Lib. de caus. 3), <i>what is first and being to the greatest degree is cause of subsequent beings</i>. Therefore there is something that is being in and through itself, that does not have being by participation, but from which other being have being.</p><p>We may further establish that participating being requires unparticipating being in many other ways. Here I will use three transcendental disjunctions to do so, selecting them because they have been widely used in discussing these matters: (A) per se  or per aliud; (B) contingent or necessary; (C) exemplate or exemplar.</p><p>***</p><p>A1. <u>We find in our experience something that has being per aliud</u>. To be from another is to have <u>being per aliud</u>. We find in our experience many things that are, and they have a sort of interconnection with each other, in that one being receives being from another. This connection is participation. It is a reception of what belongs to another. This received being completes what receives it, so is a perfection; indeed, it is the purest kind of a perfection, since all other completeness or perfection depends on being. This reception is also partial in that the being received is received particularly as being derivative from that which originally has it; this is why we often take causing as a kind of superiority over being caused. </p><p>A2. <u>If there is being per aliud, there must be being per se</u>. To be from another requires that there be something that is in and of itself, or has <u>being per se</u>. As Aquinas (ST 1.63.1), <i>What is per se is the principle and cause of what is per aliud</i>. If we have a series of beings from another, so that A is from B is from C is from D, and so forth, then the whole series, ABCD and so forth, is from another; any collection of per aliud beings, in fact, is per aliud, since that very collection would not be except for another. However, if we take all beings that have their being by participation, so as to be per aliud, then that collection requires, on pain of contradiction, that there be at least something not in the collection of beings per aliud from which they receive their being. But a being that is not per aliud has being per se; to say that something has being per se is to understand its being in light of negation, by which we reject its having that being from another.</p><p>This accords with our practices of explanation in general, since whenever we find anything per aliud, whether being or anything else, we look for that which has it per se.</p> <p>A3. <u>Therefore there is being per se, which the beings per aliud of our experience ultimately participate</u>. St. Thomas tells us (Quodl. 2.2.1), <i>Whenever something is predicated of another through participation, it is necessary that there should be something there besides that which is participated, and for this reason in whatever creature the creature itself which has actual being is one thing, and its actual being itself is another</i>. As we have noted before, whatever belongs to a thing beyond itself originates either in the principles of its nature or from some principle outside its nature. Actual being, however, cannot originate in a quiddity (whatness) or essence, so as to be beyond them, because this would be the same as saying that they produce themselves, or that essences may actually be independently of any actual being. Therefore wherever actual being is not the quiddity itself, it must be due to something other than the thing that actually is. As there cannot be an infinite regress, whatever is from another is traced back to something that is not from another, and therefore has being per se. And this is the first principle of being, to whose quiddity actual being itself belongs. Again, beings per aliud have something in common precisely insofar as they receive it or have it as effects, namely, they have received being in common. When many things share something, however, we take there to be a common source, cause, or reason for it. Something that is the source, cause, or reason for other things even being, however, must be in order to be such; therefore, there should be some higher source, cause, or reason for being per aliud, so that received being is the effect or result corresponding to it. Such a thing could not itself have being per aliud, however; therefore, it must have being per se.**</p><p>***</p><p>B1. <u>There are contingent beings</u>. 'Necessity' is a term used in many ways. For instance, we call a being that is both ingenerable and imperishable 'necessary', and this sense of 'necessary' indicates something with an unlimited ability to be. However, in another sense we use necessity to mean what is such that it is impossible that it be otherwise. Contingent means what is neither impossible nor necessary. Likewise, we may apply these terms to many different things, and how we understand them is affected by the nature of that to which we apply them. Thus a necessary being would be a being that could not possibly fail to be, and a contingent being would be one that can be or not be. Since some things clearly exist, with respect to necessity and contingency there are only three possibilities that could be the case with these things that are: either they all are necessary, or they all are contingent, or some are necessary and some are contingent. It is false to say that every being is necessary, as we recognize that things that could be fail to be, and that that could fail to be, exist, in everything we do. Therefore there are contingent beings.</p><p>It is clear that contingency is a participation relation; contingency being is the having of being in a way less complete than necessary being. Moreover, what is contingent has a cause. If a being is neither impossible nor necessary, that is, it can be or not be, then its very contingency establishes that it does not have its being from itself, and therefore it must have it from something else. Indeed, our insight into contingency is largely built on our understanding of causes, since we most often, even if not always, recognize that something is contingent by recognizing that it is such as to require a cause that either does not guarantee it or is itself not guaranteed to be.</p><p>B2. <u>If there is contingent being, there is necessary being</u>. Let us assume that there is no necessary being. Then every being would be contingent; contingency would, in fact, be a transcendental convertible with being. Moreover, since something composed wholly of contingent beings is contingent, if there is no necessary being, the whole lot of beings could fail to be. But whether a contingent being fails to be or not depends on causes; that is to say, if something can be or not be at all, whether it is one or the other must depend on something other than itself. Thus if we attribute contingency to the whole of what is, there must be something other than what is, on which its being depends. Thus if there were no necessary being, we would have to say that something both is and is not. If we were to say that the every being was contingent but the whole of them together was not, which some attempt to say, this is absurd, since it makes a necessary being consist entirely of contingent parts, but in any case, it requires holding that, despite its parts being contingent, being as a whole is necessary being. Therefore, regardless of how one travels, one reaches necessary being as a destination.</p><p>Therefore, since every being is necessary or contingent, and not every being can be contingent, there is necessary being. As a matter of reason, we regularly tend to explain what is contingent, for instance, a physical object, in terms of what is necessary, such as mathematical principles, and treat this as more fundamental than explaining it in terms of other contingencies; therefore it is not really surprising that contingent being would be ultimately explained by necessary being. Further, as Jonathan Edwards notes (<a href=\"https://www.apuritansmind.com/puritan-favorites/jonathan-edwards/scientific-writings/of-being/\">&quot;On Being</a>), &quot;That there should absolutely be nothing at all is utterly impossible. The mind can never, let it stretch its conceptions never so much, bring itself to conceive of a state of perfect nothing. It puts the mind into mere convulsion and confusion to endeavor to think of such a state.&quot;</p><p>Given that contingency and necessity are said in many ways, it should be noted that saying that contingent being requires that there be necessary being is not the same as saying that contingent being is necessarily caused. We are considering necessity of being, not necessity of causing; the two are not the same, as we can see in recognizing that a contingent being could be such that it necessarily causes another contingent being.</p><p>B3. <u>Therefore there is necessary being, such that contingent being receives its being from it</u>. Or, in other words, there is a being, not participating any other being, which other beings participate in such a way that they may be or not be.</p><p>***</p><p>C1. <u>There is exemplate being</u>. In certain situations we recognize that something depends on another in such a way as to copy or imitate it. Thus when an experimenter makes an experimental set-up, it must in some way copy or imitate the idea of it in the experimenter's mind, if it is to be of any use at all. The idea is thus an extrinsic form that specifies the being or form of the experiment. Something that, as extrinsic form specifies the being or form of another thing, is called an <u>exemplar cause</u>. What is exemplate, like the experiment, is clearly derived from the exemplar, the idea in the mind of the experimenter's, in such a way that its being an experiment depends on it. However, as any experimenter knows, an actual experiment may 'fit' the idea in different ways and to different degrees. The same kind of experiment done by the same experimenter according to the same experiment may have variation in its quality of fit to the idea, depending on the quality of the materials, processes of contamination, intrinsic capacity for chance variation, and so forth. We see from all this that exemplarity is a participation relation, and this is not surprising as we have seen repeatedly, even in passing, that experimentation as such has a crucial dependence on participation relations, often of many kinds. In this case, the participation relation is due to an experiment being one kind of produced artifact; artifacts by nature have exemplar causes, and are the most obvious cases of things that do.</p><p>However, we do not find exemplarity confined to artificial matters like experiments or artifacts. In asexual reproduction, for instance, we find clear cases in which the genetic material of the reproduced is exemplate and derived from the exemplar genetic material of the reproducer. We find the same in the context of sexual reproduction, with the complication that there are two exemplar causes for one exemplate, and the result is, with exemplarity, like an artifact made by cooperation of two artisans. But more than this, in cases in which we have multiple things with a common feature had in different degrees, there must be some source of this variable communion. In natural things, this source cannot be free choices in the things themselves; where the things, insofar as they have this common feature, are effects, natural necessity in the things themselves will not be the whole source. Therefore, the commonality with variation must in natural effects trace back to some cause that is itself such that the effects have this commonality, despite receiving it in various degrees, and the cause's capacity to cause the effects will be an extrinsic standard for the commonality, and therefore an exemplar cause.</p><p>C2. <u>If there is exemplate being, there is exemplar being</u>. We find such a case when we consider the being of natural effects, which is a commonality had in varying degrees that must be received from a cause or causes that are, insofar as they are capable of causing this commonality, exemplar causes of the actual being of the natural effects. But for being in a cause to be exemplar of being for an effect that actually is, the exemplar must be really possible, and it must be exemplar either because the cause's own being must serve as the standard for the being of the effect, or because the cause's ability to cause serves in some way as the standard for the being of the effect. In either case, there must be an exemplar cause of being in the effects; but in this case we are considering the actual being of the effects, and thus what the exemplate must be imitating in its fashion is the actual being of the cause, since any causal power would presuppose the actual being of the cause. </p><p>Everything must be an exemplate, an exemplar, or both, with respect to being, since everything must either be because of what it is, or be because of something else, or in some way both. It is not clear that there can be a series of exemplate exemplars with respect to being, but let us assume it to be so. If something is the exemplate of an exemplar that is also an exemplate, then it and its exemplar are together an exemplate, since each receives from another in a partial way, and the last receives from the previous one's receiving. If we have a series of such things with respect to the same thing received, then, the whole collection of them is exemplate. If we assume an infinite regress, then we assume that there is an exemplate without an exemplar, receiving being but not from anything, which is a contradiction. </p><p>C3. <u>Therefore there is exemplar being, which communicates being but does not participate it</u>. From what we have said, it is clear that there must be an unexemplate exemplar of being, which accounts for the presence of being common to other things, but itself does not receive being from elsewhere.***</p><p><br></p><p>In all three of these ways, participated being is seen to require unparticipating being, which is therefore being in its own right. Because of this, it is sometimes called <u>being itself</u> (<i>ipsum esse</i>). To be being itself, however, is a divine distinctive. It is clear that being itself is not a happenstantial or chance maximum of being, in the way that something might be the hottest thing in the room. Nothing could be more as being than being itself. Being itself, as unparticipating, must be simple, because to be composite is by nature to be participated being, having parts that participate a whole; for a similar reason it must be immutable,  since changeable being. Further, as we already noted in discussing change, change is imperfect being, which being itself cannot be. And it must be eternal, since immutability and simplicity both imply eternity. As St. Edith Stein says (PA 414), <i>Pure being, which has nothing of nonbeing in itself, is in such wise eternally infinite that no nonbeing is before it or after it, and it contains in itself all that is and can be</i>. Moreover, as being is the first object of the intellect, and all other conception presupposes it, and all other greatness of being necessarily would depend on it, being itself may be said to be, in St. Anselm's words throughout the Proslogion, <i>that than which no greater can be thought</i>, and as is said in Romans (9:5), <i>over all</i>. It is clear, then, that being itself is what anyone would think divine; it is also clear from the way in which it is so that the cosmos or universe cannot be being itself, but is itself participated being derived from being itself.</p><p>Thus the name of God is said to be (Ex. 3:14), <i>I Am That I Am</i>, or as it is interpreted in the Septuagint, <i>I Am Being</i> (<i>ego eimi ho on</i>), and also <i>I Am</i> (or, as in the Septuagint, <b><i>Being</i></b>), as in Isaiah 52:6, <b><i>Therefore my people shall know my name, therefore they shall know in that day that I Am doth speak, behold it is I</i></b> (cp. also Dt. 32:39, Is. 41:4, 46:4, 48:12, 51:12 for similar expressions), so that when Jesus said (Jn 10:33), <i>Before Abraham was, I Am</i>, the Judeans took him to be blaspheming by making himself equal to God. And likewise, to make the same point, when Jesus was betrayed, on hearing that they looked for him, the said to them, <i>I Am</i>, and that this was not an ordinary declaration is seen from the fact that <i>they drew back and fell to the ground</i>. Philo of Alexandria paraphrases Exodus 3:14 (Life of Moses 14), &quot;At first say unto them, I am that I am, that when they have learnt that there is a difference between being and non-being, they may be further taught that there is no name whatever that can properly be assigned to me, who am the only being to whom existence belongs&quot;, and Maimonides says of the name (<a href=\"https://sacred-texts.com/jud/gfp/gfp073.htm\">Guide 1.63</a>), &quot;This is, therefore, the expression of the idea that God exists, but not in the ordinary sense of the term; or, in other words, He is 'the existing Being which is the existing Being,' that is to say, the Being whose existence is absolute.&quot;  The Dionysian says (CH 4.1), <i>The being of all things is the super-essential divinity</i>, while Damascene says (De Fide Orth. 1.9), <i>It appears then that the most proper of all the names given to God is &quot;He that is&quot;.... For He keeps all being in His own embrace, like an infinite and unseen sea of being</i>. And Paul said to the Greeks (Acts 17:28), <i>God is not far from any of us, for in him we live and move and have our being</i>. </p> <p>When people hesitate over the notion of being itself being divine, this is generally for one reason. For one could worry that this would make God the being of everything. This is how certain monists and pantheists reason, and, while it is less clear that it is a correct interpretation, it is how Advaitin philosophers are often interpreted when they speak about Brahman. This, however, is impossible. The being that belongs to the things we know best is divided according to substance and accident, or whatever real classification you please; but to be unparticipating being, being itself must not fall under any genus, whether substance or any of the genera of accidents. And we see on the other side, that participated being receives its being not as being itself, but partially, which being itself does not do; thus being itself is prior and participated being is posterior, and therefore they are in this way opposed.</p><p><br></p><p>[II] As with being, so with the transcendental one. Things that are not one cannot be; as Boethius says of unity (Cons. Phil. 3 pr11), <i>when you have taken that away from anything, not even being will remain</i>, and the Dionysians says (DN 13.2), <i>there is no single thing which does not participate in some way in the one, which uniformly pre-held in the uniqueness throughout all, all and whole, all, even the things opposed</i>.  What first falls into the intellect is being; second comes negation of being; from these two follows, in the third place, the notion of division, since, from the fact that something is conceived to be a being, and not to be some other being, it is divided from it in the intellect. Fourth, the notion of one follows in the intellect, inasmuch as this being is understood as undivided from itself. Fifth, the notion of multitude follows, inasmuch as this being is understood as divided form another one, and each one of them as being one in itself. However much certain things may be conceived as divided, there still is no notion of multitude unless each one of the divided things is conceived as being one.</p><p>A thing is one to a greater degree if it is one by nature rather than by imposition. For instance, if I tie or tape blocks together they are in some way one; but this is not as great a unity as when something is one by its very nature, because what is one by nature in a sense makes itself one, or, perhaps more accurately, resists separation. Just as being can be 'categorized' in terms of substance, quantity, quality, relatedness, and so forth, so unity is categorizable in terms of substantial sameness, quantitative equality, qualitative likeness, relative equivalence, and so forth. As St. Thomas says (ST 1.76.2ad2), <i>Everything has unity in the same way it has being, and consequently we must judge of the multiplicity of a thing as we judge of its being</i>.</p><p>The human mind in understanding naturally seeks unity; it is the aim of every scientific endeavor. This is due to the convertibility of unity and being. As Rosmini says (<a href=\"http://rosminipublications.com/book_cat/metaphysics/\">Theosophy I</a>, p. 195), <i>Human intelligence needs to reduce everything to unity. The origin of this need is clearly the fact that our mind uses being to understand everything it understands; in other words, 'that which is not being cannot be understood' is what I have called the 'principle of cognition</i>'<i>. </i>This drive to unity that is integral to inquiry with the intent to know and understand is seen in many ways. For instance, we attempt to unify composites by causes, since every composite requires a cause of its unity that is itself a unity of some kind. Likewise, faced with a multitude of things, we try to find a way to think of them as one, for, again, everything has unity in the way it has being and thus our judgment of multiplicity is related to our judgment of its being. And in terms of our accounts and theories of things, we all recognize unification as progress. This is seen in at least three ways. First, we like theories that can predict what was not anticipated, thus uniting what is already in hand with what is not yet discovered, and take it to be progress when a new theory can accurately predict more. Second, we like theories that unite different kinds of things, and take it be progress when we have consilience, that is, when one theory brings two different fields together in a unified way. As Whewell says (<a href=\"https://books.google.com/books?id=tjuGVRBbCFYC&amp;pg=PA65#v=onepage&amp;q&amp;f=false\">PIS2, p. 65</a>), &quot;The instances in which his have occurred, indeed, impress us with a conviction that the truth of our hypothesis is certain.&quot; Third, we like theories that are tightly unified, and take it to be progress when a loosely unified theory is replaced by a more tightly unified theory. On the other side, we are often misled simply by unity, when we unify in a way not relevant to our particular inquiry -- for instance, in physics, if we have a theory that is more unified mathematically but does worse in unifying experimental and observational results, we have confused one unity for another. We are able to err in this way because we were aiming at unity in the first place.</p><p>Of the mistakes that have been made with regard to the transcendentals, few have been so egregious as the conflation of numerical unity and transcendental unity; the latter is coextensive with being, while the former is in the genus of quantity and is the way in which undivided being is found in the category of quantity. As St. Thomas says (ST 1.11.3 ad2; cp. Quodl. 10.1.1), <i>One that is principle of number belongs to the genus of mathematical things, which have material being but are abstracted from matter by reason. But one that is convertible with being is something metaphysical, that does not depend on matter for being</i>. Unity as such is convertible or interchangeable with being, since it signifies being under the note of indivision, and indivision being merely a negative or privative notion does not posit any positive thing added to being itself, but just what is sometimes called the being of reason. However, numerical unity is a categorical accident. Accidents pertain to substances, adding something positive to them. Thus a quantitative one takes the notion of unity and adds to it a notion of quantitative measurement, in terms of which we can define units, either considered particularly, as when we speak of one inch or one kilograms, or generally, as when we consider the properties of the numbers abstractly. What is more, it is clear that in mathematics there are many kinds of unity -- numerical unity, unity of magnitude, unity as a set, and so forth -- and therefore none of these can be unity simply speaking; rather, they are each one with respect to a different way of measuring one. Therefore any mathematical one falls under a genus; one as convertible with being, with respect to which mathematical unity is participated unity, does not.</p><p>The notion of one as such does not add anything positive to that of being; instead it adds the negative note of indivision: one is just being considered as undivided. Thus one and being are convertible and coextensive. Here is one way to consider this. Every being is simple or composite. What is simple is undivided, and thus one being. But what is composite does not have being if its parts are divided from each other, but only once they compose it, which is to say, only insofar as they come to unity. Nothing, then, prevents something divided in one way from being undivided in another way, so something may be in one way one and in another way many. Thus something essentially one may have many incidental characteristics, and something actually one may be potentially many, and likewise something may be one in notion or principle or cause but many in reality. We can speak even more strongly, though; as we briefly noted above, every kind of multitude is a kind of unity. As the Dionysian says (DN 13.2), <i>without the one there will not be a multitude, but without the multitude there will be the one</i>. Because of this we can think of being as divided by 'one' and 'many' without detriment to the 'one' being a convertible transcendental. Therefore we get the disjunctive transcendental, one-or-many, where the 'one' of the disjunctive transcendental adds a notion (namely, contrast with multitude) to the one coextensive with being.</p><p>Since unity as we find it is itself divisible according to unity and multitude, it follows that things that are one can have unity in common while nonetheless receiving it in various ways and degrees. In addition, in each genus multitude is measured by unity, and things in that genus must receive their unity from some one prime member whose unity is the measure and source of all, or from something outside that genus on which the existence of things in that genus depends, or from something in a series of causes tracing back to some such primary unity. Whenever we find agreement in some respect, then, we trace it back to a primary unity at some point. But all things agree in being, and therefore there must be a primary unity for all beings, and other unities must refer and trace back to it as source and measure. </p><p>Since one is undivided being, if anything is supremely one it must be, and being itself would have to be supremely undivided, since it cannot have its unity by participation. The one itself, from which all other things have their unity, is likewise being itself, from which all other things have their being. This is the sort of thing that people call divine. Thus, as Saadia Gaon notes (Beliefs and Opinions 2.4), it is said (Dt 6:4), <i>Hear, O Israel, the Lord our God, the Lord is one</i>, and again (Dt 4:35), <i>Unto you it was shown, that you might know that the Lord, He is God; there is none else beside him</i>, and again (Zech. 14:9), <i>The Lord shall be one and His name one</i>. And St. Anselm says of God (Pros 18), <i>You are unity itself</i>. Nor are these in any way the only cases; as is said in the Vivekachudamanai attributed to Shankara (<a href=\"https://archive.org/details/vivekachudamanio00sankrich/page/118/mode/2up\">260</a>), &quot;That which, though One only, is the cause of many; which refutes all other causes; which is Itself without cause; distinct from Maya and its effect, the universe; and independent&quot; is Brahman. </p><p>Further, we have noted that simplicity and eternity are both associated with the divine. The one itself is simple, since composition is participated unity. As Anselm says (Pros 18), <i>whatever is composed of parts is not absolutely one but is in a way many and is different from itself and can be divided actually or intellectually</i>. And as St. Thomas says (Lib. de caus. 21), <i>simplicity pertains to the notion of unity--for something is said to be simple that is one and not gathered together from many</i>.  It will have to be immutable for a similar reason. Likewise, unity itself is eternal, since to be one it must be the all-at-once possession of all that it is, because otherwise it would be participated unity. And the one itself, source of all other unity, that is being itself, source of all other being, so as to be in itself simple, immutable, and eternal, is certainly divine.</p> <p>_____________</p><p>* See Allan B. Wolter, <i>The Transcendentals and Their Function in the Metaphysics of Duns Scotus</i>, The Franciscan Institute (St. Bonaventure, NY: 1946), especially pp. 128-161, for what is still the classic discussion of disjunctive transcendentals in Bl. John Duns Scotus and the likely influence of St. Bonaventure on this point. See also Jacek Surzyn, <a href=\"https://www.academia.edu/31776805/Disjunctives_as_Transcategorial_Attributes_of_Being_An_Outline_of_John_Duns_Scotuss_Standpoint\">&quot;Disjunctives as Transcategorial Attributes of Being: An Outline of John Duns Scotus's Standpoint,&quot;</a> from Agnieszka Woszczyk and Dariusz Olesinski, <i>Being and Logos: Categorical and Generic Analyses of Being in Classical Philosophy</i>, Impulse (Krakow: 2012) pp. 105-135.</p><p>** For more discussion broadly relevant to this, arising in the context of St. Thomas's Fourth Way, which is somewhat different from this particular argument, see James Chastek, <a href=\"https://thomism.wordpress.com/2014/03/27/draft-perseity-and-the-fourth-way-parts-1-and-2/\">Draft: Perseity and the Fourth Way, parts 1 and 2</a>, 27 March 2014,  <a href=\"https://thomism.wordpress.com/2014/04/18/perseity-and-the-fourth-way-part-iii/\">Perseity and the Fourth Way, Part III</a>, 18 April 2014, and <a href=\"https://thomism.wordpress.com/2019/08/17/perseity-principle-of-systematic-investigation/\">Perseity: principle of systematic investigation</a>, 17 August 2019, on Just Thomism [http://thomism.wordpress.com/].</p><p>*** For discussion broadly relevant to this, arising in the context of the relation between St. Thomas and Platonism, see Rebecca Loop, &quot;Exemplary Causality in the First Being&quot;, <a href=\"https://www.thomasaquinas.edu/news/review/archive-past-issues\">The Aquinas Review</a>, Vol 5. No. 1 (1998).</p><p></p><p></p><p></p>"
}