{
  "title":"Vermigli on Platonic Ideas",
  "date":"2021-08-11T09:50:55.812000-07:00",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-338864259738225246",
  "link":"http://branemrys.blogspot.com/2021/08/vermigli-on-platonic-ideas.html",
  "content":"<p> In Book I, Chapter 6 of Peter Martyr Vermigli's <i>Commentary on Aristotle's Nicomachean Ethics</i>, there is a discussion of the Platonic theory of Ideas that gives an interesting look at how Plato and Aristotle were approached in Protestant universities in the sixteenth century (Strasbourg in 1553, to be exact). Interestingly, Vermigli's interpretation of Plato himself is heavily influenced by the Dionysian corpus, which unsurprisingly gives his account of the Ideas a tinge of Christian Neoplatonism:</p><p></p><blockquote>At the outset we should deal with the term itself: the word ta eide, or &quot;idea&quot; comes from the verb eidein or idein, which means &quot;To notice&quot; or &quot;to comprehend.&quot; And it is possible to comprehend something either before it is revealed or after. If it is comprehended before it is revealed, principally on the basis of its efficient cause, it is called &quot;idea&quot;; and therefore, they have said that it arises before the actual creation since it precedes the individual realizations that are then produced. These realizations would have never been produced unless there existed a kind of form and of universal notion in the mind of the creator, unless he were thought to be unaware of what he was doing. Therefore they are properly called &quot;prefigurations,&quot; and whatever thus occurs is related to its universal notion according to which pattern it was created. (p. 138)</blockquote><p></p><p>He recognizes that there are forms of Platonism in which the Ideas are not in the divine mind but have reality in some other way; he does not regard them as particularly relevant for understanding the theory.</p><p>In any case, Vermigli makes a standard moderate-realist distinction between the nature as understood prior to things (nature taken as a pattern), in which it is in the mind of the Creator, the nature as found in things (nature taken as a composite whole), and the nature as belonging solely to human reasoning (nature taken as a sum of constituents). We can talk about the first kind, Ideas in the divine mind, in three ways: (1) &quot;as something that is contained in the divine essence and so is one and uniform&quot;; (2) &quot;as a practical object of the divine mind, in which case it would also be one and uniform&quot;; and (3) &quot;as a  Form and pattern&quot;, in which case we have to say that there are many Ideas (p. 143). Vermigli takes it to be unclear whether Plato holds that Ideas are the divine nature as understood by God and insofar as it is the source of other things or whether he holds that they are distinct from the divine nature and known from eternity as models or practical objects for creation; if taken in the first sense, following Augustine, Vermigli regards Plato's account to be unexceptionable, while, if taken in the second way, he regards it as vulnerable to Aristotle's criticisms.<br></p><p>The first Aristotelian criticism is that accidents, being produced and knowable, would have associated Ideas, which would therefore be accidents without substance. (Vermigli, ever the Protestant theologian, notes that this is parallel to arguments against transubstantiation.) In addition, the reasons for positing Ideas would seem also to be reasons for positing an Idea of Ideas, since Ideas are similar and have at least some kind of common nature, which Plato uses Ideas to explain. Moreover, Ideas are so different from what they are intended to explain in generable things that they seem quite isolated from them. Because of arguments like these, Vermigli agrees with Aristotle's position that the Platonic Ideas are not particularly relevant to ethical life, even though there is one interpretation (in which they are distanced from the craftsman's-model metaphor) that he thinks metaphysically reasonable.</p><p>*****</p><p>Peter Martyr Vermigli, <i>Commentary on Aristotle's Nicomachean Ethics</i>, Campi &amp; McLelland, eds., Sixteenth Century Essays &amp; Studies, Volume 73, Truman State University Press (Kirksville, MO: 2006).</p>"
}