{
  "title":"Patroness of Forgotten People",
  "date":"2021-08-13T18:05:01.248000-07:00",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-5280799784110935859",
  "link":"http://branemrys.blogspot.com/2021/08/patroness-of-forgotten-people.html",
  "content":"<p> Jeanne-Françoise Frémyot was born in 1572 to an important political family in Burgundy. She married Christophe II de Rabutin, Baron de Chantal, in 1592, and really came into her own. The Baron de Chantal's estates were in considerable disarray, in part because the Baron had business with royal court that regularly called him away; Jeanne-Françoise took it all in hand and soon had everything in good working order. As it happened, although she had seemed a quite ordinary Burgundian girl, she had an immense talent for practical organization. Her organizational talents were employed not merely toward making the estate run but toward charitable work, as well, and they saved quite a few lives when the region was hit with a severe famine.</p><p>The marriage between the Baron and Baroness was quite good; they had six children, although two died in infancy. The Baron, however, died in 1601 in a hunting accident. As she mourned her husband, she made a vow that she would remain celibate for the rest of her life, and, after her children were grown, devote herself to helping others.</p><p>In 1604, this general resolution began to take a serious shape. Visiting her father in Dijon, Jeanne-Françoise happened to hear St. François de Sales (who was bishop of Geneva, but due to a Calvinist resurgence had been forced to flee) preach a number of sermons, and they immediately became good friends. It was a fruitful friendship. Several of St. Francis's most enduring works, including <i>An Introduction to the Devout Life</i>, grew out of it.</p><p>As her children entered adolescence, Jeanne-Françoise began to place them in various positions in which they could gain what they needed in life and, with the advice and help of St. Francis, founded the Congregation of the Visitation in 1610, which had as its purpose active ministry in the world for the sick, elderly, and disabled, and which as a matter of principle accepted even those who could not join other religious orders and societies due to sickness or age. The timing, unfortunately, was not particularly good for it; the bishops of the time were (rightly and reasonably) cracking down on unruly religious orders and societies, and unfortunately, as imagination has never been a prerequisite for episcopal office, the episcopal solution to the problem was to require religious orders and societies all to conform to exactly the same set of templates, and an uncloistered women's order devoted entirely to active ministry in the world was not one of the templates. St. Jane-Frances and St. Francis, having appealed all the way up to the Pope, who came down against them, were forced to change the structure of their order into a more ordinary cloistered order.</p><p>The forced cloistering, however, may have contributed to Visitationist success in the long run, since it possibly allowed Madame de Chantal much more influence than she would otherwise have had. The order caught the attention of a number of aristocratic families looking to support religious activities, and they soon became aware of just how valuable Jeanne-Françoise was as a source of advice about practical finances and moral issues in everyday life. Her correspondence massively expanded. And unlike the bishops, she had enough imagination and ingenuity to figure out how to do something like what she had hoped to do within the strictures imposed upon her. While she had intended to use her skills to do immediate practical good by means of her order, she was able to do much more good through interaction with donors and supporters, and yet more good still from the correspondence, which, although not fully surviving, continues to be read with benefit today.</p><p>St. Francis de Sales died in 1622, and St. Vincent de Paul became her new spiritual director; they got along well, but it was nothing like the close friendship she had had with François. She herself died in 1641, was beatified in 1751, and was canonized in 1767. Her feast has moved around a lot, but is currently today in the US calendar.</p><p><a href=\"https://www.gutenberg.org/files/50592/50592-h/50592-h.htm\">From a letter to the Countess de Toulonjon, 1625</a>:</p><p><br></p><blockquote><p>...You are too much attached to the things of this life and take them too much to heart. What have you to fear? Is it that the fact of having so many children deprives you of the means of providing for and educating them according to their birth and your ambition? Have no such apprehensions, I beg of you, for in this you wrong the Providence of Him who gives them to you, and who is good enough and rich enough to nourish them and provide for them as is expedient to His glory and their salvation. That is all that we should desire for our children, and not look for worldly prosperity in this miserable and mortal life. </p><p>Now my dearest daughter, lovingly look upon all these little creatures as entrusted to you by God, who has given them to you; care for them, cherish them tenderly, and bring them up not in vanity, but faithfully in the fear of God. So doing, and trustfully leaving all these anxieties of yours to divine Providence, you will see how sweetly and tenderly it will provide for all, so that you will have good reason to bless and rely wholly upon it. Take my advice, dearest daughter, and cast yourself into these safe arms: serve God, cast aside vanity, live in perfect harmony with him whom God has given you, interest yourself in the good government of your household, be active and diligent in applying yourself to that work, and begin from this time forth to live after the manners and customs of a true mother. If I had not had the courage to do this from the beginning in my married life we should not have had the means of livelihood, for we had a smaller income than you have and were fifteen thousand crowns in debt. Be brave then, dearest daughter; employ your time and your mind not in worrying and being anxious about the future, but in serving God and your household, for such is the divine will. Act thus, and you will see how blessings will attend your undertakings....</p></blockquote><p> John Conley has <a href=\"https://iep.utm.edu/chantal/\">a nice discussion of St. Jane-Frances's moral philosophy</a> at the Internet Encyclopedia of Philosophy.</p><p><br></p><p><a href=\"https://commons.wikimedia.org/wiki/File:JohannaFranziskaFremyotdeChantal01.jpg#/media/File:JohannaFranziskaFremyotdeChantal01.jpg\"><img alt=\"JohannaFranziskaFremyotdeChantal01.jpg\" src=\"https://upload.wikimedia.org/wikipedia/commons/4/4e/JohannaFranziskaFremyotdeChantal01.jpg\"></a><br><br></p><p></p><p></p><p></p>"
}