{
  "title":"Fortnightly Book, August 15",
  "date":"2021-08-16T06:37:55.499000-07:00",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-4804921659450060750",
  "link":"http://branemrys.blogspot.com/2021/08/fortnightly-book-august-15.html",
  "content":"<p> I was wondering what I was going to do for the fortnightly book after <i>A Dream of Red Mansions</i>; but I was on a plane last weekend and a woman sitting next to me was reading John Irving's <i>A Prayer for Owen Meany</i>. I have it, and haven't read it since (I think) high school when visiting my grandparents, and have been intending to do it for a fortnightly book at some point, and just never have come around to doing so. Thus, it is decided: I'll be doing <i>A Prayer for Owen Meany</i>.</p><p>John Winslow Irving was born John Wallace Blunt, Jr. in 1942 in Exeter, New Hampshire; he eventually took the last name of the stepfather who actually raised him. He wrote his first novel, <i>Setting Free the Bears</i>, in 1968, which received some polite critical interest but no much more. He eventually became a professor of English at Mount Holyoke, and in 1978 had his big breakthrough with <i>The World According to Garp</i>, which became a heavily-awarded international bestseller and on its own made him independently wealthy. Several other novels by Irving went on to become major bestsellers, such as <i>The Cider House Rules</i>, published in 1985, and <i>A Prayer for Owen Meany</i>, published in 1989.</p><p>The book has three epigraphs, which capture its intertwining themes:</p><p></p><blockquote><p>Have no anxiety about anything, but in everything by prayer and supplication with thanksgiving let your requests be made known to God. -- The Letter of Paul to the Philippians</p><p>Not the least of my problems is that I can hardly even imagine what kind of an experience a genuine, self-authenticating religious experience would be. Without somehow destroying me in the process, how could God reveal himself in a way that would leave no room for doubt? If there were no room for doubt, there would be no room for me. -- Frederick Buechner</p><p>Any Christian who is not a hero is a pig. -- Leon Bloy</p></blockquote><p></p><p>Thus we have the three themes of the nature of prayer, the nature of religious experience, and the nature of heroism, and the question of what each of these things are. John Irving had attended Philips Exeter Academy in high school when Frederick Buechner had been teaching here. In any case, the three quotations capture the guiding concerns of a very liberal form of New England Christianity, which is familiar to anyone familiar with American culture, which is often found in Irving's novels, and which absolutely saturates <i>A Prayer for Owen Meany</i>.</p>"
}