{
  "title":"Fortnightly Book, August 29",
  "date":"2021-08-29T17:25:00.915000-07:00",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-1523157556066264552",
  "link":"http://branemrys.blogspot.com/2021/08/fortnightly-book-august-29.html",
  "content":"<p> We don't know for sure the author of <i>Egil's Saga</i>, a thirteenth century saga that is one of the earliest sagas to have been given a written form, and is generally considered one of greatest. Almost everyone, however, attributes to Snorri Sturluson, because frankly there's not only no better candidate, we don't know of any other candidate at all: besides being the known author of a number of other works from the same period, Snorri had the erudition, the literary capability, and the broad experience of Scandinavia that would be required. It purports to depict the life Egil Skallagrimmson, about three centuries earlier, who was a warrior-poet. We don't know for sure whether Egil is a historical figure or a folklorish one, or both, or (for that matter) an invention of the author, but while they are not entirely consistent, the saga makes a great deal of effort to tie Egil to actual historical events and figures, so we have good reason at least to think that the author saw himself as trying to tell the history of a real Viking hero.</p><p>Egil's family has been locked into a long feud with King Harald Fairhair and his descendants; this will end up serving as the impetus for Egil to do a lot of traveling in order to avoid King Eirik Bloodaxe's continual manhunts to find and execute him. He will fight for King Aethelstan in England; he will cause some massacres and take out his vengeance for others; he will raid lands; and live a remarkably long life given the circumstances. But Egil is the ultimate that could possibly have been imagined in a man in the period when Scandinavia is Christianizing but not yet Christian, a pagan hero of the highest caliber. As a warrior, he is ruthless, unforgiving, and unbeatable, capable of transforming into a terrible wolf; as a poet, his words are unmatched and have a magical power to change the world around him. His virtues are all pagan virtues: loyalty to the point of vengeance, honor to the point of irrationality, friendship to the point of destroying anyone who stands in the way of his friends. He does nothing small whether it be done in joy or in grief or in anger. He has not a drop of humility, that strange Christian virtue, but his boasting is not mere boasting, because he can back every bit of it up. He is a man who has no problem with kings, but is ruler of himself. And in the end, such a man cannot but be alone.</p><p>I will be reading it in the Penguin Classics edition, translated by Bernard Scudder.</p>"
}