{
  "title":"DaVia on Fake News and Free Speech",
  "date":"2021-08-24T06:47:43.896000-07:00",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-6120524811804924502",
  "link":"http://branemrys.blogspot.com/2021/08/davia-on-fake-news-and-free-speech.html",
  "content":"<p> At the APA Blog, <a href=\"https://blog.apaonline.org/2021/08/23/four-theses-on-fake-news/\">Carlo DaVia has a post on free speech</a> that is unfortunately a good example of bad political philosophy, since it is poorly reasoned and, indeed, at least borders on mendacious, which is ironic given that it is an argument that lying is sufficient justification for government and corporate censorship. DaVia puts forward four theses:</p><p>(1) <i>Fake News is not Free Speech</i>. In the course of clarifying this, DaVia makes a number of very obvious errors. </p><p>Error #1: He moves back and forth between  'free speech' as a category of speech. While people do use 'free speech' as a colloquial shorthand, sometimes, the relevant category is &quot;freedom of speech&quot;. This is not a minor issue: freedom of speech is not a kind of speech but a kind of freedom that people have that covers speaking. Thus it is a category mistake to contrast 'fake news' with 'free speech'. If we have freedom of speech, the only relevant question is whether 'fake news' is speech in a non-equivocal sense. (And in fact in the course of his argument he seems to concede that it is, which resolves the issue entirely. The first thesis is a lie.) This is relevant to the next error.</p><p>Error #2: DaVia thinks that freedom of speech needs to be morally justified. He says:</p><p></p><blockquote>Freedom of speech gives us the ability to think and speak freely. As UCLA Professor Seana Shiffrin argues, we are morally justified in protecting the freedom of speech because it is necessary for us to live flourishing human lives. Developing and expressing our thoughts is an essential part of living well, and freedom of speech creates the environment in which that is possible. Freedom of speech opens the so-called marketplace of ideas where we come to understand the world and our place in it. Without free speech culture, our lives would be truly impoverished.</blockquote><p></p><p>This may well be <i>one</i> reason to <i>protect</i> freedom of speech from intrusion, and indeed, one <i>additional</i> reason, but the reason we are morally justified in protecting freedom of speech is that it is a freedom of the people. Protecting freedom of speech doesn't need moral justification; the people just have freedom of speech. What requires moral justification is restricting it, because restricting freedoms of the people without adequate justification and authority is usurpation of power -- and in a republic like ours, it is a usurpation of one of the most fundamental powers of civil society. There's no need to justify protecting the people from would-be usurpers at all. The default of every free citizen should be to repudiate any intrusion on the freedom of the people that has no appropriate and adequate justification. Further, freedom of speech does not exist to subserve the &quot;marketplace of ideas&quot;; the 'marketplace of ideas' is a metaphor for one particular conception of one particular version of free-speech culture, but freedom of speech does not depend on it for any kind of justification at all, nor does it exist to develop free-speech culture. It exists because the people have power against tyranny, in the old-fashioned sense, against usurpation of power, and intrusion on that power is a good sign of tyranny and usurpation.</p><p>Error #3: While it may well be that 'fake news' poisons our free speech culture, DaVia incorrectly assumes that 'fake news' is a descriptive category rather than an insult that arose for partisan criticisms of sloppy journalism. (That suggests that we should be talking freedom of press rather than freedom of speech, but we often use the latter expansively to include the former, and none of the fundamental points change, so we can ignore that.) He does manage to avoid the mistake many make of taking it to to be a descriptive category about content, but this is only because he takes it to be a descriptive category about intent. But it is not a neutral term, it is not an objective term, it is a term made popular by politicians, and in particular by Donald Trump, in order to dismiss the professional press reporting things that they did not like. Now, the professional press may well have its problems, but arguing that we need more censorship of speech because politicians insult various kinds of speech for partisan reasons is grotesque, and it remains grotesque even if they happen for yet other reasons to be right in this or that particular case. (I'm afraid the structure of the argument, in which DaVia uses a term notoriously made popular by Donald Trump to label Trump, strongly suggests to me that DaVia is deliberately being disingenuous in how he is constructing his argument.)</p><p>(2) <i>Fake is Worse than False</i>. DaVia gives two reasons for this. First, that fake news is more likely to be believed, but he doesn't actually give a reason to think that it is more likely to be believed than misinformation, so there's not much that can be made of this.. Second, that &quot;fake news has a much greater corroding effect on free speech culture&quot;. This is at least very plausible, if you assume that fake news is something definite determined according to reasonable criteria, and not, as it in fact is, a political insult. DaVia tries to justify it on the ground that the American people in surveys treat media bias as more serious than accidental misinformation; but the survey he cites does not show this -- it shows something rather more troubling for his argument, that Americans are inclined to take all media inaccuracy as media bias, and that they are inclined to regard news organizations that regularly promulgate things with which they disagree as deliberately attempting to manipulate the public. Thus far from backing his claim, the evidence DaVia cites suggests that Americans do not differentiate between fake news and false news all that much, and almost do not do so at all where it touches on their own political opinions.</p><p>(3) <i>Police intent, not content</i>. So now we go from DaVia seeming to suggest ordinary usurpation of power as a solution to seeming to suggest that the solution is totalitarianism. Of course, neither governments nor firms have any power to police intent. What DaVia actually suggests is something entirely different: the regulation and discouragement of bots and sockpuppet accounts -- I suppose in social media, although how that is in any way going to do much about 'fake news' given that DaVia repeatedly indicates that he thinks President Trump's non-bot, non-sockpuppet Twitter account is a paradigmatic example, is more than unclear. Trying to police sockpuppets always runs into the problem that people inevitably try to shoehorn pseudonymous accounts into sockpuppetry, but more seriously, this is not 'policing intent' at all, but policing means of participation in media.</p><p>DaVia tries to draw an analogy to defamation, but incorrectly claims defamation requires intent. You can be convicted of defamation even if it was unintentional; in fact, intent very rarely comes up in actual defamation cases except where the plaintiff is someone in a public office, and even then you don't actually have to prove intent, strictly, speaking, but only that the defendant was in a definite position to know that it was false, which can include cases of negligence ('reckless disregard for truth'). The burden of proof for defamation, if you're not in public office or very famous, is actually quite low; it's just that it requires two things that in reality don't occur together often -- you need to prove that the statement was false and you need to prove that the statement harmed your career or reputation; most of the things that definitely do the latter are such that it is not easy to prove they are false, and most statements that are false are not such that it's easy to prove that they harmed your good name. But if you've got both, something you can prove is false that provably caused you harm, then you have a pretty case, regardless of the other person's intent. Defamation is almost entirely about false content and its effect! The only qualifications to this are for protecting people with less power from those who have more.</p><p>DaVia also brings up the old canard of shouting 'Fire!' in a movie theater. As has been pointed out time and time again, this supposed obvious example was originally made in an attempt to prevent people from protesting the draft; the decision that used it is universally recognized as bad case law (and was overturned decisively); and arguing that a renowned argument in favor of government violation of rights is so obviously true that it justifies this other kind of censorship, as well, is really poor argumentative judgment, if it's not deliberately dishonest.</p><p>(4) <i>Cancel Trump, not Parler</i>. I suppose this is DaVia's attempt to be moderate, saying that a person should be canceled, not a company? The irony is, in any case, complete; Parler was formed out of protest of Twitter's suppression of a number of prominent conservative accounts. In any case, while it's true that not every kind of platform or means of speech is responsible for the content, DaVia has been arguing that either the government or the corporations are in fact responsible for the spread of fake news through their failure to regulate, and it is impossible to see how the government could require platforms to suppress accounts if they didn't in fact have any responsibility for doing so.</p><p>In any case, DaVia ends with two mind-boggling cherries on this crazy sundae, by responding to objections. The first one is that his proposals would lead to abuse:</p><p></p><blockquote>Abuses of regulatory power are no doubt possible, but their likelihood diminishes if we keep in mind that fake news is fake not on account of its false or partisan content, but rather on account of its deceptive intent. If the agency accordingly regulates only on the basis of intent, then it will be less likely to restrict news out of self-interest or greed.</blockquote><p></p><p>I am somewhat flabbergasted at this. Regulating only on the basis of deceptive intent, the go-to practice of fascist governments everywhere, is not very liable to abuse because it prevents self-interest or greed. Hmmm. Perhaps you should not go around making claims that make you sound like a supporter of a totalitarian regime, Carlo DaVia.</p><p>The second cherry concerns the possibility that this will chill free speech culture. He says:</p><p></p><blockquote>The effect of punishing liars is to encourage people to express claims they genuinely believe, even if they turn out to be wrong. Similarly, the effect of punishing fake news would be to encourage people and organizations to share news they genuinely believe. </blockquote><p></p><p>Which would no doubt be true if our government officials had the archangelic superpower of being able to prove intent in all but a tiny minority of cases. Who knew that to have honesty, all we had to do was punish liars? Such a very easy solution for ending all lying; I wonder why we don't do it? And what might that say about why people are reluctant to try to regulate 'fake news' out of existence? Hmmmm.</p>"
}