{
  "title":"Dashed Off XVIII",
  "date":"2021-08-20T17:58:22.235000-07:00",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-6465295480088261878",
  "link":"http://branemrys.blogspot.com/2021/08/dashed-off-xviii.html",
  "content":"<p><i>Presence is based on form.</i></p><p><i>Half of politics is persuading others to classify things a particular way.</i></p><p><i>'Epistemology' was coined by James Ferrier, Institutes of Metaphysic (1854), as part of the triad epistemology - agnoiology - ontology.</i></p><p><i>Nowhere is tunnel vision more dangerous than in politics.</i></p><p><i>Rawlsian arguments against aristocracy usually exaggerate immobility, ignoring institutions (military, Church, guild) that at least complicate the caricature of everyone frozen by birth into a state of life.</i></p><p><i>It is impossible to establish a system of distribution that eliminates contingency and luck.</i></p><p><i>Effort should be rewarded, but is not the only, or even always the most important, thing that should be rewarded; nor does it make any sense to demand that all good whatsoever should only be had as a reward.</i></p><p><i>Rawls's difference principle falsely assumes that we are members of only one society.</i></p><p><i>Libertarian concepts of self-ownership treat persons as virtual quasi-property.</i></p><p><i>The oldest extant Manichaean temple is Cao'an in Jinjiang -- it survives because it was eventually turned into a Buddhist temple without much modification, and was for a long time thought to have originally been built as a Buddhist temple, with a slightly unusual representation of Buddha -- but it was unusal because it was originally Mani, and only Buddha later.</i></p><p><i>From each according to reason, to each according to reason.</i></p><p><i>&quot;Christ *merited* salvation for his Church, and merit is the contrary of punishment.&quot; Chastek</i></p><p><i>&quot;We individually cannot reasonably hope to attain the ultimate philosophy which we pursue; we can only seek it, therefore for the *community* of philosophers.&quot; Peirce</i></p><p><i>reincarnation as symbol of being freed from or tangled in layers of maya</i></p><p><i>The swift leap to violence is almost always bad strategy, even when it makes sense operationally.</i></p><p><i>the deimos and phobos of political contest</i></p><p><i>inferences of the sort 'possunt, quia posse videntur'</i></p><p><i>the work-hardening of arguments</i></p><p><i>In rhetoric as well as battle, effective siegework depends on preparation, that is, on fortification, provision, and watch.</i></p><p><i>&quot;The existence of things consists in their regular behavior.&quot; Peirce</i></p><p><i>inherence, causation, systemic interrelation, representation, narration, internarration</i></p><p><i>an architecture of icons</i></p><p><i>relics as traces of providence ('trace' is perhaps too weak here, given its use in other contexts)<br>-- relics as commemorations of providential men and women</i></p><p><i>media of personal commemoration: name, memento (relic), image (icon)</i></p><p><i>the Church as super-relic</i></p><p><i>abductive inference as pattern recognition (cf. Peirce in &quot;Pragmatism as the Logic of Abduction&quot;, on relation between abduction and perception)</i></p><p><i>Semo Sancus, the Sabine god of oaths/fides (from whom we get, with some modification, latinate words for 'holy'), was protector of: marriage, hospitality, law, commerce, and contract. He was sometimes possibly identified with Hercules (who also protected oaths), but this is based on limited data.</i></p><p><i>In the Simonian proto-Gnostic system, the five books of Moses were taken allegorically to represent the five senses.</i></p><p><i>All S is P &amp; All S is Q -&gt; All S is P&amp;Q<br>All S is P &amp; No S is Q-&gt; No S is P&amp;Q<br>All Sis P &amp; Some S is Q -&gt; Some S is P&amp;Q<br>All S is P &amp; Some S is not Q -&gt; Some S is not P&amp;Q<br>No S is P &amp; No S is Q -&gt; No S is P &amp;Q<br>No S Is P &amp; Some S is Q -&gt; Some S is not P&amp;Q<br>No S is P &amp; Some S is not Q -&gt; Some S is not P&amp;Q</i></p><p><i>conscience as home, conscience as court</i></p><p><i>&quot;Distinct cognition is nobler than confused cognition.&quot; Scotus</i></p><p><i>Scotus on concurring causes<br>(1) causes concurring in part (e.g., two men dragging same body -- they are on par as causes even if not equal in strength)<br>(2) causes not par<br>-- (2a) higher cause moves lower such that the lower does not act except by higher<br>-- -- (2a1) so that the lower receives the 'virtus' from the higher<br>-- -- (2a2) so that the lower is only moved to act by the higher ('virtus' from elsewhere, higher gives direction)<br>-- (2b) higher does not move lower but simply has the more complete power to act (with the two together being more complete)</i></p><p><i>fear of the Lord as practical recognition of his sublimity</i></p><p><i>solidarity<br>(1) co-being<br>(2) so as to contribute to each other's work<br>(3) with respect to justice, dignity, or peace.<br></i></p><p><i>If an object persists through time, this is not because it exists at various times, because existing *at* a time is not the same as existing *through* a time; we see this with the hypothetical of something nontemporal intruding at multiple instants of time.</i></p><p><i>All physical objects both endure and perdure, because whole and part are not the same in each.</i></p><p><i>A thing may exist at time t1 according to one measure and at time t2 according to another; this is repeatedly ignored by analytic philosophers.</i></p><p><i>the categorical imperative applied to families, nations, etc., which can have subjective principles of action</i></p><p><i>original vs adaptive translation</i></p><p><i>&quot;'To be concluded' is in rational actions as 'to be moved' is in natural actions.&quot; Aquinas</i></p><p><i>four ways of intending an end<br>(1) actual: requires actual knowledge and willing of end, including choice of means expressly directed to the end<br>(2) virtual: requires prior actual willing of the end that influences present act, including choice of means<br>(3) habitual: possesses habit arising from prior willing, but this does not influence choice of means<br>(4) interpretative: does not exist, but there are reasons why it would if things were a little different</i></p><p><i>Commemoration is always for some good serving as an end.</i></p><p><i>Wisdom has a natural aptitude toward cooperation in contemplation of truth.</i></p><p><i>glory, formally speaking: clara notitia cum laude<br>glory, objectively speaking: completion of a being that inclines those who know it to praise (praiseworthy completeness)</i></p><p><i>Christ on Cross: Church Militant :: Christ in Tomb : Church Patient :: Christ Risen : Church Triumphant</i></p><p><i>actual design<br>descendant of design<br>--  strict: design still controlling <br>-- loose: design merely residual<br>presumptive design</i></p><p><i>Act according to the judgment of that conscience that could at the same time be treated as a universal tribunal.</i></p><p><i>conscience<br>- in its authoritative summons<br>- in its first advisory<br>- in its accusation<br>- in its defense<br>- in its judgment<br>- in its postjudicial reflection</i></p><p><i>modes of tribunal: right, erroneous, confused, scrupulous, doubtful, probable</i></p><p><i>evocative objects (Turkle)</i></p><p><i>(1) 'Father', 'Son', and 'Holy Spirit' are not synonyms of each other (i.e., not intensively interchangeable).<br>(2) 'Father', 'Son', and 'Holy Spirit' are not nonsynonymous ways of describing the same (i.e., not extensively interchangeable).<br>(3) The term 'God', applied to Father, Son, and Holy Spirit, is intensively &amp; extensively interchangeable.</i></p><p><i>We are caught up in a creativity more fundamental than we are.</i></p><p><i>Tradition is projective &amp; project-building.</i></p><p><i>the three habits involved in knowledge of morality: synderesis, moral science, prudence</i></p><p><i>imputability -&gt; responsibility (dominion over acts) -&gt; liberty</i></p><p><i>demonstration proper : condign merit :: demonstration ex convenientia : congruous merit<br>(indeed, one could figuratively speak of 'meriting' conclusions)</i></p><p><i>God can grant a dispensation from secondary precepts of natural law that concern creatures insofar as there is a significant difference between acting on one's own and acting as an instrument or agent of another.</i></p><p><i>means to end<br>(1) preparative<br>(2) contributive<br>(3) regulative<br>(4) constitutive</i></p><p><i>Lv 19 as outline of human holiness: right with respect to origin, with respect to attitude in obligations to God, with respect to attitude to other human beings, with respect to observation of the divine law<br>-- note that these are preceded in Lv 17 &amp; 18 by nondefilement, the impediment-removing condition for holiness, and followed in Lv 20-22 by social safeguards to prevent defilements from entering into community, thus concerning the preventative condition for holiness.</i></p><p><i>Human reason is not a law unto itself; the law natural to it is a law that implies a law higher than it.</i></p><p><i>apparent miracle<br>(1) illusion<br>-- -- -- (a) physical (mis-sensing)<br>-- -- -- (b) testimonial (fiction)<br>-- -- -- (c) psychological (hallucination, delusion)<br>(2) natural event of unusual circumstances, with no identifiable significance<br>(3) diabolical work<br>(4) real divine miracle<br><br>(a) There are apparent miracles, in the broad sense of 'apparent'<br>(b) Apparent miracles that involve no sensory, testimonial, or psychological defects are genuine wonders, in a broad sense.<br>(c) Genuine wonders (in a broad sense) that are morally or theologically significant are supernatural wonders.<br>(d) Supernatural wonders that have an efficacy, utility, mode, end, personal involvement, and occasion appropriate to God are divine wonders.</i></p><p><i>Miracles are rare, but the human heart anticipates them. It is true that this can over-incline people to believe that they have occurred; but it is also true that it makes it impossible to argue that they are intrinsically incredible.</i></p><p><i>Holiness always involves relation to others.</i></p><p><i>holiness and belonging to God</i></p><p><i>The Sign of the Cross as a summary of the doctrines of the Trinity and the Redemption.</i></p><p><i>Each of he four elements in St. Thomas's definition of law may be exemplified to a greater or lesser degree.</i></p><p><i>Dooyeweerd's aspects as really capturing domains of human sense-making</i></p><p><i>poetic justice as an aesthetic anticipation of the juridical</i></p><p><i>All images are imitations of the Son as Image.</i></p><p><i>direct conspiracy theories (the ct is specifically about a cabal) vs indirect conspiracy theories (the ct is about soemthing else and uses appeal to assume conspiracy to interpret evidence along a certain line)<br>-- could be called 'cabal conspiracy theories' and 'opportunistic conspiracy theories'</i></p><p><i>&quot;A scientific type is a concrete individual object that serves as an objective standard reference for, and realization of, the definition or taxon category it names.&quot; Alisa Bokulich</i></p><p><i>the doctrine of creation -&gt; the modal structure of the world</i></p><p><i>We require virtue<br>(a) to give good determination to our capabilities<br>(b) to enable us to act well easily<br>(c) to enable us to act well consistently<br></i></p><p><i>community unions, like labor unions but for communities</i></p><p><i>human nature as first title to dominion over things, as regards their use<br>Another way to say this is that rational use of things for what human life requires is a human right and that other uses, rational or otherwise, presuppose this.</i></p><p><i>The sign is as it were the signified, the signified is as it were the sign. -- This gives important clue for understanding the phrase 'as it were'.</i></p><p><i>Authority exists to foster friendship and community.</i></p><p><i>Everything in a consumer society becomes packaging -- a packaging of politics (spin), a packaging of morals, a packaging of religion.</i></p><p><i>Human feelings are layers and layers.</i></p><p><i>correspondence between people as a literary making-common by giving and receiving</i></p><p><i><br></i></p><p><br></p>"
}