{
  "title":"Evening Note for Tuesday, August 17",
  "date":"2021-08-17T15:09:00.368000-07:00",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-7430123748727318551",
  "link":"http://branemrys.blogspot.com/2021/08/evening-note-for-tuesday-august-17.html",
  "content":"<p><b> Thought for the Evening: Philosophical Systems as Adaptive</b></p><p>One of the things that Hegelians get right about philosophical systems is that real philosophical systems are adaptive and changing things. I say 'real philosophical systems' to contrast them with what I think people often assume philosophical systems to be, namely, rigid structures of relations between particular claims. On the Hegelian view, that is something more like an X-ray. An X-ray depicts the body, but very selectively; it captures real relationships and relations among relationships, but only some of many possible relationships of which the parts of the body are capable, because it is in fact just a snapshot of how the body is arranged under a particular set of circumstances. To be sure, it's very useful, and you can learn a great deal about the body from an X-ray; but only if you put the X-ray in the context of some kind of knowledge of how living bodies themselves work. So too with philosophical systems. In real life, if you introduce new data, or a new objection, into a philosophical system, it adapts, because philosophical systems are expressions of people, and people adapt to new data or new objections.</p><p><a href=\"https://branemrys.blogspot.com/2018/10/jottings-on-evaluating-philosophical.html\">I've previously noted</a> that parts of philosophical systems are bound together in ways that can be evaluated according to <i>consistency</i> or according to <i>tightness</i>. Consistency is determined by whether the parts of the system contradict each other or not. Tightness, often confused with consistency, is determined by whether the parts are linked to each other by clear, definite, logically connected steps. It is possible to have a very loose system that is very consistent -- say, one where positions are mostly bound together by analogy. It is possible to have a very tight system that is inconsistent. Consistency and tightness are related, but obliquely; we might roughly put it by saying that tight systems let inconsistencies spread, whereas loose systems make inconsistencies harder to identify. Logical positivism is fairly tight; you can evaluate its consistency fairly easily, but an inconsistency can wreck the whole thing. Romanticism, with its aphoristic approach to thought, is quite loose; it's often difficult to prove definitely whether anything in it is consistent or inconsistent with anything else, but if you do find an inconsistency, it's relatively isolated, and if you just took it out, it might not affect much beyond a few analogies and associations. There is a third way in which we can assess how a philosophical system is bound together, and that is <i>connectivity</i>. The connectivity of a system is how well-linked any one part is to any other -- roughly, if you start at one part of the system, how many ways can you take to get to any other. Neo-Platonism, for instance, is very highly connective, because you can easily start with (say) the virtue of justice and from there get to (say) the metaphysics of geometry and from there get to (say) the existence of the gods, by many different routes. Almost every part is connected to almost everything else, whether it's by direct analogy or because they use principles that have analogies or because they use the same principles in ways that are adapted to a given subject-matter.</p><p>Eclectic systems, which might almost be called non-systematic and are certainly minimally systematic, are loose, weakly connected, and often inconsistent. Most actual philosophical systems are probably eclectic systems. Such systems tend to be very adaptable but also not very stable. The strongest and most durable systems, like Aristotelianism or Neo-Confucianism or Nyaya tend to be systems of very consistent parts loosely but highly connected to other very consistent parts. Such systems are very adaptable. There is no way to refute Neo-Platonism with a single argument; Neo-Platonic systems have the potential to marshal dozens of counter-arguments for any particular objection you might make. Important for understanding adaptability is most of these arguments are in fact merely potential: most arguments that a Neo-Platonist could make have never been made, because no Neo-Platonist ever had occasion to make them. But the principles, the analogies, the examples, or what have you that are already there could be formed into the argument, even if no one has ever done so. This contrasts with very consistent, very tight, very connective systems, which are often beautiful but extremely fragile. You might well be able to demolish a very consistent, very tight, very connective system by a single good argument.</p><p>Philosophical systems are also not purely structural. Every philosophical system has what might be called a 'flow of thought'. There's no system in which everything is equally important with everything else; we do not see philosophical systems with a God's-eye view as pure abstract structures. Some parts of a philosophical system are more natural starting-points when we are thinking something through; some tend to be convenient mediating hubs; some tend to be terminal points. Likewise, some bonds between the different parts are not symmetrical, and cannot as easily think in one direction as you can in the other. In one system, we might start with the senses in order to get to mathematics; in another, it might be more natural to start with mathematics in order to get the reliability of the senses. Whenever we have a philosophical system and introduce new data or new objections, this new element creates new relations in the system, and these new relations can shift the flow of thought, either making it easier or harder for the mind to pass along certain pathways between different parts of the system. In the course of time, as new things add up -- say, mounting evidence, difficult to dismiss, that part of a system might be wrong, the flow of thought will often 're-route'. Suppose position A and position B are linked by two different lines of argument, R and S, and that R is the easier, simpler route. You would expect people to emphasis R. If new evidence comes up that is not easily dismissible but puts R into question, you would expect people then to emphasize the longer, more complicated, but less in-question, S.</p><p>Sometimes the flow of though in a philosophical system becomes so re-routed that a part of the system that was previously important is largely avoided. In such a case, a number of things can happen, depending on the resources available. The part that has been isolated might be shifted around by people eventually building stronger connections between the isolated part and other parts of the system; that is, the part might be 'reattached' in a different way or to a different set of parts. The relations between the part and other parts might be reconceived -- for instance, things previously taken literally might now be taken figuratively, or things previously asserted might now be taken as hypothetical or as parts of arguments <i>per impossibile</i>. This is, and has always been, a common way in which analytic philosophers handle matters like this. (I've noted this, based on personal experience, <a href=\"https://branemrys.blogspot.com/2013/06/pain-is-generic-term.html\">with analytic accounts of pain</a>.) The relations between one part and others are modulated. Or the isolated part might become isolated enough that it is merely pinched off, detached, and, whatever value it had in the past, it just gets dropped.</p><p>Philosophical systems also require infrastructure. You need an archive, whether that be just memorizable sutras, or paradigmatic examples and a handful of principles, or an entire library. You need people who actually put some effort and energy into thinking through philosophical systems, the more the better. You need ways of interacting with the world and others. One thing Hegel gets wrong is playing down this infrastructural component in any philosophical system. While Marx overemphasizes it, he is right that it is there. It doesn't matter how good your principles are, if you don't have enough people applying them to address objections, you are going to get swamped with objections to which you don't yet have any answer. Thus infrastructure often affects the adaptiveness of arguments by affecting the speed at which they adapt. It often does so in a very indirect way. There are many means by which a philosophical system might be adapted; some are naturally slow (rigorous analysis and proof), some are fast (speculation, light analogy, loose metaphors). Lack of resources will reduce how much you can do of the former, and will tend to push adherents and defenders of the system to use more and more of the latter to address any potential objections or any unexpected new evidence.</p><p><br></p><p><b>Various Links of Interest</b></p><p>* Philippe Lemoine, <a href=\"https://cspicenter.org/blog/waronscience/why-covid-19-is-here-to-stay-and-why-you-shouldnt-worry-about-it/\">Why Covid-19 Is Here to Stay, and Why You Shouldn't Worry About It</a></p><p>* Jack Zupko, <a href=\"https://philarchive.org/rec/ZUPQIN\">&quot;Nothing in Nature is Naturally a Statue&quot;: William of Ockham on Artifacts</a> (PDF)</p><p>* Wessie du Toit, <a href=\"https://im1776.com/2021/08/17/how-the-internet-turned-sour/\">How the Internet Turned Sour</a></p><p>* Brian Kemple, <a href=\"https://realityjournal.org/2021/08/04/essay-the-constitution-of-culture/\">The Constitution of Culture</a></p><p>* Francisco Eduardo Plaza, <a href=\"https://realityjournal.org/2021/08/15/article-christian-philosophy-as-an-existential-habitus/\">Christian Philosophy as Existential Habitus</a></p><p>* Ryan P. Doran, <a href=\"https://philarchive.org/rec/DORUII\">Ugliness is in the Gut of the Beholder</a> (PDF)</p><p>* John P. McCaskey, <a href=\"https://philarchive.org/rec/MCCIIT-5\">Induction in the Socratic Tradition</a> (PDF)</p><p>* Brendan Hodge, <a href=\"https://www.pillarcatholic.com/p/the-kids-are-not-alright-statistics\">The kids are not alright -- a look at US religious belief and practice</a></p><p>* Justin P. Holt, <a href=\"https://philarchive.org/rec/HOLWFV\">Wollstonecraft's Feminist Virtue Ethics: Friendship and the Good Society</a> (PDF)</p><p>* Paul Campos, <a href=\"https://nymag.com/intelligencer/2021/07/the-truman-show.html\">The Truman Show</a>, looks to Harry Truman as the beginning of the practice of Presidents greatly enriching themselves after leaving the Presidency.</p><p>* Holden Karnofsky, <a href=\"https://www.cold-takes.com/does-x-cause-y-an-in-depth-evidence-review/\">Does X cause Y? An in-depth evidence review</a>, pokes mild fun at statistical analyses.</p><p>* Jennifer Banks, <a href=\"https://www.cardus.ca/comment/article/mortality-and-natality-in-the-pandemic/\">Mortality and Natality in the Pandemic</a></p><p>* Christopher Kaczor, <a href=\"https://churchlifejournal.nd.edu/articles/do-children-contribute-to-the-flourishing-of-their-parents/\">Do Children Contribute to the Flourishing of Their Parents?</a></p><p>* Thomas R. Rourke, <a href=\"https://www.catholicworldreport.com/2021/07/22/secularization-marxism-and-the-enlightenment-in-augusto-del-noce/\">Secularization, Marxism, and the Enlightenment in Augusto Del Noce</a></p><p>* Thaddeus Metz, <a href=\"https://philarchive.org/rec/METEWA\">Exactly Why Are Slurs Wrong?</a> (PDF)</p><p>* Joshua Fox, <a href=\"https://philarchive.org/rec/FOXTPI-2\">Two Pessimisms in Mill</a> (PDF)</p><p><br></p><p><b>Currently Reading</b></p><p>John Irving, <i>A Prayer for Owen Meany</i><br>Alexander, Ishikawa, Silverstein, et al., <i>A Pattern Language</i><br>Reginald Garrigou-Lagrange, <i>The Order of Things</i><br></p>"
}