{
  "title":"Hushed Is Care, and Passion's Din",
  "date":"2021-08-27T16:10:43.603000-07:00",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-1948755638789922267",
  "link":"http://branemrys.blogspot.com/2021/08/hushed-is-care-and-passions-din.html",
  "content":"<p><b/></p><blockquote><b>Monica and Augustine<br>by Lucy Larcom</b><br>  <br>In the martyr Cyprian's chapel there was moaning through the night;<br>Monica's low prayer stole upward till it met the early light.<br>Till the dawn came, walking softly o'er the troubled sea without,<br>Monica for her Augustine wept the dreary watches out.<br><br>&quot;Lord of all the holy martyrs! Giver of the crown of flame,<br>Set on hoary-headed Cyprian, who to Thee child-hearted came;<br>Hear me for my child of promise! Thou his erring way canst see;<br>Long from Thee a restless wanderer, must he go away from me?<br><br> &quot;'T is for Thee, O God, a mother this her wondrous child would keep;<br>Through the ripening of his manhood Thou hast seen me watch and weep.<br>Tangled in the mesh of Mani, groping through the maze of sense,<br>Other, deadlier snares await him, if from me he wander hence.<br><br>&quot;Thine he shall be, Lord; Thy promise brightens up my night of fears:<br>Faith beholds him at Thy altar, yet baptized with only tears;<br>For the angel of my vision, came he not from Thy right hand,<br>Whispering unto me, his mother, &quot; Where thou standest, he shall stand&quot;?<br><br>&quot;Saviour, Lord, whose name is Faithful, I am Thine, I rest on Thee;<br>And beside me in Thy kingdom I this wanderer shall see.<br>Check the tide! hold still the breezes! for his soul's beloved sake,<br>Do not let him leave me! Keep him — keep him — lest my heart should break!&quot;<br><br> Man must ask, and God will answer, yet we may not understand,<br>Knowing but our own poor language all the writing of His hand.<br>In our meagre speech we ask him, and He answers in His own;<br>Vast beyond our thought the blessing that we blindly judge is none.<br><br>When the sun rose from the water, Monica was on the shore;<br>Out of sight had dropped the vessel that afar Augustine bore.<br>Home she turned, her sad heart singing underneath its load of care,<br>&quot;Still I know Thy name is faithful, O Thou God that hearest prayer!&quot;<br><br>By the garden-beds of Ostia now together stand the twain,<br>Monica and her Augustine, gazing far across the main,<br>Toward the home-land of Numidia, hiding in the distance dim,<br>Where God parted them in sorrow, both to bring the nearer Him.<br><br>And the mother's prayer is answered, for their souls are side by side,<br>Where His peace flows in upon them with a full eternal tide.<br>And Augustine's thought is blending with the murmur of the sea;<br>&quot;Bless Thee, Lord, that we are restless, till we find our rest in Thee!&quot;<br><br>And their talk, the son and mother, leaning out above the flowers,<br>Is like lapse of angel-music, linking heaven's enraptured hours.<br>Hushed is all the song of Nature; hushed is care, and passion's din,<br>In that hush they hear a welcome from the Highest: -- &quot;Enter in!&quot;<br><br>&quot;What new mercy has befallen? every earthly wish is gone,&quot;<br>Monica half speaks, half muses; &quot; why should earthly life move on?<br>Ah, my son, what peace and gladness surging from this silence roll!<br>'T is the Eternal Deep that answers to the deep within my soul!<br><br>&quot;Not a sigh of homesick longing moves the stillness of my heart;<br>In the light of this great glory, unto God would I depart.<br>Though more dear thou art than ever, standing at heaven's gate with me,<br>For the sweetness of His presence I could say farewell to thee.&quot;<br><br>There's a silent room in Ostia; tearless mourners by a bed:<br>Since the angels roused that sleeper, who shall weep, or call her dead?<br>Not beside the dust beloved shall her exiled ashes lie;<br>She awaits the Resurrection underneath a Roman sky.<br><br>Now Augustine in his bosom keeps the image of a saint,<br>Whose warm tears of consecration drop on thoughts of sinful taint.<br>In the home that knew him erring, a bewildered Manichee,<br>Minister at Truth's high altar, him that mother-saint shall see.<br><br>In the dreams of midnight, haunted by the ghosts of buried sins;<br>In the days of calm, the spirit, struggling through temptation, wins;<br>Monica looks down upon him, joy to bless, and gloom beguile;<br>And the world can see Augustine clearer for that saintly smile.<br><br>Still the billows from Numidia seek the lovely Roman shore,<br>Though Augustine to his mother sailed long since the death-wave o'er,<br>Still his word sweeps down the ages like the surging of the sea:<br>&quot;Bless Thee, Lord, that we are restless, till we find our rest in Thee!&quot;</blockquote><p></p>"
}