{
  "title":"Peace and Due Order",
  "date":"2021-08-28T16:26:46.664000-07:00",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-5116881982171868621",
  "link":"http://branemrys.blogspot.com/2021/08/peace-and-due-order.html",
  "content":"<p> Today is the feast of St. Augustine, Doctor of the Church. From a passage in the early <i>De ordine</i> in which he gives advice to his students (<a href=\"https://archive.org/details/on-order-de-ordine-st-augustine-commentary/page/n49/mode/1up\">2.8</a>):</p><p></p><blockquote>Have friends or seek to have them in any circumstance of life, anywhere and at any time. Defer to worthy persons, even though they may not desire it. Ignore the proud, and above all don't be proud yourself. Live in any orderly and harmonious way. Worship, think about and love God with the support of faith, hope, and love. Pursue peace and due order in your studies, those of your friends and whoever else has talent, with a view to a good mind and a quiet life.</blockquote><p></p><p>The <i>De ordine</i> is an interesting work, very often forgotten. It is a series of relatively short philosophical works -- Against the Academics, On the Happy Life, On Order, and Soliloquies -- that were written after Augustine gave up his professorship of rhetoric in Milan in 386 and retreated to a farm in Cassiciacum with his mother, his son, and a few students to study philosophy, prior to his baptism in 387. The works are intended the capture the essential ideas and spirit of the philosophical discussions they had there; the <i>De ordine</i> discussion is said later by Augustine to have occurred during a week's gap in the middle of the discussion in <i>Contra Academicos</i>. All of the dialogues are quite charming, although I think you have to be a teacher to appreciate them fully, because much of what carries them is the sincere desire of everyone (including Augustine) to learn something new and Augustine's very deep love for his students and pride in their discoveries. </p><p>While always primarily a discussion between Augustine and his students, St. Monica, whose feast was yesterday, weaves in and out in extremely important ways (I think it's an interesting and under-considered topic what role Augustine's mother plays throughout the Cassiciacum dialogues). <i>De ordine</i> has one of the more charming interactions between Augustine and Monica. Augustine and his students are discussing the question of how evil fits into the order of the world, given that the latter is an expression of divine providence, and in particular what order even is, and they are following the rule that any questions have to be recorded in the notebook that Augustine is keeping to help organize their discussion. </p><p>Monica, who already knows the topic they are discussing, comes in and asks how far their discussion has proceeded; Augustine tells her to come in and have her question recorded. Monica, bemused, asks him what he's doing, since she's never read in any of his philosophy-books of a woman joining the discussion. Augustine dismisses this with a long speech: he doesn't care what the arrogant and ignorant will say; what matters is not the dressing of the discussion but the actual philosophy. People who are genuinely interested in philosophy will not be bothered by his discussing it with his mother, and Augustine says something like, &quot;There were lots of philosopher-women in ancient times, and I like your philosophy.&quot; Philosophy is love of wisdom, which she loves even more than he does, so he should probably be her student.</p><p>To which she replies (mildly, Augustine says, and probably amused at being called a philosopher-woman) that he has never lied so much in all his life.</p>"
}