{
  "title":"Impassibility and Arbitrary Creation",
  "date":"2021-08-26T14:22:32.901000-07:00",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-4327504150984886001",
  "link":"http://branemrys.blogspot.com/2021/08/impassibility-and-arbitrary-creation.html",
  "content":"<p> RT Mullins last year published a paper in the open-access journal, <i>Open Theology</i>, <a href=\"https://www.degruyter.com/document/doi/10.1515/opth-2020-0110/html\">The Problem of Arbitrary Creation for Impassibility</a>. There are several oddities about it.</p><p>(A) It's unclear what 'impassibility' is doing here at all. To say that God is impassible is to say that he is not required to undergo influence from others; 'passion' in the sense used when talking about 'impassibility' is the effect of an agent on a patient. However, creation is the only reason there are any others at all; thus abstracting from creation, there aren't any others to force their actions on God, even if you think God is passible. Impassibility is simply irrelevant to the question of God's reasons for creation.</p><p>(B) Mullins's characterizations of impassibility are odd and nonstandard in any case. For instance, at one point he says:</p><p></p><blockquote>The classical theist maintains that God’s reasons for freely acting cannot be due to anything ad extra to the divine nature. Recall that nothing ad extra to the divine nature can move or influence the impassible God in anyway.</blockquote><p></p><p>Mullins uses these kinds of expression involving &quot;ad extra&quot; multiple times, and in no case is the phrase used in a way that intelligibly corresponds to its actual sense. I have no idea if this Mullins's misunderstanding, or if he's picked it up from a poor usage in one of his sources, but this is a bizarre expression. &quot;Ad extra&quot; indicates something going towards the outside; passions, which are the relevant question for impassibility, indicate something coming in from the outside, and Mullins can hardly be unaware of the latter, since he uses words like &quot;influence&quot;, flowing in, that capture this. To say that 'nothing ad extra to the divine nature can influence it' is just an odd expression that treats going out and coming in as if they were the same thing. What I think is going on is that Mullins really just means 'outside' or 'extrinsic' when he uses expressions like 'ad extra to'. Indeed he literally says something like that:</p><p></p><blockquote>If God’s reason for creating the universe is because it is the best possible universe, then God’s reasons will be based upon considerations that are external to the divine nature. That violates impassibility.</blockquote><p></p> <p>This is obviously wrong. One of the unfortunate results of this strange usage is that it obscures the fact that the key concern in impassibility is not that it's a problem that things are outside God but that things outside God cannot impose themselves on Him, as agents to patient, so that He has to endure their actions. Mullins regularly interprets it as if it were saying that God cannot in an way take into account anything outside Himself in His actions; this is not at all the case. The point is that nothing outside of Himself can act on Him as agent to patient. There are a number of reasons for the latter; one is that being a patient requires potentiality, but God is pure act, and it requires change, but God is immutable; another is that in the change that the patient undergoes that is 'passion', the agent is in some sense nobler and more powerful than the patient, but nothing is superior to God in these ways; another is that in passion, the patient is subordinated to the ends of the agent, but God cannot be subordinated to the ends of any other being.</p><p>These two points, (A) and (B), combined with the fact that creation is an action so passions can only be its reasons if it is an action made possible by God's undergoing some action of a higher cause that makes God create, completely doom Mullins's argument before it starts. There are a few other minor oddities, but the misconceptions indicated by these are fatal to the argument before even developing it.</p><p>In any case, let's consider the argument itself. Mullins characterizes the Problem of Arbitrary Creation as an attempt to establish that the following three claims are an aporetic triad, incapable of being held together:</p><p>(1) God is impassible.</p><p>(2) God is perfectly rational.</p><p>(3) God created the universe.</p><p>He claims then that the following is entailed by the meaning of 'perfectly rational':</p><p>(4) If God is perfectly rational, God created the universe for a reason.</p><p>Which with (2) gives us</p><p>(5) God created the universe for a reason.</p><p>He then will want to argue (and he recognizes this as the controversial pin of the argument):</p><p>(6) If God is impassible, God created the universe for no reason.</p><p>With (1) that gives us</p><p>(7) God created the universe for no reason.</p><p>Which with (5) gives us a contradiction.</p><p>There are things that could be argued with -- e.g., classical theists, who are Mullins's targets, often prefer not to apply terms like 'perfectly rational' to God, because 'rational' is often used for the distinctive discursive cognition of human beings, in which understandings have to be chained together piecemeal to get a full understanding, whereas God's intellect is infinitely superior to this, having full understanding without any such chaining process. God created the universe out of wisdom or understanding; whether this is exactly equivalent to saying He created it out for a reason depends on exactly what you mean by 'for a reason'. This is at least of some concern. I think Mullins, for instance, misunderstands classical theists whom he claims accept (6), not recognizing that the people in question are in fact questioning whether (2) is in any way an adequate understanding of the superiority of divine cognition over our own. And at least one of Mullins's arguments, that (5) has to be accepted on the basis of cosmological arguments, I think clearly equivocates about what 'for a reason' means. Likewise, there are reasons right off the bat to reject (6), namely, that in every action that God does, He is guaranteed to have at least one reason -- namely, Himself. Thus even if you held that impassibility meant that God cannot have <i>adequate</i> reason for creating what He does, it is necessarily false to say that it implies that He would have <i>no</i> reason for creating. This is never addressed adequately, but it comes up briefly when Mullins tries to dismiss the claim that the reason for creating the universe is that God wills His own goodness; he tries (vaguely) to claim that this might not be a reason at all, despite the fact that one of the very common things we use the term 'reason' for is a good that is considering in an action, because God necessarily wills His own goodness. Nothing about necessity in fact rules out its being a reason for something; 1 + 1 = 2 is necessary and yet is obviously at least a contributing reason for a lot of things. This is Mullins quite clearly confusing 'no adequate reason' with 'no reason', and thus not arguing for what he actually needs to argue, which is that divine goodness could have no role in the intelligible structure of creation at all. Nor is this the only confusion rampant on this point; later, when talking about the claim that God creates to manifest His glory, his argument confuses 'no good reason' with 'no reason'. </p><p>Mullins's own characterization of 'reason' seems guaranteed to cause equivocations. He says, &quot;A reason is a consideration that counts in favor of some particular choice or action. A reason explains why an agent acts as she does.&quot; These are two completely different characterizations of 'reason'. A consideration that counts in favor of some particular choice or action does not necessarily explain why an agent acts as she does; a reason that explains why an agent acts as she does is not necessarily a consideration counting in favor of some particular choice or action. 'God wills to manifest His glory' is clearly a consideration that counts in favor of God creating something, even something otherwise wholly gratuitous, that can do it, even though it doesn't explain why God does that particular thing, since ex hypothesi it is otherwise wholly gratuitous. And, indeed this is entirely relevant, since creation <i>is</i> a gratuitous act, classical theists asked for a reason why God creates <i>will give reasons why God engages in free or gratuitous acts</i>. Thus, the self-diffusiveness of good, or God willing His own goodness, or God willing the manifestation of His glory, all account for creation as being considerations in favor graciously and freely doing things, with creation quite clearly being one possible gracious, free act. Thus by the first sentence, classical theists are all doing all they need to do in order to show that God acts for <i>some</i> reason, which therefore establishes that (6) is false. It is just standard classical theism that we can't give God's reasons in the sense of the second sentence -- i.e., the rational account that explains exactly why God acts the way He does -- because everything God does, He does out of omniscience. Thus we, being very far from omniscient, cannot possibly consider the full panoply of reasons that God might have for doing any particular action. We can only discuss God's reasons in a very general way, like saying that creating the world is a free and good action and there are certainly identifiable reasons for doing something free and good.</p><p>But let's set that aside and look at the reasons why Mullins thinks (6) is true. There really isn't much. Mullins doesn't consider the question directly, and mostly just responds to objections to (6). If we try to pull something out of this responses, the recurring theme is that God, if impassible, cannot consider anything else in doing anything, which, of course, is built entirely on the misunderstandings mentioned above under (A) and (B).</p><p>There are other problems with the paper. In responding to Helms, Mullins botches the question of how immanent actions and transitive actions are related, saying that an immanent action cannot be a reason for a transitive action, which is false even in our own case.</p><p>But the paper is interesting to read, for all that, in part because it provides, once you recognize where Mullins keeps going on, it makes very clear that the 'Problem of Arbitrary Creation' isn't any kind of problem for classical theism at all.</p>"
}