{
  "title":"Jewish Temples",
  "date":"2021-08-14T05:40:22.259000-07:00",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-2896544472876162190",
  "link":"http://branemrys.blogspot.com/2021/08/jewish-temples.html",
  "content":"<p> When we speak of 'the Temple', we usually mean one of two buildings, both in Jerusalem:</p><p>(1) <i>The Temple of Solomon</i>, or the First Temple. King David, seeing that the Ark of the Covenant was housed in a decaying tent while he lived in a palace, conceived of building a palace for God in Jerusalem. He did a number of things in this direction -- reorganized the priesthood, picked out a site on Mount Moriah, and so forth -- but none of his attempts ever completed because, we are told, he had shed much blood. The actual Temple was built by his son Solomon, who consolidate David's conquests and alliances into a minor trading empire, beginning it in about the fourth year of his reign and finishing it in about the eleventh year. When it was finished, the Ark was placed in its inmost room, the Holy of Holies, and &quot;the glory of the Lord filled the house of the Lord&quot; (1 Kg. 8:10). It apparently needed some extensive maintenance in the reign of King Josiah, but the Temple would last until the reign of King Nebuchadnezzar of Babylon. The Kingdom of Judah had been (like most of the little kingdoms in the area) had been allied with Babylon as a form of protection against Egypt. When Nebuchadnezzar attempted a grand invasion of Egypt that failed spectacularly, a number of these little kingdoms, including Judah, began to think that they had backed the wrong horse; they stopped paying tribute to Babylon and started courting Egypt. Furious, Nebuchadnezzar sacked Jerusalem in 598; King Jehoiakim died during the siege, so Nebuchadnezzar took the young heir Jeconiah, as well as a large number of artisans and skilled workers, to Babylon as war prisoners, installing Jeconiah's uncle, Zedekiah, as a vassal king. Zedekiah broke his obligations of vassalage, however, and also began courting Egypt. Nebuchadnezzar responding by laying siege to the city again, in about 587, and this time did not merely plunder the Temple but raze it to the ground. This is the first event that is commemorated in the Jewish holy day of Tisha B'Av.</p><p>(2) <i>The Second Temple</i>. When Cyrus allowed the return of Jewish exiles, as part of his general policy of consolidating his empire by providing support to those oppressed by nations he conquered, one of the major concerns was to re-build the Temple. It was a slow and rocky building; everything needed to be rebuilt and there were plenty of obstacles, so it took about twenty years. It was consecrated in 516 BC. It was desecrated by King Antiochus IV Epiphanes of Greek Syria who, after quashing a rebellion in the province in 167 BC, outlawed Jewish religious practices and put a statue of Zeus in the Temple. During the Maccabean revolt, it was recaptured by the Maccabees and re-dedicated in 164, which is the event commemorated during Hanukkah. The Maccabees, successful in throwing off Syrian rule, established the Hasmonean dynasty, and seem to have done considerable maintenance and expansion work on it. The Temple had to be rededicated again in 63 BC when the Romans under Pompey accidentally desecrated it after taking Jerusalem; the Temple was not plundered, and Pompey gave his full support to re-establishing the Temple services. Bad relations between the Romans and the Hasmoneans, however, led to the Romans ending the Hasmonean dynasty and installing the Herod the Great as a client king to keep order among the Judeans. A distrusted foreigner, Herod seems to have tried every possible means of consolidating his rule, one of which was a massive expansion and enrichment of the Temple. This was so massive that it really could count as a rebuilding, and is sometimes called Herod's Temple; the reason it is usually counted as still the Second Temple is that Herod organized it so that the Temple services were not interrupted. After the Jewish Revolt against Rome, the Romans laid siege to Jerusalem, then plundered and destroyed the Temple in AD 70. This is the event commemorated on the Arch of Titus in Rome, and is the second event remembered by the Jewish holiday of Tisha B'Av (which is probably celebrated when it is because of a rabbinical tradition that the Second Temple was destroyed on the ninth day of the month of  Av).</p><p>These are the only temples recognized as licit by the Jewish rabbis. However, there were others.</p><p>(3) <i>The Temple of Leontopolis</i>. Sometime around Antiochus's desecration of the Second Temple, the High Priest Onias III, or more probably his son Onias IV, fled with a number of others to Egypt, under the rule of Ptolemy IV, Antiochus's major enemy. Ptolemy was quite generous with the exiles, and gave them a rich area of the Nile delta that became known as the Land of Onias, and included a compound called Leontopolis, where he helped them build their own temple, a smaller and simpler copy of the one in Jerusalem. They had the same Temple services, however. When the Temple was rededicated in Jerusalem, it became common for the Egyptian Jews to make pilgrimages to it, but they continued sacrificing their own temple as well. Despite this, it was probably still less important in the overall life of Egyptian Jewry than the synagogue in Alexandria, as it seems to have been primarily a way for them to fulfill certain occasional obligations whenever they couldn't actually manage to get to Jerusalem. The Temple at Leontopolis was destroyed by the Romans in AD 93, in response to ongoing Jewish revolts against the Romans. </p><p>The later rabbinical tradition has a somewhat ambiguous view of the Leontopolis Temple; it's consistently evident that the rabbis don't like its existence as a matter of ritual law, but the priests of Onias were allowed to officiate in the Jerusalem Temple, and there is no indication that there was anything idolatrous ever done there. The other Jewish temples were much less acceptable.</p><p>(4) <i>The Temple on Mount Gerizim</i>. The Samaritans accept the Torah, although there are textual difference between their Torah and those accepted by the Jews of Jerusalem, one of which is that the Samaritan version of the Torah requires that the temple be built on Mount Gerizim in Samaria (currently in the West Bank), not far from Shechem, rather than on Mount Moriah in Judea. They split off from the main trunk of the religion sometime after the destruction by Assyria of the Northern Kingdom of Israel in about 720 BC, and their tradition is that they are descendants of the tribes of Ephraim and Manasseh rather than the tribes of Judah and Benjamin. (And according to the same traditions, of course, they are the main trunk of the religion, the Judean branch being an aberration arising from Eli's attempt to seize the High Priesthood from Shechem and bring it to Shiloh, some decades before the rise of David and Solomon, when the Shilonite cultus was transferred to Jerusalem.) We don't know when the temple at Gerizim was built, but the evidence we have suggests the fifth century BC. The Samaritans were able to get recognition under Antiochus of being different from the Judean Jews, which probably saved a great many of them, but were required to designate their temple a temple of Zeus Hellenios (according to Josephus) or Zeus Xenios (according to 2 Maccabees 6:2). The Hasmonean dynasty under John Hyrcanus destroyed the temple at Gerizim in 113 BC. The difference between Samaritan and Judean forms of worship comes up in the discussion of Jesus with the Samaritan woman at the well; Jesus comes down very strongly on the Judean side, but says the time is coming when worshipers will worship neither on Gerizim nor in Jerusalem, but in spirit and truth. After the Bar Kochba revolt in AD 132, the Romans, who had received assistance from the Samaritans, had the Samaritan temple rebuilt; this temple was destroyed around 484 by the Emperor Zeno; it's unclear whether Zeno first destroyed the temple and then put down the resulting Samaritan revolts, or whether the Samaritans revolted and Zeno destroyed the temple in retaliation, but Byzantines and Samaritans did not get along well, so either is possible.</p><p>Another Jewish temple is known to have existed very early on..</p><p>(4) <i>The Temple at Elephantine</i>. Elephantine is an island in the Nile, and was of considerable strategic importance, being at the border of Egypt and Nubia. It was dedicated to the Egyptian ram-headed god, Khnum, and his consorts Satis and Anuket. Khnum was god of the source of the Nile, but later became a kind of quasi-creator figure, said to be the divine potter who formed gods and men. The compound at Elephantine had a number of temples to a number of deities, and one of them was clearly established and maintained by a local colony of Aramaic-speaking Jews, probably an already existing merchant-colony that received a large number of exiles after the Babylonian destruction of Jerusalem. That the Elephantine Jews saw themselves as having a clear connection to those of Jerusalem can be seen in that we have a surviving document in which, after a destruction of their temple, they requested assistance from the Jews of Jerusalem in rebuilding, and we know that they observed Passover. However, the practices of the Elephantine temple were in some ways radically different from what we would think of as Jewish -- the fact that the Lord, whom they called Yahou, was being worshipped in a temple-complex dedicated to other gods is already a significant deviation, but the Elephantine Jews were henotheists, not monotheists. That is, they seem to have held that Yahou had at least a divine consort, Anat-Yahou, who were also worshipped, and may have held that there were other gods, as well. The Elephantine temple was flourishing in the fifth century BC, but it vanishes completely in the next century; probably it was  pushed out by the priests of Khnum, who massively expanded their own temple at about the same time.</p><p>There are a few others about which we know considerably less. At Tel Arad, archeologists discovered a building with incense altars that was built roughly on the same general model as the First Temple at Jerusalem, which seems to have been in use in the ninth and eight centuries BC, and may have been decommissioned in the reign of Josiah, or maybe Hezekiah. While some have suggested that both the Lord and a divine consort were worshipped there, there's remarkably little evidence of this. The ostraca from the Tel given no indication and simply call the temple 'the House of the Lord'. More recently, archeologists about a decade ago discovered another temple at Tel Motza, just a bit outside Jerusalem. It was also functioning in the ninth century, but there is still a lot we don't know about it.</p>"
}