{
  "title":"Three Poem Re-Drafts",
  "date":"2022-10-26T03:28:04.752000Z",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-2582224572756967716",
  "link":"http://branemrys.blogspot.com/2022/10/three-poem-re-drafts.html",
  "content":"<p><b>Examen</b><br><br>O God, you are thrice holy as you dwell in endless light;<br>send down your flawless splendor to your children in the night,<br>for if you do not aid us, how empty is our song!<br>How clearly all our virtue but a mask to hide our wrong!<br>When I think upon my life, Lord, I should weep with tears of shame:<br>each moment hides a weakness in which I've failed your name:<br>when nations look upon me they should see Christ Crucified,<br>yet often how it seems that I am nothing but a lie!<br>Should I not become a sign of endless, holy grace?<br>My life is more a symbol of the failing of our race.<br>With your sanguine power flowing, Lord, cast out this sin in me<br>as the music of your Spirit moves in psalmic melody.<br><br>O God, you are most holy with your goodness ever-same,<br>and who would stand before you if you chose to render blame?<br>Not I, my King, most surely I would drown beneath the sea<br>of times when I have fallen short of where our hearts should be.<br>The love that I have given has not always come from you;<br>my hope is streaked with cowardice that runs it through and through;<br>in all my faith how truly rare are glory's little gleams;<br>and prudence in me shifts around like faces in a dream;<br>my courage, not a martyr's, is but mostly comfort tame;<br>and moderation flees away, and justice just the same.<br>With your sanguine power flowing, Lord, cast out this sin in me<br>as the music of your Spirit moves in psalmic melody.</p><p><br></p><p> <b>One Moment in Time</b></p><p>I fell in love<br>with a girl sweet and shy,<br>bright as spring<br>when the birds sing,<br>with stars in her eye.<br>She looked at me<br>and my senses were caught,<br>with my breath <br>taken away<br>in entranced thought.</p><p>Someday, I know,<br>at the back of the night,<br>when all darknesses are gone,<br>there will be light.<br>Someday I dream<br>all the moments now past<br>will be found,<br>all safe and sound,<br>this time to last.</p><p>Never before my clear eye<br>for such a vision has tried;<br>never before has my soul<br>known such a promise to be whole.</p><p>I fell in love<br>with a girl sweet and shy,<br>filled with joy<br>enough for a boy<br>to taste till he dies.<br>She looked at me;<br>the sun broke the cloud<br>as dawn <br>takes a scissor<br>to night's shroud.</p><p>Never before has the light<br>poured from the sky to sight,<br>never again will the sky<br>look the same to the seeking eye.</p><p>Ever and again, I recall<br>the sun in its rise and fall;<br>Hear but the name,<br>the world is never the same.</p><p>I fell in love<br>with a girl sweet and shy,<br>bright as sun's ray<br>in blazing day<br>as it pours from the sky.<br>Someday, I know,<br>a future far and fair<br>this moment returns<br>from memory burned,<br>and erased <br>of all care.</p><p>Then it seems to me<br>that my soul rises free:</p><p>I fall in love<br>with a girl sweet and shy,<br>bright as spring<br>when the birds sing,<br>and starry of eye.<br>She looks at me<br>and my senses are caught,<br>with my breath <br>taken away,<br>in entranced thought.</p><p><br></p><p><b>So It Goes</b><br><br>There is love,<br>there are lies,<br>there is lying in love,<br>there is living a lie<br>(and loving it too),<br>there is love like to hate<br>and hate like to love,<br>there is lying in wait,<br>then surprise in their eyes<br>when shots ring out.<br><br>She hates and she loves,<br>he hates and he loves,<br>at times all the same in a jumbling game<br>where the prize is a heart,<br>or a life,<br>or a death,<br>and the sudden exhaling of everyone's breath<br>when shots ring out.<br><br>And so --<br>the gun's in her hand<br>and the shots ring out,<br>and how it ends who can tell?<br>I suppose no one knows<br>who has not been there,<br>feeling it happen.<br>So it goes.<br><br>And so --<br>the gun's in her hand<br>and the life-lines are tangled with lies<br>and soon somebody dies,<br>and death is an untensing of breath.<br>And so it goes.<br><br>The dark is a friend,<br>the dark is a foe,<br>the tears on her cheek cannot recall<br>even a memory tracing the path she has gone,<br>wandering in darkness<br>before hint of dawn;<br>just the sound stays<br>as shots ring out.<br><br>He is dead.<br>There -- it's said.<br>He lied;<br>let him lie.<br>It cannot be recalled.<br>So it goes.<br><br>And so --<br>the gun's in her hand;<br>who can tell<br>who it is<br>who suffers the more?<br>I guess to understand<br>we would need to be there,<br>feeling overcome.<br>So it goes.<br><br>And so --<br>the gun's in her hand,<br>and when love is a lie,<br>or a lie is a love,<br>there is lying in wait a doom and a fate<br>that cannot end well.<br>And so it goes.<br><br>We are fools for our loves,<br>we fall for their lies,<br>and so --<br>the gun's in her hand:<br>like spilled milk, spilled blood<br>now pointless to cry over;<br>the tears were already shed,<br>and she works out a fate<br>she chose long ago.<br>So it goes.<br><br>And so --<br>the gun's in her hand;<br>what's past has passed --<br>and yet we would love to recall<br>the lies of the past<br>and not let them lie.<br>It makes no sense;<br>it cannot be reasoned away.<br>And so it goes.</p>"
}