{
  "title":"All Saints",
  "date":"2022-11-01T15:51:23.256000Z",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-2758309926288100177",
  "link":"http://branemrys.blogspot.com/2022/11/all-saints.html",
  "content":"<p></p><blockquote>Then I heard what seemed to be the voice of a great multitude, like the sound of many waters and like the sound of mighty thunderpeals, crying out,  “Hallelujah! For the Lord our God     the Almighty reigns.  Let us rejoice and exult     and give him the glory, for the marriage of the Lamb has come,     and his bride has made herself ready; to her it has been granted to be clothed     with fine linen, bright and pure”--for the fine linen is the righteous deeds of the saints. [<a href=\"https://www.biblegateway.com/passage/?search=Revelation+19%3A6-8&amp;version=NRSVCE\">Rev 19:6-8 NRSV</a>]</blockquote><p> </p><p></p><p><b>Gildas the Wise</b></p><p>Gweltaz, known usually by the Latin form of his name, Gildas, was born in the sixth century. According to a longstanding legend, he was born in Scotland somewhere around modern-day Glasgow, but it is often held that he was actually born much farther south. According to himself, he was born in the same year as the Battle of Mount Badon. The battle was later attributed to King Arthur; St. Gildas does not say who fought at it, but the later attribution led to Gildas occasionally showing up in Arthurian legend. Unfortunately, we don't know exactly when the Battle of Mount Badon took place; Gildas is the first person we know to mention it, but he takes it as a reference point his original readers would already know. It is generally held to have occurred around 500. Gildas became a monk, and is traditionally thought to have been educated in the school run by St. Illtud in Wales. At the age of forty-four, he wrote the work for which he is famous, <i>On the Ruin and Conquest of Britain.</i> The work is a scathing polemic attacking the morals of several kings and the clergy of his day, but has since become most important for historical purposes because it was the only surviving extended near-contemporary discussion of figures and events at the time, and was influential on the development of several other important historians, like St. Bede and Alcuin. St. Gildas also became a recurring symbol of political and ecclesiastical reform in British contexts. At some point, Gildas founded an abbey at Rhuys, in Brittany, and died there, perhaps in 569 or 570. His feast day is celebrated on January 29.</p><p><b>Clelia Barbieri</b></p><p>Clelia Rachele Maria Barbieri was born in 1847 in Bologna to a poor working-class family. She herself began to work very young. When she was eight years old, her father died, and to maintain her family Clelia had to spend much of her day spinning hemp into rope. The family lived near a little church, and the girl spent her time when not working or sleeping at the church. In 1861 she joined a group devoted to Christian catechesis and soon became an active teacher in the parish's catechetical programs. In 1868, she founded her own group, the Little Sisters of Our Lady of Sorrows, to minister to the local poor and sick. She contracted tuberculosis, however, and died on July 13, 1870. She was beatified in 1968 by Bl. Paul VI and canonized in 1989 by St. John Paul II; her feast day is July 13.</p><p><b>Marguerite Bourgeoys</b></p><p>Born in 1620 in Troyes in the County of Champagne, Marguerite Bourgeoys lived a relatively uneventful life until in 1652 Paul de Chomedey, Sieur de Maisonneuve, the governor of the French colony at Fort Ville-Marie (later known as Montreal), visited his sister, a local canoness.  Maisonneuve happened to be looking for people to start schools, and Marguerite was one of the people he asked. So in 1653, Bourgeoys arrived in Quebec and set to work. She helped organize the fundraising and building for the first church in Fort Ville-Marie, Notre-Dame-de-Bonsecours, and set up a school. She and her fellow workers helped educate orphan girls who were sent to the colony and also interviewed male settlers who came to Quebec looking for fortune and a wife. A small community of women grew up around Bourgeoys's work, and this eventually became the Congregation of Notre Dame of Montreal. Bourgeoys herself often returned to France to raise funds, recruit help, and petition for royal support for various projects; one of the most important such projects was keeping the Congregation uncloistered. There was a strong push to cloister most religious congregations at the time, which was seen as necessary for religious reform; Marguerite recognized that this was utterly unsuitable both to the nature of the Congregation itself and the needs of the population they served, and kept petitioning until she met King Louis XIV and obtained his support in keeping her community a community of sisters out in the world. The king seems to have been fairly impressed with her, and noted that she was a major contributor to the building of the colony both educationally and materially. Royal patronage in hand, the Congregation built schools all over Quebec. This kept Bourgeoys busy, although she had to spend a fair amount of time fending off the attempts of bishops to make the Congregation cloistered in the misguided belief that in doing so they were aiding in the reform of the Church rather than impeding it. She died on January 12, 1700. She was beatified in 1950 by Pius XII and canonized in 1982 by John Paul II. Her feast is January 12.</p><p><b>Charles Eugene de Foucauld de Pontbriand</b></p><p>Charles Eugene de Foucauld de Pontbriand was born September 15, 1858 in Strasbourg, but both of his parents died in 1864 from different ailments; he and his sister were given over to the care of their paternal grandmother, but she died shortly after, as well, so they were raised by their maternal grandparents. Their grandfather did a great deal to encourage Charles's education, but Charles was often sick and not a cooperative or sociable child at all. The family had to flee in 1870 due to the Franco-Prussian War, and they eventually ended up in Nancy. Charles was confirmed, but he shortly afterward began to doubt his faith, became an agnostic, and stopped all of his religious practices. Finishing his education up in military schools, he eventually joined the French cavalry and spent time posted in Algeria, Morocco, the Sahara, and Palestine. The time in North Africa, and subsequent return to France, slowly brought him back to his faith, and in 1890, despite having lived a quite dissolute lifestyle before, he became a Trappist monk, and later, feeling called to something different from what the Trappists offered, became a hermit. He was ordained in 1900, and set out for Algeria to found a new congregation, but that project was a complete failure. Instead, he simply lived among the Berbers, studying Tuareg culture and creating the first Tuareg-French dictionary. His life came to an end on December 1, 1916, when a bunch of raiders broke into his hermitage and kidnapped him, probably hoping for a ransom; however, when the raiders ran into French cavalry, they panicked and shot Foucauld in the head. He was beatified by Pope Benedict XVI and was canonized by Pope Francis I in 2022; his feast day is December 1.</p><p><b>Lazaros the Iconographer</b></p><p>Lazaros, often known as Lazaros Zagraphos ('the Painter' or 'the Iconographer') was a ninth-century Armenian who became a monk and studied at the great Stoudios Monastery in Constantinople, where he was ordained. He was discovered to have a talented for painting, and his frescos were especially impressive, so he was set with the task of restoring old icons. In another time, this might have been quiet minor work, but in Lazaros's day Constantinople was in the grip of the iconoclastic movement, and the emperor, Theophilos, was a major supporter of the iconoclasts. Thus restoring icons was potentially dangerous work, particularly since one of Lazaros's task was repairing icons that had been vandalized by the iconoclasts. Lazaros was eventually dragged before the emperor who, discovering that Lazaros could not be bribed to stop, threatened him with death; when he discovered that Lazaros was a priest, Theophilos instead threw him in prison, where he was tortured in the attempt to get him to stop. Instead, he began painting icons on the prison walls using makeshift materials. Eventually the torture put Lazaros on his deathbed. Since he was dying anyway, the empress, Theodora the Armenian, who was sympathetic to the iconodoules, was able to get him released. Lazaros took shelter at a church near the shores of the Bosporus, where he recovered, and in fact outlasted the Emperor Theophilos. As Theodora brought the iconoclastic persecution to an end, Lazaros was free to paint again. He was also sent on a couple of diplomatic missions to Rome in the attempt to heal the damage that had been caused between Rome and Constantinople during the iconcolastic period, dying in Rome on the second such mission. His feast is usually celebrated November 17 on Orthodox calendars and February 23 on the Roman calendar.</p><p><b>Arialdo and Erlembaldo</b></p><p>Arialdo lived in the eleventh century; he became a canon in Milan, which was still one of the major sees of the West. It was not a great time for Milan, whose clergy were infamous for a long list of immoralities. However, times were changing, and Arialdo was the beginning of it. He began preaching against the tendency of the clergy to keep concubines, probably taking advantage of the fact that the bishop of Milan was away at the time. The clergy of Milan, alarmed, sent envoys to Pope Stephen IX, suggesting that Arialdo was a troublemaker trying to stir up the people of Milan against the clergy. Arialdo heard about this, however, and went to Rome himself to explain his own position. The pope was convinced that, at the very least, further investigation was required, so he sent two envoys, Anselm of Baggio and Hildebrand of Sovana, to look into the matter further. The result was that Arialdo could continue to preach, although there were occasional attempts to kill him and his associates. One of those killed was a man named Landulf Cotta. The violence was inconsistent. However, Arialdo had to return to Rome in 1059 because things were getting out of hand. The pope again sent envoys, Anselm of Baggio and St. Peter Damian, but the envoys were unable to get the city under control. A full-scale reform movement, known as the Pataria, had grown up around Arialdo, and the Patarines and their opponents, led by the bishop, Guido de Velate, were increasingly in direct conflict. The Patarines had an unexpected opportunity when Anselm of Baggio became Pope Alexander II in 1061. The new pope had quite a bit on his plate, but he actively supported the Pataria. In 1063, Landulf Cotta's brother, Erlembaldo Cotta returned from a pilgrimage and was convinced by Arialdo to become an active member of the Pataria, despite being a soldier rather than a cleric; Erlembaldo received the papal banner in 1864. This guaranteed that the fundamental showdown was now not between the See of Milan and the Pataria but between the See of Milan and the Holy See of Rome. Bishop Guido was excommunicated, and the Pataria began moving directly against the Milanese hierarchy, with Arialdo imposing an interdict on the diocese. This led to a revolt, and Arialdo had to flee; he was caught, however, and killed. Things continued to heat up, as Erlembald had to deal with the meddling of Emperor Henry IV, who was backing opponents of Pope Alexander II. As the pope's representative in Milan, Erlembald, despite being a layman, effectively governed the church, deciding appointments and doing what was required to support them, but his opponents were many, and when backed by the Emperor, Erlembald was sometimes limited in what he could do. However, the Pataria had another stroke of luck when Alexander II, who had died in 1073, was succeeded by Hildebrand of Sovana, now Gregory VII, who was also a supporter of the Pataria, with the result that the Pataria, backed by Rome, was able to outlast the Emperor, who was having problems elsewhere in his empire. Nonetheless, problems were not over, as the Pataria continued to be controversial, and when the cathedral of Milan was set on fire by a lightning storm in 1075, many of the people of Milan took it as a sign of divine judgment against the Pataria. A major revolt rose up. Erlembald was able to put it down, but at a cost, since he died from wounds in the battle. After his death, the Pataria began to dissolve, although tensions between the popes and the emperors over Milan continued. Ariald's feast is June 27 and Erlembald's feast is July 27.</p><p><b>Devashayam Pillai</b></p><p>Neelakandan Pillai was born in 1712 in Tamil Nadu to a Brahmin father and a non-Brahmin mother; because of this, he was outcaste and therefore was raised entirely by his mother's family, his father not being ritually able to play a role in his education. His mother's family had important connections in the court of the maharaja of Travancore, so Neelekanden eventually became an important official. So things would probably have remained, except that in 1741, the Dutch East India Company tried by force to establish a trading post in Travancore, at Colachel. The Dutch were resoundingly defeated at the Battle of Colachel, and the commander of the Dutch military forces, Eustachius Benedictus de Lannoy, was taken prisoner. He was later pardoned by the maharaja on the condition that he would assist the development of the Travancore military, particularly when it came to European tactics and weaponry. He did so well that he was eventually made commander, and in this position, Neelakandan Pillai interacted with him to a considerable degree, and became curious about his Christianity. As a result of these interactions, Pillai was baptized in 1745, taking the baptismal name Lazar, although the version of the name he came to use most, and was known most by, was a Tamil translation of the name, Devashayam. Many other members of Devashayam Pillai's family followed him into the Church. The Brahmin priests eventually brought charges against Devashayam for rejecting traditional beliefs and practices, and he was imprisoned. For diplomatic reasons, due to relations between Travancore and European nations, he was eventually sent to exile in the nearby Pandya kingdom; he spent some time in the forests near Aralvaimozhy, where he gained a reputation as a holy man. The exact circumstances of his death are difficult to determine, but he seems to have been shot by soldiers, perhaps at the instigation of local Brahmin priests. He was beatified by Benedict XVI in 2012 and canonized by Francis I in 2022. His feast day is January 14.</p><p><b>Gerard Majella</b></p><p>Gerardo Maiella was born in southern Italy in 1726. He was apprenticed as a tailor, but his career was somewhat rocky because his health was always frail. His fragile health also prevented him from joining a religious order as he wished to do, but in 1749 he was allowed into a relatively new religious order devoted to missionary work, the Congregation of the Most Holy Redeemer, or Redemptorists, as a lay brother. He did a large number of odd jobs for the Redemptorist community, and things were for the most part quiet. However, in 1753, he was accused by a local woman of having fathered her child; the scandal was serious enough that St. Alphonsus Liguori, the head of the Redemptorists, investigated the matter himself. Maiella refused to speak in his own defense, and therefore St. Alphonsus imposed sanctions on him. Later the woman confessed that she had lied, and Maiella's name was cleared. He died of tuberculosis in 1755. After his death, he became popular among pregnant mothers in Italy because devotion to him was associated with easing labor due to some of the miracles attributed to him; for this reason, he is often referred to as the patron saint of expectant mothers. He was beatified in 1893 by Leo XIII and canonized in 1904 by St. Pius X. His feast day is October 16.</p><p><b>David Uribe-Velasco</b></p><p>David Uribe-Velasco was born in 1889 in Buenavista de Cullar in Mexico. He was ordained as a priest in 1913. It was an uneasy time for the Catholic Church in Mexico; the Constitution at that time was anticlericalist, although its anti-Catholic provisions were only very lightly enforced. However, in 1914 there was a coup which put into place a regime that used the provisions to engage in an active persecution of Catholics. Fr. David at one point had to relocate in the hope of avoiding a direct crackdown. Political struggles eventually led to the persecutions being lightened up temporarily, but the way the Church was treated see-sawed back and forth depending on who was in power. This was unstable, and it all exploded in 1926 with the Cristero War, in which parts of the rural Catholic population of Mexico rose in rebellion after the regime attempted to close Catholic churches. Meanwhile, Catholic priests often had to say Mass and give confessions in secret. The Mexican army eventually became aware of a secret Mass celebrated by Uribe-Velasco. The Mexican government had established its own schismatic alternative to the Catholic Church, the Iglesia Católica Apostólica Mexicana, and tried to recruit him to it. When he refused, he was shot. He was beatified in 1992 and canonized in 2000 by St. John Paul II as one of the Martyrs of the Mexican Revolution. His feast day is April 12, the anniversary of his death in 1927.</p><p><b>Inácio de Azevedo and the Martyrs of Tazacorte</b></p><p>Inácio de Azevedo de Ataíde Abreu e Malafaia was born in Porto, Portugal, in 1526; he was an illegitimate son, but as his family was nobility, he was legitimized and began to be trained for a life at court. However, after he began attending sermons by a Jesuit missionary, he gave that career up and became a Jesuit priest instead. He was put in charge of several Jesuit schools, eventually doing extensive work in raising funds for the construction of the Roman College (now known as the Gregorian). In 1565, St. Francis Borgia named him Visitor to Brazil; he arrived in Brazil the next year to oversee Jesuit schools and missions. It was tricky business, because he had to keep working around the war between France and Portugal that was happening at the time, but within two years he had visited every Jesuit mission in Brazil. He returned to Lisbon and then Rome to report, and asked to have more volunteers to help meet the needs of the Brazilian missions. He was given full authority to arrange such a mission to Brazil as he thought appropriate and he and the volunteers set out in June of 1570. On July 15, shortly after leaving Tazacorte, the small fleet of which the mission was a part was sailing near La Palma in the Canary Islands, when they were attacked by the fleet of the French pirate, Jacques de Sores. The ships were captured. Many of the passengers were allowed to escape, but Jacques do Sore, who was a French Huguenot, ordered the Catholic priests and seminarians to be executed. Forty of them, including Fr. Inácio were stabbed and thrown overboard. They were beatified in 1854 by Pius IX as the Forty Martyrs of Brazil. Their feast day is July 17.</p><p><b>Angelus of Jerusalem</b></p><p>Angelus and his twin brother John were born to a Jewish family in Jerusalem in 1185, but their mother converted to Catholicism not long after, and so they were both baptized. As their parents died when they were children, they were raised in the household of the Patriarch of Jerusalem. At the age of 18, they joined the relatively new order, the Order of the Brothers of the Blessed Virgin Mary of Mount Carmel, usually known as the Carmelites. Angelus, unlike his brother, wanted to be a hermit, so he began the eremitic life in the wilderness, but had some difficulty because people kept hearing about him and seeking him out. In 1218, he set out for Italy. We don't quite know why, as different stories give different reasons. But he seems to have done so with the permission of his superiors, because he was authorized to petition Pope Honorius III for confirmation of a new rule for the order. While in Rome, he is said to have preached in St. John Lateran and to have met both St. Francis and St. Dominic. We don't know for sure whether this is true, but according to the story, St. Angelus predicted that St. Francis would share the wounds of Christ, and St. Francis predicted that St. Angelus would die fairly young. Angelus made his way to Sicily, where he spent his time preaching. On May 1, 1220, he was stabbed to death by a Cathar knight, supposedly for having convinced the knight's mistress to leave him. He died a few days later, and his burial place in Licata became a major Carmelite pilgrimage site. His feast day is May 5.</p><p><b>Laura of Saint Catherine of Siena</b></p><p>María Laura de Jesús Montoya Upegui was born in Jericó, Colombia in 1874. Her father's death in the Colombian Civil War of 1876 left the family nearly destitute, so she was raised first by her grandmother and then sent to an orphanage run by her maternal aunt. With her aunt's help and support, she trained to be a schoolteacher, and began teaching in 1893. Beginning in 1908, she started working with indigenous communities. She had been wanting for a while to become Carmelite nun, but one thing that kept her was that Carmelites were cloistered and she found that evangelism was what actually interested her. So in 1917 she started the Congregation of Missionary Sisters of the Immaculate Virgin Mary and Saint Catherine of Siena and with a few other women began doing missionary work in the little indigenous community of Dabeiba. She took the religious name of Laura of Saint Catherine of Siena and was active in missionary work the rest of her life. Toward the end of her life she suffered from a prolonged illness that kept her in a wheelchair. She died in 1949. She was beatified in 2004 by St. John Paul II and canonized in 2013 by Francis I. Her feast day is October 21.</p><p><b>Jean-Baptiste de la Salle</b></p><p>Jean-Baptiste de la Salle was born to a wealthy and noble family in Reims, France, in 1651; his mother's family, in fact, was a major winemaking family, the Moëts, whose name is still associated with high-quality champagne. La Salle was destined for religious life from his teenage years, and he was given an excellent education, culminating in attendance at the Seminary of Saint-Sulpice. Both of his parents died shortly afterward, however, so he had to leave school to look after his younger brothers and sisters. While this slowed him down a bit, it did not stall him, and he was ordained a priest in 1678. One of his earliest tasks was to help establish the Sisters of the Child Jesus, recently founded to look after the education of poor and sickly girls. This would be formative, because while he was serving as confessor to the order, he met Adrian Nyel. Nyel was a civil educator, founding schools for poor children throughout Rouen, and La Salle began working with Nyel to found schools that were properly integrated into the local communities. La Salle began overseeing the schools founded by Nyel in and around Reims. He immediately ran into the problem that the teachers at these schools often faced nearly insuperable impediments. They were poor and had little training, and often only a very basic education themselves, and they had difficulty working together with a common aim. To help remedy this La Salle started inviting them to dinner, which at the time was scandalous because they belonged to a much lower class than he did. Having inherited a very large amount of money, he began thinking of using it to found a series of high-quality schools for the poor and working class. As it happens, he ended up donating almost all of the money to help during a famine, but he went ahead with the school project, anyway. Thus began the Institute of the Brothers of the Christian Schools. It had a very rocky start. The bishops were wary of this (at the time) very unusual approach to religious life; secular authorities were very suspicious of this unusual approach to schools. But he did not stop and in 1685 founded a school specializing in the training of teachers. His work in education turned out to be extremely successful, but it was also extremely time-consuming and exhausting, and the stress of it is often thought to have been a contributing cause of his death on Good Friday in 1719. He was canonized by Leo XIII in 1900, and his current feast day is April 7.</p><p><b>Damien of Molokai</b></p><p>Jozef de Veuster was born in 1840 in Tremelo, Belgium. His parents intended him for the mercantile life, training him to work in the family farm and the little grain business they owned, but he became fascinated by the Redemptorists and began looking into the possibility of religious life. He eventually decided to join the Congregation of the Sacred Hearts of Jesus and Mary and took the religious name of Damien. He wanted to be a missionary priest. He got very little encouragement from his superiors, because the farmboy was very, very far from being polished in manners or scholarly in interests. He was an intelligent young man, however, and although he never stopped being a bit rough in manners, when he showed that he could learn Latin fairly easily, he was allowed to proceed with a seminary education and was ordained. Shortly before his ordination, in 1864, he was sent to Hawaii on a mission, because the previous priest had become too sick to go. The Kingdom of Hawai'i at that time was in a state of severe crisis; unemployment was rampant, crime was increasing, illness was spreading everywhere. Leprosy was becoming worryingly common, so that King Kamehameha V signed into effect a law to quarantine all lepers at the colony of Kalawao. However, the Kingdom struggled to pay for the expenses of such a quarantine, and the whole project was teetering on the edge of humanitarian disaster. At this time, the bishop in Honolulu decided that more needed to be done for the leper colony, and Damien de Veuster was one of the priests who volunteered. He established a church and became very well known throughout the colony for his willingness to help any of the residents with any of the practical problems that they might have; he helped dress wounds, lay down roads, repair houses, till farms, found hospitals, build furniture, dig graves. He himself rarely took a primary supervisory role, but he could always be counted on to help those who did. His work came to the attention of King David Kalakaua and Princess Lydia Lili'uokalani, and after they recognized him officially, he became internationally famous, to such an extent that his work was no longer merely supported by Catholics but by a wide range of Protestant churches, as well, although locally Christian churches were often highly critical of him, as he was widely regarded as an uncouth and coarse man, lacking all polished respectability. In 1884, he accidentally put his foot into water scalding enough to blister his skin, and feeling nothing, knew that he had contracted leprosy. Recognizing that the clock was ticking on his mission, he threw himself into his work as much as his medical condition would allow, trying to finish projects that had started and set up for success those projects he could not finish. He died on April 15, 1889. Shortly afterward, Robert Louis Stevenson was in Hawaii, suffering from tuberculosis, and, curious about Fr. Damien's story, investigated and wrote up a defense of him from his critics that made him even more internationally famous. He was beatified by Pope John Paul II in 1995 and canonized by Pope Benedict XVI in 2009. His feast day is May 10.</p><p><br></p><p>************</p><p><a href=\"https://branemrys.blogspot.com/2021/11/all-saints.html\">2021 All Saints Post</a><br><i>Niklaus von Flue, Contardo of Este, Peter of Verona, Virginia Centurione Bracelli, Fulrad, Ivan of Rila, Austregisilus, Sulpitius the Pious, Desiderius, Amandus, Remaclus, Theodard, Lambert, The Martyrs of Shanxi, Tôma Khuông, Maria Teresa Goretti, Lidwina of Schiedam, Oliver Plunkett, Mariam Baouardy, Marinus, Nunzio Sulprizio</i></p><p>    <a href=\"https://branemrys.blogspot.com/2020/10/all-saints.html\">2020 All Saints Post</a><br><i>André de Soveral, Domingos Carvalho, and the Martyrs of Cunhau, Henry of Uppsala and Eric IX the Holy, Adelaide of Burgundy, Junípero Serra y Ferrer, Maria Restituta Kafka, Venantius Fortunatus, Radegund, Junian of Maire, and Gregory of Tours, Magdalene of Nagasaki, Jeanne-Antide Thouret, Louis IX, Peter Nolasco, Tarasios of Constantinople, Albert Chmielowski</i><br><br><a href=\"https://branemrys.blogspot.com/2019/11/all-saints-iii.html\">2019 All Saints Post, Part III</a><br><i>Mariam Thresia Chiramel Mankidiyan, Gregory II and Gregory III, Katarina Ulfsdotter, Marko Stjepan Krizin, István Pongrácz, Melchior Grodziecki, Amandus and Bavo of Ghent, Zhang Huailu, Colette of Corbie, Alphonsus Rodriguez, Marie-Margeuerite d'Youville, Anthony of the Caves, Teresa of Calcutta</i><br><br><a href=\"https://branemrys.blogspot.com/2019/11/all-saints-ii.html\">2019 All Saints Post, Part II</a><br><i>Bartolomeu dos Mártires, Manuel Moralez, Apollonius the Apologist, Henry II the Exuberant and Cunigunde of Luxembourg, Ramon Nonat, Francis Xavier Cabrini, Juliana of Liège, Aelia Pulcheria, John Henry Newman, Anna Schäffer, Ivo of Chartres, Paul I of Constantinople</i><br><br><a href=\"https://branemrys.blogspot.com/2019/11/all-saints-i.html\">2019 All Saints Post, Part I</a><br><i>Matteo Correa Magallanes, Nicholas Owen, Knud IV and Knud Lavard, Mariana de Jesús de Paredes, Joseph Vaz, Zdislava Berka, Caterina Fieschi Adorno, Pietro I Orseolo, Ðaminh Hà Trọng Mậu, Jeanne-Françoise Frémiot de Chantal, Stephen Min Kŭk-ka, Rabanus Maurus Magnentius</i><br><br><a href=\"https://branemrys.blogspot.com/2018/11/all-saints.html\">2018 All Saints Post</a><br><i>Gianna Beretta Molla, Margaret of Scotland, Yu Tae-chol Peter, Justa and Rufina of Seville, Giuseppe Moscati, Kazimierz Jagiellończyk, Marie-Alphonsine Danil Ghaţţas, Salomone Leclerq, Arnulf of Metz, Óscar Arnulfo Romero y Galdámez, Frumentius of Tyre, Jeanne Jugan, Joseph Zhang Dapeng, Maroun and Abraham of Harran, Magnus Erlendsson, Callixtus I, Hippolytus, Urban I, Pontian, Anterus, Fabian, Jean de Brébeuf</i><br><br><a href=\"https://branemrys.blogspot.com/2017/11/all-saints.html\">2017 All Saints Post</a><br><i>John Ogilvie, Leo IV, Andrew Stratelates and the 2593 Martyrs, Theodore the Studite, The Martyrs of Gorkum, Margaret Ward and John Roche, Mesrop Mashtots, José María Robles Hurtado, Genevieve of Paris, Pedro Calungsod, Isaac of Nineveh, George Preca, Denis Ssebuggwawo Wasswa, Anthony of Padua</i><br><br><a href=\"https://branemrys.blogspot.com/2016/11/all-saints.html\">2016 All Saints Post</a><br><i>Theodore of Tarsus, Nilus the Younger, Anne Line, Mark Ji Tianxiang, Maria Elisabetta Hesselbad, Sergius of Radonezh, Anna Pak Agi, Jeanne de Valois, Vigilius of Trent, Claudian, Magorian, Sisinnius, Martyrius, Alexander, Euphrasia Eluvathingal, José Sanchez del Rio, Andrew Kaggwa, Roberto Bellarmino</i><br><br><a href=\"https://branemrys.blogspot.com/2015/11/all-saints.html\">2015 All Saints Post</a><br><i>Margaret Clitherow, Kaleb Elasbaan of Axum, Louis Martin and Marie-Azélie Guérin Martin, Gertrude of Nivelles, Pius V, Clare and Agnes of Assisi, Kuriakose Elias Chavara, Scholastica, Vinh Sơn Phạm Hiếu Liêm, Thorlak Thorhallson, John Damascene</i><br><br><a href=\"https://branemrys.blogspot.com/2014/11/all-saints.html\">2014 All Saints Post</a><br><i>Marie Guyart, Alphonsa Muttathupadathu, John Neumann, Hildegard von Bingen, Pedro de San José Betancurt, Benedict the Moor</i><br><br><a href=\"https://branemrys.blogspot.com/2013/11/all-saints.html\">2013 All Saints Post</a><br><i>María Guadalupe García Zavala, Antonio Primaldi, Nimatullah Kassab Al-Hardini, Gabriel-Taurin Dufresse and Augustine Zhao Rong, Josephine Margaret Bakhita, John Chrysostom</i><br><br><a href=\"https://branemrys.blogspot.com/2012/11/all-saints.html\">2012 All Saints Post</a><br><i>Jadwiga of Poland, Kateri Tekakwitha, André Bessette, Rafqa Pietra Choboq Ar-Rayès, Alberto Hurtado Cruchaga</i><br><br><a href=\"https://branemrys.blogspot.com/2011/11/all-saints.html\">2011 All Saints Post</a><br><i>Bonifacia Rodríguez de Castro, Celestine V, Olga of Kiev, Cyril of Jerusalem, Joseph Mukasa and Charles Lwanga</i><br><br><a href=\"https://branemrys.blogspot.com/2010/11/all-saints.html\">2010 All Saints Post</a><br><i>Moses the Black of Ethiopia, Micae Hồ Đình Hy, Katherine Mary Drexel, Robert Southwell, Lojze Grozde, Andrew Kim Tae Gon</i><br></p>"
}