{
  "title":"And You Shall Tell the Next to Me",
  "date":"2022-10-24T16:18:12.234000Z",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-6900636234340826292",
  "link":"http://branemrys.blogspot.com/2022/10/and-you-shall-tell-next-to-me.html",
  "content":"<p><b/></p><blockquote><p><b> Matter of Brittany <br>by Dorothy Sayers</b> </p><p>Draw to the fire, and let us weave a web <br> Of sounds and splendours intertwined-- <br> Of warriors riding two by two <br> In silken surcoats stitched with blue, <br> To seek and strive the whole world through <br> For a scarlet fruit with silver rind; <br>Of unsteered ships that drift for miles on miles <br>Amid the creeks of myriad magic isles <br>Over enchanted seas, that leave at ebb <br> A beach of glittering gold behind. </p><p> Hark! how the rain is rippling over the roofs <br> And knocking hard on the window-pane! <br> It rattles down the gutter-spout <br> And beats the laurel-leaves about; <br> So let us tell of a kempy stout <br> With bells upon his bridle-rein-- <br>How, as he rode beneath the chattering boughs, <br>He clashed the iron visor over his brows, <br>Hearing upon his heel the hurried hoofs <br> Of Breunor, Breuse or Agravaine. </p><p> Of names like dusky jewels wedged in gold <br> The tale shall cherish goodly store, <br> Of Lionel and Lamorak <br> And of Sir Lancelot du Lak, <br> And him that bore upon his back <br> Arms for the Lady Lyonor; <br>Persant, Perimones and Pertolepe, <br>And Arthur laid in Avalon asleep, <br>Dinas and Dinadan and Bors the bold, <br> And many a mighty warrior more. </p><p> And grimly crouched in every woodland way <br> A dragon with his emerald eyes <br> Shall sit and blink on passing knights; <br> In the deep dells, old eremites, <br> Victors once of a thousand fights, <br> Shall sing their masses at sunrise; <br>And weary men shall stumble unaware <br>On damsels dancing in a garden fair, <br>And there, like Meraugis of Portlesguez, <br> Dance, cheated of their memories. </p><p> To towns where we shall feast at Pentecost, <br> Carlion or Kynke Kenadon, <br> Each day shall come a faery dame, <br> Or else a giant with eyes of flame <br> Shall bid to the beheading game <br> Knights that the king sets store upon; <br>And some shall find, at hour of day's decline, <br>The house beside the fountain and the pine, <br>And learning much of marvel from their host, <br> Shall hasten greatly to begone. </p><p> Some, by the help of charmèd steeds shall-- just-- <br> Leap through the whirling barriers <br> That guard about the pleasant bower <br> Where every moment is an hour, <br> And with an elfin paramour <br> Drowse and dream for a hundred years, <br>But setting foot again on Middle Earth, <br>Or tasting wheaten bread in hour of dearth, <br>Shall crumble to a little cloud of dust <br> Blown by the wind across the furze. </p><p> Or sometimes through the arches of the wood <br> The sad Good Friday bells will ring <br> Loud in the ear of Percivale, <br> Through many a year of ban and bale <br> Yet questing after the Sangraal <br> For comfort of the Fisher King; <br>And suddenly across a vault of stars <br>Shall drive a network of enchanted spars, <br>And Lancelot and Galahad the good <br> Behold the ship of hallowing. </p><p> And first of all I'll tell the tale to you, <br> And you shall tell the next to me: <br> How gentle Enid made complaint <br> While riding with her lord Geraint, <br> Or how the merry Irish Saint <br> Went ever westward oversea; <br>While your dim shadow moving on the wall <br>Might be Sir Tristram's, as he harped in hall <br>Before Iseult of Ireland, always true, <br> Or white Iseult of Brittany.</p></blockquote><p>If you can recognize all of the names in this poem, I salute you on your Arthurian knowledge. I had completely forgotten Dinas (King Mark's seneschal) and Persant, Perimones and Pertolepe (enemies of the Round Table), and had to look up Kynke Kenadon (a city mentioned only once, in Malory's tale of Geraint), which I don't think I ever knew. Meraugis of Portlesguez I only recognized because I have been reading up on various tales of Sir Gawain; he shows up in passing in a number of places, but has a major role in a Gawain-focused story by Raoul de Houdenc that is named after him. </p><p></p>"
}