{
  "title":"Logres XI",
  "date":"2022-11-14T22:31:51.834000Z",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-7783949372054810567",
  "link":"http://branemrys.blogspot.com/2022/11/logres-xi.html",
  "content":"<p><i><a href=\"https://branemrys.blogspot.com/2022/10/logres-x.html\"> continuing Book II</a></i></p><p><b>Chapter 4</b></p><p>After the end of the tournament, Epiphany Eve having arrived, there gathered together all the great men of from around about, whether of the lay orders of knight and king or the holy orders of priest and bishop, for a trial of the sword. After the singing of <i>Te Deum Laudamus</i>, many barons and lords tried their hand, and all failed, until Arthur stepped up to the sword and drew it easy, giving it over to Bishop Bedwin. Then the house of Sir Ector, the houses of Duke Corneus and Sir Don, the houses of Sir Ulfius and of Sir Brastias, and all their supporters, as well as all the common people, stood with Arthur, but the other lords and barons were in great shock and disbelief, and then in great anger, saying that no one of such low degree was deserving to be king.</p><p>&quot;Shall we be overgoverned by a boy of no blood?&quot; they said to each other in wrath. &quot;This is surely some trick.&quot;</p><p>But Bishop Bedwin said, with great hardness in his voice, &quot;Though he were even a shepherd-boy, younger than his brothers, the Lord might raise him up, and what man is there who could gainsay it? But I shall show you. Arthur, take the sword and return it to the stone.&quot;</p><p>Arthur did as he was told. The barons and lords again tried to take it from the stone, but found it as fastly bound as it had been. Arthur, however, again drew it easily.</p><p>&quot;Will you then be against the Lord's will?&quot; said the bishop to the barons.</p><p>The barons and the lords were for the most part not moved, but wary of the influence of Sir Ector and of Duke Corneus, and not wanting to defy the Church directly in the presence of the common people, they said, &quot;Good sir, we are not against the Lord's will, but surely the boy is not old enough yet.&quot;</p><p>To this, Bishop Bedwin replied, &quot;The one who has chosen him knows who he is.&quot; But still the barons demanded that another trial be held at Candlemas. And some of the more clever among them added that by this means the trial could be witnessed by men from more distant lands. This was then agreed, and it was agreed as well that until then, ten knights should guard the sword, so that, day or night, there should always be five guarding it.</p><p>After all of this, Sir Don came to Bishop Bedwin and Sir Ector, saying, &quot;We must take great care, or the boy may meet with a mishap that is not a mishap.&quot; From that moment on, Sir Kay, Sir Lucan, or Sir Bedivere was with Arthur, no matter the time and no matter the place. The three were the first of the Companions of Arthur.</p><p>Thus at Candlemas the trial was held again, with men coming from every part of every realm around. Again the barons and the lords attempted to draw the sword, and again Arthur drew it easily. The prelates and the common folk all shouted acclamation, saying, &quot;Who shall deny that Arthur is the choice of the Lord?&quot; </p><p>But the barons and the lords replied, &quot;Surely we must be sure that there is no better. Let the trial be held again, this time at Pascha, that any man who wishes to try may try it.&quot;</p><p>Bishop Bedwin said in response, &quot;If we hold a trial yet again at Pascha, will you accept the choice?&quot; And when they affirmed this, he granted their request.</p><p>Thus the trial was held again on Easter Eve, and again Arthur alone drew the sword. Bishop Bedwin spoke at length of the sobriety and prudence he found in Arthur. Then the barons and lords consulted among themselves and came to the bishop.</p><p>&quot;What impediment to the Lord's choice do you bring this time? Surely the boy should already be crowned,&quot; the bishop said.</p><p>&quot;We do not impede it at all,&quot; said the representatives of the lords, &quot;but you have seen his character and we have not. Thus let him be crowned, if it be the Lord's will, but let it wait until Pentecost, that we may ourselves behold his character, and may also spend the time in prayer.&quot;</p><p>Thus Bishop Bedwin, having taken counsel with Arthur and Sir Ector, agreed that Arthur's crowning and sacring would be delayed until Pentecost. Then the barons and lords brought fine gifts to Arthur as tokens of good faith; but in reality, they wished to see if he could bought and bribed. However, all that they gave him, Arthur at the advice of Sir Ector gave away. Horses and fine tapestries he gave to knights, and jewels to merchants and their wives, and gold and silver to the poor, and his fame among the common people grew. And indeed, some of the lords and barons were won over by this, either because they themselves received gifts, or because they found him to be a noble young man in heart, or because they did not wish to cross directly one who was increasingly well liked.</p><p><b>Chapter 5</b></p><p>Thus all things continued until Whitsuntide. Again on Whitsun Eve, the sword was tried, and again only Arthur could draw it from the stone. But this time the Bishop Bedwin had ready the crown and the scepter and holy oil. In the view of the people and with the consent of the barons, he knighted Arthur. Then he adorned Sir Arthur with royal vestments, and bringing him before all, he said, &quot;Here is the man God has chosen to be your king. But if any of you have reason why he should not be made king, let him now speak or else hold his peace.&quot; But none dared speak.</p><p>Then Bishop Bedwin, showing the sword to Sir Arthur, said,  &quot;This is the sword with which you will keep justice in defense of the holy Church and to maintain right and the Christian faith. If you will, here before all the orders of Christendom, swear to God, and to our Lady, Saint Mary, and to Saint Peter and to all the saints, to save and uphold truth and peace in the land, and to use your power to keep justice, come forth and take this sword of your election by God.&quot;</p><p>Then Sir Arthur and many of the people were greatly affected and wept as Sir Arthur took the sword. He said, &quot;As truly as God is Lord over all, may he grant grace and power to do as you have said.&quot; Then he was led to the altar and laid it thereon. Bishop Bedwin crowned and anointed him with the same rite that Bishop Fastidius had used for King Uther Pendragon. Then High Mass was sung, the first Mass of the reign of King Arthur.</p><p>When the people left the church, they marveled, because there was nothing where the stone of the sword had been.</p><p>Then King Arthur held court, and lords and barons and knights came to give their service. Many complaints were also brought to King Arthur of wrongs that had been done since the death of King Uther Pendragon, for many knights and ladies had been bereft of their lands. The king gave judgment in all such cases, and he became known for his fairness and impartiality. He also created the officers of his household; Sir Kay was made seneschal and steward, Sir Ulfius was made chamberlain, Sir Lucan was made butler, Sir Bedivere was made constable, and Sir Brastias was made warden of the north. Then King Arthur began establishing his magistracy over all the counties and lordships around Londinium, and even into Cambrian lands.</p><p>All things went well until the middle of August.</p><p><b>Chapter 6</b></p><p>In the middle of August, King Arthur held a great feast and royal court at Caerleon, and invitations were sent far and wide. There came King Lot of Lothian, King Urien of Rheged and Gore, King Caradoc Strongarm of Stangore, known far and wide as the husband of Queen Tegau Goldenhearted, King Yder the Elder of Scotland, and the young King Anguish of Ireland. There also came a king named Malaguin or Maelgwn, but known more often as the Tall King or the King of a Hundred Knights; he was the king who is known elsewhere to have at first opposed St. Padarn and St. Tydecho, but who eventually gave them lands and became a great supporter to them. And each of these kings came with their knights.</p><p>When they were all assembled, King Arthur showered gifts upon them and invited them to a great feast. But the kings, regarding him as being a beardless boy of low birth and not a suitable king for such a realm as Logres, held all that he gave them and all that he did in disdain. They refused his gifts, saying that they came instead to give him gifts, namely, a sharp sword between the neck and the shoulders. Then King Arthur withdrew to a strong tower in Caerleon and they besieged him. With King Arthur were five hundred good men. But with the six kings there were twenty-seven hundred knights.</p><p>For fifteen days the six kings besieged King Arthur, for the tower to which he had withdrawn was well victualed. And on the fifteenth day, Merlin came, showing himself with wonders and marvels in the town, so that rumor of him spread like fire all around. Hearing of this, the kings at the advice of King Urien sent for him. They met him at a palace on the banks of the river outside the town, in a tower that overlooked the water and had a view in the distance of the walls of Caerleon.</p><p>&quot;What do you think of this beardless boy,&quot; asked King Urien, &quot;whom the bishop of Trinovant has crowned a king without our license and without the assent of the people of the land? What do you propose as our best means of dealing with him?&quot;</p><p>But Merlin replied, &quot;Bishop Bedwin has done well, and could not have done better than he did.&quot;</p><p>The kings in turn responded, &quot;How can it possibly be as you say? Many there are who are of higher lineage or of greater experience, many who are stronger or wiser. No man knows whence this boy comes, for Sir Ector is merely his foster father.&quot;</p><p>&quot;You say what you wish were true,&quot; said Merlin, &quot;but his lineage is higher than any of yours.&quot;</p><p>King Lot replied, &quot;You have gone mad.&quot;</p><p>&quot;This boy Arthur,&quot; said Merlin, &quot;is the son of Uther Pendragon by Igraine of Tintagel.&quot;</p><p>&quot;You are saying he is a bastard,&quot; the kings replied.</p><p>&quot;Not so,&quot; said Merlin. &quot;He was begotten after Gorlois had died and he was born in wedlock after Uther had married Igraine. I will tell you more than this. Those who oppose him, he will defeat. Even to his dying day, no one who rises against him shall have victory against him, though they had many more men, and much better men, than any that you are able to bring. He is, by right, the King of Britain.&quot;</p><p>Then some of the kings, such as King Urien and the King of a Hundred Knights, were disturbed. But King Lot, laughing in scorn, said to them all, &quot;He lies. Is he not often said to be the Devil's son? Like his father, he lies.&quot;</p><p>Nonetheless, Merlin persuaded the kings that an embassy should be received under truce so that the matter might be discussed. Thus he went to the tower, where he was received joyfully by Sir Ulfius and brought to the king. </p><p>Merlin told them all that had happened, and said, &quot;Do not fear, my king. The days before you are difficult, but you will triumph. Go forth boldly, as a king and not as a supplicant, and answer them in all things as their lord and chieftain. For they will kneel before you, whether they will or nill.&quot;</p><p><i>to be continued</i></p>"
}