{
  "title":"'Theology Without Anathemas'",
  "date":"2022-10-31T16:32:17.457000Z",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-4994054507791426417",
  "link":"http://branemrys.blogspot.com/2022/10/theology-without-anathemas.html",
  "content":"<p> Steven Nemes has a Cambridge Core Element, <a href=\"https://www.cambridge.org/core/elements/orthodoxy-and-heresy/50689A55E19FDEC6B45FF3F3DAE2BBC2\">Orthodoxy and Heresy</a>, that is temporarily open access (until November 3). The work is a critique of the concepts in the title, advocating instead a 'theology without anathemas' and has some interesting parts, but involves, I think, a fundamental and largely fatal structural flaw. The flaw can be roughly summarized in the following terms. Nemes assumes that orthodoxy and heresy are primarily terms that get their meaning, function, and value within theology as a field of intellectual inquiry; his primary criticism is that they fail to serve that field well in a number of ways. But this is simply an error. Orthodoxy and heresy are not primarily terms from theology as a field; they are terms concerned with the practical matter of communion or, to use a common Protestant term, church order. Their justification, structure, and practical implementation all derive from this, not from purely theological concerns. Theology as a field is only relevant to them insofar as they require the use of theological criteria. Therefore Nemes's discussion, which is focused almost entirely on the theological criteria considered in isolation from their ecclesiastical context, and mostly only discusses the social and political criteria to criticize their existing at all, repeatedly fails to address properly, or even at times to consider, the issues that would actually be relevant to assessing orthodox and heresy, which would have to look not at pure rational theory but at the practical issues involved in evaluating and handling the problem of counterfeits or of deviations so great that they seem to involve leaving the common social project in favor of another project entirely.</p><p>Nemes's entire argument is an <i>ignoratio elenchi</i>, in other words. It's as if you advocated a 'philosophy of law without censures' on the ground that legal licensing and practice requirements were distorting discussions of philosophy of law so that the latter were disproportionately focused on matters concerned with the ways you can legally practice and implement law, rather than floating free and considering every possible kind of legal matter in light of practical reason and empirical evidence. Simply considering philosophy of law as a field in complete isolation, there is indeed no particular reason why you couldn't specialize in vigilante law or warlord justice or the laws that might pertain to purely hypothetical fantasy societies. But most people are not interested in philosophy of law for these things; they want to discuss the kind of law that is in fact legally structured and restricted by the actual legal system, and thus it is very important to them to know what kind of laws and legal practice are actually legal or constitutional themselves. This is not in any way surprising, and it is if anything less surprising that people want to discuss the kind of theology relevant to participating in particular ecclesial communities. Further, whatever might be said of philosophy of law as a field, philosophy of law also serves as a means of assisting the actual legal practices and systems. This is a common pattern in 'philosophy of X' fields. But revealed theology, as opposed to natural theology, is very much like a philosophy of X field; it's also a means assisting ecclesial communities. Most people are not doing theology as a private little game or hobby; they want among other things to become more informed about what's involved in participating in their favored church community. </p><p>Criticizing 'orthodoxy' and 'heresy' for not having purely theoretical value in the context of purely theoretical investigations is thus missing the point. What Nemes would really have to argue, because it is the real controversy between him and almost everyone else, is that the ecclesial functions associated with the concepts of orthodoxy and heresy are irrelevant to salvation. That he does hold something like this is clear from his comments about belief-in versus belief-that, e.g., &quot;Christian belief-in Jesus is a matter of growing toward Him, whatever the more precise details of the theoretical context in which this takes place.&quot; Almost everyone else is skeptical about the &quot;whatever&quot; here; most people hold that growing toward Christ is something we do as communities, i.e., as churches and thus presupposes these communities being able to function as communities; almost everyone else holds that whether precise details of the theoretical context matter is a <i>practical</i> not a <i>theoretical</i> question, that has to be determined on a <i>case-by-case basis</i> and not as a <i>general rule for every situation</i>. Nemes has confused a question of the doctrinal conditions for ecclesial practice for a question of the epistemological questions for a purely theoretical exploration of doctrine.</p><p>All communities assess whether people are actually participating in the communal project; for communities where particular principles are involved, this may involve assessing whether people are using community offices, community resources, or community time to spread principles subversive or destructive of the communal project. Communities have authority over who can participate in the community, and in what way. Every community privileges certain views as valuable to the communal project and depreciates views that cause problems for the communal project; depending on the community, this may sometimes be backed by exhortation, rebuke, or formal penalties involving censure, removal of office, restriction of resource use, or expulsion. That churches are communities is undeniable, that they in fact back their communal projects with exhortation, rebuke, or penalty is undeniable, so the only question, really, is that of what should be included in the appropriate practical powers of churches given their nature and goals, of whether they should be doing these things. This is a practical question that has more in common with ethics than with epistemology.</p><p>I regard this as the fundamentally fatal objection to Nemes's argument. There are some others, more minor. For instance, I was struck by this passage:</p><p></p><blockquote> A person first confronted with the notion of a “theology without anathemas” might immediately think of Paul’s “anathema” against those who preach “another gospel” in Gal. 1:8–9. If Paul could do this, why shouldn’t the practice of anathematization be permissible or even necessary at times in the present day? By way of response, one could first note that it is not clear that Paul is in fact offering a formal “anathema” rather than simply engaging in extreme rhetoric. But it is also worth noting that the case is not the same in later theology. The Gentiles had received the Holy Spirit, proof that God had chosen them, and yet were told that they had to submit to circumcision in order to be proper members of the people of God’s Messiah. There was an empirical disproof of the alternative position at hand, and Paul does not hesitate to use it (Gal. 3:2–3). </blockquote><p></p><p>Part of the issue here intersects with what is noted above. I don't really know what Nemes thinks a &quot;formal 'anathema'&quot; is, if not a declaration of something as anathema in a public document (as Galatians, intended like most of the New Testament epistles to be read in public, is) put forward as authoritative for guiding action. Nemes comes close to recognizing the distinction between practical acts in a community (such as formal anathemas) and rhetorical presentations of doctrine, but this is not really consistent with his argument, which is all about the latter -- if Paul is engaging even in &quot;extreme rhetoric&quot;, then he is doing something analogous to what Nemes has actually been criticizing. But more than this, referring to Paul's rhetorical questions in Galatians 3:2-3 as &quot;empirical disproof&quot; is such a bizarre stretching of the term 'empirical' that I no longer know what it is supposed to mean. The passage including the immediately preceding and following verses for context:</p><p></p><blockquote>You foolish Galatians! Who has bewitched you? Before your very eyes Jesus Christ was clearly portrayed as crucified. I would like to learn just one thing from you: Did you receive the Spirit by the works of the law, or by believing what you heard? Are you so foolish? After beginning by means of the Spirit, are you now trying to finish by means of the flesh? Have you experienced so much in vain—if it really was in vain? So again I ask, does God give you his Spirit and work miracles among you by the works of the law, or by your believing what you heard? So also Abraham “believed God, and it was credited to him as righteousness.” [<a href=\"https://www.biblegateway.com/passage/?search=galatians%203&amp;version=NIV\">Gal. 3:1-5 NIV</a>]</blockquote><p></p><p>We have a reference in 3:1 to Jesus being clearly portrayed as crucified &quot;before your eyes&quot;, but this is related to the immediately preceding verse, the last verse in Galatians 2, which says that if righteousness is through the law, Christ died for nothing; it is emphasizing that the message that was publicly announced (another way we could translate 'clearly portrayed') was one of Christ crucified. Galatians 3:4, here translated 'experience', might be thought to suggest empirical disproof, but the word is actually <i>epathete</i>, which means 'endured' or 'suffered', and thus is clearly referring to the common Pauline theme that our own sufferings for Christ are connected to Christ's suffering for us. It extends the point that Paul is already making -- the Galatians are treating Christ's crucifixion as in vain, they are lacking in understanding and 'bewitched' so that they have deviated from the gospel of Christ crucified that was actually preached to them, they are ignoring that what made them part of the faithful was believing the doctrine, they are making their own suffering for Christ crucified to be in vain. None of this is &quot;empirical disproof&quot; of the thesis in question. And the point of the miracles in Galatians 3:5 is not that the miracles are empirical signs of what is being proven but just to reiterate the same rhetorical question. Paul is not assuming that the Galatians have to check their experience of miracles to see if he's right; he's making the point that their interpretation is foolish because it would make their lives as Christians pointless. This is a practical argument, not an empirical one. </p><p>And guess what rhetoric comes up historically when people are talking about orthodoxy and heresy? That such-and-such position is without understanding of the gospel that was actually received, that it makes Christ's sacrifice in vain, that it makes pointless the sufferings of the martyrs, that it would make nonsense of the actual doctrine and practice of the Church or of Christian life. Whether or not one regards this as true in any given case, it doesn't take much work at all to find these practical arguments being made through the centuries, and, indeed, being made on the model of St. Paul. But this is, of course, the problem with a 'theology without anathemas'; Nemes thinks that Paul is exploring a theological topic by reason and empirical evidence. In reality, the Apostle is directing a church. A theology without anathemas is an invention of theologians to free themselves from churches, because it is nothing other than theology without regard for the actual life in a church.</p>"
}