{
  "title":"Dorothy L. Sayers, Striding Folly",
  "date":"2022-11-06T17:24:10.666000Z",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-2597177365166919544",
  "link":"http://branemrys.blogspot.com/2022/11/dorothy-l-sayers-striding-folly.html",
  "content":"<p><b><a href=\"https://branemrys.blogspot.com/2022/10/fortnightly-book-october-23.html\"> Introduction</a></b></p><p><b>Opening Passages:</b> From &quot;Striding Folly&quot;:</p><p></p><blockquote><p>'Shall I expect you next Wednesday for our game as usual?' asked Mr Mellilow.</p><p>'Of course, of course,' said Mr Creech. 'Very glad there's no ill feeling, Mellilow. Next Wednesday as well. Unless...' his heavy face darkened for a moment, as though at some disagreeable recollection. (p. 35) </p></blockquote><p></p><p>From &quot;The Haunted Policeman&quot;:</p><p></p><blockquote><p>'Good God!' said his lordship. 'Did I do that?'</p><p>'All the evidence points that way,' replied his wife.</p><p>'Then I can say that I never knew so convincing a body of evidence produce such an inadequate result.'</p><p>The nurse appeared to take this reflection personally. She said in a tone of rebuke:</p><p>'He's a <b>beautiful</b> boy.' (p. 59)</p></blockquote><p></p><p>From &quot;Talboys&quot;:</p><p></p><blockquote><p>'Father!'</p><p>'Yes, my son.'</p><p>'You know those peaches of Mr Puffett's, the whacking great big ones you said I wasn't to take?'</p><p>'Well?'</p><p>'Well, I've tooken them.' (p. 93)</p></blockquote><p><b>Summary: </b>&quot;Striding Folly&quot; is a story of Mr Mellilow and Mr Creech, who regularly meet for a chess match. Mr Creech is extremely unpopular, having bought a significant quantity of highly scenic and universally visible land (originally owned by the Striding family and marked by a stone tower known as the Folly) in the area simply in order to the Electrical Power Company to build a large power-plant as the area begins to be electrified. Mr Mellilow is the only person who is still polite to him, because of their regular chess matches, although even he is very unhappy about Mr Creech's actions. In this state of mind, Mr Mellilow has a dream in which he is missing his goloshes and chased by a pair of towers across a chessboard-like land lit by flashes of lightning, ending with seeing a dead black crow. When next he is supposed to meet Mr Creech, however, Mr Creech does not show and instead a stranger comes by asking to play; afterward, Mr Mellilow, looking for his goloshes, wanders up to the Folly, where he does indeed find his goloshes, right by a murdered Mr Creech. Mr Mellilow is of course the primary suspect for the murder until Lord Peter Wimsey, a friend of the Chief Constable's, shows up.</p><p>In &quot;The Haunted Policeman&quot;, Lord Peter and Harriet have just had their firstborn son, and Lord Peter, having just seen off the doctor, meets a worried and distracted policeman just off duty, whom he spontaneously asks to help him celebrate. The policeman tells Lord Peter the source of his distraction. Walking a beat, the policeman had turned into Merriman's End and noticed a suspicious character when someone began shouting about a murder. The policeman goes to Number 13 and sees a curious sight through the letter-flap. Inside there is a black-and-white marble floor and a staircase with a red carpet. A nude woman at the bottom of the staircase is carrying a pot of blue and yellow flowers. He sees a number of other things, all quite vividly, but the most serious is a large man on the floor with a knife in his throat. He blows his whistle, and has to leave the house temporarily to make sure people don't run into the street, and soon is met by another policeman, who was coming to take over for the night. They discover a problem. There is no Number 13 (all the streets are even-numbered), and Number 12 and Number 14 (and, indeed, all the others) look nothing like what the policeman had seen through the letter-flap. He is accused of having been drinking and might well lose his job, if Lord Peter cannot solve the  mystery of the disappearing house.</p><p>In &quot;Talboys&quot;, the oldest son of Lord Peter and Harriet, Bredon, is in trouble for having stolen a couple of prize peaches from Mr Puffett. Mr Puffett is fairly affable about it, and Lord Peter whips Bredon. A visitor, Miss Quirk, a friend of Harriet's sister, is staying and takes a dark view of corporal punishment as only encouraging delinquency, and takes herself to be vindicated when all of Mr Puffett's peaches are stolen, since Bredon is the likeliest suspect. Lord Peter and Mr Puffett investigate the scene of the crime, while Miss Quirk follows up her suspicion of Bredon, who is certainly hiding something.</p><p>All three stories are that particular form of mystery story in which someone is falsely accused, whom we know from having 'met' them probably to be falsely accused, but on grounds that seem unimpeachable, and therefore all have a structure of building up evidence in order to show that the evidence's apparent direction is not what it seems. &quot;Talboys&quot; is best of the three, and on its own is a reason to read this short collection. It has the most natural set-up for the crime and the most natural reason for Lord Peter to be involved; it has the most distinctive characterization; and it is a very funny story, being in part a send-up of modern views of education and parenting, embodied in Miss Quirk. It perhaps helps the story that Miss Quirks have become more, rather than less, common; being judgmental about other people's approach to parenting seems a common sport in our day and, as with Miss Quirk, it is a sport that anyone can play, even the childless. But while it's true enough that parents make their share of mistakes, sometimes even serious ones, it's only in the most extreme cases true that another person in their place would certainly do better. As in war, no plan survives contact with the enemy, so too in parenting, no scheme of how it should be done ever survives contact with actual children. At the very least, all parenting requires some custom-tailoring. Sayers's skewering of Miss Quirk's refusal to recognize this is very well done, and makes for an enjoyable story throughout.</p><p>My past two weeks have been for the most part extraordinarily busy, but listening to audiobooks is something I can occasionally do even when my reading is itself taking a hit -- more places I can do it -- so I also listened to two audiobooks -- the audiobook version of <i>Striding Folly</i>, put out by Blackstone Publishing and narrated by Ian Carmichael, and Colin Duriez's <i>Dorothy L. Sayers: A Biography of Death, Dante, and Lord Peter</i>, published by Oasis  Audio and narrated by Simon Vance. Both were quite good. &quot;Talboys&quot; in particular works quite well in audio form; I did notice that the audio script toned down some of the policeman's crudeness in &quot;The Haunted Policeman&quot;. Duriez's biography struck me as probably better in audiobook form that it would be in book form; it's more a conversational introduction than a deep dive into Sayers's life.</p><p><b>Favorite Passage:</b></p><p></p><blockquote><p>'I wish,' said Harriet, a little irritably, for she strongly disliked being lectured about her duties and being thus prevented from attending to them, 'you wouldn't always talk about &quot;a&quot; child, as if all children were alike. Even my three are all quite different.'</p><p>'Mothers always think their own children are different,' said Miss Quirk. 'But the fundamental principles of child-psychology are the same in all, I have studied the subject. Take this question of punishment. When you punish a child -- '<br></p><p>'<b>Which</b> child?' (p. 115)</p></blockquote><p></p><p><b>Recommendation: </b> Recommended.</p><p>*********</p><p>Dorothy L. Sayers, <i>Striding Folly</i>, New English Library (London: 1977).</p>"
}