{
  "title":"Fallacies of Distribution",
  "date":"2022-10-27T02:18:55.673000Z",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-613533606679485459",
  "link":"http://branemrys.blogspot.com/2022/10/fallacies-of-distribution.html",
  "content":"<p>William Stanley Jevons, in his <i>Elementary Lessons in Logic</i> (Chapter XIX), notes that certain fallacies concerned with conditionals in propositional logic correspond to certain fallacies in syllogistic logic. For instance, one such conditional fallacy is the <i>fallacy of affirming the consequent</i>, e.g.,</p><p>If the iron is impure, the iron is brittle.<br>The iron is brittle.<br>Therefore the iron is impure. [INVALID]</p><p>This corresponds as an argument to:</p><p>All the impure iron is brittle iron.<br>The iron is brittle iron.<br>Therefore the iron is impure iron. [INVALID]</p><p>The categorical syllogism is guilty of a specific fallacy, <i>the fallacy of the undistributed middle</i>. And this will be found to be quite general: Whenever the hypothetical syllogism is guilty of the the fallacy of affirming the consequent, the categorical syllogism is guilty of the fallacy of the undistributed middle, and vice versa.</p><p>Likewise, we find this works with the <i>fallacy of denying the antecedent</i>:</p><p>If the iron is impure, the iron is brittle.<br>It is not true that the iron is impure.<br>Therefore it is not true that the iron is brittle. [INVALID]</p><p>This corresponds to:</p><p>All the impure iron is brittle iron.<br>The iron is not impure iron.<br>Therefore The iron is not brittle iron. [INVALID]</p><p>In this case, the categorical syllogism suffers from the <i>fallacy of the illicit process of the major</i>.  This too will be found to be general: When the hypothetical syllogism involves the fallacy of denying the antecedent, the corresponding categorical syllogism involves the fallacy of illicit major. </p><p>Jevons doesn't pursue this matter further, but there is another correspondence. Here is an example of a conditional fallacy that doesn't usually have a name, although we might call it the <i>fallacy of false chaining</i>:</p><p>If the iron is impure, the iron is brittle.<br>If the iron is impure, the iron is unsuitable.<br>Therefore if the iron is brittle, the iron is unsuitable. [INVALID]</p><p>The categorical fallacy corresponding to false chaining is well known; it is the <i>fallacy of the illicit process of the minor</i>. Thus:<br></p><p>All the impure iron is brittle iron.<br>All the impure iron is unsuitable iron.<br>Therefore all the brittle iron is unsuitable iron. [INVALID]</p><p>The correspondence is quite general: Whenever the hypothetical syllogism commits false chaining, the corresponding categorical syllogism commits illicit minor, and vice versa.</p><p>These correspondences arise from the general correspondence of conditional propositions with universal affirmative propositions. As Jevons notes, any conditional proposition can be reduced to a universal affirmative proposition (although we have to be careful sometimes about interpretation). Indeed, the correspondence is essential to the predicate calculus, although the predicate calculus goes the opposite direction of Jevons and reduces universal affirmative propositions to conditional propositions.</p><p>The three categorical fallacies are all fallacies of distribution. According to the principles of distribution, universal affirmative propositions all have distributed subjects and undistributed predicates. In any categorical syllogism, (1) the middle term must be distributed at least once; (2) if a term is distributed in the conclusion, it must be distributed in the premises. Violating the first rule gives you undistributed middle; violating the second rule gives you either illicit minor (if the term distributed in the conclusion is the subject term) or illicit major (if the distributed term in the conclusion is the predicate term).</p><p>I've mentioned all this before. However, it's also true that, since conditional propositions can be converted to disjunctive propositions, if we are interpreting the former as material conditions, so we can find corresponding fallacies with disjunctive syllogisms. One common disjunctive fallacy is the <i>fallacy of affirming a disjunct</i>:</p><p>Either the box is on the shelf or the store was closed.<br>The box is on the shelf.<br>Therefore it is not true that the store was closed. [INVALID]</p><p>&quot;Either the box is on the shelf or the store was closed&quot; is translated into conditionals as &quot;If it is not true that the box is on the shelf, the store was closed; and if it is not true that the store was closed, the box is on the shelf.&quot; In this case the corresponding conditional argument is:</p><p>If it is not true that the box is on the shelf, the store was closed.<br>The box is on the shelf.<br>Therefore it is not true that the store was closed. [INVALID]</p><p>This means affirming a disjunct corresponds to denying an antecedent, and thus corresponds to the fallacy of illicit process of the major. However, notice that, because you actually translate the disjunction into two conditionals, affirming a disjunct <i>also</i> corresponds to affirming the consequent and thus to the fallacy of undistributed middle.</p><p>The disjunctive fallacy corresponding to illicit process of the minor seems not to have a name. An example:</p><p>Either the box is on the shelf or the store was closed.<br>Either the box is on the shelf or Christmas is coming.<br>Therefore, either Christmas is coming or it is not true that the store was closed. [INVALID]</p><p>That sounds quite odd, but the conclusion is equivalent to 'If the store was closed, Christmas is coming', and one can imagine making the error in this form:</p><p>Either the box is on the shelf or the store was closed.<br>Either the box is on the shelf or Christmas is coming.<br>Therefore if the store was closed, Christmas is coming. [INVALID]</p><p>Traditionally, distribution has usually been understood as indicating whether a term is in a position that requires it to cover the whole of that which it indicates. For instance, in &quot;All human beings are mortal&quot;, &quot;human beings&quot;, by being made a subject term in a universal proposition, is made to apply to every human being. We could reverse that and say that every human being is relevant. However, &quot;mortal&quot; isn't being made to apply to everything mortal (mortal cats are irrelevant to the proposition, for instance). Since propositions don't have extensions in this way, this doesn't carry over. But the original idea for distribution seems to have been mereological. To say &quot;All human beings are mortal&quot; was seen as corresponding to something like &quot;The extension of 'human being' is part of the extension of 'mortal'&quot;. Likewise, the conditional, &quot;If it's a human being, it's mortal&quot;, would correspond to &quot;The situations described by &quot;it's a human being&quot; are part of the situations described by &quot;it's mortal&quot;&quot;. A universal subject term is like a part of a whole; an antecedent in a conditional is also like a part of a whole. The affirmative predicate term is like a whole to which a part is assigned -- that on its own doesn't require that the part includes everything in the whole. Likewise with the consequent of the conditional.<br></p>"
}