{
  "title":"High Tea",
  "date":"2022-11-10T01:43:27.798000Z",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-7136001866772932591",
  "link":"http://branemrys.blogspot.com/2022/11/high-tea.html",
  "content":"<p> Every so often, you get accidental clusters of similar events and, as it happens, in three different places in the past two weeks I have come across people getting the usage of 'high tea' wrong. This is, after confusing peerage titles and feudal titles, one of the most common Americanisms that seems to spread everywhere. So a few quick points related to 'high tea'.</p><p>(1) The first and most important is that high tea is not fancy. High tea gets its name from being 'high' in the afternoon or even into the evening; it was originally a working-class tea for people who had to work until 5 pm or later. Despite its working class origins, it become common in general, because almost everybody has situations where they can't take tea until late, and because travelers and guests would often arrive fairly late in the day, so it became a common form of quick-bite-to-eat hospitality. As such, it's usually a simple tea meal, consisting basically of tea with both a savory (like ham salad sandwich) and a sweet (like bread and jam) snack. </p><p>(2) The fancy tea can sometimes be called low tea, but is usually just called afternoon tea. It usually has a nice spread of tea sandwiches, scones, cakes, tea biscuits, and the like. It's a nicer tea than high tea in the sense that it is more social and less utility-driven, but, strictly speaking, it does not have to be formal. A cream tea, for instance, is basically just tea and some scones (with clotted cream or Devonshire cream, hence the name). However, when people talk about 'high tea' in American movies, television shows, and novels, they almost always mean formal afternoon tea. Formal afternoon tea is a tea for a tea party, a special-occasion light meal for a group; for the past century, it's almost always something taken at a hotel. You typically have to dress up for it. The most common formal afternoon tea in the United States is the debutante tea occasionally hosted by women's organizations for younger women.</p><p>(3) The fanciest form of afternoon tea, though, is arguably not formal afternoon tea but dancing tea, or tea dance, which is a full-scale party with music and dancing. Just as a tea is a light meal, so a dancing tea is a light dancing party, well short of a formal dance; you'd do the dancing in a garden or drawing room rather than a ballroom, and the tea meal itself would be handled like a buffet. </p><p>Needless to say, there can be, and have been, all sorts of variations. The kettle drum, for instance, was a form of very informal afternoon tea party that became popular for a while in the eighteenth century; it was basically just a dropping-in kind of tea, as people would come by without much formality, mingle and talk a bit, and then leave when they felt like it. Lots of other variations exist, particularly if you look at local modifications throughout the Commonwealth. But a high tea is an informal tea for after work or at the end of a long day.</p>"
}