{
  "title":"Dashed Off XXVII",
  "date":"2022-11-12T05:43:44.681000Z",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-931495232099524158",
  "link":"http://branemrys.blogspot.com/2022/11/dashed-off-xxvii.html",
  "content":"<p>This begins the notebook that was started in December 2021.</p><p><i>****** </i></p><p><i>incipit/desinit as constructed by comparison of changes</i></p><p><i>Metaphysics 1056b4-5: If 'many' is placed in contrariety to 'one', impossible things follow.<br>1056b33-35: &quot;The one is opposed to the many as measure is to measurable.&quot;</i></p><p><i>the child &quot;guided by the inner teacher&quot; (Montessori)</i></p><p><i>the joy of strolling as a mild exercise in learning</i></p><p><i>the charm of social life as diversity of people in harmonious interaction</i></p><p><i>Historically, secularization is always accompanied by (but not caused by) a kind of atrophy of reason.</i></p><p><i>the regrounding or re-radicating of passions and virtues as part of evangelism</i></p><p><i>barbarism as &quot;the absence of standards to which appeal can be made&quot; (Ortega y Gassett)</i></p><p><i>beauty as something that invites thought</i></p><p><i>Acts 4:31 -- filled with the Holy Spirit and spoke the Logos of God boldly</i></p><p><i>Simple ethical actions are signs and symbols of greater ethical actions.</i></p><p><i>Faith may express itself in the midst of any and all of the passions.</i></p><p><i>Fortune favors the diversifier.</i></p><p><i>Nothing can be discovered out of nothing.</i></p><p><i>In scholarship as in all else, nothing is made from nothing.</i></p><p><i>Sovereignty must itself be a kind of right, or it is not sovereignty.</i></p><p><i>To arbitrate disputes presupposes the authority of reason.</i></p><p><i>Bentham's &quot;Anarchical Fallacies&quot; and &quot;The Necessity of an Omnipotent Legislature&quot; as laying out the real structure of utilitarianism</i></p><p><i>the monitorial system of education<br>the method of learning by teaching<br>plastic platypus learning</i></p><p><i>teaching structures: professional, monitorial, democratic<br>learning structures: receptive, apprenticed, autonomous ?<br>-- a school is a combining of a teaching structure with a learning structure</i></p><p><i>Athanasius Kircher gets a lot of flak, but it's often forgotten that Kircher's view was that hieroglyphics can't actually be translated -- his paraphrases are not intended as translations in the proper sense. And he did recognize that there could be a phonetic value for a hieroglyph, the foundation of later work, and he was the first to recognize that Coptic was related to demotic; both of these were elements necessary to the actual discovery of how to read hieroglyphs.</i></p><p><i>Hieroglyphs are complicated by the existence of honorific transposition -- divine things, like the solar sign, are elevated or moved to the front out of respect.</i></p><p><i>progress as converting genius to method</i></p><p><i>the 'link' between the I and the eye</i></p><p><i>Dates for the 'Fall of Rome'<br>[Fall of Republic]<br>31 BC -- Actium <br>27 BC -- Principate<br>[Fall of Empire]<br>---[Fall of Caesarean Empire]<br>180 -- Death of Marcus Aurelius and Succession of Commodus<br>312 -- Conversion of Constantine<br>378 -- Adrianople and Death of Valens<br>410 -- Sack of Rome by Visigoths<br>455 -- Sack of Rome by Vandals<br>476 -- Sack of Rome and Deposition of Romulus Augustulus by Odoacer<br>---[Fall of Byzantine Empire]<br>1204 -- Latin Sack of Constantinople in Fourth Crusade<br>1453 -- Ottoman Conquest of Constantinople<br>---[Utter End]<br>1806 -- Last Holy Roman Emperor <br>1917 -- Last Czar<br>********<br>All of these are right; Republics and Empires are many-layered things, and with each, something important was stripped away and sometimes replaced.</i></p><p><i>All falls of nations are either defeat by external force, defeat by internal force, or moral corruption. Nothing else is actually any kind of fall at all. Declines are likewise multiplications of problems related to these.</i></p><p><i>If we think of myth as meaning-making story, we can ask what the myth would be that is commensurate with human life.</i></p><p><i>There are clearly multiple ways to assess disparate impact and no reason to think they would all agree; thus one should always ascertain the relevant standard.</i></p><p><i>Economies arise out of communications.</i></p><p><i>visible shapes as color-dependent, tangible shape as resistance-dependent<br>-- The key question: Do we perhaps link these by a sense of color (at least sometimes) being resistant to the eye? Or is it something else like constant conjunction or abstract analogy?</i></p><p><i>acquired dispositions of institutions -&gt; institutions having a quasi-character, and thus quasi-virtues and quasi-vices</i></p><p><i>Anyone who truly loves virtue will love divinity, its exemplar.</i></p><p><i>plot-focused ethical reasoning vs. episode-focused ethical reasoning</i></p><p><i>Nations rise from small springs and fall in cataracts small and great.</i></p><p><i>trace-fossil formation and the major genera of trace fossils<br>(1) left in soft-sediment surface: Cubichnia<br>(2) dwelling structure formation (e.g., burrowing or boring): Domichnia<br>(3) sediment disturbance in deposit-food search: Fodinichnia<br>(4) surface disturbance in grazing-food search: Pascichnia<br>(5) locomotion: Repichnia<br>[These are Seiacher's and account for most trace fossis , but there are others, e.g., Colichnia, arising from making structures for breeding activities, like bee cells), and people propose others from time to time.]</i></p><p><i>the palaetiology of ideas<br>arguments as environments of ideas<br>ideas as undergoing selection within argumentational environments<br>manifest contradictoriness or impossibility in a context // extinction</i></p><p><i>Multiplicity can in a certain fashion be attributed to the noncomposite by expression (how it is reflected, received, etc., or by assumption).</i></p><p><i>geometrical diagram as speech act: locution (line and circle), illocutionary force (interpretation), perlocutionary effect (for illustration or for proof)</i></p><p><i>Tengwar and Lodwick's Universal Alphabet</i></p><p><i>word, as quasi-form, structuring world, as quasi-material</i></p><p><i>The ebook is a more fragile, not a less fragile, technology, than a codex or scroll, and whether it is more or less accessible depends on environmental factors, not itself.</i></p><p><i>the 'practical minimum of concession' as a key idea in planning</i></p><p><i>Skepticism requires that we be able to say that such-and-such does not appear to have sufficient ground or reason.</i></p><p><i>One often finds in theology that one doctrine serves as an allegory for another.</i></p><p><i>Poorly analyzed experiments are worse evidence than trustworthy anecdotes.</i></p><p><i>arrow of time // dominance of matter over antimatter</i></p><p><i>The meaning of a myth depends in part on its ritual context.</i></p><p><i>the economy of myths -- myths are one of the things we exchange</i></p><p><i>Academic papers are not primarily research instruments but career instruments.</i></p><p><i>pandemics and defense-in-depth</i></p><p><i>Cuisines spread by 'fast-food-izing'.</i></p><p><i>the moral-juridical presence of Christ in the sacrament of reconciliation</i></p><p><i>being married before God as the base for the presence of Christ in the sacrament of matrimony</i></p><p><i>Christ's Baptism as a symbol of His Incarnation.</i></p><p><i>repentance unto friendship</i></p><p><i>&quot;A martial nobility and stubborn commons, possessed of arms, tenacious of property, and collected into constitutional assemblies, form the only balance capable of preserving a free constitution against the enterprises of an aspiring prince.&quot; Gibbon<br>&quot;The principles of a free constitution are irrecoverable, lost, when the legislative power is nominated by the executive.&quot;<br>&quot;In elective monarchies, the vacancy of the throne is a moment big with danger and mischief.&quot;<br>&quot;Wit and valour are qualifications more easily ascertained than humanity or the love of justice.&quot;<br>&quot;But the power of instruction is seldom of much efficacy, except in those happy dispositions where it is almost superfluous.&quot;<br>&quot;Of all our passions and appetites, the love of power is of the most imperious and unsociable nature, since the pride of one man requires the submission of the multitude.&quot;</i></p><p><i>All lovers are fighters.</i></p><p><i>symbolism &amp; allegory : virtue ethics :: critical exegesis : deontology :: x : consequentialism</i></p><p><i>'artfully to collect in his own person all the scattered rays of civil jurisdiction'</i></p><p><i>consular powers<br>(1) superintendance of ceremony<br>(2) levy and command of legions<br>(3) reception of ambassadors<br>(4) presidence in assembly, both senatorial and popular<br>tribunitian powers<br>(1) veto<br>(2) convene plebeian assembly<br>(3) summon senate<br>(4) propose legislation</i></p><p><i>One of the most important goals in constitutional law is to force things into visibility -- literally anything can be abused by human ingenuity, but it is harder to abuse them in full light of day.</i></p><p><i>emperor (imperator): general + consul + tribune + censor + pontiff</i></p><p><i>One cannot properly understand the Church as People of God without understanding it as societas perfecta.</i></p><p><i>Solidarity primarily works by other routes than obligation.</i></p><p><i>immersed life, study, reparative reconstruction</i></p><p><i>The Genesis creation story places God before all the cosmogonical origins and supposed divinities of pagan myth.</i></p><p><i>the Shabaka Text ('Memphite Theology'): thought -&gt; word -&gt; world<br></i></p><p><i>grace as participation in divine missions</i></p><p><i>Law intrinsically applies a higher rational order than itself.</i></p><p><i>law as humanitarian tradition -&gt; human common good -&gt; God as primal good</i></p><p><i>'this rational and bloodless sacrifice, for our own sins and for the ignorance of the people'</i></p><p><i>Empathy can be valuable, but it is not itself good judgment.</i></p><p><i>Boredom sometimes repulses us more than pain.</i></p><p><i>constant polynomial : s orbital :: linear polynomial : p orbital :: quadratic polynomial : d orbital :: cubic polynomial : f orbital</i></p><p><i>the transcendental unity of the history of philosophy</i></p><p><i>Forgiveness is not a release of resentment; the latter is sometimes a removal of an impediment to forgiveness, but one can forgive where there is no resentment at all, and release resentment without forgiveness.</i></p><p><i>Nobody confines their forgiveness to people who deserve it, if only because we are often not well positioned for assessing whether they deserve it.</i></p><p><i>No one has a right to be forgiven, but no one can be charitable without a willingness to forgive.</i></p><p><i>Forgiving is never condoning -- they are completely opposed acts.</i></p><p><i>One reason to be ready to forgive is to avoid self-righteousness, which is one of the worse things that can befall a person.</i></p><p><i>Philosophy is per aliud wisdom participating per se wisdom, contingent wisdom participating necessary wisdom, etc.</i></p><p><i>Note that in Psalm 148, the angels and host are put before sun, moon, and stars. (Compare Turretin on this.)</i></p><p><i>Ps 148:5 -- &quot;he commanded and they were created&quot;</i></p><p><i>the sentiments of the people vs the professions of the people</i></p><p><i>Moving from sets to categories emphasizes functions over membership/inclusion.</i></p><p><i>the classic problem of organizational ethics: good intentions deteriorating the ethically constrained functioning of the system</i></p><p><i>Marriage is not a commitment but a union.</i></p><p><i>finality as a transcendental</i></p><p><i>Possibilities are represented in myths as other places or other times.</i></p><p><i>&quot;Had it not been love which is the basis of all relationships, it was impossible to promote peace, respect others. In fact, meaningful life on earth would have been impossible.&quot; Mawere</i></p><p><i>fantasy and the literalization of striking metaphors</i></p><p><i>A very great deal of Chinese Imperial history seems to consist of the Confucians losing whenever they were most clearly and inconveniently right.</i></p><p><i>generic experience, structured experience, directed experience, participative experience</i></p><p><i>Every giving creates signs: giving as the root of semiosis.</i></p><p><i>As the Incarnation was made possible by the Virgin's Yes, so too every Eucharist morally depends on her Yes.</i></p><p><i>As Israel in suffering was sign of Christ in Passion, it therefore was also the sign of Christ in Eucharist.</i></p><p><i>Crucifixion - Session - Mass as one act of sacrifice (morally, juridically, and really)</i></p><p><i>'deism of the Cross' in certain accounts of Christ's sacrifice</i></p><p><i>contracts as agreeing on ways to express one's rights<br>-- this is the correct idea that social contract theory misplaces</i></p><p><i>The senses do not distinguish substance and accident at all; when we recognize that accidents require substances, we are not starting with an experience of accidents and concluding to substances beyond them, but starting with an experience of accidents-in-substances and concluding to substance within it.</i></p><p><i>partial substance (hand)<br>substance (man)<br>supersubstance (cosmos)</i></p><p><i>Aquinas's use of mereological terminology to organize virtues works because the part-whole relation is relativity without separation.</i></p><p><i>incomplete induction as credibility-lending</i></p><p><i>more-and-less as hypercategorical</i></p><p><i>hypercategorical transcendental : convertible transcendental :: change (incomplete act) : actuality (complete act)<br>-- this is a conjoined rather than separate analogy, because change is hypercategorical and actuality is convertible</i></p><p><i>three kinds of evidence:<br>actuality anticipative of actuality<br>actuality reminiscent of actuality<br>actuality suggestive of actuality</i></p><p><i>common good : Matthew :: subsidiarity : Mark :: human dignity : Luke :: solidarity : John</i></p><p><i>Freedom of conscience does not have to be asserted and vindicated for everybody because matters to which conscience is applied are not all the same in their relations either to conscience or to freedom; a finer-grained analysis is necessary.</i></p><p><i>the right to religious freedom (Dignitatis Humanae)<br>(1) all should have [some kind of] immunity from coercion in religious matters<br>(2) that no one should be forced to act against conscience in religious matters within due limits [i.e., as long as due public order is preserved]</i></p><p><i>Human dignity, solidarity, subsidiarity, and common good are four ways human beings are not separate from each other.</i></p><p><i>Because of Adam's sin, our dignity is mixed with baseness, our solidarity with discord, our subsidiarity with rebellion, and our common good with mutual temptation.</i></p><p><i>Parenthood begins prior to birth; this is much more important than usually recognized.</i></p><p><i>If mathematics or logic are ever explanatory, there must be real formal causes.</i></p><p><i>To deny the principle of sufficient reason is to hold that there are possibilities that are not any kind of possibility, and are thus unspecifiable.</i></p><p><i>Liberty is protected by mediating institutions.</i></p><p><i>choices as pure formal means</i></p>"
}