{
  "title":"Evening Note for Saturday, October 22",
  "date":"2022-10-23T17:23:35.996000Z",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-7122858040188358884",
  "link":"http://branemrys.blogspot.com/2022/10/evening-note-for-saturday-october-22.html",
  "content":"<p> <b>Thought for the Evening: Pseudoplots</b></p><p>Aristotle in the <i>Poetics</i> famously identifies six poetic parts of tragedy: plot (<i>mythos</i>), character (<i>ethos</i>), thought (<i>dianoia</i>), diction (<i>lexis</i>), melody (<i>melos</i>), and spectacle (<i>opsis</i>). Of these, plot is the fundamental to the narrative, the first principle and soul of tragedy, as Aristotle puts it. Indeed, Aristotle's word for plot, <i>mythos</i>, just means 'story', particularly a story that clarifies or explains the nature of something. There are many things that can be called 'narrative' or 'story', but <i>mythos</i> is story in its purest and most perfect form. We have plot when we have the  plausible ordering of a complete action, with beginning, middle, and end, involving a complication that is turned into a resolution. In a tragedy, the <i>mythos</i> would literally be the myth of the gods or heroes that you are trying to tell. It is distinct from the chronological presentation of the narrative -- famously, the optimal way of beginning an epic is <i>in medias res</i>, in the middle of the plot, in the midst of the substance of the story -- but to have a <i>mythos</i> you need an identifiable beginning, middle, and end, regardless of the order in which you happen to be presented them.</p><p>Plots in the proper sense are very, very, very difficult to construct in a sophisticated way. Many genuinely great literary works have a very minimal plot, relying mostly on episode, that is, the material with which one fills the structure of the story. Aristotle captures this in his analysis of the plot of the long, sprawling narrative of <i>The Odyssey:</i> A man has been abroad a long time; he is trying to get home but Poseidon is opposed to him; meanwhile at home, his wealth is being wasted and his son's death is being plotted by men trying to marry his wife; after terrible suffering, he finally comes home; there he reveals himself and saves himself by killing his enemies. &quot;All the rest,&quot; Aristotle says, in what I firmly believe is an example of the dry sense of humor that comes through even in lecture notes like the <i>Poetics</i>, &quot;is episode.&quot; Homer had to pull together a very large number of episodes to construct a plot you can tell in a few lines. </p><p>I said above that there are uses of the term 'narrative' or 'story' that are not the same as <i>the</i> story that we find in plot, and one of the very common problems people today have in writing is that they are constantly confusing plots with something that is not a plot at all -- namely, a <i>character arc</i>. Unsurprisingly, character arcs belong not to the plot but to the character element of the narrative, but they do have a narrative structure: the character starts out one way and through responses to events ends up another way. Character arcs are, as Aristotle would put it, episode, not plot. Indeed, we can describe a character arc as a series of episodes ordered in such a way as to make sense of a change in attitude or motivation. You can have very good stories with no character arcs at all, because plot does not depend on character arc. The reverse is closer to being true: a character arc is built by ordering the response of the character to actions and events, and thus in stories with a plot, the character arc just is the character's response to the action of the plot. You can indeed have character arcs that are detached from the plot, and these are not uncommon in highly episodic forms of narrative, like TV shows. Even such character arcs, if genuinely well constructed, suggest at least the ghost of a plot, however.</p><p>Because a very large portion of the narrative art that people read and watch today is highly episodic, people today commonly confuse plot and character arc. This is one reason, I think, for the proliferation of badly constructed stories. Plot, again, is very difficult to construct properly; truly good writers sometimes struggle with it. If you can't tell the difference between plot and character arc, though, the task becomes literally impossible. On the other end, people who can't tell the difference between plot and character arc are practically shut out of an entire aspect of the narrative, which means that their judgments of the quality of a narrative are defective. They would contest that claim, of course, but in reality, you have only to look at the result of such writers and such an audience. In such narratives, events happen so that the character can do what the writer wants the character to do. If the narratives rely on a few events or on very ordinary events, this is not necessarily fatal -- your narrative, properly developed, still then has a chance of being an excellent character study, and that's not a small thing. You can have a great story, in a broad sense of the term, without much that is the story, in the sense of a proper plot. </p><p>However, the bolder the events get, the more you court disaster. This results in the widely recognized problem of narratives that end up being a string of incoherent, implausible, impossible, or absurd events. A problem with the recent <i>Rings of Power</i> television series is precisely that Season 1 is held together not by a plot but by Galadriel's character arc, with the result that the events make no sense as a whole because a character arc simply cannot do what a plot does. This contrasts with, say, <i>Babylon 5</i>, a work of art in which the distinction between plot and character arc is well respected. That series has a well-defined plot both by season and as a series, its episodes are tightly plotted (i.e., a very large portion of episodes contribute something to the construction of that plot), and, as an ensemble story, the responses of various characters to the action of the plot constitutes multiple character arcs moving through that well-defined structure. The character arc of (to take just one example) G'Kar is not the plot of <i>Babylon 5</i>, but it is immensely satisfying because the plot guarantees that everything in the character arc makes complete sense; on the other side, the weaving of that character arc through a well-defined plot framework does a great deal to bring the story home and give us personal investment in it.</p><p>Character arc, then, is a pseudoplot that arises from the interaction of one part of the narrative, character, with the plot, or at least the kinds of action or actions that in competent hands would serve as the materials of an actual plot. This raises the question of whether there are other kinds of plot-like non-plots, <i>pseudomythoi</i>, arising from the interaction of the other poetic parts with plot or at least the materials for plot. When we ask this question, I think it becomes obvious that there are, and indeed, we talk about them sometimes.</p><p>Melody (<i>melos</i>) literally means something like musical phrasing, and obviously music is multifarious. However, we do speak of music narratively. That you can have music with narrative structure is knowledge so old we do not know when it was discovered; since the Viennese Golden Age, much of our music has been deliberately designed to have something like a narrative structure, to such an extent that music that definitely has no narrative structure sometimes sounds odd to our ears. This just means that music can easily be part of a narrative. But in being part of a narrative, <i>melos</i> can interact with <i>mythos</i> to create a pseudoplot. This is something with which we are very familiar, since one of our most popular modern arts, cinema, makes extensive use of it, and even gives us a name for it: <i>soundtrack</i>. It consists in the musical response to the action or actions of the narrative. We are, thankfully, prevented by a number of things from confusing plots and soundtracks, although you can have narrative held together by soundtrack -- perhaps the most famous and successful example in cinema being Disney's 1940 film, <i>Fantasia</i>. In such a case your narrative doesn't hang together much as a story, but it can still be an excellent study of musical change and mood. As with character arcs, though, soundtrack achieves its perfection in subordination to plot, and for the same reason: the plot makes the soundtrack intelligible, the soundtrack makes the plot sensible.</p><p>As with melody, spectacle (<i>opsis</i>), which literally means a view or appearance, interacts with action or actions to build a plot-like non-plot. Cinema is a field in which this has at times been taken almost to perfection. In a movie, we are not usually seeing events as we would see them; rather, we are getting fragmented showings of things -- scenes -- that are distinct of themselves. This makes the narrative more manageable as to time and space (a continual problem in cinema), and makes it possible to show things that are not amenable to straight viewing. However, sharp, jarring transitions between distinct scenes cause problems -- nobody has a problem with transition as such, but something has to bind both sides of the transition together. So competent directors attempt to create a visual narrative that is continuous through the scenes, or at least one that is conveyed by visual patterns and recurrences across scenes. The most basic are things like panning the camera; various fades and cuts give a way to make the transition in a way appropriate to the story; when scenes are set up visually, the end of one scene often has at least a token something-or-other that is visually in common with another scene. And of course, one does not merely use the visuals to maintain continuity, one uses them to support the story. Steven Soderbergh, when he tries to explain this, makes use of a version of <i>Indiana Jones and the Raiders of the Lost Ark</i>, cutting out all the sound. When you do that, you still get a narrative, despite losing a lot of information about the plot: the visuals are at all times very clear and striking and the transitions are smooth and give a sense of being carried forward in a narrative despite the fact that the scenes are representing all sorts of different locations. <i>Raiders of the Lost Ark</i> would be a masterpiece of spectacle pseudoplot even if we lost the sound, did not know the plot beforehand, and only had extended fragments without context.</p><p>You'll notice I skipped two of the parts, thought (<i>dianoia</i>) and diction (<i>lexis</i>). Novels and television shows guarantee that we know about character arcs; cinema has proven conclusively that there are soundtracks and spectacle pseudoplots. But while thought is certainly part of all of these, arts with a clear and obvious dianoetic pseudoplot are somewhat difficult to find -- it just seems harder to see the thematic narrative than a character arc, for instance. Nonetheless, while it's not always obvious, we can with some care recognize them in novels, television shows, plays, and movies. Dianoetic pseudoplots have a problem-solution structure, and the plot-likeness comes from how these are broken up into stages. <i>The Lord of the Rings</i> has a plot that is about taking the Ring to Mount Doom; it has a thematic narrative concerned with the problem of pride and its resolution in friendship and pity. </p><p><i>Joe versus the Volcano</i> is a movie with an unusually robust dianoetic pseudoplot or thematic narrative: People who do not know who they are cannot make real personal connections, but knowing who you are seems to be something we develop through real personal connection. That is the thematic problem. The thematic solution is ultimately doing something great with our life in a way that overlaps with someone else's doing something great with their lives, and the full resolution of the problem -- two people knowing who they are in a real personal connection -- is symbolized by the actual jump into the volcano. But this solution and resolution is built in stages: Joe is shocked into recognizing that he can't bear to die without having done something truly bold, then he interacts with three women. The three women are all very similar -- the first two are the not-quite-rights in the personal connection for which he is searching -- and there is a building progression among them that corresponds to and reflects Joe's own building progression in solving the problem: the woman whose bold act is just to say yes to a date, the woman whose bold act is expressed in her (derivative) style and art, the woman who is sailing on the ocean, all of them facing the same problem as Joe at a given stage.</p><p>Diction pseudoplots are harder yet, in part because I think diction is much more closely linked to character than to plot, but I think we do see them -- narratives sometimes shift in tone. I think this is most visible in epics, in part because they give us so much material to work with. We see this in <i>The Lord of the Rings</i>, again: we move back and forth from colloquial and sublime styles. Diction also helps express mood, so we get shifts of mood depending on the kinds of situation through which the action runs. </p><p>I recently re-watched <i>The Expanse</i> and am currently going through audiobook versions of the books. The books have some advantages over the series, but one point on which the television series has so far done much better than the books is on the lexical narrative. There is some variation in the narrator-voice, presumably because of how the book was written -- James S. A. Corey is actual two co-authors who work out a basic story together, then divide it up into chapters with viewpoint characters, each author taking different characters, after which they revise cooperatively -- but it doesn't really progress at all, and the diction of the books is remarkably flat. One aspect of this that I find a little jarring is that characters rarely modulate their cursing according to situation. I don't care how far in the future we go, watching your language around people on whom your livelihood or status depends is universal. The only one who really noticeably does this, though, is Chrisjen Avasarala when talking to her superiors -- and since she doesn't have many superiors, that is not often. I know oil toughs and rednecks who have a better sense of when and how and in what company to swear than most of the characters. The series toned down the swearing, no doubt for practical reasons, and one of the results is that the lexical narrative makes much more sense -- people swear with people they know, they swear in moments of intensity, and while Avasarala still swears like a sailor in inappropriate situations, she's the only one who does, and it highlights both her status (she can get away with it) and her frankness (she speaks her mind) and the fact that she's often talking to people about extremely serious situations (the swearing makes sense in context). And because people aren't swearing so much, it's easier to distinguish manners of talking and how they relate to the events that are happening. That's a small lexical point in works that have a lot of speech, but it shows how the lexical narrative works: different ways people talk are like the conversational soundtrack.</p><p>There are many complications that arise with all of these pseudoplots. But, in any case, this is enough to establish their existence.</p><p><br></p><p><b>Various Links of Interest</b></p><p>* &quot;The Neglected Books Page&quot; <a href=\"https://neglectedbooks.com/?p=9271\">looks at Sigrid Undset's early novel, <i>Jenny</i></a>.</p><p>* Sacheen Littlefeather was famous as a Native American celebrity and activist, but information has come to light that suggests that she was not Native American at all. Jacqueline Keeler, a Navajo writer who has been investigating the phenomenon of non-Indians pretending to be Indian, <a href=\"https://www.sfchronicle.com/opinion/openforum/article/Sacheen-Littlefeather-oscar-Native-pretendian-17520648.php?utm_campaign=CMS%20Sharing%20Tools%20(Premium)&amp;utm_source=t.co&amp;utm_medium=referral\">lays out the reasons to think this the case</a>. She has family members who claim it was made-up, there is no record of her family having any connection with the Apache, and some of the claims she made don't seem to fit the facts.</p><p>* Amrouche Moktefi &amp; Jens Lemanski, <a href=\"https://philarchive.org/rec/MOKOTO\">On the Origin of Venn Diagrams</a> (PDF)</p><p>* David Landy, <a href=\"https://philarchive.org/rec/LANISA-2\">Is Shepherd a Bundle Theorist?</a> (PDF)</p><p>* Greg Bamford, <a href=\"https://philarchive.org/rec/BAMFAF\">Function and Forethought in Design</a> (PDF)</p><p>* Eddy Keming Chen, <a href=\"https://philarchive.org/rec/CHETSO-31\">The Simplicity of Physical Laws</a> (PDF)</p><p>* Boris Hennig, <a href=\"https://philarchive.org/rec/HENAAM-3\">Aitiai as Middle Terms</a> (PDF)</p><p><br></p><p><b>Currently Reading</b></p><p>Thomas Joseph White, OP, <i>The Trinity: On the Nature and Mystery of the One God</i><br>John C. Wright, <i>The Vindication of Man</i><br>Christian Raab, OSB, <i>Understanding the Religious Priesthood: History, Controversy, Theology</i><br>Rod Girle, <i>Modal Logics and Philosophy</i><br>James S. A. Corey, <i>Caliban's War</i> (audiobook)</p>"
}