{
  "title":"Dashed Off XXVI",
  "date":"2022-10-29T03:04:42.093000Z",
  "author":"Brandon",
  "id":"tag:blogger.com,1999:blog-7193878.post-5446759200116491239",
  "link":"http://branemrys.blogspot.com/2022/10/dashed-off-xxvi.html",
  "content":"<p> This ends the notebook that was completed in December 2021.</p><p><i>rule of law: Plato, Laws IV 715d<br>Aristotle, Politics III.16 1287a</i></p><p><i>Lewis's principle of recombination obviously fails to respect any links between causation and modality.</i></p><p><i>What we love we take as a kind of end.</i></p><p><i>Confucius thinks we should practice ritual and music like rustics, in the sense that rustics perform their ritual and music with a view to their purpose, not to show.</i></p><p><i>Taxonomies are products of liberal and have grammatical, logical, and rhetorical features.</i></p><p><i>algebra as a structure of measurements, calculus as a structure of measurement processes</i></p><p><i>In general, empires fall from their successes.</i></p><p><i>Steno's Principles<br>I: &quot;If a solid body is enclosed on all sides by another solid body, of the two bodies that one first became hard which in the mutual contact expresses on its own surface the properties of the other surface.&quot;<br>II: &quot;If a solid substance is in every way like another solid substance, not only as regards the conditions of surface, but also as regards the inner arrangement of parts and particles, it will also be like it as regards the manner and place of production, if you except those conditions of place which are found time and again in some place to furnish neither any advantage or disadvantage to the production of body.&quot;<br>III: &quot;If a solid body has been produced according to the laws of nature, it has been produced from a fluid.&quot;<br>-- &quot;If, therefore, every solid has its accretions, at any rate, from a fluid, if bodies similar to one another in all respects were also produced in a similar way, and if of two contiguous solids that one first became hard which exhibits on its surface the characeristics of the other's surface, it will be easy, granted a solid and the place in which it is, to affirm something definite about the place of its production. And this, indeed, is the general question of a solid contained within a solid.&quot;</i></p><p><i>Steno's Principles of Crystalline Matter<br>I: &quot;A crystal grows while new crystalline matter is being added to the external planes of the crystal already formed.&quot;<br>II: &quot;This new crystalline matter is not added to all the planes but, for the most part, to the planes of the apex only, or to the terminal planes....&quot;<br>III: &quot;The crystalline matter is not added to all the terminal planes at the same time, nor in the same amount.&quot;<br>IV: &quot;An entire plane is not always covered by crystalline matter, but exposed planes are left sometimes toward the angles, sometimes toward the sides, and sometimes in the centre of the plane.&quot;</i></p><p><i>&quot;Whatever contributes anything to the production of any substance, does this either as place, or as matter, or as the agent.&quot; Steno, Prodromus<br>&quot;There are no other means in order to enjoy the real human happiness in this world than those taught by Our Lord, namely, to constantly live before God's eyes and to eradicate our vices with the help of a confessor.&quot; Steno, Op. Sp.<br>&quot;God does not ask us for lofty or difficult things, but for love.&quot; Steno, Ep. to Cosimo III, 21 June 1672</i></p><p><i>Gladiatorial combat seems to have arisen in the context of funerary rites.</i></p><p><i>FIND-SELECT games vs FIND-AVOID games<br>FIND-MATCH games vs. FIND-FIND-MATCH games vs. FIND-MATCH-FIND games</i></p><p><i>sport as ethical toy model</i></p><p><i>race as a distortion of the concept of tribe</i></p><p><i>In Etruscan paintings, men and women are often distinguished not by physical characteristics but by color -- women are pained white and men are painted red.</i></p><p><i>We partly measure special occasions by the work we put into them.</i></p><p><i>An ethics not conveyable in a story would be a very defective ethics.</i></p><p><i>Folk taxonomy is often more rigorous for its particular practical purposes than any taxonomy built for theoretical purposes.</i></p><p><i>kinds of classification<br>(1) placement under a label<br>(2) placement in a division<br>(3) placement in a hierarchy<br>(4) placement in a system of distinct hierarchies<br>-- all of these admit of simple or graded versions.</i></p><p><i>The Torah is never abrogated, only accomplished in that of which it is a sign. It never fails, but is fulfilled in Christ.</i></p><p><i>Geometry plays a large role in the ancient world in part because the notational system of geometry was vastly more flexible and powerful than an arithmetic notation without place value.</i></p><p><i>Geometrical lines must lack breadth or it massively complicates congruency.</i></p><p><i>Language is constantly emerging on the model of prior language.</i></p><p><i>The usefulness of language, like that of a physical tool, lies in its combination of mutability and stability.</i></p><p><i>-ly as a suffix in English was originally -like</i></p><p><i>'Do', 'go', and 'come' can cover practically every situation.</i></p><p><i>'Canons' in the literary sense arise from pedagogical bottlenecks.</i></p><p><i>A cause is like a genus for its effect.</i></p><p><i>John Mitchell, letter to Cavendish, 27 Nov 1783, read before the Royal Society, gives an early clear statement of something like a black hole (body with escape velocity greater than light) -- differs from relativistic conception in that it would still be escapable with sufficient acceleration.</i></p><p><i>categorical vs transcendental causes (w/ intellectual beings being examples of the latter)</i></p><p><i>The clicks of click languages are thought by some to be a form of avoidance/respect -- etiquette in a broad sense, in which one replaces by click or clicks over a name or word that should not be merely spoken; this is at least very likely in later emergences, like Bantu languages.</i></p><p><i>Languages mix by nature because communication itself is usually a mixing.</i></p><p><i>Everybody's knowledge of language is impressionistic.</i></p><p><i>Forms of advertising are driven more by what the seller fears than anything to do with the product or service.</i></p><p><i>a Christian approach to other religions<br>(1) identify analogies<br>(2) use allegorically<br>(3) qualify excesses<br>(4) repair deficiencies</i></p><p><i>Humility is hierarchical by nature, and has three aspects: willingness to be purified, willingness to be enlightened, willingness to be united with another (and ultimately God).</i></p><p><i>ren : seeking good :: yi : avoiding evil</i></p><p><i>All Christian papyrus manuscripts from the second-century are codices. (This is one of the reasons to think that the Christian community is a major cause of the spread of the format.)</i></p><p><i>&quot;making sense&quot; = reducible to a usable rule of thumb</i></p><p><i>Ejectives are often associated with mountain languages.</i></p><p><i>characteristic classification -&gt; type classification -&gt; prototype classification</i></p><p><i>writing as a symbiotic system with speech: writing allows revival, extends shelf-life of some linguistic features, etc.</i></p><p><i>forms of business ethics<br>(1) management ethics<br>(2) workplace ethics<br>(3) labor ethics</i></p><p><i>Julio-Claudian Formation -- solved Julius Caesar's problems<br>Year of Four Emperors -- problems unsolved by Julio-Claudians become unmanageable<br>Flavian Consolidation -- solved Julio-Claudian problems<br>The Five Good Emperors -- solved problems shown by Domitian, but could not establish solutions as stable</i></p><p><i>A fossil captures an interaction between an organism and its environment. This is most clear with trace fossils, but it is also true of body fossils; the interaction is just of a different kind.</i></p><p><i>&quot;For real wisdom does not merely cause us to know: it makes us 'be' in a different way.&quot; Hadot</i></p><p><i>Simia Qian on the Spring and Autumn Annals: &quot;It distinguishes what is suspicious and doubtful, clarifies right and wrong, and settles points which are uncertain. It calls good good and bad bad, honors the worthy, and condemns the unworthy. It preserves states which are lost and restores the perishing family. It brings to light what was neglected and restores what was abandoned.&quot;</i></p><p><i>&quot;Order is the arrangement of graded elements in which each is given its due.&quot; Grosseteste</i></p><p><i>Tidy schemes of grammatical gender always get broken by analogical extensions.</i></p><p><i>Things do not appear merely as present, but as traces of the past with potential for the future.</i></p><p><i>the sacraments qua signs of Christ's passion as pedagogy against the capital vices: e.g., Christ's sacrifice shows the remedy of humility, aspects of which are expressed in different sacraments -- the self-sacrifice in the eucharist, the compassion (solidarity) in matrimony, the patience in unction, the appeal to mercy in penance, etc.; and thus together they make a pedagogy against pride. And so with all others -- the remedy of self-giving against envy, the remedy of mortification against lust and gluttony, etc.</i></p><p><i>Study of the historical development of language is hampered by having no pre-writing analogue to fossilization.</i></p><p><i>standard language order (McWhorter)<br>SOV -- about 45% -- e.g., Bengali, Malayalam, Urdu, Latin<br>SVO -- about 42% -- e.g., Chinese, Dutch, English, Malay<br>OSV -- vanishingly small -- e.g., Warao, Xavante, Iamamadi<br>VSO -- about 9% -- e.g., Irish, Welsh<br>VOS -- about 3% -- e.g., Malagasy<br>OVS -- about 1% -- e.g., Apulas, Hixkaryana</i></p><p><i>the Wedding at Cana as the structure of Marian intercession: she intercedes with Christ, then directs us to Him</i></p><p><i>Lk 1:41 -- As an unborn baby, Jesus is first recognized by an unborn baby, John. The Word is incarnate of the Virgin Mary; Christianity begins in the womb.</i></p><p><i>Juxtaposing signs in and of itself raises the question of how they are related.</i></p><p><i>perceptual evidence: causal principle<br>inferential evidence: causal + abstract principle<br>testimonial evidence: causal + abstract + personal/ethical principle</i></p><p><i>Every effect implies a source (causation) not itself (remotion) more than adequate to explain it (eminence). (Merely adequate would just be direct transformation or continuity.)</i></p><p><i>To decipher an ancient writing is to rebuild, at least in model and idea, what makes a script useful and producible.</i></p><p><i>All known natural writing systems have phonetic signs, which are integratable with other signs when such signs are used.</i></p><p><i>A science like paleontology requires a very large amount of abstract infrastructure -- extant taxonomies, scientific theories from other sciences, ready chronologies, counterfactuals, etc. -- on which it must draw, often more directly than other sciences (which might, e.g., construct them on the fly).</i></p>"
}