{
  "title":"Never forget to check the basics",
  "date":"2021-08-30T05:27:54.000000-07:00",
  "author":"/u/blueskyn01se",
  "id":"t3_peh3bj",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/peh3bj/never_forget_to_check_the_basics/",
  "content":"<div class=\"md\"><p>I work for a company that provides a cloud communications platform as a service — developers can use our web service APIs to do a lot of neato stuff. I’m a tier 3 technical support engineer/developer — usually when a ticket makes it to our queue, advanced troubleshooting is needed. </p> <p>I suppose that’s how sometimes the team forgets to check off the basics of troubleshooting, and something like this goes over our heads. </p> <p>Got a user who couldn’t get our programmable chat API to work. By the time I got the ticket, two of my team members had already done some troubleshooting which included verifying and updating their SDKs, combing through our backend logs, and attempting to debug a snippet of their code. So far, no luck. </p> <p>I’m reading through the ticket history and one of the very first replies we got from this user was that everything had been working prior to their account being suspended. Now, I re-route a lot of account suspended tickets — I know that it happens a lot and usually account administration handles it without any fuss. It was totally fair to assume that they had gone through that team already and taken care of that puzzle piece. </p> <p>I did think it was odd however that neither of my team members had responded to that bit of information or referenced it again. My brain starts churning the gears — what exactly happens to our API keys when an account is suspended? It makes sense to me that they would become invalid, which would prevent future attempts to generate access tokens or to use our API services. I run this by the team and, with none of us having tried it before, get the suggestion to suspend+reactivate my own test account and see for myself.</p> <p>Cool. We have a game plan! I start opening some browser tabs, pulling up my own account info as well as the users so that I had everything I needed …</p> <p>Right there. At the top. In huge, bold letters. </p> <p>‘ACCOUNT SUSPENDED’</p> <p>Welp. </p> <p>Mr. Owl, how many developers does it take to notice that an account is inactive? The world does know, unfortunately, and the answer is embarrassing LOL</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/blueskyn01se\"> /u/blueskyn01se </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/peh3bj/never_forget_to_check_the_basics/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/peh3bj/never_forget_to_check_the_basics/\">[comments]</a></span>"
}