{
  "title":"I just grabbed your ASR disk and... it's ALL GONE!",
  "date":"2021-08-24T10:26:22.000000-07:00",
  "author":"/u/Odd_Seaweed_5985",
  "id":"t3_parxa5",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/parxa5/i_just_grabbed_your_asr_disk_and_its_all_gone/",
  "content":"<div class=\"md\"><p>New guy joins the support team and we share an office.</p> <p>I'm the more experienced one, so he's learning the ropes from me.</p> <p>On one of his very first days, he gets a request to upgrade Windows on a laptop for some big mucky-muck.</p> <p>Thinking that he'll impress me with his initiative, he starts the process before I get to work.</p> <p>When I arrive, my new, somewhat reactive office-mate immediately grabs me and starts in with &quot;I'm in big, big trouble, I'm going to get fired!&quot; I can see that he's really worried. I can't imagine what he could have done at THIS place that could get him fired so quickly.</p> <p>&quot;Why, what happened?&quot; I asked.</p> <p>&quot;&quot;I needed to upgrade a Windows laptop for [important guy in corner office] so I grabbed your install disk... and it... <em>whiped everything!&quot;</em></p> <p>&quot;What disk did you grab?&quot;</p> <p>He shows me a disk labeled &quot;ASR&quot;. Oops. That's NOT a setup disk, it's an Automated System Recovery disk, used for automatically, mass-installing, Windows onto many devices at the same time. You insert the disk, turn ON the system, and it immediately whipes the harddrive and installs Windows over the network.</p> <p>I still kinda smile imagining what horrors must have been going through his head as he saw the harddrive suddenly start going crazy....instead of getting a normal Windows setup screen. And then it wouldn't boot afterward? Oh the pain he must have been feeling!</p> <p>I tell him what he had just done. He asks me why I would have such a dangerous thing in my possession, and actually gets kinda mad at me.</p> <p>He tells me that the laptop belongs to a <em>high-level</em> exec, and he's deathly afraid to tell him that all of his data is now gone. He's sure to be fired on the spot.</p> <p>I laugh and say &quot;No, you won't. Come with me, watch and learn, we'll take care of it together. He should have backups or copies of anything important. If he's in such a position in the company, then he's fully aware of his responsibility to protect his and the companies data.&quot;</p> <p>We go to the guys office and I tell him what had happened. He's disappointed, <em>really</em> disappointed. I apologize for the accident, and tell him that we've removed every ASR disk so that it couldn't possibly happen again.</p> <p>He asks about data recovery. Sure, we can atttempt that, but no guarantees, and it's expensive. I can tell that he's getting more agitated.</p> <p>As a subtle reminder of <em>his</em> responsibilities, I casually mention &quot;You know, for quite some time now, Support has offered a few different services that will automatically backup your data and even your complete profile. You just never know, <em>even when things are going perfectly</em>, when a harddrive might fail, a laptop gets dropped or stolen...&quot;</p> <p>He stood there and I see a transformation come over his face. He gets it.</p> <p>&quot;Yeah, I should have enrolled this into the [automatic backup process] a long time ago.&quot; He even knew the name of the backup software we were using?</p> <p>We eventually leave and never hear of it again.</p> <p>The new guy eventually moved to Executive Support, so I guess he was just a glutton for punishment...</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/Odd_Seaweed_5985\"> /u/Odd_Seaweed_5985 </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/parxa5/i_just_grabbed_your_asr_disk_and_its_all_gone/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/parxa5/i_just_grabbed_your_asr_disk_and_its_all_gone/\">[comments]</a></span>"
}