{
  "title":"The phones worked when I tested them connected to the ISP gateway, why doesn't it work when I plug it in at people's desks? What's a firewall? - The IT Company That Replaced Me",
  "date":"2021-08-23T09:52:49.000000-07:00",
  "author":"/u/newtekie1",
  "id":"t3_pa3u12",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/pa3u12/the_phones_worked_when_i_tested_them_connected_to/",
  "content":"<div class=\"md\"><p>So, I do freelance IT for small businesses. One of my customers decided to replace me. The &quot;company&quot; they replaced me with is really just the IT Director of the local community college. He is a people manager, and know next to nothing about actual IT. But he's a friend of one of the employees and he's cheap. So I tell my customer good luck and contact me if the every need me.</p> <p>It wasn't even a week and the first thing this guy tried to do he botched.</p> <p>I get a call from him in a panic. He was tasked with replacing their ancient AVAYA phone system with a modern VOIP system. This is what he did:</p> <p>He tested all the phones connected at his office, and they worked. The next day he takes them out to the customer's office. He plugs a phone directly into the ISP gateway and the phone connects. So he calls the VIOP company and tells them all is good, the phones are connecting correctly, and they can start porting the phone numbers over from the POTs lines to the VOIP service.</p> <p>While the porting is happening, he starts disconnecting the old phones at people's desks and connecting the new VOIP phones. And when he is done he realizes none of the phones are connecting.</p> <p>The VOIP company tells him to run a connection test tool on his laptop plugged in through one of the phones and sure enough the connection is being blocked.</p> <p>But by this point the numbers are already ported to the VOIP service and the customer is without phones, and he has no clue why they aren't working.</p> <p>That's when I get the call. He explains what he did and I asked him why he didn't test the phones from behind the firewall. And I shit you not, his exact words were &quot;What's a firewall?&quot;</p> <p>Seriously, he had no clue what a firewall was. He always just assumed you plugged everything into the ISP gateway and used that. I was floored. This is a guy that is doing business IT and he doesn't know what a firewall is.</p> <p>Oh, and the kicker, his next project is to set up a site to site VPN connection between their current office and a new office they just rented. He told them he totally knows how to do that. They guy that doesn't know what a firewall is claims he knows how to setup up site to site VPNs.</p> <p>So I logged in remotely and set up the firewall properly to work with the VOIP phones. I'm sure the owner of the business will question why I had to be brought in to fix the phones when he receives my detailed bill.</p> <p>TL;DR - Customer of mine when with a cheaper friend of an employee for their IT and fired me. The person they hired doesn't even know what a firewall is.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/newtekie1\"> /u/newtekie1 </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pa3u12/the_phones_worked_when_i_tested_them_connected_to/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pa3u12/the_phones_worked_when_i_tested_them_connected_to/\">[comments]</a></span>"
}