{
  "title":"'Something's wrong with the printer!'",
  "date":"2021-08-28T14:53:46.000000-07:00",
  "author":"/u/TheAnniCake",
  "id":"t3_pdir25",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/pdir25/somethings_wrong_with_the_printer/",
  "content":"<div class=\"md\"><p>Hey guys!</p> <p>Currently I'm doing my apprenticeship in a local town hall in Germany to become a sysadmin. My final exams are coming up next year, so I'm pretty much aware of what I'm doing. Working for the government isn't really challenging. Most of the time you help coworkers with simple stuff like 'How to use your second monitor', replacing broken hardware or updating the servers. Really simple work if you ask me.</p> <p>Right now we've got elections coming up and you can do a postal vote. We've set up a special office for this. This office got a pc, a printer and a barcode scanner so my coworkers don't have to type every name by hand. The barcodes are on the polling cards people get per mail.</p> <p>One of my coworkers called me that she had some issues with the printer. It just won't work. She claimed that if the used that barcode scanner, the printer won't work which didn't make any sense. The only issue was that the printer wasn't set as the standard printer. I set it as the standard and told her to try again. She refused because she didn't want some important documents printed elsewhere which is understandable because it contains sensible data (it only tried to print it into OneNote which she also didn't understand). My coworker just refused to see that I've fixed the issue and wanted one of the other IT guys to come because she apparently can't trust me because I'm still an apprentice.</p> <p>That one colleague she tried to call wasn't available so after half an hour of waiting and talking her into it, she finally tried it again. She was a bit shocked that it magically worked and we could move on. But she still was convinced that the barcode scanner was responsible for this issue.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/TheAnniCake\"> /u/TheAnniCake </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pdir25/somethings_wrong_with_the_printer/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pdir25/somethings_wrong_with_the_printer/\">[comments]</a></span>"
}