{
  "title":"Your new AntiVirus broke a whole division!",
  "date":"2021-08-28T12:12:56.000000-07:00",
  "author":"/u/tyr4774",
  "id":"t3_pdfxof",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/pdfxof/your_new_antivirus_broke_a_whole_division/",
  "content":"<div class=\"md\"><p>This was back maybe a decade ago, I had just got my start in IT after being out of college and working retail attempting to get out. I had been able to join a small 5 person firm that was in the middle of a merger with another 5 person firm. As such our firm &quot;IT&quot; was taking over the IT of the clients of the other company &quot;Phone Setup&quot;. We came in to one of &quot;Phone Setups&quot; big clients, large manufacturing company in the area that basically everyone in this small town had family working for, &quot;Builder, Inc&quot;.</p> <p>I was tasked to work with one of the senior guys in &quot;IT&quot; to roll out a new AV for all of the machines at &quot;Builder, Inc&quot;. Mostly this should've been done via GPO but their old AV (I forgot what it was) had a manual removal process so I was tasked with going to each machine during someone lunch break or downtime to run the uninstall steps, reboot, and reboot again so the AV would install. All in all this was going to take awhile. However not even a week in when we had maybe 25% of the company protected we get a call about how the new AV is causing massive slowdowns to &quot;all&quot; the machines they are installed on. Me, being new to IT deferred to the senior tech, but didn't think it was ours as full scanning hadn't been enabled. In fact the only &quot;scanning&quot; that was done for this test group was nightly from like 8p-1a.</p> <p>&quot;Joe&quot;, the lead on this roll out, asks me for a list of devices from each division of &quot;Builder&quot; so he can pull one from each to once again separate into another group. So I did that and asked Joe what he was thinking. Joe let me know that since these are old (even at that time) 32-bit machines with 2GB of RAM and XP installed on them (this was near the great XP EoL) that the machines were just slow to begin with and that the users were blaming it on the AV to try and not make their bosses look cheap/lazy for not updating their machines in over a decade. </p> <p>I get Joe the list and he makes a new group with some different settings. We wait a week and have a meeting with the client including one of the Shift Managers, Hank, who had been yelling the loudest about how the new AV was making thing slow. I don't recall it verbatim but part of the conversation went like this: </p> <p>Joe: So Hank, how has your machine been running this past week?</p> <p>Hank: Fantastic! I told you that new Virus Software you put on was slowing us down. We need to go back to that old software as it doesn't keep us from slowing down.</p> <p>Joe:Are you sure about that? You're absolutely sure that compared to last week everything has been running faster? </p> <p>Hank: Yup, its like night and day Joe</p> <p>​</p> <p>I don't recall the rest of the meeting but after Hank left Joe let the higher ups know that the only change he did was remove the icon on the task bar showing the AV was &quot;on&quot; and that all other scanning settings were the same. He even brought up the policies he created and the only difference was the &quot;Show Icon&quot; button was unchecked. </p> <p>We did eventually have to upgrade those machines ahead of the XP EoL deadline because of the AV but that was down the line and after an upgrade and is another story.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/tyr4774\"> /u/tyr4774 </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pdfxof/your_new_antivirus_broke_a_whole_division/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pdfxof/your_new_antivirus_broke_a_whole_division/\">[comments]</a></span>"
}