{
  "title":"Client cannot accept they're wrong",
  "date":"2021-08-24T08:39:44.000000-07:00",
  "author":"/u/polandreh",
  "id":"t3_papt60",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/papt60/client_cannot_accept_theyre_wrong/",
  "content":"<div class=\"md\"><p>Hey TFTS, first time posting, which is odd since I've worked all my professional life in application support and couldn't think of a story to post even though I have thousands.</p> <p>My first job in London was providing 1st and 2nd line of support to a reporting software my company built and sold to clients in the financial sector.</p> <p>We had two types of clients: hosted or in-house install. While the first were easy to debug (log in to their environment, replicate and assess, all while having full access to the back end), the others were less so for obvious reasons, yet we kept a (virtually stale) copy of their initial environment to provide some semblance of support. This story, obviously, is about the latter type.</p> <p>The software itself was like Tableau, in which you add objects to a sheet (graphics, tables, images,...) to create a template, and the workflow fills in the latest data as often as you want it (daily, weekly, monthly,...) and generates the final report in the format you want, the most common being Word or PDF.</p> <p>Also, the software used a proprietary third party software to convert Word documents into PDF. Don't recall which one it was, but we would buy the license ourselves and would give it to the client for their in-house install. We didn't only recommend this software in our install documentation but insisted that they use it since our product only &quot;supported&quot; this vendor in particular (meaning it could probably work with others, but we only tested this particular one, so could only ensure it works as expected with it and it alone).</p> <p>So, the ticket in question was floating around for a while, bouncing from one Support member to another, and no one could figure it out. We were only 4 in the Support team, so it was bound to land on my plate eventually. Also, side note, I was the youngest (by far) in the team, and my impostor syndrome was high, so I was dreading my turn to have a go at this issue.</p> <p>The problem was that the generated PDF reports were showing the objects completely misaligned compared to what they were supposed to look like. Moreover, this only happened when generating PDFs; Word docs came out as expected. </p> <p>So, this being an in-house installation, we could only try to replicate it on our end to no avail. A co-worker tried to get a copy of their database to get our environment in line with the client's, but that was turned down because of &quot;sensitive information&quot; that they couldn't share (what's the point of non-disclosure contracts?). Another co-worker tried a screen sharing session but all it helped for was to see the report being generated incorrectly, since their IT team wouldn't let us take a look at the back end and see if the software was installed properly.</p> <p>By then, the client was getting impatient with how long it was taking for this issue to be resolved. So having this information telling me how tied my hands were, plus the pressure on being the last line of defense, I do the first thing I can come up with: I check in Acrobat Reader who is the PDF Producer of the file the client sent. Usually, you would expect to see the name of the third-party software as the creator, but lo and behold, the client was using some other tool for the PDF conversion (why? As I said, we provided the license for FOR FREE!!! So it wasn't a matter of saving pennies). </p> <p>So, I happily send my reply to the client stating &quot;Unfortunately, you're using a software we don't support, please use [product name] as is specified in our documentation.&quot;</p> <p>One would expect the issue to be closed: the client was caught red-handed using our software incorrectly, thus in breach of contract. However, as you read the title of this story, this was not the case. All I got in return was a condescending reply to my email CC'ing the account manager on our company and my boss stating &quot;This is ridiculous, [Account Manager's name]. This has taken long enough. Can't someone fix the damn problem?&quot;</p> <p>I wish I could say the story had a satisfying ending but unfortunately for me, my company was &quot;too British&quot; in their mentality and followed the creed of &quot;the customer is always right&quot;. I didn't hear back on this issue, and luckily that client didn't raise many tickets, so I didn't have to deal with them again. My guess is that the AM had to convince them to use the third-party software we supplied, but I never asked her how that discussion went.</p> <p>All I got was a chuckle from the rest of the team saying &quot;how didn't I think about that before?&quot; and a pat on the back from my manager which would come back and haunt me for the rest of my days at that company since I became known as the &quot;last resort&quot; guy, which meant I had to deal with all the troublesome tickets.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/polandreh\"> /u/polandreh </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/papt60/client_cannot_accept_theyre_wrong/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/papt60/client_cannot_accept_theyre_wrong/\">[comments]</a></span>"
}