{
  "title":"So many desktop files.....",
  "date":"2021-08-27T11:13:14.000000-07:00",
  "author":"/u/Guslet",
  "id":"t3_pcst3k",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/pcst3k/so_many_desktop_files/",
  "content":"<div class=\"md\"><p>This happened recently, I work as a Systems/Network Engineer, but do a solid amount of Tier 2 &quot;troubleshooting&quot;.</p> <p>So I get a call from our hardware guy, who is a great guy, but not the best troubleshooter. He is replacing someone's computer (He does a profile restore from the old computer, which copies down Desktop, Documents, etc, etc) and when he gave it to her, she complained it was incredibly slow on login and when they logged in it was taking a log time for things to load etc, she also mentioned she could not see the files on her desktop.</p> <p>He calls me up for some guidance. So I remote into the computer and sure enough nothing is showing on the desktop. The computer is definitely crawling too, I look at task manager, nothing seems to be particularly high as far as usage.</p> <p>Navigating into file explorer I go to the users desktop folder. They had over 2600 files on their desktop.....apparently Windows finally got fed up and decided it just cannot handle loading that many files at login. I promptly highlight all the files and put them into a new &quot;Old Desktop&quot; folder, then reboot the machine.</p> <p>Of course it logs in like a dream and the remaining 7 folders that I left show up on the desktop.</p> <p>I've been in IT for 10 years and it never ceases to amaze me that someone would think having 2600+ items on their desktop wouldn't be a problem....I don't even understand how this person worked before on their old laptop with that many files.....</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/Guslet\"> /u/Guslet </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pcst3k/so_many_desktop_files/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pcst3k/so_many_desktop_files/\">[comments]</a></span>"
}