{
  "title":"Backups keep the machine running",
  "date":"2021-08-27T12:10:10.000000-07:00",
  "author":"/u/MAD_ROB",
  "id":"t3_pctwh5",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/pctwh5/backups_keep_the_machine_running/",
  "content":"<div class=\"md\"><p>Another, very recent tale. Caution: german without proofreading skills.</p> <p>You can guess what the tale is about just from the title, and see in the end if you guessed right.</p> <p>​</p> <p>The setting:</p> <p>one robotcell with an IPC* (Industrial PC, see below) which is connected to the customers company-lan (vlan)</p> <p>customer difficulty: easy</p> <p>it difficulty: easy</p> <p>​</p> <p>players:</p> <p>$me: me</p> <p>$itguy: the it guy of the customer</p> <p>$cust: the customer</p> <p>​</p> <p>story:</p> <p>​</p> <p>We installed a new robot cell with an IPC with Win10. My policy is that the $cust gets a patched system which is up to date, and can decide if he wants to run it off grid, or connect it to something and takes the responsibility for security and updates. This customer does the latter, and his external $itguy gets an local admin account and sets his things up (AV, Backup, ...)</p> <p>After a few days the $cust calls me and tells me that every night at around 9pm the IPC is shutting down, bringing the production to a halt. I have no clue what happens, so I decide to visit the site at 9pm and have a look.</p> <p>Did you already guessed it?</p> <p>Yes... the backup runs at 9pm. And the standard-setting for this customer is &quot;do the backup, and then shut the machine down&quot;. Why? Because the it put the IPC in the office-group for the backup, and not the machine-group. And the office workers have to leave their pcs on, they make the backup and shut down.</p> <p>A short mail to $itguy solved this rather quickly.</p> <p>​</p> <p>TL/DR: After the backup the PC gets shut down. Stopping the machine.</p> <p>​</p> <p>Edit: spelling corrected after I woke up refreshed. </p> <p>And a little bit of clarification here and there. </p> <p>IPC = Industrial PC</p> <p>Special Hardware for running 24/7 in rough enviroments like workshops.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/MAD_ROB\"> /u/MAD_ROB </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pctwh5/backups_keep_the_machine_running/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pctwh5/backups_keep_the_machine_running/\">[comments]</a></span>"
}