{
  "title":"A case of impeccable timing",
  "date":"2021-08-30T12:31:12.000000-07:00",
  "author":"/u/Cyborg_Ninja_Cat",
  "id":"t3_pepaox",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/pepaox/a_case_of_impeccable_timing/",
  "content":"<div class=\"md\"><p>I'm a full stack web dev, mostly working on developing and maintaining eCommerce sites using my company's in-house platform. We do support and maintenance as well as new sites and features, but aren't expected to support end users directly. However we occasionally (or in the case of the site that features in this story, not so rarely) get end user issues forwarded to us if the client's helpdesk can't fix it.</p> <p>This particular site is healthcare-adjacent. I'm not in the US so HIPAA doesn't apply but data security is still a particularly big deal for this site compared to some of our other clients - and security of customer data is a big deal for everyone these days.</p> <p>In the far-off days before the pandemic, I'd been working for months on a Major New Feature that allowed customers to use the site in a different way than before. It touched almost every part of the site and presented some fairly unique problems. We had to request a new feature be added to the in-house platform just for this, which necessitated deferring the Major New Feature's completion until after a separate project to migrate the site through a major version of the platform.</p> <p>Finally, everything is completed, tested, and signed off. The big release goes fairly smoothly, the Major New Feature appears to be working, and we pat ourselves on the back and relax.</p> <p><em>Cut to shortly after we get in the following morning</em></p> <p>A customer who placed a single order is receiving dozens, no, hundreds of order confirmation emails. He provides a screenshot of his flooded inbox.</p> <p>Virtually all eCommerce sites have transactional emails - and this has more than many, along with optional text message notifications. One of the implications of the Major New Feature is that it's no longer completely trivial to decide who should be notified by what method about updates to a given order or account. I've written a nice new piece of code that abstracts away all this decision making into one place.</p> <p>Obviously, I've got something terribly wrong. Are we sending every email update to the same person, this guy? Worse*, are we sending every update to <em>everyone</em>, and this guy is just the first to report it? Either way, it sounds like a significant data security breach, on the site that I would least like to have a data breach on, and it's definitely my fault. It's <strong>panic stations</strong>.</p> <p>I start looking frantically at my new code and the database, while our senior dev gets into the logs. I've just found the mildly reassuring information that the number of emails the customer appears to have received doesn't match up with orders taken since the release of the Major New Feature, when the senior reports that the order confirmation page for this customer's single order is being requested ten times a minute.</p> <p>He's refreshing the page ten times a minute. For an hour. We assume that it's some kind of browser extension or something.</p> <p>A quick proof of concept confirms that you can indeed generate multiple confirmation emails by refreshing that page. Which I hasten to add is not ok, and we immediately put a ticket in to fix it. But this bug appears to have been in the site for years, since before I joined the company. <em>Of all the days for it to come to light...</em></p> <p>​</p> <p>*Actually, that probably wouldn't be <em>much</em> worse, because at that time we had another issue in the system that would have caused nearly all emails to fail to send in that case.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/Cyborg_Ninja_Cat\"> /u/Cyborg_Ninja_Cat </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pepaox/a_case_of_impeccable_timing/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pepaox/a_case_of_impeccable_timing/\">[comments]</a></span>"
}