{
  "title":"“CBS randomly mutes itself”",
  "date":"2021-08-30T22:34:03.000000-07:00",
  "author":"/u/Littlewing586",
  "id":"t3_pezm9f",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/pezm9f/cbs_randomly_mutes_itself/",
  "content":"<div class=\"md\"><p>In addition to my professional career, I’m the family technician especially to my grandmother’s boyfriend. Feels like every time I come here, he’s calling me over to help him with something.</p> <p>I come by once a week to do laundry and hang out with my grandmother and tonight was that night. My grandmother’s boyfriend, Hank, calls me into the other room where it’s <em>super</em> warm, like I’m sweating in seconds of walking in, to ask me for tech support tonight.</p> <blockquote> <p>Hank: Can you check out the TV? Like reboot it or something? Channel 2 CBS is always going mute randomly and now it’s spreading to other rooms.</p> </blockquote> <p>I agree rebooting sounds like a good start so I unplug all of the fairly hot cable boxes around the house and leave them unplugged for a good 30 or so minutes while I talk with my grandmother.</p> <p>I come back and plug in everything and they get to watching all these awful shows like Young Sheldon and whatever else was on while I browse Reddit and play mobile games. But I peek my head up every so often and start to notice what Hank was talking about. Randomly throughout commercial breaks, mostly, the sound just goes dead silent. Pretty wonderful to me, but I could understand this was <em>their</em> entertainment.</p> <p>Then I started noticing that throughout all of these shows…there was this really weird narration. I thought it was a strange move by CBS to have so many shows from comedy to drama have this woman in the background describing what’s going on in each episode. Maybe their new trademark?</p> <p>Then I started picking up on it during NCIS when it was clearly out of place and realize this is definitely not CBS’ doing.</p> <p>I asked Hank for the remote and checked the Accessibility settings and saw someone enabled some setting for narration that was only showing on CBS, not on any other channel we were watching. Disabled that setting and so far over the last few hours, all is good again.</p> <p>This isn’t uncommon at my grandmother’s house. Someone is always enabling some weird setting on the TV and everyone just puts up with it until I come around.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/Littlewing586\"> /u/Littlewing586 </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pezm9f/cbs_randomly_mutes_itself/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pezm9f/cbs_randomly_mutes_itself/\">[comments]</a></span>"
}