{
  "title":"New User Nightmare",
  "date":"2021-08-30T08:15:42.000000-07:00",
  "author":"/u/EonThief",
  "id":"t3_pek3xi",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/pek3xi/new_user_nightmare/",
  "content":"<div class=\"md\"><p>Hello all, it has been some time since my last post on here. Since that last post I have left the service desk job that I had and thought my time at the help desk was over. However much like an ex texting you at 3 in the morning, you can't help but get pulled back in.</p> <p>This particular day was my first real day out of training, and it should've been a fairly easy day being a Friday and all. However, the IT gods above did not seem to want to give me an easy day. Thus began a multiple call saga, that spilt over into today. So sit back, relax, and enjoy my suffering.</p> <p>The characters in this story are:</p> <p>Me: Your storyteller for the moment, and the hero of this anime.</p> <p>New User: My eternal rival, and the best/worst part of my day.</p> <p>As our story begins I am just logging in for the day, and within a minute or so I get a call.</p> <p>​</p> <blockquote> <p>Me: Hello, thank you for contacting the [insert company name here] service desk, I'm Eon can I have your username? </p> <p>New User: *<em>provides username</em>* </p> <p>Me: Wonderful, how can I help you? </p> <p>New User: Hi, I'm new user and I'm trying to setup my computer but I'm stuck. </p> <p>Me: Yeah no problem, what step are you stuck on? </p> <p>New User: On step 3.</p> </blockquote> <p>Now before we go any further I should explain something. When a user is sent a computer we send them a fairly in depth list of instructions on setting up their device. These instructions are, in my opinion, very easy to follow with one or two issues that most users have. They are so easy in fact that the only thing that would make them easier is if they included pictures. With that little info dump out of the way lets continue.</p> <p>​</p> <blockquote> <p>Me: Okay, step 3 should have you reset your password. There should be a website listed on that step as well. Do you see it? </p> <p>New User: There isn't any website listed. </p> <p>Me: Sir I can assure you there is a website listed there </p> <p>New User: No website, just this [insert web address here] at the end of the step. </p> <p>Me: *<em>trying to stop my palm from colliding with my forehead</em>* That's the website sir... </p> <p>New User: No it's not. </p> <p>Me: Type that into a web browser and it will take you to the website sir... </p> <p>New User: Why didn't it say that? </p> <p>Me: *<em>internally &quot;I shouldn't have to say it&quot;</em>* It just assumes that users would know what to do in that circumstance. </p> <p>New User: Yeah, well I don't mess with computers none. </p> <p>Me: Most of our new users don't sir.</p> </blockquote> <p>From this point the call goes on and I get his password reset and in the instructions it says that an initial password reset can take at least 30 minutes so the user says he'll call back in 30 minutes to continue setup.</p> <p><strong>15 minutes later...</strong></p> <p>I receive another call from who else but New User.</p> <p>​</p> <blockquote> <p>Me: Hello, thank you for contacting the [insert company name here] service desk, I'm Eon can I have your username? </p> <p>New User: *<em>provides username</em>* Yeah I just got off the phone 30 minutes ago and am ready to go through the setup some more. </p> <p>Me: Yes sir, it was me you spoke with and based on the time it has not yet been 30 minutes, I recommend calling back in another 15 minutes. </p> <p>New User: Alright</p> </blockquote> <p>The call gets disconnected and this would be another good time to provide some information. The reason I didn't continue to help is because the &quot;at least 30 minutes&quot; isn't an exaggeration, 30 minutes is the quickest that the password will synchronize for first time users in our system. Not sure why though, but that's just how it is.</p> <p>Back to the story again though.</p> <p><strong>15 more minutes later...</strong></p> <p>Of course the guy calls in again, and at this point I just recognize the number.</p> <p>​</p> <blockquote> <p>Me: Hello, thank you for contacting the [insert company name here] service desk, is this [insert users name]? </p> <p>New User: Yes this is him. </p> <p>Me: Yes I've been the same agent you've spoken to every time you've called this morning. How can I help you this time?</p> </blockquote> <p>The user then proceeds to basically tell me his life story, culminating in a summary of his issue. A very incorrect summary mind you, but still a summary nonetheless. I work with him for the next <strong>45 MINUTES!!</strong> On something that the users are expected to do by themselves mind you. Getting a number of questions that would be answered if the guy actually read the instructions that were given to him. I finally manage to talk him into working through it himself, and he agrees stating that he'll call back if he has any other issues. I end the call and pray to any god that will listen that I don't have to deal with him again. </p> <p>Later that day he does callback, and is very promptly taken care of by a coworker.</p> <p>I was hoping this would be the end of my interactions with him, at least until some point far down the line... Today has unfortunately rained on that parade.</p> <p>I'm just going to give you the cliff notes of this call, as I don't want to transpose it. He called back in because only the default password was letting him sign into his computer, the new password he created wasn't working. His new password would work when in the computer however, this was caused by him not locking and unlocking his computer while on VPN. This was odd to me, since, you guessed it, a step in the setup for the computer! When I mentioned this he of course got defensive because, and I quote &quot;I followed them steps on the paper&quot;. Luckily the call didn't last that long and I, hopefully, won't have to deal with this guy for a nice loooooong while.</p> <p>I hope you all enjoyed my little story.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/EonThief\"> /u/EonThief </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pek3xi/new_user_nightmare/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pek3xi/new_user_nightmare/\">[comments]</a></span>"
}