{
  "title":"Because that's the way I was trained.",
  "date":"2021-08-27T22:32:22.000000-07:00",
  "author":"/u/night-otter",
  "id":"t3_pd41p9",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/pd41p9/because_thats_the_way_i_was_trained/",
  "content":"<div class=\"md\"><p>I was temp worker at a government office. I was a clerk, filing, forms, mail, etc. But folks soon figured out I knew about computers and I responded much faster than the IT team. The IT team was in another building in another part of the city.</p> <p>One day the admin assistant for the Senior Director flags me down. &quot;My computer is very slow. Can you look at it.&quot;</p> <p>Wow this machine is old. Still running plain old DOS. Early 90s, not unheard of, but every other system in the building was running Windows. I start looking around and find the root directory is filled with *.tmp files. So I clear them all out and reboot. Zoom (relatively speaking) it boots.</p> <p>She fires up WordPerfect and everything is fine.</p> <p>A couple of weeks later, same thing. This time I stuck around to see her work. Starts WordPerfect, types up a document, prints it, and shuts off the computer. She grabs another set of notes, starts up the computer, types up the document, etc, etc.</p> <p>I try to convince to do saves, to not shut off the computer every time. Nope, Nope, that's how she was trained so long ago and she's not going to change.</p> <p>I'd already done time in the trenches of Tech Support so I knew arguing with a long term Senior Admin Assistant was not worth my time. </p> <p>So I created a autoexec.bat file that deleted the tmp files on every start up. She never bugged me again</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/night-otter\"> /u/night-otter </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pd41p9/because_thats_the_way_i_was_trained/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pd41p9/because_thats_the_way_i_was_trained/\">[comments]</a></span>"
}