{
  "title":"Now you have TWO reviews Dave!",
  "date":"2021-08-25T21:49:15.000000-07:00",
  "author":"/u/dave999dave",
  "id":"t3_pbsi7n",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/pbsi7n/now_you_have_two_reviews_dave/",
  "content":"<div class=\"md\"><p>I'm Dave and once again we going through a mass migration from one tool to another. About 15K will participate in this move.</p> <p>I'll call the new tool TruthSayer, which is almost absurd as the real name it was branded.</p> <p>And once again I have drafted extensive documentation, churned out quick reference guides, wrote reports, compiled FAQs, held demo sessions, held Q&amp;As sessions, presented road shows, recorded presentations for replay, composed WBTs, done troubleshooting with the vendor, etc etc. I'm constantly incorporating feedback from all of this to make it all more appealing / accessible / concise etc.</p> <p>All of this and many many more is listed on our new tool's sorted and organized landing page. A one stop shop if you have ANY questions.</p> <p>I was chatting with my coworker Stan today when I noticed the landing page had gotten a review. I didn't even know the pages could get reviews. I leaned forward and saw it was a 1 star review. So it sucks I guess?</p> <p><strong>Dave</strong>: Huh. Our TruthSayer landing page got a review.</p> <p><strong>Stan</strong>: Oh, what was it?</p> <p><strong>Dave</strong>: No comments, but they did give it a star. A one star review.</p> <p><strong>Stan</strong>: So how many reviews so far?</p> <p><strong>Dave</strong>: Just that one, one review.</p> <p><strong>Stan</strong>: I see. Here, Dave I'll help you out. Your page now has TWO one star reviews! Gotta go! <em>&lt;Click&gt;</em></p> <p>I checked and yes, seconds after our call there were now two one star reviews. Thanks Stan.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/dave999dave\"> /u/dave999dave </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pbsi7n/now_you_have_two_reviews_dave/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pbsi7n/now_you_have_two_reviews_dave/\">[comments]</a></span>"
}