{
  "title":"The New Guy Chronicles - Episode 2: The Betrayal",
  "date":"2021-08-30T10:33:37.000000-07:00",
  "author":"/u/iammandalore",
  "id":"t3_pemwdf",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/pemwdf/the_new_guy_chronicles_episode_2_the_betrayal/",
  "content":"<div class=\"md\"><p>These are the stories of the New Guy. All of what you are about to read is true. I write you these tales of mirth and woe, of entertainment and anger with as much accuracy and as little embellishment as I can manage. Many conversations are written as best I can remember them from my notes and memories about the incidents they describe, but the heart of what you are about to read is as true as I can make it.</p> <p>Names have been changed to protect the innocent. And the guilty.</p> <p>The cast:</p> <ul> <li>Jordan - FNG</li> <li>Thomas - Me, the manager and network admin</li> <li>John - The older of my two other reports, primarily responsible for server maintenance, major application upgrades, and supporting our smaller off-site locations and their specific applications</li> <li>Daniel - The younger of my two original employees, though here for the same amount of time as John. Both longer than me, actually. Desktop and server support, document management and phone system support, phenomenal people skills.</li> </ul> <p><strong>DAY 10</strong> - The Betrayal</p> <p>A little over a week has come and gone. Jordan remains steadfast in his attempts to drive me and my other two reports to the brink of insanity. Thus far he has failed a stunningly easy test I devised to assess his problem-solving skills, admitted to underage drinking, attempted to build camaraderie in a conversation with us all by saying &quot;you guys know how hard it is to pull one over on my mom&quot;, and argued with me about the importance of locking computers when leaving them unattended. </p> <p>While he was away from his desk performing a task and I was talking idly with John and Daniel, I walked over to inspect the clutter Jordan had already amassed and noticed a password written on a sticky note. </p> <p>Ah, an opportunity to teach an important lesson. I mentioned it to John and Daniel, and then waited.</p> <p>&quot;Jordan, what's wrong with your desk?&quot; I asked upon his return. </p> <p>&quot;Uh, I forgot to lock my computer?&quot;</p> <p>&quot;Well yes, but there's something else.&quot;</p> <p>&quot;I don't know,&quot; he declared after looking around.</p> <p>&quot;What's on that sticky note?&quot;</p> <p>&quot;Oh! That's the password that Daniel gave me.&quot;</p> <p>Daniel, who had been listening to the exchange from his desk, poked his head out from behind his monitors.</p> <p>&quot;I'm sorry, what?&quot;</p> <p>&quot;Yeah,&quot; Jordan replied. &quot;It's that [anti-virus] management password you gave me. You told me to write it down so I wouldn't forget it.&quot;</p> <p>&quot;I didn't tell you to write any password down.&quot;</p> <p>&quot;Yeah, you-&quot; </p> <p>I cut in, stopping the conversation and telling Jordan not to worry about it right then. I again explained the importance of locking unattended computers, and let the issue drop until later in the day when I called him into my office.</p> <p>&quot;Close the door behind you. About that password.&quot;</p> <p>&quot;Daniel gave me that password.&quot;</p> <p>&quot;I spoke to Daniel and he said he doesn't remember giving you that password and definitely wouldn't have told you to write it down. You're sure?&quot;</p> <p>&quot;Absolutely. That's not like me.&quot;</p> <p>Intent on giving Jordan every opportunity to come clean I tried again.</p> <p>&quot;Like I said, I talked to Daniel and he's certain that he didn't give you that password. I have to agree; it wouldn't be like him to tell you or anyone to write down a password.&quot;</p> <p>&quot;I'm positive he gave it to me and told me to write it down so I wouldn't forget.&quot;</p> <p>&quot;You're sure?&quot;</p> <p>&quot;Yes.&quot;</p> <p><em>deep sigh</em></p> <p>&quot;Jordan, I know for a fact that Daniel didn't give you that password.&quot;</p> <p>&quot;What do you mean?&quot;</p> <p>&quot;<em>I</em> gave you that password. In an email, which also explained that you should change it when you log in the first time.&quot;</p> <p>&quot;Oh.&quot;</p> <p>&quot;Listen, Jordan. I've known the whole time what was up and I've been trying to give you the chance to be honest, but you chose right from the start to throw Daniel straight under the bus. That's not the way to build a good working relationship with your coworkers. If you keep that up no one is ever going to trust you.&quot;</p> <p>&quot;OK.&quot;</p> <p>The conversation ended. No apology, no remorse, no assurances it wouldn't happen again. I reported this chain of events to my director, knowing that such a claim of dishonesty on the part of the HR director's son would best be handled between the two directors. My cries would fall upon deaf ears.</p> <p>The chronicles would continue.</p> <p><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pcvl1s/the_new_guy_chronicles_episode_1/\">Episode 1</a></p> </div>   submitted by   <a href=\"https://www.reddit.com/user/iammandalore\"> /u/iammandalore </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pemwdf/the_new_guy_chronicles_episode_2_the_betrayal/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pemwdf/the_new_guy_chronicles_episode_2_the_betrayal/\">[comments]</a></span>"
}