{
  "title":"The New Guy Chronicles - Episode 1",
  "date":"2021-08-27T13:37:55.000000-07:00",
  "author":"/u/iammandalore",
  "id":"t3_pcvl1s",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/pcvl1s/the_new_guy_chronicles_episode_1/",
  "content":"<div class=\"md\"><p>These are the stories of the New Guy. All of what you are about to read is true. I write you these tales of mirth and woe, of entertainment and anger with as much accuracy and as little embellishment as I can manage. Many conversations are written as best I can remember them from my notes and memories about the incidents they describe, but the heart of what you are about to read is as true as I can make it.</p> <p>Names have been changed to protect the innocent. And the guilty.</p> <p><strong>PREFACE</strong></p> <p>&quot;We need a new tech on the team. We have a team of three guys supporting almost 600 users. Tickets are up almost 60% over the last five years and we can't keep up. On top of that we have to migrate almost 500 workstations from Windows 7 to Windows 10. How are we supposed to find the time to do that?&quot;</p> <p>My director, Laurie, looked at me tiredly. We'd had this conversation many times, and the answer had always been 'no'. I hoped this time would be different, but I knew not to hold to that hope too strongly. </p> <p>&quot;I'll bring it up with Steve, but he won't want to spend the money on another person.&quot;</p> <p>Ah. Steve. The CEO. The penny-pincher. </p> <p>&quot;Look, I'm not even necessarily asking for a full-time person. Even a part-time intern or whatever would be a huge boon to the department. I'm just telling you we don't have the resources to keep up with day-to-day tasks much longer, nevermind a massive migration project.&quot;</p> <p>&quot;I'll see what I can do.&quot;</p> <p>A few days later I got word from Laurie that it actually looked promising. I began excitedly writing job descriptions for two different positions. One for a full-time tier-1 helpdesk technician, and one for a part-time intern. This was exactly what we needed. A full-time helpdesk technician could work almost exclusively on Windows 10 upgrades and get us finished by January 2020 without us having to do much with it at all. A part-time intern could at least take most of the burden off the main team. </p> <p>I sent the job descriptions over to Laurie the next day. A few hours later I got the call. We're definitely getting our guy. </p> <p>&quot;That's fantastic. Are we getting someone full-time or part-time?&quot;</p> <p>&quot;Full-time.&quot;</p> <p>&quot;Awesome. Did you take a look at the job descriptions I sent over? Do you think it needs any changes?&quot;</p> <p>The briefest of pauses. &quot;Well...&quot;</p> <p><em>Oh no. No good can come of this.</em></p> <p>&quot;He's already picked out, actually,&quot; she continued.</p> <p>&quot;Whose kid is it?&quot;</p> <p>&quot;Was it that obvious?&quot;</p> <p>&quot;Yes. Whose kid?&quot;</p> <p>&quot;Sherry.&quot;</p> <p>The director of HR? You've got to be kidding. Surely she knows better than this. <em>sigh</em></p> <p>&quot;Alright. I'll get with her.&quot;</p> <p><em>a few hours later</em></p> <p>&quot;Hey, Sherry. I understand your son will be starting with us soon.&quot;</p> <p>&quot;Yes. His name is Jordan. Now you'll have to teach him, because he doesn't have much experience. But he's very smart and he loves technology.&quot;</p> <p>&quot;We'll teach him whatever he needs to know.&quot;</p> <p>&quot;That's great! He'll start in a few days. And don't worry. He'll be treated just like any other employee.&quot;</p> <p><strong>DAY 1</strong> - The Arrival</p> <p>7:50</p> <p>&quot;Welcome. I'm Thomas, I'll be your manager. John and Daniel usually arrive around 8:30; they're the more senior sysadmins. So how much experience do you have?&quot;</p> <p>&quot;It's mostly just from playing around with computers at home and stuff to be honest. I took a couple classes in school but I don't have a degree.&quot;</p> <p>&quot;Well, as long as you're willing to learn we'll teach you everything you need to know. I will tell you that a lot of your time - especially at the beginning - is going to be spent upgrading and imaging computers. It's not going to be particularly fun work. All of the computers here are still on Windows 7 and we need to be on Windows 10 by January 2020. Along with imaging them you'll be upgrading a lot. Some of them are over 10 years old and we'll be adding RAM and upgrading them to SSDs.&quot;</p> <p>&quot;10 years? I can't believe you have modems that old.&quot;</p> <p>And so begin - The New Guy Chronicles</p> <p><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pemwdf/the_new_guy_chronicles_episode_2_the_betrayal\">Episode 2</a></p> </div>   submitted by   <a href=\"https://www.reddit.com/user/iammandalore\"> /u/iammandalore </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pcvl1s/the_new_guy_chronicles_episode_1/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pcvl1s/the_new_guy_chronicles_episode_1/\">[comments]</a></span>"
}