{
  "title":"Thank you for helping me but here is a 400+ word message why you helped me wrong.",
  "date":"2021-08-30T01:23:49.000000-07:00",
  "author":"/u/Aikaparsa",
  "id":"t3_pedvmr",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/pedvmr/thank_you_for_helping_me_but_here_is_a_400_word/",
  "content":"<div class=\"md\"><p>I work for a small OEM company that builds pcs and sell them via different distributors. To find out anything about any configuration we made we prefer to work of the serialnumber as this is unique to every single device. We also have similar configurations which only differ by which mainboard is used or another CPU that is used and all those tiny differences that make a big difference at the end. Today I got a very interesting exchange with a customer that I helped figure out what he wanted but I did it wrong. </p> <p>His first email was as follow:<br> Dear company, </p> <p>2 years ago I bought a pc with windows, but I wish the windows disk was bigger.<br> Now I want to use a bigger one.<br> Can you tell me what RAM is installed (manufacturer and how many slots are available 4x4 or 2x8 RAM installed?) and if the RAM I want to install would fit.<br> Sadly I have no documents regarding this pc and I have no product name and I don't want to take the pc oout of the desk just to see if a serial number might be on the back or to open the case and see how many slots are available. You have to know this kind of information and be able to tell me if I can do that.<br> (List of specs like CPU, GPU, amount of disk space on C: and D:, 64x Windows 10)<br> I want to use (this) RAM and want to know if its compatible. </p> <p>My response was as this:<br> Dear customer, </p> <p>sadly I can't provide you correct information without a serialnumber.<br> There is a freeware called &quot;Speccy&quot; that reads all the systemdata and gives you information like productnames of the components and such.<br> With the productname you can easily search those on the manufacturers site and find all the needed information. </p> <p>This is a google translate of his respons:<br> Thank you very much for your helpful tip with the Speccy, that worked wonderfully and now I know what I have. Of course this is a quick solution, but not really what you mean by &quot;the customer is king&quot; or customer-friendly service. ;-) Therefore I have to say that it would be customer-friendly not only to clip the old serial numbers on the back of the computer, but to store them somewhere under the driver files on the computer. Who is constantly crawling under the desk where he has to determine a tiny number with a flashlight, just because he wants some information from the manufacturer. This is really tedious, especially when you have a dozen cables hanging on the computer, all of which just barely reach the socket. Or do you really expect that we all have desks in the middle of the room? As you can see, that's a typical male way of thinking. (Definition of men's thinking: construction of coffee machines with ultra-modern equipment and in the end all the pots spill because they let their women make coffee for them) For advertising, companies like you make all sorts of changes so that it flashes everywhere, the customer is led to some partner site and the company logo appears permanently. A little more customer friendliness would be a good idea if you don't provide any support without a serial number. And why do you actually need a serial number to determine the number and size of the ram banks? And let's be honest, that is completely superfluous for this question, even for a possible reason that is not enough. The support of a manufacturer should actually know what he has sold, you will surely see that as well. You only need to collect the data sheets of the computers on offer and write the date of the offer on it, then you can determine within a few minutes which complete systems you sold 2 years ago. I don't know, but sometimes companies really trip themselves up because they don't come up with the simplest ideas. I just threw a product out of my company because they had such shitty support and overloaded the system with customer-unfriendly nerd functions. On the other hand, I also recommend computers to my company and they are constantly buying new computers for their more than 200 partner companies throughout the country. You certainly want to shine in your job, so you can bring it in as an &quot;innovative suggestion&quot;. Sometimes there is even a financial bonus for this. Well that was a comment. As I said, you helped me so thank you and have a nice weekend </p> <p>I am unsure what to do with is insightful tip, I forwarded it to my coworkers and my superior hopefully they can figure it out.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/Aikaparsa\"> /u/Aikaparsa </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pedvmr/thank_you_for_helping_me_but_here_is_a_400_word/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pedvmr/thank_you_for_helping_me_but_here_is_a_400_word/\">[comments]</a></span>"
}