{
  "title":"Another win for the little guy?",
  "date":"2021-08-26T09:21:09.000000-07:00",
  "author":"/u/VictoryInChains",
  "id":"t3_pc2viu",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/pc2viu/another_win_for_the_little_guy/",
  "content":"<div class=\"md\"><p>I work as a field tech for $ISP, a little local company in the U.S.</p> <p>$client has been having issues lately with their gateway router, which is almost ten years old.</p> <p>$client, being a fairly high-functioning adult with more sense than God gave a goose, uses this thing called a search engine, actually figures out that their gateway router is probably old, and replaces it.</p> <p>$client gets a fairly basic home mesh system from the local box store, avoiding the kit from those vendors who want to just suck up ALL your data. $client gets this system home, plugged in, and powered up. Correctly!</p> <p>$client's Smart TV, less than a year old, from the people who make those cool phones, connects up to the new Wi-Fi network without a problem and starts throwing 'cannot communicate with server' errors.</p> <p>$client calls mesh system support. Support blames TV manufacturer.</p> <p>$client calls TV support. Support blames mesh system manufacturer.</p> <p>$client calls mesh system manufacturer support, conferences in TV manufacturer support. Both mutually agree to blame the ISP.</p> <p>$ISP phone support determines $client's connection working great. Warns of service fee but $client has had enough and is totally willing to pay the fifty bucks to have someone actually look at their stuff.</p> <p>Enter me, $FieldTech!</p> <p>I quickly determine that the new router/mesh system is not, in fact, routing IP traffic. It is actually eating traffic. I log into the gateway, and then run the initial setup process. </p> <p>The new router begins routing traffic. The TV works!</p> <p>$client mutters about recovering the service fee from their router manufacturer. $FieldTech agrees.</p> <p>It's really not so much the client's fault here, either. S/he downloaded the appropriate smartphone app, connected to the appropriate wifi network, and saw the pretty 'congratulations, you're online!' screen presented by said app, just missed 'Tap here to finish setting up your network'.</p> <p>Mostly I'm impressively aghast at the support for the mesh system. How did they miss needing to finish the INITIAL SETUP?</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/VictoryInChains\"> /u/VictoryInChains </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pc2viu/another_win_for_the_little_guy/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/pc2viu/another_win_for_the_little_guy/\">[comments]</a></span>"
}