{
  "title":"My mouse doesn't work",
  "date":"2022-11-08T19:59:18.000000Z",
  "author":"/u/maitreg",
  "id":"t3_ypwrtu",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/ypwrtu/my_mouse_doesnt_work/",
  "content":"<div class=\"md\"><p>During my first few months of a new tech support job I took years ago, I had one particular user who'd been in the company more than 20 years, and for 6 consecutive Monday mornings she left me a voice-mail before I got to work about her mouse not working. </p> <p>On the first 3, she fixed it herself before I got to the office so I never confirmed what the problem was. On the 4th one I got there and went straight to her office.</p> <p>&quot;So your mouse isn't working again?&quot;</p> <p>&quot;Yeah! I don't know why it keeps doing it. But every time I plug my laptop back in after taking it home the mouse won't work. I usually just unplug it and back a few times and it starts working on its own.&quot;</p> <p>&quot;Oh that's weird!&quot; I said to her even though I suspected she just wasn't waiting for the USB driver to load on startup.</p> <p>&quot;Yes! And it's doing it again today!&quot;</p> <p>So I took a look at the mouse, followed the cord around, and found the USB plugged snugly into the RJ45 port. (Little did I know they were the same width)</p> <p>I explained nicely to her that the mouse needed to be plugged into the USB port on the other side. A week went by.</p> <p>Monday morning, same user, same voice-mail, same problem, same solution.</p> <p>And then it happened AGAIN. From what I could tell she had plugged her USB mouse into her ethernet port on 6 consecutive Monday mornings before she figured out what she was doing wrong.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/maitreg\"> /u/maitreg </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/ypwrtu/my_mouse_doesnt_work/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/ypwrtu/my_mouse_doesnt_work/\">[comments]</a></span>"
}