{
  "title":"This one goes way past 11",
  "date":"2022-11-09T16:54:34.000000Z",
  "author":"/u/CroMignonMan",
  "id":"t3_yqoi8a",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/yqoi8a/this_one_goes_way_past_11/",
  "content":"<div class=\"md\"><p>A recent security camera post reminded me of an issue I ran into with my mother-in-law's home business security cameras a few years ago:</p> <p>Every time the power went out her system would not be accessible from the network when it came back up, you could only reach the cameras by connecting a monitor to the local device. </p> <p>She would call the installer and they would come out and fix it 'under warranty'. When the warranty ran out she did not want to pay them so asked me to take a look.</p> <p>Thankfully she had all of the password information. When I got on the device's interface I saw a few odd things, including that it was enabled as a DHCP server and had its MTU set to a negative number (!?). The one that really caught my eye was the IP address it had assigned. It was something like:</p> <p>805.400.1.50</p> <p>I have no idea where that came from, and presume some sort of corrupted firmware. I did check, however, and the fields allowed you to enter any three digits instead of limiting it to 0-255. </p> <p>Changing that to the correct local IP address (which I was able to determine based on her router's port forwarding settings), and adjusting the MTU and a few other things fixed it, but we had to do that each time the power blipped. I wrote her up a complete set of steps to follow which she has now given to her neighbor so he can come over when the power drops and get it back online.</p> <p>(I guess the IP address issue was somewhat helpful in that the machine coming up as a DHCP server AND actually being on the network could have caused even more mysterious problems!)</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/CroMignonMan\"> /u/CroMignonMan </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yqoi8a/this_one_goes_way_past_11/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yqoi8a/this_one_goes_way_past_11/\">[comments]</a></span>"
}