{
  "title":"Makes you want to \"claw\" your way to a new job, Part 2",
  "date":"2022-11-17T00:35:56.000000Z",
  "author":"/u/dickcheney600",
  "id":"t3_yxbefp",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/yxbefp/makes_you_want_to_claw_your_way_to_a_new_job_part/",
  "content":"<div class=\"md\"><p>Several days later, someone else had untangled the string on the claw and put it back in place. They also glued a washer over the broken end of the pulley. The string couldn't slip off anymore, but may still catch on the remaining broken part from time to time. I suppose that will have to do until a replacement part was obtained. The boss knew what it needed so if he wanted me to order it myself, I figured he would say so.</p> <p>You may remember that I mentioned a missing ground prong on the plug. I included that in the email to my boss about the claw machine. We didn't originally get the machine like that, it broke off in an outlet while it was at our store. We didn't have any replacement plugs OR cords that I knew of, but in this disorganized mess of a store, who could say? </p> <p>A couple weeks later, on a day where the boss wasn't there, a customer complained that the claw machine shocked him. I described what an electric shock from AC felt like and asked if it felt like that, or more like a static shock. He said it felt like AC was present. So I asked him to, without touching the machine, point to what shocked him. He pointed to the metal box where the joystick and coin slots were. I told him, thanks. He left the store without another word. </p> <p>I grabbed my little voltage detector pen, and turned it on, testing it on a known-live outlet before I &quot;trusted&quot; it. I poked the metal box with it. The pen lit up and beeped. Ruh roh. I then poked the metal decorative trim that ran up the corners/edges, which surrounded the decorative &quot;rope lights&quot; or &quot;strip lights&quot;. This too was live. Yikes! Even the metal frame of the front door was live, with 110 VAC.</p> <p>This needed to be unplugged, IMMEDIATELY, and not hooked back up until it was repaired. The trouble was moving the machine back so I could remove the plug without touching either 1: The metal trim up the corners, 2: the coin/controller box, or 3: The metal frame of the front door. I didn't have any insulated gloves, and even if I did, I was wearing a short sleeved shirt and didn't have a coat to cover my arms, due to the weather that day. I asked my coworker if he knew which breaker controlled that set of outlets where the claw machine was. He said he didn't know. I told him that he should shut down the computer, because it might lose power. He asked why, and I explained the claw machine was shocking people, and I couldn't reach the plug without touching the machine, so I needed to find the breaker, and that might mean the computer would lose power. He said he needed the computer to stay on. I literally facepalmed right in front of him, and said &quot;I don't think you understand, there is high voltage on the outside of the machine. The outside that people can touch. That means someone could get electrocuted, and we would get sued. That could put us out of business, which means we would all lose our jobs. No one's lives are depending on that computer right now, nor is our business.&quot;</p> <p>With that, I went to the breaker room and took a few guesses. I went back out to the floor, and I had indeed shut off the outlet cluster that fed the claw machine. I pulled the machine away from the wall and unplugged it. I opened up the back cover and removed the fuse, putting a big DANGER note covering the fuse slot. This was inside the machine. Since the machine was on wheels, I went ahead and wheeled it to the back room, and then I turned the breakers back on. </p> <p>I called the boss and left a message explaining why the claw machine had been moved to the back room. </p> <p>I took the cord and tried using a continuity checker to zero in on the source of the problem. I measured between the hot prong and the metal parts on the outside, but the checker didn't beep or light up. I figured if it did, I could disconnect parts of the machine one by one until I found where the short was. Unfortunately, the continuity checker isn't seeing it, so it's probably a case of slight leakage from something rather than a dead short. So I armed myself with the multimeter and voltage detector pen from before. </p> <p>I went through a similar process that I'd originally planned, but with the ohms setting on my meter. I measure between the hot prong and the metal trim on the machine. It should either be open or at least in the mega-ohms, but it's lower resistance than that. Not a dead short, though, so it probably isn't an actual frayed wire touching the inside of one of the metal parts. So I disconnected one light fixture inside the machine, but the leakage was still there. I disconnected another light fixture, the leakage was still there. I disconnected the power supply... bingo! There was leakage between Hot and Ground on the power supply. </p> <p>The ground strap is supposed to be connected to the inside of all user-accessible metal trim, so that if a hot wire touches it from inside, it shorts out and blows a fuse/breaker. However, with the third prong missing on the plug, the ground strap instead carried the fault current from the power supply to all the outside metal parts of the machine. I reconnected the lights, but left the power supply box disconnected. The power supply was 24V for the motors and 5V for the control board. Great, that shouldn't be hard to find. I labeled the wires for the power supply outputs so we'd know where the wires were supposed to go on the new power supply when we got one. </p> <p>We lacked any ticketing or record keeping system for repairs of machines that belonged to us, so I just wrote on a blank piece of paper that the machine needed a new 24V/5V power supply, and a new cord or plug (The missing ground prong was the reason the machine became live on the outside. With a ground prong, the fuse would have simply blown instead, or lower current leakage would just harmlessly go to ground) </p> <p>I worked on some other machines, did some cleaning and busy work until closing time and went home for the day. </p> <p>The next day, I see the claw machine back out on the floor already. Given that both of my coworkers had a track record of disregard for electrical safety, I had little doubt it was still a shock risk. Indeed, I grabbed my voltage detector pen, poked the metal coin door with it, and found that it was live, again! They had hooked the same power supply back up again, and didn't replace the plug! If they had done <em>either</em> the machine wouldn't be live! But where did they get another fuse? I pulled out the original, and we didn't have any in stock as far as I knew. Unless.... You guessed it, they bypassed the fuse to get the machine running again, effectively going for double Jeopardy: Now you can get shocked AND burn the store down! Of course, what else are claw machines for?</p> <p>I called my boss and, since he of course didn't pick up, I basically left a message saying that someone else had undone all my safety measures and put the machine back out on the floor, still unrepaired, still a shock hazard to customers who simply wanted to play the machine. This time, the machine was in a different position and I was able to safely reach the plug without pulling the breaker first. </p> <p>I honestly can't imagine how the idiot managed to plug it in without touching the metal parts, which would have immediately clued him in that neither I nor the customer were joking when we said it was shocking people. </p> <p>Now you're all saying &quot;cut the plug off&quot; and yes, in hindsight I probably could have done that. However, I figured the boss might consider that destruction of the store's property (even though that would be the first step to putting a new plug on the end of the cord) which is why I didn't do that. That said, I had pretty much run out of any other options that didn't involve physical violence. </p> <p>After unplugging the machine, I disconnected the power supply from the inside, then plugged it back in so the lights would be on, therefore my idiot coworkers would be none the wiser until/unless they actually tried to play it, or looked at the little LED screen that was supposed to show the credits and time. </p> <p>To be clear, the machine was now technically safe to touch for people. It just wouldn't work with the power supply disconnected, but it wouldn't shock people either.</p> <p>Whoever pulled it back out was clearly fixated on having a claw machine out on the floor. Therefore, I decided to look and see if we had a power cord and power supply from another machine so we could have the claw machine working again. </p> <p>I asked my coworkers if they knew of any machines that we could use for parts. They both said no. I asked if they knew of anything else that used a 24V supply. They had no idea. Well, thanks for nothing, I guess.</p> <p>This was the only claw machine we had in the store, so using another one for parts (or using this one for parts to fix that one) wasn't an option. I went to the back room and checked if we had any power supplies. Finding anything back there was always a chore due to the lack of organization. I found that most of them were 12 V power supplies. I didn't think wiring them in series for 24V would actually work due to the capacitors in the power supply, and I'd hate to ruin a good power supply trying it. </p> <p>Well, I decided to take a closer look at some other machines to see if their power supplies will work. Nah, most of them are 12 volts. But, a long-deceased driving game (the motherboard quit) with a force feedback motor on the steering wheel had a 24V power supply that still worked! I put a note on the machine &quot;Power supply removed for claw machine up front, PS make / model was x/y, specs were z&quot; so if anyone objected, they could revert it to it's original state, and if they found a replacement motherboard, they'd know what power supply to get. Now for the cord.</p> <p>Every machine I could find back there had the ground prong missing. What the heck is it with the lack of ground prongs? Pretty much everything in the back either belonged to a customer, or appeared to be a &quot;scrap&quot; machine. But there was nothing I could &quot;steal&quot; an intact cord from, all the good ones had long since been taken to fix other machines, and none of them had been replaced. At this point I had already mentioned to the boss that we needed more cords or plugs, so I decided to not pester him about it.</p> <p>Well, I could at least half-fix the machine. With the wires already labeled, I unplugged the machine, removed the old power supply and connected the wires to the new one. I put the fuse back in, but did not connect the &quot;hot&quot; wire from the cord back to the new PSU, since we still needed to fix the missing ground issue. I figured if they saw the machine was &quot;working&quot; again, they wouldn't see the need to fix the ground issue. </p> <p>A few days later, I noticed someone playing the machine. At least they weren't getting shocked, but out of curiosity, I looked at the cord when they were done playing. What do you know, a new plug was put on. It was even done properly, what more do you want? Other than a new pulley, where the original still had a washer glued on it. </p> <p>A few more days later, the inevitable happened and the washer came unglued, allowing the string to tangle up again. I asked around about what kind of glue was used, so that I could try a different kind of glue, but no one knows what was originally used. I wasn't sure anything would work that well between metal and plastic. With the string tangled up, I was worried that if someone tried to play the machine, the up/down motor might burn out or the gears could strip. Therefore, I disconnected the power supply inside the machine once again.</p> <p>I had figured that sometime the next day, I could try super glueing the washer back on. The beginning of that day, I turned the machines on like always. I was the only one who turned them off after closing, my coworkers left them on. A few minutes later, I hear the dreaded sound of &quot;capacitor popcorn&quot; coming from the general direction of the claw machine. </p> <p>Sure enough, the claw machine was quickly filling with smoke. I unplugged it quickly and grabbed the fire extinguisher and flung the door open. There were no actual flames, so rather than actually spray, I waited to see if the smoke died down on it's own. Thankfully, it did. It was coming from the motherboard and the power supply. Oh fsck.</p> <p>I took a closer look and found that one of the connectors had been pulled out, but then put back in backwards. To be fair, they weren't keyed which meant this was possible without the use of a hammer. However, the connectors didn't need to be unplugged to begin with. I unscrewed the board and approached my coworker.</p> <p>Me: &quot;Were you messing with the claw machine, by any chance?&quot; Idiot: &quot;Yeah, the machine wasn't working again so I figured I could pull the connectors out and put them back in again and it would work&quot; Me: &quot;Well you put it in backwards&quot; Idiot: &quot;So? Just put it back the right way&quot; Me: (Screaming internally, I put the board where it's plainly visible to him, with all the burned traces, popped capacitors and chips with craters in them, all visible) &quot;It's destroyed. You reverse a connector or put it in the wrong hole, this is what happens. Did you not see all that smoke or hear those popping noises? If I hadn't been there, it might have caused a fire.&quot;</p> <p>Remember how there was no information about this machine available anywhere? Even with the manufacturer's name in hand, I couldn't even find a picture of it, let alone a manual. This meant that finding an entire circuit board, or even just a programmed microcontroller, would have been darn near impossible. Okay, I suppose it would be technically possible, but only to the extent that winning the lottery would also be &quot;technically possible&quot;. In other words, realistically, we were never going to find another motherboard for this machine. It's fate was sealed.</p> <p>TL;DR: Claw machine gets a band-aid fix for the broken pulley. Later on, a deadly electrical short occurs and both my coworkers insist that it remain plugged in despite it being a death trap. I fixed the short by replacing the power supply. Someone replaced the plug, properly. But then, one of the idiots tried &quot;fixing&quot; the machine by reseating the connectors, but accidentally reversed it and burned out the motherboard.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/dickcheney600\"> /u/dickcheney600 </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yxbefp/makes_you_want_to_claw_your_way_to_a_new_job_part/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yxbefp/makes_you_want_to_claw_your_way_to_a_new_job_part/\">[comments]</a></span>"
}