{
  "title":"Makes you want to \"claw\" your way to a new job, Part 1",
  "date":"2022-11-16T15:52:51.000000Z",
  "author":"/u/dickcheney600",
  "id":"t3_ywx4zm",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/ywx4zm/makes_you_want_to_claw_your_way_to_a_new_job_part/",
  "content":"<div class=\"md\"><p>At this crappy gameroom store I used to work in, we had a claw machine. Ever since I had started there, the claw had been stuck: it would move forward, backward, left and right, but not up and down.</p> <p>I took it upon myself to try and figure out the problem. First, I opened it up and unscrewed the cover over the &quot;box&quot; that held the mechanism that moved the claw up and down. One of the plastic pulleys was broken in such a way that the little string could slip off and get stuck. Indeed, the string was already tangled up every which way. Now, I hadn't dealt with a claw machine before, so some kind of manual would help if I could find one. I'll also need to figure out who built the thing to be able to order a part for it. </p> <p>Now, the claw machine had a name on the &quot;marquee&quot; but it did not show a manufacturer's name. I opened up the machine and look for any evidence of who made the thing. There is none: the machine is literally built with no-name parts. The motors, the board, the power supply, all lack any manufacturer's name on them. On an unrelated note, I found a manual for a completely different machine, stuffed inside this claw machine.</p> <p>Well, the machine itself obviously wasn't the best place to find the manufacturer's info in this case. So I punted and just Googled (name of machine) claw machine. </p> <p>Well, disappointingly, after going through page after page (while doing other things around the store in between) I found practically nothing pointing me in the direction of who made this thing, or even, for that matter, if the company still exists.</p> <p>Later, someone found an old brochure online from a well-known arcade game manufacturer, advertising the machine. A company that was still in business! Great! So I called them up. </p> <p>Oops, premature celebration. It turns out that company also used to <em>sell</em> other machines that they themselves did not make, and this was one of them. The company that actually made the machine itself had long since gone bankrupt. The support rep also didn't know of any machines that shared any parts with this one. But on the other hand, I am now armed with the name of the original manufacturer, so I may not be able to order original parts, but I could probably find information about how this thing is supposed to work so that I can rethread the string properly.</p> <p>Armed with the name of the manufacturer, I turned to Google again. I Googled and Googled until my Googler was sore, and, for the lack of a phrase that rhymes, I found ZERO evidence that the manufacturer <em>ever</em> existed or what they made.</p> <p>I had tried (name with an A) and (other name with an O) in case I heard the guy wrong over the phone. I tried it as one word, and as two words. None of which yielded any additional results to even tell me which name was accurate.</p> <p>In short, I was back to square one.</p> <p>The next time I came back to this machine, I decided to try finding parts another way. I used calipers to take measurements of the pulleys that the string wrapped around, so that I could order replacements whose measurements matched. </p> <p>As I looked up claw machine parts, I was rather disconcerted to find that, out of everyone that makes or sells parts for claw machines in general, <em>all</em> of them listed the specific machine(s) that the parts would fit and <em>none</em> of them listed the dimensions! So my measurements weren't worth a quarter.</p> <p>Later on, a light bulb came on over my head. Perhaps some industrial suppliers might sell pullies for other purposes that happen to match the size, or at least be close enough? After all, there's nothing particularly extravagent or unusual about these pullies as far as I can tell. </p> <p>I spent some time searching around industrial machine suppliers that took small-quantity orders. I decided to simply forward links to the product pages to my boss, so that he could research the actual suppliers and decide on which one was the best one to use. I also forwarded the measurements as well, in case he had another kind of machine with a similar enough part to fit, or for that matter, try to fabricate something. I also pointed out that the plug was missing the ground prong, so we would need to order more replacement plugs unless we had some somewhere that I didn't know about.</p> <p>Stay tuned for the second part of the story.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/dickcheney600\"> /u/dickcheney600 </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/ywx4zm/makes_you_want_to_claw_your_way_to_a_new_job_part/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/ywx4zm/makes_you_want_to_claw_your_way_to_a_new_job_part/\">[comments]</a></span>"
}