{
  "title":"Accused of breaking into my own office",
  "date":"2022-11-16T22:07:11.000000Z",
  "author":"/u/__Mattt__",
  "id":"t3_yx7tmg",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/yx7tmg/accused_of_breaking_into_my_own_office/",
  "content":"<div class=\"md\"><p>First time posting. </p> <p><strong>Background</strong>:<br> I used to work in a NOC for an WISP, and we also fielded the user calls. I was a senior engineer which was basically a glorified L1 engineer that took charge in Managers absence. </p> <p><strong>STORY:</strong><br> It was a Sunday I had started work nice an early and was the senior engineer on duty with 2 other junior engineers. </p> <p>An outage occurred in quite a large segment of out network so we where all hands on deck fielding calls for a 200 - 300 user segment of the network, when I received a call from a user.</p> <p>&quot;Thank you for Calling [Company Name] Your speaking to Matthew, How can I assist?&quot; I say in my best telephone voice.</p> <p>She replies &quot;My Internet is off&quot; in a frustrated tone.</p> <p>At this moment I realize the customer is upset and most likely affecting by the outage we have, but due to process I need to create a ticket and link user to the parent case for email and SMS updates on the ongoing issue.</p> <p>Kindly ask the user &quot;No problem Ma'am, I just need to locate your account. Please may I have the account holders name and an email address or account ID?&quot;</p> <p>She then screams &quot;[Customers Physical address]!&quot;</p> <p>Now normally this is enough to locate an account but we are tasked to confirm 3 or more details on the account to make sure that we are speaking to the user in question and to ensure that we are somewhat upholding GDPR and not leaking information.</p> <p>I kindly repeat to the user &quot;Please may I have the account holders name or telephone number as well?&quot;</p> <p>She then proceeds to scream at me &quot;YOU DO NOT NEED THIS INFORMATION I HAVE DEALT WITH THIS TECH SUPPORT MORE TIMES THAN I CAN COUNT BECAUSE MY INTERNET IS SO SH$#...!&quot;</p> <p>At this moment I give the customer the benefit of the doubt and understand internet problems are frustrating and ask the user &quot;Please ma'am, I require this information to confirm that I am speaking to the account holder&quot;</p> <p>User goes quite for 10 seconds there is an awkward silence...</p> <p>User: &quot;You dont work for [Company Name], Do you?&quot;</p> <p>Shocked by the question because who in their right mind would want to work in a call center during an outage &quot;Excuse me Ma'am???&quot; I reply confused.</p> <p>&quot;Your a Thief! You have broken into the office and are stealing customers info...&quot; </p> <p>I cut the call mid sentence, I look at my Juniors who are both staring at me and say &quot;I am not paid enough to deal with that...&quot; </p> <p>Customer proceeded to call over and over but I spent the next 2 hours dropping her call every time I saw it in the call queue.</p> <p>Let my boss know to check the call recordings, I get a laughing emoji in response.</p> <p>​</p> <p>6 Days later I find 16 customer service complaints logged against me that no-one in management or Customer service team told me about.</p> <p>Listen to the Voicemails attached to tickets. </p> <p>&quot;Hello??? There is someone in your office stealing peoples information, I am worried about your staffs safety. He kept asking me for my information and when I asked him why he needed this information he told me it is because it is what I want and when I asked him if he truly works for [Company name] he said no he doesn't and told me to F#$% Off.... Please I am worried about your staffs safety... and also my internet is off&quot;</p> <p>I must have listened to this voice recording a 100 times and was declared the Data Thief of the office. </p> <p>Never dealt with a more delusional customer before, I asked the higher ups if they terminated her contract like they have in the past for abusing staff on the phone they neither confirmed or denied that they had but we have never heard from them since :) </p> <p>Don't let customers treat you like trash.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/__Mattt__\"> /u/__Mattt__ </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yx7tmg/accused_of_breaking_into_my_own_office/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yx7tmg/accused_of_breaking_into_my_own_office/\">[comments]</a></span>"
}