{
  "title":"Just so we're clear - you do all know your passwords, right?",
  "date":"2022-11-11T07:24:33.000000Z",
  "author":"/u/mattthepianoman",
  "id":"t3_ys41pg",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/ys41pg/just_so_were_clear_you_do_all_know_your_passwords/",
  "content":"<div class=\"md\"><p>I'm a sysadmin/database admin/developer (jack of all trades, master of none) for a small company that recently took on a few developers to build and maintain company-specific applications.</p> <p>We were getting a HUGE number of SSH login attempts to our main application server from bots originating mainly from Russia and the Far East. Obviously the root account is locked down tight, but the big bosses wanted us to do something, so I suggested login rate limiting and IP banning for repeat offenders. We had the usual meeting that could have been an email to decide on the specifics, and we settled on 5 failed attempts in 10 minutes resulting in a roughly 2 hour IP ban, which increased exponentially for each subsequent string of failed attempts within a certain time period. For obvious reasons we white listed various important IPs so that we couldn't lock ourselves out.</p> <p>I tested a couple of solutions before settling on one, and before pulling the trigger we had another meeting to make sure that everyone could log in and knew their passwords, and that everyone had their main WFH machines set up using key-based login. We also unofficially agreed that the first dumbass to lock themselves out would have to buy the person who had to unblock their IP a bottle of spirit of their choice.</p> <p>The new policy went live at 4pm yesterday. At 8:30pm I get a phone call from one of our senior developers asking what bottle I wanted. He had left his WFH machine at home and had used his personal laptop to try to SSH in, but without specifying a username so it defaulted to his local machine's username. It only took 4 and a half hours before I had to perform my first unban.</p> <p>Looks like I'll be enjoying a bottle of rum this weekend. Cheers!</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/mattthepianoman\"> /u/mattthepianoman </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/ys41pg/just_so_were_clear_you_do_all_know_your_passwords/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/ys41pg/just_so_were_clear_you_do_all_know_your_passwords/\">[comments]</a></span>"
}