{
  "title":"In case of stupid wiring, break device",
  "date":"2022-11-14T23:56:04.000000Z",
  "author":"/u/dickcheney600",
  "id":"t3_yvguwt",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/yvguwt/in_case_of_stupid_wiring_break_device/",
  "content":"<div class=\"md\"><p>I worked at a company that made 110VAC and 220VAC motors, all of which had some degree of control intelligence built into them. Some of them only had a soft-start routine along with current protection (so if something stopped the motor from turning, it wouldn't burn out) but others allowed an input from an external system to control them. The soft start ability would save energy in the long run for things that had to cycle on and off a lot.</p> <p>The previous owners of the building also had the need to test certain things on 220VAC as well. How did they do this? No, of course they didn't use a proper outlet into which only 220VAC plugs would fit. They wired a regular 110VAC outlet to be 220VAC instead. You can probably guess where this is going.</p> <p>So as I understand it, they wanted to use the power strip as a convenient switch for their motor. The power strip they chose was also a surge protector, which by definition does something to prevent an excessive voltage from reaching devices plugged into it. There are power strips that are JUST power strips, and we had several of those, which didn't give a hoot about the input voltage. Surge protectors, on the other hand, <em>must</em> react to an overvoltage, by definition.</p> <p>I was working on something else when my coworker brought me the surge protector. He admitted that he hooked it up to 220 and it went &quot;pop&quot; and didn't work anymore. I set it aside, and kept at my current project until I was done with it. </p> <p>Later on, I had nothing better to do, so I decide to take apart the surge protector, assuming there's any way to do so non-destructively in the first place. And indeed, there was. It wasn't designed intentionally to <em>prevent</em> repairs, but it wasn't designed with repairs in mind, either. I'll leave it at that. </p> <p>I was looking for a fuse, but before I even found it, I saw the problem. The traces that once carried the input power were <em>gone</em> and the surface of the board itself has two big burn marks where the traces used to be. There actually <em>was</em> a thermal fuse next to the MOVs, as well as a circuit breaker which was part of the switch. Both of which did diddly squat. I'll explain in a comment how (most) surge protectors work.</p> <p>I showed my coworker the burned up board, and he thankfully didn't try to get me to &quot;fix&quot; it. </p> <p>TL;DR: electrical codes exist for a reason. A 110V outlet wired for 220V is a recipe for disaster</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/dickcheney600\"> /u/dickcheney600 </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yvguwt/in_case_of_stupid_wiring_break_device/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yvguwt/in_case_of_stupid_wiring_break_device/\">[comments]</a></span>"
}