{
  "title":"\"Don't hate the data, hate the game\"",
  "date":"2022-11-17T01:47:09.000000Z",
  "author":"/u/LongIslandTrooper",
  "id":"t3_yxd00u",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/yxd00u/dont_hate_the_data_hate_the_game/",
  "content":"<div class=\"md\"><p>I dont post alot of tales but after a conversation with a co-worker she suggested i MUST share this tale. </p> <p>Picture IT. </p> <p>Its 2010. </p> <p>Im a Network Admin at a financial institution. We were looking to move to VOIP from an OLD and i mean old PBX system. I had some VOIP experience so guess who they asked from IT to get this started. Easy guess , me.</p> <p>We went through a few vendors and a few demos and after a couple of months and a little coaxing we went with the Cisco solution. Fast forward we implement the solution and after a few late nights and long days all is well. I maintain the system on the network side and since i have previous experience with VOIP i learn as much as i can when comes to CUCM and UCCX (Keep UCCX in mind). Over years i take various training classes and overall be become pretty proficient in all things CUCM and UCCX. I also develop some pretty good contacts that i can lean on within Cisco for help with anything i may need some some assistance on. Keep in mind these contacts are outside of Cisco TAC.</p> <p>Fast forward a few years and a new VP of the Dept the Contact Center is in is assigned to head up the dept. He goes over some of the reporting and does not like the numbers. I just heard this via hearsay. My thinking is &quot;I guess some changes may need to be made personell wise to achieve the numbers you want&quot;. Mind you i just said this in my head, i never expressed this to anyone. It was just a thought. A couple of weeks go by and i get a call asking to attend a meeting later that day. No big deal i get to the conference room and its the VP of the Contact Center, and the Contact Center supervisors. We all exchange pleasantries and they get to meat of why they asked me here.</p> <p>VP - &quot;We been looking at these reporting numbers and we don't think that they are right&quot; </p> <p>Me - &quot; What do you think is off with the numbers&quot; </p> <p>VP - &quot;Call Center Supervisor #1, can you explain further?&quot; </p> <p>Call Center Supervisor #1 - &quot;These numbers are all off. We think some of these people had to be taking more calls than this. Something must be wrong with the system </p> <p>Me - &quot;Let me know exactly what report you are running and i'll look into it.&quot; </p> <p>They send me the name of the report and off i go into report land. The land of pulling numbers from a database and checking on its accuracy. After a couple of days of trouble shooting i'm really not seeing anything wrong. I note my findings via email and don't hear anything back. I'm thinking the matter is closed but little do i know in an exective meeting its being told that the numbers are &quot;way off&quot; and LongIsland is wrong and does not have a clue. The system is wrong.&quot; </p> <p>Now i have no problem being wrong but in this case the data is the data. Just because you don't like whats in the report doesn't mean I or the report is wrong. Time to step this up a notch. I decided to get on the phone with a few of my contacts at Cisco. I sent them over the reports and we performed a quick webex and determined the reports were indeed legit and made sure i had their verification in Email. I scheduled a meeting with the Cisco Contacts, Contact Center VP, Supervisors and my VP to go over the findings and the meeting sort of went like this.<br> After exchanging introductions. </p> <p>Cisco Contact - &quot;So heard you are having some issues with numbers generated on this particular report.&quot; </p> <p>Contact Center VP - &quot;Yeah these number are way off, they cannot be right. We think there is issue with the system.&quot; </p> <p>Cisco Contact - LongIsland and i went over the system and the numbers thoroughly and i really dont see any issues. Usually in cases like this the customer wants the numbers to reflect what they feel they should reflect. The numbers pulled from the database are just that. They cannot be manipulated in any way. Usually when they don't produce the results you want that is a personell issue not a data issue. We do have a few consultants that can help you acheive the numbers you are trying to attain. if you like i can reach out to them on your behalf.&quot; </p> <p>Silence </p> <p>Me - I guess we will have to take this offline. Thanks for your help Cisco Contact. </p> <p>And that was that. It was hard to keep that shit eating grin off my face and my VP knew it. I never heard about any issues with UCCX reports again. The phone menu is a diffrent matter, but that is for another time.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/LongIslandTrooper\"> /u/LongIslandTrooper </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yxd00u/dont_hate_the_data_hate_the_game/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yxd00u/dont_hate_the_data_hate_the_game/\">[comments]</a></span>"
}