{
  "title":"Harvest. Don't harvest! Harvest. Don't harvest!",
  "date":"2022-11-10T15:22:42.000000Z",
  "author":"/u/DrHugh",
  "id":"t3_yri789",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/yri789/harvest_dont_harvest_harvest_dont_harvest/",
  "content":"<div class=\"md\"><p>So I lead a corporate IT team that supports a particular kind of platform; back in the day, these were first called PDM systems, for Product Data Management, as they worked like electronic libraries where people could only check-out files if they were checked in.</p> <p>Our ticketing system for user support has groups for the different teams. We have a &quot;Corporate PDM&quot; group for our team's stuff. If any other organization at the company needs to assign a ticket to us, they just put it in the &quot;Corporate PDM&quot; group and we get notified of it. There is even a document in the ticketing system, so if you search for &quot;PDM&quot; then this document comes up and says, &quot;Assign to the 'Corporate PDM' group.&quot; We can see on a ticket if someone searched for such a ticketing system document and indicated it was the solution.</p> <p>Our corporation acquired another company a few years back. One thing that Old Company -- let's call them OLDco -- had in-progress was an attempt to put a PDM system in place.</p> <p>At first, it sounded like our PDM group would have to provide support to the users of this other PDM system, but our management wanted it kept separate from our &quot;normal&quot; tickets. So we created a new group in the ticketing system, called &quot;Corporate PDM - OLDco&quot; to be distinctive.</p> <p>After having done that, and after the folks at that acquired company saw our PDM system, they decided to abandon their project. We never used the group, and we dropped members from it, so no one got notifications about it.</p> <p>Our mistake was in not requesting deletion of the &quot;Corporate PDM - OLDco&quot; group at that time.</p> <p>Every so often, the ticketing system people see this unused group and decide to harvest it. They ask me, and I say to go ahead. Then they come back and say they can't, there's a ticket in it.</p> <p>Lo and behold, they are right. Such tickets are put in by folks in IT helpdesks in other countries. We all use the same ticketing system, but apparently they hear that someone was once part of OLDco, so they look for groups with OLDco in the name to assign the ticket. It is important to understand that there are no ticketing system help documents that tell anyone to use the &quot;Corporate PDM - OLDco&quot; group. Not one. So these other helpdesk people are not following proper procedure in assigning tickets.</p> <p>So, I take the tickets (which are weeks or months old at that point), reassign them to the proper group, ask the IT agent who assigned them to the wrong place why they did it, and to update whatever documentation they are using, because they shouldn't do this again.</p> <p>But the next time a harvest cycle comes around, the same problem crops up with someone else who put a ticket in there. It's like playing whack-a-mole with a game that's been put in storage, but someone won't unplug it while a mole is sticking up, and they won't let the person who whacks the mole do the unplugging.</p> <p>It feels like I've been doing this every quarter of the last two years. Today, I got ahold of someone who is involved in the harvest process, and he says they will expedite the harvest, hopefully it will happen tomorrow.</p> <p>I'm keeping my fingers crossed, but I am not holding my breath.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/DrHugh\"> /u/DrHugh </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yri789/harvest_dont_harvest_harvest_dont_harvest/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yri789/harvest_dont_harvest_harvest_dont_harvest/\">[comments]</a></span>"
}