{
  "title":"Just your average network failures for no apparent reason",
  "date":"2022-11-08T17:19:40.000000Z",
  "author":"/u/Scorpious187",
  "id":"t3_ypskyb",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/ypskyb/just_your_average_network_failures_for_no/",
  "content":"<div class=\"md\"><p>Yesterday (Monday) I came to the office, and for some reason, most of our phones were down. I did troubleshooting on them, called the company, they said it looks like the phones are dead. Ordered new phones.</p> <p>Today I get to the office early, and nothing is working. No phones, no computers, nothing can connect to the internet. I'm like, what the hell is going on...</p> <p>Last Friday we had a bunch of storms roll through and knock out power for a few minutes, on and off. Yesterday I was thinking that maybe the power outage blew up the phones somehow, 'cause some of them were still working. But then I plugged in a spare phone that was new in the box to test it... dead.</p> <p>*<em>angry IT Guy noises</em>*</p> <p>Then today nothing would connect at all. I'm thinking &quot;Did the storms blow out my network switch somehow?&quot; Except there were three devices in the building that still had connectivity throughout all this, and they were all connected to the switch with all the other devices that were failing. And some of the devices that weren't working earlier started working for a bit, and then stopped again.</p> <p>Now I'm even <em>more</em> confused.</p> <p>Then I logged onto the one computer that could still connect, and went back to my training: I ran ipconfig. Checked all the settings, everything looked right. I checked all the settings on another computer that couldn't connect, and the Default Gateway was wrong. I'm like, &quot;why do these two have different Default Gateways... how the hell did that happen...&quot;</p> <p>And then I realized what the IP address it was pointing to was:</p> <p>The security camera DVR.</p> <p>Tuesday of last week, the security camera company came in and put in a new DVR. For reasons I don't understand, even though they knew the old camera DVR was on my main network and all the cameras they were setting up were analog cameras directly connected to the DVR... they set it up as a DHCP server. So when Friday rolled around and the storms knocked out our power, everything started getting its IP addresses from the DVR instead of my network's DHCP server.</p> <p>Went into the DVR settings to confirm... sure enough, they had its DHCP server turned on. Turned that off, rebooted my network switches, and everything went back to normal.</p> <p>It's Tuesday and I already feel like I've worked a full week.</p> <p>Edit: Couple points...</p> <p>First of all, the reason these aren't on a separate VLAN is they're old-school analog cameras that are wired to the DVR over coax, not IP cameras. When the original installation was put in, VLANs and digital IP cameras didn't even exist. That's what I'm workin' with here. Our company is small and we can't afford all this new-fangled &quot;technology&quot; like cameras from this century and whatnot (trust me, I tried, the purchase got denied)... so cut me some slack here. :P</p> <p>Second: Yes I cancelled the phone order. :D</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/Scorpious187\"> /u/Scorpious187 </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/ypskyb/just_your_average_network_failures_for_no/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/ypskyb/just_your_average_network_failures_for_no/\">[comments]</a></span>"
}