{
  "title":"Why aren’t you done yet?",
  "date":"2022-11-08T01:46:23.000000Z",
  "author":"/u/Architect_of_Sanity",
  "id":"t3_yp7oxo",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/yp7oxo/why_arent_you_done_yet/",
  "content":"<div class=\"md\"><p>I’m helping a client get licensing under control and from the initial evaluation, they’ve spent hundreds of thousands of unnecessary dollars on licensing on specific software because they deployed around without considering the type and versions they’re installing. </p> <p>No worries fam, I don’t charge you a dime as I’m a presales resource here to help. </p> <p>I need to gather a detailed list of your site locations, quantities of users, and current work loads and I offered to help do it. I just need help to show me where all your sites are and how to get to them. </p> <p>Oh no can’t do that, now that was asking too much. Now I’m getting random spreadsheets without half the information in them and god knows what locations they apply to. </p> <p>My dude, I don’t know your shorthand naming conventions because you haven’t shared any of this with me, I don’t understand what the numbers are in this csv files your coworkers are sending me without any labels or context… </p> <p>I’ve provided exactly what I needed and you can’t even follow basic instructions or provide these requirements. </p> <p>I came close to flipping my desk over this afternoon when the client had the balls to complain about the delays in our audit report and they’re pissed they just got their renewal bill from vendor X and it blows their budget out of the water unless we do our job. Insert mute button tirade. Unmute button “offering assistance to gather the data requested so we can help them slash that bill”</p> <p>I’m strongly leaning on the account manager to fire this customer… thanks for listening. </p> <p>I’m fucking tired of working my ass off for thankless fuckups that land in these IT leadership roles in companies.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/Architect_of_Sanity\"> /u/Architect_of_Sanity </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yp7oxo/why_arent_you_done_yet/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yp7oxo/why_arent_you_done_yet/\">[comments]</a></span>"
}