{
  "title":"\"Can you help me bypass those pesky US-sanctions?\"",
  "date":"2022-11-15T17:45:11.000000Z",
  "author":"/u/SonOfAQuiche",
  "id":"t3_yw4c9j",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/yw4c9j/can_you_help_me_bypass_those_pesky_ussanctions/",
  "content":"<div class=\"md\"><p>So this one is fairly short, but I was absolutely in awe.</p> <p>I work as second line support for a big multinational. Not going into further detail, because of reasons. I also have additional duties regarding tech support of meetings and other events involving MS Teams and a multitude of other tools. </p> <p>A couple of months ago I received a long e-mail chain regarding an online meeting between sites in around a dozen different countries including mine. I read through the entire chain and it boiled down to: the meeting itself always works fine, but for some reason we always have issues with the Q&amp;A. One site has issues accessing it. It was never mentioned which site.</p> <p>I contacted the person, who sent it to me:</p> <p>Dear User,</p> <p>Could you please elaborate on the issues this site is facing? We use this tool every day on site and it never appears to make problems.</p> <p>Best Regards,</p> <p>Quiche</p> <p>User then replied:</p> <p>Dear Quiche,</p> <p>The participants in question are situated in Iran and they have difficulty accessing the Q&amp;A. It is probably due to the sanctions from the US against Iran. Do you know any way we can bypass them?</p> <p>Kind regards,</p> <p>User</p> <p>I sat there at my desk, comprehending what was asked of me. My eyelids opening and closing by themselves, probably spelling out The Hague in Morse Code or something. My internal monologue went something like &quot;sure thang just let me hit up old Joey and deal with this Malarkey right away. Might solve the FUCKING MIDDLE EAST CRISIS, while were at it amirite?&quot; </p> <p>I am not sure on what lists I just ended up on just being involved in an e-mail exchange with the words 'bypass US-sanctions' in it. I will try to avoid visiting the US for a good while until I need my prostate checked by the TSA.</p> <p>I replied to user:</p> <p>Dear User,</p> <p>Please consider using [other common tool]. </p> <p>Best regards,</p> <p>Quiche</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/SonOfAQuiche\"> /u/SonOfAQuiche </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yw4c9j/can_you_help_me_bypass_those_pesky_ussanctions/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yw4c9j/can_you_help_me_bypass_those_pesky_ussanctions/\">[comments]</a></span>"
}