{
  "title":"That time I thought I'd be dismembered by a mob boss",
  "date":"2022-11-14T17:51:25.000000Z",
  "author":"/u/darkhelmet46",
  "id":"t3_yv70bb",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/yv70bb/that_time_i_thought_id_be_dismembered_by_a_mob/",
  "content":"<div class=\"md\"><p>Note: This story is real. In accordance with the rules, the names of the people and businesses involved have been changed.</p> <p>This story goes back to the early 2000's. I was working for an IT support company located in the city of New Bedford, Massachusetts. New Bedford has a rich fishing history and was once considered to be &quot;the whaling capital of the world&quot;. In fact, the story of &quot;Moby Dick&quot; takes place in this very city. However, at the time this story takes place, New Bedford would more accurately be described as &quot;the Mos Eisley of Massachusetts&quot; - you would never find a more wretched hive of sum and villainy. Especially on the waterfront.</p> <p>The fishing industry being the main center of commerce for New Bedford, many of our clients were in this line of business. One client in particular, Stormy Seas Fisheries, is at the center of this story. Stormy Seas was a good client. They were easy to deal with, paid their bills, rarely complained, and were not too demanding. We enjoyed supporting them.</p> <p>One day I walked into the office and the owner of the IT company, his wife, and several employees, were standing around talking with concerned looks on their faces. There was a story in one of the local newspapers which reported Stormy Seas was the victim of a literal &quot;hostile takeover&quot; where a man named James Greco literally held a gun to the owner's face and informed him he would be taking over. We came to learn that James was a major figure of organized crime in the area.</p> <p>The discussion was about what to do about the situation. As I said, Stormy Seas was a great client and we'd hate to lose them. After some deliberation the decision was made to keep them on and just see how it goes. So we did, and things went along just as before. We'd show up onsite, the same people were there, no weird vibes, no red flags, no sign of this mysterious organized crime figure. Stormy Seas continued to pay their bills no questions asked and we happily continued supporting them.</p> <p>This went along for several months, and honestly most of us had forgotten all about the whole hostile takeover bit because as I said, no weirdness came out of it. Then one day we got a call from a woman we had never heard of but who claimed to work for Stormy Seas Fisheries and was reporting a problem with the internet connection at their house and asked if we could urgently send someone by. We weren't really in the business of doing residential work, but since Stormy Seas was such a good client we figured we'd do them a favor and send someone. That someone ended up being me. Me, a young and naïve 20-something with too much innocence and zeal for his own good. So I drove out to the address in a wealthy part of a neighboring town. As I pulled up to the house I drove past a Ford Explorer SUV with dark tinted windows and bristling with antennas sitting on the side of the road near the end of the driveway. I thought that was odd but I paid it no mind as I pulled into the driveway and arrived at what locals would have described as a &quot;Portuguese Palace&quot;. Those familiar with the area would know what I mean. An expansive front lawn lined by a wrought iron fence, a long gravel driveway leading to an ornate concrete staircase with concrete lion gargoyles on either side, terminating at a large house with a brick and stucco finish and a gigantic wooden door.</p> <p>I strolled up to the door and rang the bell. It opened, and I was suddenly faced with what could best be described as a human grizzly bear who dwarfed my wiry 5'11&quot; frame. A large, imposing man who looked like he hadn't shaved or changed clothes in about a week. Taken aback, I looked up at the man, held out my hand and sheepishly said &quot;Hi, I'm Dark Helmet, I'm here to fix the computer.</p> <p>&quot;The man smiled, gripped my hand with his giant meat paw and said &quot;Hey, nice to meet you! Jimmy Greco!&quot;</p> <p>I felt my entire body tense up. I tried to maintain my composure but I'm pretty certain my eyeballs were bulging out of my head as I remembered the newspaper story as an image of this man stalking into the office of Stormy Seas Fisheries and holding a gun to the owner's head flashed before my eyes.</p> <p>I think I blacked out a bit because the next memory I have is of me in the living room sitting at the computer at a desk in the corner, pecking away, while Jimmy sat on the couch to my left. I glanced over at him and I noticed a bulge under one of his pant legs near the ankle. An ankle bracelet, I realized. Suddenly it all came together. Jimmy's disheveled appearance. The unmarked SUV watching the house. The urgent need to repair the internet. This man was under house arrest! I would later learn the SUV belonged to the FBI.</p> <p>So Jimmy was sitting there just jabbering my ear off with small talk. He seemed almost giddy to have someone new to talk to. By the way, you have to imagine his voice in the stereotypical baritone NY City gangster accent you hear in movies, because that's exactly what he sounded like.</p> <p>&quot;So anyways, what'd you say your name was again kid?&quot;</p> <p>I replied nervously, &quot;Dark Helmet&quot;.</p> <p>Jimmy leaned back and pensively said, &quot;Helmet… Helmet… I know a few Helmet's…&quot;</p> <p>Me: &quot;Yeah, well I know my uncle Bill is friends with Chris.&quot; (Chris was another guy who worked at Stormy Seas, and my uncle was notorious for having friends in low places.)</p> <p>Jimmy cocked his head to the side in thought as he pondered. &quot;Hmmm… Helmet… Billy Helmet… Hey, didn't he have a twin brother?&quot;</p> <p>Not really sure where this was going I replied, &quot;Yeah, Tom. That's my dad.&quot; (They are identical twins.)</p> <p>Jimmy's eyes narrowed as he leaned forward towards me, gesturing with his index finger at me as he spoke. Sort of jabbing at the air towards me with his finger.</p> <p>&quot;Yeah, Tom Helmet! TOM HELMET!&quot; He said excitedly, his eyes gleaming. &quot;You know, I was in Walpole once. He was one of my CO's!&quot;</p> <p>Walpole was a prison. CO stands for Corrections Officer. Prison guard in layman's terms. Yes, my dad worked there.</p> <p>I froze and just stared blankly at the screen in front of me as I felt the blood drain away from my face. &quot;I'm dead. I am never leaving this house alive. I'm going to be killed and dismembered and buried in this man's back yard.&quot; These thoughts raced through my head as I tried to judge my ability to spring from my chair and dash out the door before Jimmy had time to leap from the couch and tackle me.</p> <p>Then, the unexpected happened. Jimmy relaxed and leaned back as his face brightened and he said, &quot;You know, he was a REALLY nice guy!&quot;</p> <p>I'm pretty sure I visibly breathed a sigh of relief and relaxed as I felt the color return to my face. Jimmy went on and regaled me of stories of my father's kindness while he was imprisoned in Walpole. Come to find out, my dad was the night kitchen officer. Some inmates who had certain dietary needs or medical conditions were allowed a carton of milk in their cell after hours. Jimmy at the time was a young 18 year old kid. My dad took pity on him and would bring him any extra milk he had, even though Jimmy technically wasn't allowed to have it in his cell.</p> <p>I still had work to do and Jimmy was still talkative so the banter continued.</p> <p>&quot;So, you got any brothers or sisters?&quot;</p> <p>&quot;Yes, I have a younger sister.&quot;</p> <p>&quot;Oh, and what does she do for work?&quot;</p> <p>&quot;She's a massage therapist.&quot;</p> <p>&quot;Oh, yeah? Massage Therapy, that's nice! You know, last year for Christmas the guys from the office got me one of those you know &quot;massage a month&quot; type deals. Dumb [expletive] only showed up three times and stopped coming. I oughta send someone out to bust her knee caps. Hey, you should give me your sister's number!&quot;</p> <p>&quot;Yeah… uh… I'll uh… give it to Chris and he can give it to you.&quot;</p> <p>&quot;Thanks, kid!&quot;</p> <p>Spoiler: I didn't.</p> <p>This is where our story concludes. I have absolutely no recollection of what the actual problem was with the computer or internet connection. I do remember texting my dad on the way down the driveway something like &quot;Hi dad, Jimmy Greco says hi and thanks for the milk!&quot; and I waved to the FBI folks as I drove past. My license plate number and description of my vehicle is probably enshrined in an FBI file in Boston somewhere. That was the last time we ever saw or heard from Jimmy Greco. Shortly after these events he was tried and convicted, but he was released from prison in 2011.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/darkhelmet46\"> /u/darkhelmet46 </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yv70bb/that_time_i_thought_id_be_dismembered_by_a_mob/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yv70bb/that_time_i_thought_id_be_dismembered_by_a_mob/\">[comments]</a></span>"
}