{
  "title":"How did you even get hired if you don't know how to use a mouse?",
  "date":"2022-11-11T17:54:56.000000Z",
  "author":"/u/Far-Ad1423",
  "id":"t3_yshqcf",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/yshqcf/how_did_you_even_get_hired_if_you_dont_know_how/",
  "content":"<div class=\"md\"><p>This is one of those times I asked myself &quot;why do I have to deal with this sh*t! Why me always??&quot;</p> <p>A caller calls in &quot;My mouse is not working. I'm trying to close a document and I point at the red x and hit enter but nothing is happening&quot;</p> <p>Me: *mutes the mic, shouts a few profanities until I feel better. &quot;Ok I can help you with this&quot;. I ask a couple of triage questions then ask caller to unplug their mouse. At this point in already know it's user error but I have to follow triage or else QA will rain upon me like a hailstorm.</p> <p>&quot;Let's unplug the mouse then use your touchpad&quot; Surprisingly, caller knows what a touchpad is, or do they..?</p> <p>Caller: I've done that but now I can't use my mouse at all</p> <p>Me: that's because we unplugged the mouse now we have to use the touchpad</p> <p>Caller: same thing, I hit enter but it doesn't close</p> <p>Me:*educates the caller on the use of right and left click.</p> <p>Caller: oh wow I didn't know you could do that!</p> <p>I go on to point out the similarities between a touchpad and a mouse, plug mouse back in and voila, it's working again.</p> <p>I was left wondering how they finessed their way through the interview process and landed a job that requires daily use of a computer!</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/Far-Ad1423\"> /u/Far-Ad1423 </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yshqcf/how_did_you_even_get_hired_if_you_dont_know_how/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yshqcf/how_did_you_even_get_hired_if_you_dont_know_how/\">[comments]</a></span>"
}