{
  "title":"A miscommunication that really heats things up",
  "date":"2022-11-06T14:47:16.000000Z",
  "author":"/u/dickcheney600",
  "id":"t3_ynrt36",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/ynrt36/a_miscommunication_that_really_heats_things_up/",
  "content":"<div class=\"md\"><p>I worked at a vending company that placed vending and arcade machines at locations like restaurants, bars and similar in exchange for either paying a fixed rent to the location owner or splitting the profits with the location owner. They also rented machines out for events and parties and such.</p> <p>This place for the most part had actual competent techs working for it. Unfortunately, I wasn't so great at helping to move large items, and they needed that more than they needed a full time tech due to their rentals and events, therefore I had a relatively short period of employment there.</p> <p>One day, we got a call from a bar that our shooting game was initially starting up okay when they turned it on upon opening up the bar, but later on it would black out and show &quot;no signal&quot; on the screen. (yes, some arcade monitors do that). We knew by the title, that this was one of those games that had a computer tower inside acting as the &quot;brain&quot; of the game rather than a custom arcade motherboard. This also meant that the tower in some cases used a standard ATX power supply, which we had several of laying round as spares for these types of games. </p> <p>After finding a power supply and verifying it worked using our tester, I headed over to the bar. </p> <p>It was soon enough after opening that the machine had not shut itself down yet, but I decided to do some exploratory &quot;surgery&quot; on it rather than just wait around for it to go wrong. I opened the back cover with the key, and thankfully, there is plenty of room around the tower to take it's cover off while it's still in place. I popped the cover off, and I saw that the CPU fan wasn't turning anymore. Well, darn. I don't think we have a spare of that. On the other hand, we caught it before the actual CPU failed: score one for whoever designed this motherboard. Clearly the computer was going into thermal shutdown. </p> <p>I noted in the ticket that the CPU fan was broken, and I took pictures of both the fan itself and the model number on the computer tower case, so that we could figure out what fan to order, or find a broken tower of the same model to pull a fan from.</p> <p>Even with thermal throttling and shutdown, it's not wise to continue to run something that has improper cooling, because hitting the upper limit repeatedly is still a good way to cause failure sooner or later. The machine had a removable power cord, so I decided to take it with me - and let the bar manager know the reason I was taking it with me. He appeared to understand so I went on my way. I also made a call to the boss and explained the whole thing. </p> <p>Fast forward about 4 weeks.</p> <p>While I was out replacing the monitor on another machine in a different location, I got a call from my boss. He said that (same shooting game) is broken down at (address) and just showing &quot;No Signal&quot; on the screen. The address sounded familiar, but I didn't make the connection in the moment. As I got closer to the location, the realization hit that it's the same one I had found the fan broken in..... But how did they even get to the point of saying &quot;No Signal&quot;? </p> <p>I entered the bar and just as I suspected, there was another power cord attached and plugged in. Sure enough, the screen is saying &quot;No Signal&quot;. I tried to reboot it, however, instead of the single short &quot;beep&quot; that this machine usually made on startup, I get an ominous series of long beeps. I forget what the pattern was offhand, but it wasn't what you would want to hear when booting up a computer.</p> <p>I took the back cover off again and found that whoever put the new power cord on hadn't even closed up the tower so it was still open. More importantly, the fan was still broken, so the CPU had been started and forced to run up to it's limits multiple times. </p> <p>Normally, I would try reseating the RAM and possibly the CPU and graphics card to see if that fixes the problem. My hope of that working here was quite thin, knowing what's happened, but I might as well try something while I'm here. </p> <p>I pulled out the RAM first amd put it back in. No change. Then I tried the graphics card. No change. The thing I saved for last, because it's not a pleasant task due to the thermal paste, is the CPU. Well, whatever, I might as well get it over with. So, I unscrewed the heat sink, removed it, undid the lock on the CPU socket and removed the CPU, then put it back in and reattached the heat sink. Lights, Camera, Action! Power on and, just as I suspected, no change. I get the same error beeps. Drat. </p> <p>I called my boss to see if he knew anything about the power cord finding it's way back to the bar.</p> <p>It turns out that he had gotten a call that &quot;the power cord is missing&quot; and he had just sent one of the other employees out there with another power cord, and that guy had just plugged it in, and when it booted up in front of him he (understandably) assumed all was well. However, neither that employee OR my boss had bothered to look at the ticket. The restaurant manager didn't mention anything either, and apparently assumed the problem was fixed or forgot what I had said, and didn't unplug the machine. </p> <p>I calmly reminded my boss to check the ticket from 4 weeks ago that had my name on it. After a moment of silence on his part, he surprisingly doesn't find a way to blame me, for once. Score one for him, but that's about all he got due to his generally poor attitude. Well, maybe two because he wouldn't have stood for the kind of crap that went on at the other game room store I had worked for previously. </p> <p>The guy who didn't look at the ticket got an earful from the boss, but I don't think that was entirely fair because the boss could have checked the ticket himself, or the call-taker if it wasn't the boss. (I don't know who picked up the &quot;power cord is missing&quot; call). I told that employee that I didn't blame him.</p> <p>TL;DR: The crap hit the fan, but the fan wasn't working anymore so the crap just stayed there.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/dickcheney600\"> /u/dickcheney600 </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/ynrt36/a_miscommunication_that_really_heats_things_up/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/ynrt36/a_miscommunication_that_really_heats_things_up/\">[comments]</a></span>"
}