{
  "title":"I do a thinky",
  "date":"2022-11-10T15:12:21.000000Z",
  "author":"/u/SubstantialTerm3843",
  "id":"t3_yrhwii",
  "link":"https://www.reddit.com/r/talesfromtechsupport/comments/yrhwii/i_do_a_thinky/",
  "content":"<div class=\"md\"><p>A story from my next job after I moved on from MyBoss. It’s another small business, my job isn’t actually IT support but of course I’m the one providing it. It’s 2011 by now.</p> <p>​</p> <p>NextBoss has a requirement for computers for a one time job in another city but with the plan to expand so the resources can be used for further odd jobs away from our main site. He wants portable and simple to set up, so about a dozen laptops.</p> <p>NextBoss: “Problem is we need to meet the documented performance requirement that a 5400RPM 2.5” hard drive won’t give us, but to go with SSDs takes us way over budget. They only come in laptops on the high end. We don’t need that high a spec for CPU and RAM but you can’t get entry or mid level laptops with SSDs”</p> <p>​</p> <p>​</p> <p>Neurons fire with the brilliance of Creation itself. Across synapses a universe is born, erupts into being with the rage and violence of the First Thought, “I AM”. The laws of physics are written in the cosmic forge, order begins it’s rule and the order is Chaos. Everything and all is fire beyond fire.</p> <p>The birth scream of reality itself soothes. It cools and hardens, forms mass. The dust settles. The dust attracts, dust to dust.</p> <p>​</p> <p>The First Life. The First Death. The first consumption of another life to sustain life, the first blood meal. The First Kill.</p> <p>​</p> <p>Alamahen urges his tamed beasts to hurry. The sun has set but the sky is lit, war has come to the valley. Fire beyond the hills, and howling. Always war, endless war. He must keep moving.</p> <p>​</p> <p>Valaceran stands accused. His heresy exposed, his books burnt and instruments smashed at his feet. He is sentenced to the flame. “The Ultimate Judgement awaits you in the afterlife!!”. “No”, he smiles as the crowd harasses him with curses and stones. The executioner throws the torch “No, it does not”.</p> <p>​</p> <p>Karalenlin steps out into the void. Hers are the first eyes to look down upon her home from above, so fragile and bright in the aching darkness. If only they could see, she wails. Powerless, hopeless. Weightless. If only they could see.</p> <p>​</p> <p>Sacaranan gives the order. “JUMP!” Spacetime kneels at the heel of the experimental vessel. Vast distances fold and touch. The technology works! To travel, NO! Not moved, but exchanged between points across the expanse in an instant! This will give their masters the decisive weapon against the enemy, victory is assured!</p> <p>​</p> <p>Menistahen gazes down in sombre anticipation. Quiet falls upon the audience chamber, crushing grinding breathless panicked silence. Finally, “There can be no doubt?”. “No, Most Excellent Majesty. There is no error, it is confirmed”. Sobbing, “Every result from across the seven galaxies concludes the same. We live in an illusion, a simulation. Reality, the entire universe is a construct. Some sort of.. process. A kind of exercise. Everything we are, everything we do, is to achieve some sort of calculation? We do not exist in the concrete sense, we are the reflections and shadows of holograms. Without any substance whatsoever”. The Eternal Emperor breaks from his being held bound dumbstruck. His first thought, his first words. His squealed begging despair. “Then why do we fight? Why have we waged.. What was it all for??”</p> <p>​</p> <p>Talahansen takes a moment. The first moment, they realise, only for themself. The first breaths, the first heartbeats not given in service, for the cause. They deserve a moment, do they not? Just a tiny share of time only for them and them alone. Why not? It doesn’t mean anything anyway. It isn’t real, nothing is. Nothing IS. All that war that never was. The moment passes. They plead, to no one but for the sake of pleading. If none of it was real, if none of us were real, if we were all nothing but the ghosts of interpretations, echoes of whispered suggestion.. Please let us become something. Please let us take any kind of form. Please let us BE. If it takes the death of a universe to end the madness, end the chaos, let it materialise. Let it matter. Let us transcend into something. Even if it’s still not real. Even if it’s still not tangible or measurable. Please let me be something. Please let me become a force, an influence. They place their hand on the activation control of the device. Please let me be an expression. Or a choice. Or a determination. Even just an idea.</p> <p>​</p> <p>​</p> <p>Me: “We could get the cheaper laptops, replace the hard drives with SSDs, grab a cheap RAID card off ebay and I build you that backup server you’ve been wanting? Lovely lovely identical model hard disks for a budget eight disk fault tolerant backup server. You get the laptops up to spec within budget plus some basic data security we desperately need. The extra drives will be your cold spares”</p> <p>NextBoss: “That’s inspired, I like that”</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/SubstantialTerm3843\"> /u/SubstantialTerm3843 </a> <br> <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yrhwii/i_do_a_thinky/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/talesfromtechsupport/comments/yrhwii/i_do_a_thinky/\">[comments]</a></span>"
}