{
  "title":"YC Founder Firesides: Mutiny on AI and the next era of company growth",
  "date":"2022-10-24T16:25:31.000000Z",
  "author":null,
  "id":"6356a9c957e9f90001984b62",
  "link":"https://www.ycombinator.com/blog/yc-founder-firesides-mutiny-on-ai-and-the-next-era-of-company-growth/",
  "content":"<img src=\"https://www.ycombinator.com/blog/content/images/2022/10/BlogTwitter-Image-Template-1.jpeg\" alt=\"YC Founder Firesides: Mutiny on AI and the next era of company growth\"><p><a href=\"https://www.mutinyhq.com/\">Mutiny</a> (<a href=\"https://www.ycombinator.com/companies/mutiny\">YC S18</a>) uses AI and data to convert website visitors into customers. Today, the fastest growing B2B companies such as Notion and Snowflake use Mutiny to identify ideal customers, determine sections of websites that will increase conversion, and produce copy that converts visitors into customers. </p><p>YC’s <a href=\"https://twitter.com/anuhariharan/status/1557784730543632384\">Anu Hariharan</a> sat down with Mutiny co-founder and CEO <a href=\"https://twitter.com/jalehr\">Jaleh Rezaei</a> to talk about their <a href=\"https://twitter.com/jalehr/status/1582352047659024385\">recent acquisition</a> of Intellipse, an AI marketing platform, as well as how AI will impact the next era of growth. Throughout, Jaleh shares advice about acquisitions as a growth strategy and evolving your product with AI. </p><p>You can listen here or on <a href=\"https://open.spotify.com/episode/7dy1qB7XQfOryE4kj4spGS\">Spotify</a>, <a href=\"https://podcasts.apple.com/us/podcast/160-yc-founder-firesides-mutiny-on-ai-and-the-next/id1236907421?i=1000583708925\">Apple Podcasts</a>, and <a href=\"https://twitter.com/i/spaces/1yNxaNzAPPnKj\">Twitter</a>.</p><div class=\"kg-card kg-audio-card\"><img src=\"https://www.ycombinator.com/blog/content/media/2022/10/anu---jaleh-edit_thumb.jpeg?v=1666624417996\" alt=\"YC Founder Firesides: Mutiny on AI and the next era of company growth\" class=\"kg-audio-thumbnail\"><div class=\"kg-audio-thumbnail placeholder kg-audio-hide\"></div><div class=\"kg-audio-player-container\"><audio src=\"https://www.ycombinator.com/blog/content/media/2022/10/anu---jaleh-edit.mp3\" preload=\"metadata\"/><div class=\"kg-audio-title\">YC Founder Firesides: Mutiny on AI and the next era of company growth</div><div class=\"kg-audio-player\"><button class=\"kg-audio-pause-icon kg-audio-hide\"><svg xmlns=\"http://www.w3.org/2000/svg\" viewbox=\"0 0 24 24\"><rect x=\"3\" y=\"1\" width=\"7\" height=\"22\" rx=\"1.5\" ry=\"1.5\"/><rect x=\"14\" y=\"1\" width=\"7\" height=\"22\" rx=\"1.5\" ry=\"1.5\"/></svg></button><span class=\"kg-audio-current-time\">0:00</span><div class=\"kg-audio-time\">/<span class=\"kg-audio-duration\">57:56</span></div><button class=\"kg-audio-playback-rate\">1×</button><button class=\"kg-audio-mute-icon kg-audio-hide\"><svg xmlns=\"http://www.w3.org/2000/svg\" viewbox=\"0 0 24 24\"><path d=\"M16.177 4.3a.248.248 0 0 0 .073-.176v-1.1a1 1 0 0 0-1.061-1 9.728 9.728 0 0 0-7.924 4.85.249.249 0 0 1-.221.133H5.25a3 3 0 0 0-3 3v2a3 3 0 0 0 3 3h.114a.251.251 0 0 0 .177-.073ZM23.707 1.706A1 1 0 0 0 22.293.292l-22 22a1 1 0 0 0 0 1.414l.009.009a1 1 0 0 0 1.405-.009l6.63-6.631A.251.251 0 0 1 8.515 17a.245.245 0 0 1 .177.075 10.081 10.081 0 0 0 6.5 2.92 1 1 0 0 0 1.061-1V9.266a.247.247 0 0 1 .073-.176Z\"/></svg></button></div></div></div><p><strong>1:35</strong> - What is the founding story of Mutiny? </p><ul><li>There are two levers of growth: demand and conversion. Often companies improve their conversion rate by hiring a dedicated growth team – but it is difficult to build a system from scratch and hire the engineers to do so. Jaleh and her co-founder decided to create a no code platform and serve as the world’s growth team. </li></ul><p><strong>4:25</strong> - Jaleh elaborates on the challenges growth teams face in conversion optimization. </p><ul><li>Teams first source and use data to understand the part of the funnel to prioritize. Then they estimate revenue improvements and brainstorm tactics to improve conversion. (The time invested compared to impact is taken into consideration.) Finally, the engineers build a measurement system to capture the impact of those changes. The entire process takes months. With Mutiny, this process takes minutes even for people who aren’t technical and has a massive impact on teams’ ability to launch new experiences and optimize conversion. </li></ul><p><strong>9:00</strong> - When should a startup use Mutiny? </p><ul><li>There are use cases for pre-product market fit companies (as long as you know the customers you want to go after) and post-product market fit.</li><li>Example 1: <a href=\"https://www.mutinyhq.com/playbooks/personalize-paid-landing-pages-to-reduce-cost-per-lead\">Notion drives 60% more leads through paid marketing</a></li><li>Example 2: <a href=\"https://www.mutinyhq.com/blog/the-second-lever-replays#conversion-secret-how-snowflake-runs-abm-at-scale\">Snowflake builds an ABM and enterprise marketing program</a></li></ul><p><strong>12:50</strong> - You recently shared that with data and AI, Mutiny transforms conversion from a niche A/B testing tool to a platform that every go-to-market team can use to drive efficient growth at scale. What does that mean, and how have you leveraged the advances in AI over the last four years? </p><ul><li>When you can give the entire go-to-market team x-ray vision into every visitor and how they are converting – and then pair that insight with the ability to change the website for different segments – every team will make the website a core part of their strategy to drive more revenue. Mutiny uses AI to give teams this insight and answer questions like: What segments should I prioritize? What parts of the website should I change? What copy will resonate? Where should I focus? </li></ul><p><strong>17:00</strong> - At Mutiny when looking at data, when do you know the right questions to ask and when do you say these are not questions we need to optimize now?</p><ul><li>In the early days, one of the most valuable things we did was follow our customers’ growth teams. We would attend team meetings, watch them use our product, and ask questions. It became clear what we should build for our customers. </li></ul><p><strong>20:30</strong> - Since you started Mutiny, what are some of the advances in AI that you’ve leveraged? </p><ul><li>We did things that didn't scale in the early days to solve customers’ problems. As our customers grew, our data set grew and we used AI models and inputs to improve our recommendation engines and service a broader customer base. Today, we can build models that tell a user where on the website they should make changes and write personalized copy leveraging GPT-3. </li></ul><p><strong>29:10</strong> - Did you have moments when you felt Mutiny could be doing more with the advances being made in AI? </p><ul><li>We saw an opportunity to marry our proprietary data set with GPT-3 to produce highly personalized copy. </li></ul><p><strong>32:15</strong> - GPT-3 was an inflection point for Munity. What is the next inflection point? </p><ul><li>There are a lot of opportunities with DALL-E, as visuals are important in marketing.</li></ul><p><strong>36:30</strong> - Do you have cautionary advice on how to think about using technologies like GPT-3 and DALL-E for founders dabbling in AI? </p><ul><li>Think through the ultimate long-term vision of the product and the long-term defensibility of the business. And launch fast, as technology develops quickly. </li></ul><p><strong>38:40</strong> - What advice do you have for founders in terms of leveraging OpenAI, GPT-3, etc. while focusing on the long-term vision? </p><ul><li>Your vision and long-term view is separate from your day-to-day execution. Your long-term vision (i.e. the opportunity and what you’re trying to create over the course of a decade) provides clarity around where you’re trying to go and brings other people along with you, like your investors and employees. Day-to-day, you’re focused and executing quickly – and not always thinking about the ten year vision when you’re building V1.</li></ul><p><strong>43:45</strong> - You decided to grow your team by acquiring Intellipse. And now, Mutiny has one of the larger engineering teams with production experience in modern marketing AI technologies. Why did you decide to pursue an acquisition? </p><ul><li>Founders have to look for inflection points where something happens in the market leading to the “old way” no longer being as good. And as a result, a much larger portion of the market is open to a new and better way. We’re in a recession, and this is an inflection point for Mutiny. Companies need to convert every dollar to a customer, and Mutiny has built a product that makes marketing dollars more efficient. We can accelerate our road map with the acquisition of Intellipse</li></ul><p><strong>46:40</strong> - How did you know you wanted to work with the Intellipse team so much that you had to go through an acquisition?</p><ul><li>We were interested in the Intellipse team and the skills the team had developed. Their CTO and senior engineers had a unique experience with marketing AI and newer technologies, like GPT-3.</li><li>The personality and values of the founder spreads in an organization and becomes the company culture. After getting to know the founder and the free am, it was evident the two companies had a similar culture and shared values – and we’d be able to bring this team in and enhance our culture.</li></ul><p><strong>50:15</strong> - How long did it take to assess the culture? </p><ul><li>We spent the same amount of time with each individual as if we were hiring them onto the team through our typical recruiting process.</li></ul><p><strong>51:30</strong> - Do you expect to acquire more companies in the future? And how should founders and CEOs determine whether this strategy is right for their company? </p><ul><li>Be clear about your goals and why an acquisition is the right way to achieve those goals. When a company is working toward a similar goal – building something we would have done ourselves – it is a successful acquisition. With Intellipse, the team shared similar goals and company culture, and could accelerate our timing.</li><li>We want to hire founders onto our product team who are user focused and move quickly. Founders can focus their entrepreneurial energy on building a product and growing that business area within Mutiny. </li></ul><p><strong>54:55</strong> - What are your thoughts about how AI will impact the next ten years? </p><ul><li>There has been enough productization of backend AI technologies that as a founder you can tap into AI to accelerate the product you want to build and the value you give to customers. From a user and growth perspective, AI enables us to automate many of the tasks no one wants to do. And for those who aren’t technical – but understand what they are trying to do – they can now be self sufficient.</li></ul>"
}