{
  "title":"Welcome Diana, Dave, Edrizio, and Umur",
  "date":"2022-11-02T15:55:00.000000Z",
  "author":null,
  "id":"6361a7d8b221a60001ccd254",
  "link":"https://www.ycombinator.com/blog/welcome-diana-dave-edrizio-and-umur/",
  "content":"<img src=\"https://www.ycombinator.com/blog/content/images/2022/11/BlogTwitter-Image-Template.jpeg\" alt=\"Welcome Diana, Dave, Edrizio, and Umur\"><p>Every batch, we invite founders and executives to advise YC companies as Visiting Group Partners. These advisors bring valuable insights and recent operational experience to YC’s early-stage companies. Throughout the batch, they take on a variety of responsibilities, including application reading, interviews, group and individual office hours, Demo Day prep, and more.</p><p>As YC grows, some of our Visiting Group Partners join us full time as Group Partners to continue supporting YC companies and build out new programs and initiatives to better support our community. </p><p>Today, we’re excited to welcome Diana Hu as our newest Group Partner and Dave Lieb, Edrizio Delacruz, and Umur Cubukcu, as our newest Visiting Group Partners. And <a href=\"https://www.ycombinator.com/blog/welcome-s22-visiting-group-partners\">welcome back</a> to Visiting Group Partners JJ Fliegelman, Liz Wessel, Pete Koomen, Puneet Kumar, Rich Aberman, and Tom Blomfield.</p><h3 id=\"group-partner\">Group Partner</h3><p>After three batches as a Visiting Group Partner, Diana Hu is joining YC as a Group Partner.</p><p><strong>Diana Hu</strong><br>Diana was co-founder and CTO of <a href=\"https://www.ycombinator.com/companies/escher-reality\">Escher Reality</a> (YC S17), an Augmented Reality Backend company that was acquired by Niantic (makers of Pokémon Go). At Niantic, she was the head of the AR platform. Previously, she led data science at OnCue TV that was sold to Verizon. Originally from Chile, Diana graduated from Carnegie Mellon University with a BS and MS in Electrical and Computer Engineering with a focus in computer vision and machine learning.</p><h3 id=\"visiting-group-partners\">Visiting Group Partners<br></h3><p><strong>Dave Lieb</strong><br>Dave was co-founder and CEO of <a href=\"https://www.ycombinator.com/companies/bump\">Bump</a> (S09), the mobile app used by more than 150M people to share photos and contact info by bumping phones together. After pivoting to photo sharing, Bump was acquired by Google in 2013, and its unreleased Photoroll app formed the basis for Google Photos, which Dave co-founded and led from inception to more than 1B users. Before Bump, Dave was a researcher in the Stanford AI Lab and a software engineer at Texas Instruments. He holds EE/CS degrees from Princeton and Stanford and finished ½ an MBA at Chicago Booth before dropping out to start Bump. Dave lives with his family in San Francisco and enjoys skiing, cycling, and reading tweets.</p><p><strong>Edrizio Delacruz</strong><br>Edrizio was the co-founder and CEO of <a href=\"https://www.ycombinator.com/companies/arcus\">Arcus</a> (S13), a Latin America payments platform. The company grew to serve over 200 clients and process billions of dollars annually. In 2021, the company was sold to Mastercard. Edrizio holds an MBA from The Wharton School. He was born in the Dominican Republic, grew up in Harlem, and now resides in Miami. He loves comedy, hiking, writing, and his one-year-old baby girl.</p><p><strong>Umur Cubukcu</strong><br>Umur was the co-founder and CEO of <a href=\"https://www.ycombinator.com/companies/citus-data\">Citus Data</a> (S11), the creators of Citus, the distributed PostgreSQL database, and the first company in the world to donate equity to open source foundations. With millions of downloads and powering database infrastructure across Fortune 500 and SaaS companies, Citus Data was acquired by Microsoft in 2019; and Umur has since led the PostgreSQL product team at Azure. Umur received his MS from Stanford University, and lives with his wife and son in San Francisco, visiting Turkey every summer.</p>"
}