{
  "title":"Navigating RubyConf2022 As A Newcomer",
  "date":"2022-11-09T23:10:51.000000Z",
  "author":"Ruby Together",
  "id":"175",
  "link":"https://rubytogether.org/news/2022/11/navigating-rubyconf2022-as-a-newcomer",
  "content":"\n<h1 id=\"navigating-rubyconf2022-as-a-newcomer\">Navigating RubyConf2022 As A Newcomer</h1>\n\n<p><a href=\"https://rubyconf.org/\">RubyConf2022</a> is three weeks away, and for some of you planning to attend, this may be your first RubyConf, tech conference or conference in general! If you’re in this boat, you may be feeling a range of emotions. Events like these are often big (we have 400+ people signed up for RubyConf2022 so far!), full of official and unofficial events, and offer an abundance of subjects to learn, and people to learn from — especially if you’re new to the field. They can also be overwhelming and go by quickly!</p>\n\n<p>So, how do you take it all in and make the most of your RubyConf2022 experience?</p>\n\n<p>Luckily, the Ruby community places a high value on including, welcoming and mentoring new members; and this is no more evident than in Ruby Central’s <a href=\"https://rubyconf.org/scholarships\">Opportunity Scholars and Guides Program</a>. Established to invite new people into the tech industry that would normally face barriers trying to enter; the program offers grants, mentors, events, and more to its scholar participants. Scholars receive complimentary access to a Ruby Central sponsored conference, a mentor (Guide), group events, and a built-in community of other Scholars and Guides to attend the conference and events with.</p>\n\n<p>We caught up with a few of the Scholars and Guides from recent RailsConf and RubyConf events, to get their advice on what to expect and what to prepare for as you navigate RubyConf2022 as a newcomer. Read on for their expert wisdom!</p>\n\n<h3 id=\"oh-youre-a-fan-of-ruby-name-every-gem-or-imaginary-conference-conversations\">Oh You’re a Fan of Ruby? Name Every Gem! (Or, Imaginary Conference Conversations)</h3>\n\n<p>In the days and hours leading up to RubyConf you may be feeling excitement or nervousness — or anything in between. These feelings can be intensified by preconceived notions about what a tech conferences is like. It’s easy to build up a picture of worst case scenarios when you don’t know exactly what you’ll be walking into. The Scholars and Guides we interviewed shared their biggest worries going into their first Ruby Central and tech conferences, and we have a feeling you’ll be able to relate.</p>\n\n<p>“As a junior new to the entire industry I suspected that I would be quizzed with leetcode questions or would otherwise find myself in conversations that would require perfect knowledge of sorting algorithms or some new, yet obscure, technology,” shared Dana Weiss, a Software Engineer and former Scholar. “I’m a bit of an introvert so I was just hoping to make it through unscathed.”</p>\n\n<p>Ella Xu, a Software Engineer at Hack Club; and Caitlin Henry, Ruby on Rails Software Engineer, both wondered if the professional connections they were seeking would be easy to make.</p>\n\n<p>“I thought there would be existing social circles, or cliques, of people that knew each other before the conference,” Xu shared. “I was most nervous about how overwhelming navigating the conference would be, and about how easy it would be to connect with and meet others,” said Henry.</p>\n\n<p>For one Guide, a version of these fears played out. John Sawers, a speaker, entrepreneur and engineering manager who currently helps coordinate Ruby Central’s Opportunity Scholars and Guides Program, recalled the overwhelming experience of his first tech conference.</p>\n\n<p>“It was easy enough to go to sessions, but actually talking to the other attendees was very hard,” he said. “I think I only talked to one person, and he was hyping his JS library.”</p>\n\n<p>Sawers said he left the conference feeling like he didn’t get the full experience, saying he “felt pretty isolated.”</p>\n\n<p>So, how can you shift your focus from your fears to experiencing RubyConf2022 to the fullest?</p>\n\n<h3 id=\"hacking-pre-conference-jitters-get-by-with-a-little-help-from-your-conference-friends\">Hacking Pre-conference Jitters: Get By With A Little Help From Your Conference Friends</h3>\n\n<p>Well first, it might help to know that there will be no coding pop quizzes (as Weiss was happy to find out) – and if anyone tries to give you one, you’re free to walk away!</p>\n\n<p>Next, you can start by slowing tapping into the energy of the conference. Being around a few fellow conference goers before fully immersing yourself in the day’s activities might help you ease into the event.</p>\n\n<p>Henry’s nerves began to transform, “once I checked into the hotel the day before the conference started,” they said. “I was more excited than nervous as I felt the pre-conference buzz of the hotel lobby and bar.”</p>\n\n<p>Sawers intentionally changed his approach to navigating conferences after his first go-around. “My experience didn’t change until my social context changed,” he said. He attended his first RailsConf with his team and found that “it was so much easier to manage, more fun, and I could rely on more outgoing members of the team to start conversations or find fun things to do.”</p>\n\n<p>Kinsey Durham Grace, another Scholars and Guides coordinator, and Infrastructure Engineer at GitHub, similarly reflected that having a group to navigate the conference with made all the difference. In her case, it was the Scholars and Guides program. As a speaker, she joined her first conference as a Guide.</p>\n\n<p>After that, “it became an essential part of my conference experience,” she said. “It is where I can feel comfortable in a smaller group and where I have met my best friends in the community.”</p>\n\n<p>Sawers, too, says he now has “conference friends” he looks forward to connecting with after having attended several Ruby- and Rails- Confs. “I collected more every year,” he added.</p>\n\n<p>In fact, all of the Scholars and Guides agreed that the best way to navigate the conference and reduce your fears was to focus on making connections.</p>\n\n<h3 id=\"the-social-butterfly-effect-making-meaningful-connections\">The Social Butterfly Effect: Making Meaningful Connections</h3>\n\n<p>You never know the ripple effect one friendly RubyConf conversation could have on your life – or at the very least, your day. So what’s the best way to get started? The Scholars and Guides we interviewed suggested a few different approaches.  </p>\n\n<p>“One of the greatest things was the Slack channel,” shared Henry. “This was a great place to connect, stay in touch with, and meet other attendees. From threads about making lunch/dinner plans in Portland, to discussing our favorite talks, to threads for the LGBTQ Rails community to connect, the Slack channel had something for everyone!”</p>\n\n<p>As an attendee you’ll receive access the RubyConf2022 conference channel a week before the event. The Scholars and Guides program also has its own Slack channels, to support members and connect them throughout the conference.</p>\n\n<p>Xu shared her strategy for meeting conference goers on site: “Don’t try to go to every talk/workshop/event; spend time meeting other conference attendees in the hallways and exhibition hall,” she advised.</p>\n\n<p>Another good place to start is approaching a speaker after a session you enjoy — they are very likely to be open to a conversation. “They love it (I’m a speaker, so I know),” assured Sawers. “They’ll always be down at the front after their talk, so go say hi.”</p>\n\n<p>On the other hand, conference goers may strike up a conversation with you – in that case, you get to skip the hard part. As long as you’re safe and feeling up for it, take a chance to get to know them. “Say yes to all the opportunities presented!” prompted Weiss. It could be the beginning of a beautiful conference friendship!</p>\n\n<p>When it comes to working up the courage to start a conversation, putting yourself in the right mindset can start with acknowledging that it’s normal to feel a little uncomfortable. “Likely you’re out of your comfort zone just being there,” said Sawers. “Embrace that and make your self even less comfortable by talking to as many people as you can.”</p>\n\n<p>All of the Scholars and Guides agreed that overcoming this will be well worth it. As Henry shared, “the biggest thing you’ll take away, other than the exposure and knowledge gained, are those new relationships!”</p>\n\n<h3 id=\"more-words-of-wisdom\">More Words of Wisdom</h3>\n\n<p>Aside from making connections, the Scholars and Guides interviewed offered a few more pieces of guidance to help first time conference goers make the most of RubyConf2022.</p>\n\n<p>“Be sure to set goals before the conference,” Durham Grace suggested. For example going into her first conference Xu intended “to learn about Rails features I didn’t know about before and be able to use that knowledge to make a meaningful contribution to an open source Rails app” and “to meet other developers and learn about their work.”</p>\n\n<p>It can also be as simple as looking at the conference schedule ahead of time, as Henry did “in great detail. I knew that there were going to be some amazing talks to attend,” they shared.</p>\n\n<p>Additionally, as a conference newcomer, whether or not you are in the Scholars and Guides program, you are welcome to request a conference Guide. “If we have bandwidth, we will pair first time conference attendees with a Guide,” shared Durham Grace.</p>\n\n<p>Finally, mentally prepare yourself to be present and have a great time! “It’s going to be intense and very tiring,” said Henry. “Have fun and get as much out of the conference as you can!” encouraged Durham Grace. “Soak it all up!”  Added Henry.</p>\n\n<h3 id=\"final-dispatches-from-the-scholars-and-guides-program\">Final Dispatches From The Scholars and Guides Program</h3>\n\n<p>If any of this is making you consider signing up for the Scholars and Guides program in the future (applications are closed for RubyConf2022 and the Scholar/Guide pairings have been <a href=\"https://rubyconf.org/scholarships#SG22\">announced</a>!), here are some encouraging words from the past participants, that may help push you past your comfort zone to sign up!</p>\n\n<p>“There was so much great information that the guides shared with us Scholars, and it was a great way to connect with others pre-conference. This helped to ease my nerves as I could ask as many questions as I wanted leading up to the conference,” said Henry.</p>\n\n<p>“It was helpful to talk to and walk around with other Scholars and Guides,” said Xu. She said this is what helped her the most with her pre-conference nerves.</p>\n\n<p>“She was able to introduce me to her friends and point me to good speakers so I didn’t miss any good talks,” said Weiss of her guide. I immediately had folks to eat lunch with and make dinner plans with, so I already felt like a part of the community.”</p>\n\n<p>“I can think of a lot of Scholars who got their first jobs at RailsConf and these are exactly the people we want to see getting a solid foothold in tech,” said Sawers.</p>\n\n<p>“It’s amazing how many Guides that have been Scholars before come back each year,” said Durham Grace. Hearing the stories of how the program helped them change their lives is so incredible to hear. I have met so many incredible people through the program!”</p>\n\n<p>We hope this advice was helpful and has helped set the tone for RubyConf2022. No matter how you’re feeling, know that you’re welcome and we’re excited to have you join us! If you haven’t already, you can check out all of the conference event info \n – including all the talks, the exciting lineup of keynote speakers, logistics and more – on the <a href=\"https://rubyconf.org/home\">RubyConf website</a>.</p>\n\n<p>We look forward to seeing you in person soon!</p>\n\n\n"
}