{
  "title":"RubyConf2022 Speaker Spotlight: Lori Olson",
  "date":"2022-11-03T18:57:19.000000Z",
  "author":"Ruby Together",
  "id":"174",
  "link":"https://rubytogether.org/news/2022/11/rubyconf2022-speaker-spotlight-lori-olson",
  "content":"\n<h2 id=\"rubyconf2022-speaker-spotlight-a-tech-outsiders-picks\">RubyConf2022 Speaker Spotlight: A Tech outsider’s picks</h2>\n\n<p>RubyConf boasts an exciting variety of tracks and talks that highlight the creativity and interdisciplinary nature of the Ruby community. As a tech sector newcomer, I thought it would be fun to curate a series highlighting talks that immediately captured my curiosity, and get to know their respective speakers a little better. Read on for today’s speaker spotlight…</p>\n\n<h3 id=\"title-of-talk\">Title of Talk:</h3>\n<p>This Old App</p>\n\n<h3 id=\"speaker-lori-olson\">Speaker: Lori Olson</h3>\n\n<p><img src=\"https://draftin.com:443/images/81084?token=572Q26TUmXrV8x-dlJ9-WlwE8UjwqQqJ6VnyFh43H1LT5O28jApXwZiGkHD5WbHUWdzSF5AVZWHmayeQFYPA-b8\" alt=\"1avatar - Lori Olson.jpg\"></p>\n\n<h3 id=\"how-did-you-get-into-ruby\">How Did you get into Ruby?</h3>\n\n<p>Was a Java developer, going to a Java conference (No Fluff, Just Stuff) where Dave Thomas was speaking. All anyone could talk about in the hallway track was this cool new framework called Rails (version 0.13). Tried it out on my upcoming project at work. Never looked back.</p>\n\n<h3 id=\"whats-your-favorite-part-about-working-on-open-source-software\">What’s your favorite part about working on Open Source Software?</h3>\n\n<p>The community. So many people working together, to make programmers happy.</p>\n\n<h3 id=\"whats-your-least-favorite-part-about-working-on-oss\">What’s your least favorite part about working on OSS?</h3>\n\n<p>Also the community. Those parts of it that feel entitled to complain, demand, and belittle project maintainers while never contributing so much as a typo fix.</p>\n\n<h3 id=\"what-inspired-you-to-give-this-talk\">What inspired you to give this talk?</h3>\n\n<p>Sweta of WNB.rb posted a “talk prompts” list, and one of which was “do you have a hobby or interest that informs your work”. I’ve been embroiled in a major house renovation for a while now, and what immediately sprang to mind was “What renovating an old house teaches you about upgrading an old app”.</p>\n\n<h3 id=\"what-do-you-want-people-to-take-away-from-it\">What do you want people to take away from it?</h3>\n\n<p>Whether you are talking about an old house, or an old app,  those old things require maintenance, and eventually a coat of paint (or UI refresh) isn’t going to be enough and you’ll have to rip it apart to rebuild. Just be aware there are many years of other people’s hidden mistakes… waiting for you.</p>\n\n<h3 id=\"what-are-you-most-looking-forward-to-at-this-conference\">What are you most looking forward to at this conference?</h3>\n\n<p>Seeing lots of old friends and making new ones.</p>\n\n<h3 id=\"do-you-have-any-other-plans-in-portland-during-conference-week-that-youre-excited-about\">Do you have any other plans in Portland during conference week that you’re excited about?</h3>\n\n<p>Definitely plan to hit up NASA Space Center.</p>\n\n<h3 id=\"thank-you-lori-for-sharing-a-bit-of-your-story-see-you-at-rubyconf2022\">Thank you, Lori, for sharing a bit of your story. See you at RubyConf2022!</h3>\n\n\n"
}