{
  "title":"A Dataset Exploration Case Study with Know Your Data",
  "date":"2021-08-09T13:02:53.562000-07:00",
  "author":"Google AI",
  "id":"tag:blogger.com,1999:blog-8474926331452026626.post-4880389433895154885",
  "link":"http://feedproxy.google.com/~r/blogspot/gJZg/~3/WbCPXzssu4Y/a-dataset-exploration-case-study-with.html",
  "content":"<span class=\"byline-author\">Posted by Mark Díaz and Emily Denton, Research Scientists, Google Research, Ethical AI Team</span> <p>Data underlies much of machine learning (ML) research and development, helping to structure what a machine learning algorithm learns and how models are evaluated and benchmarked. However, data collection and labeling can be complicated by unconscious biases, data access limitations and privacy concerns, among other challenges. As a result, machine learning datasets can reflect unfair social biases along dimensions of race, gender, age, and more. </p><p>Methods of examining datasets that can surface information about how different social groups are represented within are a key component of ensuring development of ML models and datasets is aligned with our <a href=\"https://ai.google/principles/\">AI Principles</a>. Such methods can inform the responsible use of ML datasets and point toward potential mitigations of unfair outcomes. For example, prior research has demonstrated that some object recognition datasets are <a href=\"https://research.google/pubs/pub46553/\">biased</a> toward images sourced from North America and Western Europe, prompting Google’s <a href=\"https://research.google/tools/datasets/open-images-extended-crowdsourced/\">Crowdsource</a> effort to balance out image representations in other parts of the world.  </p><p>Today, we demonstrate some of the functionality of a dataset exploration tool, <a href=\"https://knowyourdata.withgoogle.com/\">Know Your Data</a> (KYD), recently introduced at Google I/O, using the <a href=\"https://arxiv.org/pdf/1504.00325.pdf\">COCO Captions</a> dataset as a case study. Using this tool, we find a range of gender and age biases in COCO Captions — biases that can be traced to both dataset collection and annotation practices. KYD is a dataset analysis tool that complements the growing suite of responsible AI tools being developed across Google and the broader research community. Currently, KYD only supports analysis of a small set of image datasets, but we’re working hard to make the tool accessible beyond this set. </p><p><b>Introducing Know Your Data</b><br> Know Your Data helps ML research, product and compliance teams understand datasets, with the goal of improving data quality, and thus helping to mitigate fairness and bias issues. KYD offers a range of features that allow users to explore and examine machine learning datasets — users can filter, group, and study correlations based on annotations already present in a given dataset. KYD also presents automatically computed labels from Google’s <a href=\"https://cloud.google.com/vision\">Cloud Vision API</a>, providing users with a simple way to explore their data based on signals that weren’t originally present in the dataset. </p><p><b>A KYD Case Study</b><br>As a case study, we explore some of these features using the <a href=\"https://arxiv.org/pdf/1504.00325.pdf\">COCO Captions dataset</a>, an image dataset that contains five human-generated captions for each of over 300k images. Given the rich annotations provided by free-form text, we focus our analysis on signals already present within the dataset.</p>  <p><b>Exploring Gender Bias</b><br>Previous research has demonstrated undesirable gender biases within computer vision datasets, including <a href=\"https://arxiv.org/abs/2006.16923\">pornographic imagery of women</a> and <a href=\"http://markyatskar.com/publications/bias.pdf\">image label correlations</a> that align with harmful gender stereotypes. We use KYD to explore gender biases within COCO Captions by examining gendered correlations within the image captions. We find a gender bias in the depiction of different activities across the images in the dataset, as well as biases relating to how people of different genders are described by annotators. </p><p>The first part of our analysis aimed to surface gender biases with respect to different activities depicted in the dataset. We examined images captioned with words describing different activities and analyzed their relation to gendered caption words, such as “man” or “woman”. The <a href=\"https://knowyourdata.withgoogle.com/docs/#relations\">KYD Relations tab</a> makes it easy to examine the relation between two different signals in a dataset by visualizing the extent to which two signals co-occur more (or less) than would be expected by chance. Each cell indicates either a positive (blue color) or negative (orange color) correlation between two specific signal values along with the strength of that correlation.  </p><p>KYD also allows users to filter rows of a relations table based on substring matching. Using this functionality, we initially probed for caption words containing “-ing”, as a simple way to filter by verbs. We immediately <a href=\"https://knowyourdata-tfds.withgoogle.com/#dataset=coco_captions&amp;tab=RELATIONS&amp;relations=kyd%2Fcoco_captions%2Fcaptions_words,kyd%2Fcoco_captions%2Fcaptions_words_gendered_groups&amp;draw=kyd/coco_captions/objects_label,bbox,bbox&amp;auto_draw=false\">saw strong gendered correlations</a>: </p>     <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\"><tbody><tr><td><a href=\"https://1.bp.blogspot.com/-jyz_dnAXfn4/YRFcv9cWZ5I/AAAAAAAAH_U/PZsSbYZa7nEl-QYfwF4E6d-iYmxvgikMQCLcBGAsYHQ/s999/image2.gif\"><img border=\"0\" height=\"520\" src=\"https://1.bp.blogspot.com/-jyz_dnAXfn4/YRFcv9cWZ5I/AAAAAAAAH_U/PZsSbYZa7nEl-QYfwF4E6d-iYmxvgikMQCLcBGAsYHQ/w640-h520/image2.gif\" width=\"640\"></a></td></tr><tr><td class=\"tr-caption\"><a href=\"https://knowyourdata-tfds.withgoogle.com/#dataset=coco_captions&amp;tab=RELATIONS&amp;relations=kyd%2Fcoco_captions%2Fcaptions_words,kyd%2Fcoco_captions%2Fcaptions_words_gendered_groups&amp;draw=kyd/coco_captions/objects_label,bbox,bbox&amp;auto_draw=false\">Using KYD</a> to analyze the relationship between any word and gendered words. Each cell shows if the two respective words co-occur in the same caption more (up arrow) or less often (down arrow) than pure chance.</td></tr></tbody></table>   <p>Digging further into these correlations, we found that several activities stereotypically associated with women, such as “shopping” and “cooking”, co-occur with images captioned with “women” or “woman” at a higher rate than with images captioned with “men” or “man”. In contrast captions describing many physically intensive activities, such as “skateboarding”, “surfing”, and “snowboarding”, co-occur with images captioned with “man” or “men” at higher rates.  </p><p>While individual image captions may not use stereotypical or derogatory language, such as with the example below, if certain gender groups are over (or under) represented within a particular activity across the whole dataset, models developed from the dataset risk learning stereotypical associations. KYD makes it easy to surface, quantify, and make plans to mitigate this risk.</p> <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\"><tbody><tr><td><a href=\"https://1.bp.blogspot.com/-ArTBIXAoUxk/YRF33FA9o5I/AAAAAAAAIAE/bWNd4jum7GobAmPvzvTZuJpMk8zOt5SaQCLcBGAsYHQ/s623/beige%2Bkitchen.jpg\"><img border=\"0\" height=\"498\" src=\"https://1.bp.blogspot.com/-ArTBIXAoUxk/YRF33FA9o5I/AAAAAAAAIAE/bWNd4jum7GobAmPvzvTZuJpMk8zOt5SaQCLcBGAsYHQ/w640-h498/beige%2Bkitchen.jpg\" width=\"640\"></a></td></tr><tr><td class=\"tr-caption\">An image with one of the captions: “Two women cooking in a beige and white kitchen.” Image licensed under CC-BY 2.0.</td></tr></tbody></table>  <p>In addition to examining biases with respect to the social groups depicted with different activities, we also explored biases in how annotators described the appearance of people they perceived as male or female. Inspired by <a href=\"https://repeller.com/male-gaze-definition/\">media scholars</a> who have examined the “male gaze” embedded in other forms of visual media, we examined the frequency with which individuals perceived as women in COCO are described using adjectives that position them as an object of desire. KYD allowed us to easily examine co-occurrences between words associated with binary gender (e.g. &quot;female/girl/woman&quot; vs. &quot;male/man/boy&quot;) and words associated with evaluating physical attractiveness. Importantly, these are captions written by human annotators, who are making subjective assessments about the gender of people in the image and choosing a descriptor for attractiveness. <a href=\"https://knowyourdata-tfds.withgoogle.com/#dataset=coco_captions&amp;tab=RELATIONS&amp;relations=kyd%2Fcoco_captions%2Fcaptions_words_attractiveness,kyd%2Fcoco_captions%2Fcaptions_words_gendered_groups&amp;draw=kyd/coco_captions/objects_label,bbox,bbox&amp;auto_draw=false\">We see that</a> the words &quot;attractive&quot;, &quot;beautiful&quot;, &quot;pretty&quot;, and &quot;sexy&quot; are overrepresented in describing people perceived as women as compared to those perceived as men, confirming what prior work has said about how gender is viewed in visual media. </p> <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\"><tbody><tr><td><a href=\"https://1.bp.blogspot.com/-AW11DtTBpkY/YRF3-NiLtnI/AAAAAAAAIAI/y7jTORPUmpYgfUXQmtUtmx3JkX0uipqkACLcBGAsYHQ/s1454/new%2Btable%2Bfor%2Bkyd.jpg\"><img border=\"0\" height=\"316\" src=\"https://1.bp.blogspot.com/-AW11DtTBpkY/YRF3-NiLtnI/AAAAAAAAIAI/y7jTORPUmpYgfUXQmtUtmx3JkX0uipqkACLcBGAsYHQ/w640-h316/new%2Btable%2Bfor%2Bkyd.jpg\" width=\"640\"></a></td></tr><tr><td class=\"tr-caption\">A screenshot <a href=\"https://knowyourdata-tfds.withgoogle.com/#dataset=coco_captions&amp;tab=RELATIONS&amp;relations=kyd%2Fcoco_captions%2Fcaptions_words_attractiveness,kyd%2Fcoco_captions%2Fcaptions_words_gendered_groups&amp;draw=kyd/coco_captions/objects_label,bbox,bbox&amp;auto_draw=false\">from KYD</a> showing the relationship between words that describe attractiveness and gendered words. For example, “attractive” and “male/man/boy” co-occur 12 times, but we expect ~60 times by chance (the ratio is 0.2x). On the other hand, “attractive” and “female/woman/girl” co-occur 2.62 times more than chance.</td></tr></tbody></table>   <p>KYD also allows us to manually inspect images for each relation by clicking on the relation in question. For example, we <a href=\"https://knowyourdata-tfds.withgoogle.com/#dataset=coco_captions&amp;tab=RELATIONS&amp;relations=kyd%2Fcoco_captions%2Fcaptions_words_attractiveness,kyd%2Fcoco_captions%2Fcaptions_words_gendered_groups&amp;relations_selected=beautiful,female%2Cwoman%2Cgirl...&amp;draw=__none__,,&amp;auto_draw=false\">can see images</a> whose captions include female terms (e.g. “woman”) and the word “beautiful”.  </p><p><b>Exploring Age Bias</b><br>Adults older than 65 <a href=\"https://arxiv.org/pdf/2103.09058.pdf\">have been shown</a> to be underrepresented in datasets relative to their presence in the general population — a first step toward improving age representation is to allow developers to assess it in their datasets. By looking at caption words describing different activities and analyzing their relation to caption words describing age, KYD helped us to assess the range of example captions depicting older adults. Having example captions of adults in a range of environments and activities is important for a variety of tasks, such as image captioning or pedestrian detection. </p><p>The first trend that KYD made clear is how rarely annotators described people as older adults in captions detailing different activities. <a href=\"https://knowyourdata-tfds.withgoogle.com/#dataset=coco_captions&amp;tab=RELATIONS&amp;relations=kyd%2Fcoco_captions%2Fcaptions_words_age,kyd%2Fcoco_captions%2Fcaptions_words_movement&amp;draw=kyd/coco_captions/objects_label,bbox,bbox&amp;auto_draw=false\">The relations tab also shows</a> a trend wherein “elderly”, “old”, and “older” tend not to occur with verbs that describe a variety of physical activities that might be important for a system to be able to detect. Important to note is that, relative to “young”, “old” is more often used to describe things other than people, such as belongings or clothing, so these relations are also capturing some uses that don’t describe people. </p>  <table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\"><tbody><tr><td><a href=\"https://1.bp.blogspot.com/-84o11xS6RYc/YRFdYDXYB1I/AAAAAAAAH_o/9HeVEoJm7FkNsFOf5cWJpmNjrJD1dbEjACLcBGAsYHQ/s1468/image5.png\"><img border=\"0\" height=\"500\" src=\"https://1.bp.blogspot.com/-84o11xS6RYc/YRFdYDXYB1I/AAAAAAAAH_o/9HeVEoJm7FkNsFOf5cWJpmNjrJD1dbEjACLcBGAsYHQ/w640-h500/image5.png\" width=\"640\"></a></td></tr><tr><td class=\"tr-caption\">The relationship between words associated with <a href=\"https://knowyourdata-tfds.withgoogle.com/#dataset=coco_captions&amp;tab=RELATIONS&amp;relations=kyd%2Fcoco_captions%2Fcaptions_words_age,kyd%2Fcoco_captions%2Fcaptions_words_movement&amp;draw=kyd/coco_captions/objects_label,bbox,bbox&amp;auto_draw=false\">age and movement</a> from a screenshot of KYD.</td></tr></tbody></table>   <p>The underrepresentation of captions containing the references to older adults that we examined here could be rooted in a relative lack of images depicting older adults as well as in a tendency for annotators to omit older age-related terms when describing people in images. While manual inspection of the intersection of “old” and “running” shows a negative relation, we notice that it shows no older people and a <a href=\"https://knowyourdata-tfds.withgoogle.com/#dataset=coco_captions&amp;tab=RELATIONS&amp;relations=kyd%2Fcoco_captions%2Fcaptions_words_age,kyd%2Fcoco_captions%2Fcaptions_words_movement&amp;relations_selected=old,running&amp;draw=__none__,,&amp;auto_draw=false\">number of locomotives</a>. KYD makes it easy to quantitatively and qualitatively inspect relations to identify dataset strengths and areas for improvement. </p>  <p><b>Conclusion</b><br>Understanding the contents of ML datasets is a critical first step to developing suitable strategies to mitigate the downstream impact of unfair dataset bias. The above analysis points towards several potential mitigations. For example, correlations between certain activities and social groups, which can lead trained models to reproduce social stereotypes, can be potentially mitigated by “dataset balancing” — increasing the representation of under-represented group/activity combinations. However, mitigations focused exclusively on dataset balancing are not sufficient, as our analysis of how different genders are described by annotators  demonstrated. We found annotators’ subjective judgements of people portrayed in images were reflected within the final dataset, suggesting a deeper look at methods of image annotations are needed. One solution for data practitioners who are developing image captioning datasets is to consider integrating <a href=\"https://www.cooperhewitt.org/cooper-hewitt-guidelines-for-image-description/\">guidelines</a> that have been developed for writing image descriptions that are sensitive to race, gender, and other identity categories. </p><p>The above case studies highlight only <em>some</em> of the KYD features. For example, <a href=\"https://cloud.google.com/vision\">Cloud Vision API signals</a> are also integrated into KYD and can be used to infer signals that annotators haven't labeled directly. We encourage the broader ML community to perform their own KYD case studies and share their findings.  </p><p>KYD complements other <a href=\"https://par.nsf.gov/servlets/purl/10208548\">dataset</a> <a href=\"https://arxiv.org/pdf/2009.10795.pdf\">analysis</a> tools being developed across the ML community, including Google's growing <a href=\"https://www.tensorflow.org/responsible_ai\">Responsible AI toolkit</a>. We look forward to ML practitioners using KYD to better understand their datasets and mitigate potential bias and fairness concerns. If you have feedback on KYD, please write to <a href=\"mailto:knowyourdata-feedback@google.com\">knowyourdata-feedback@google.com</a>. </p><p><b>Acknowledgements</b><br><em>The analysis and write-up in this post were conducted with equal contribution by Emily Denton, Mark Díaz, and Alex Hanna. We thank Marie Pellat, Ludovic Peran, Daniel Smilkov, Nikhil Thorat and Tsung-Yi for their contributions to and reviews of this post.</em></p><div class=\"feedflare\">\r\n<a href=\"http://feeds.feedburner.com/~ff/blogspot/gJZg?a=WbCPXzssu4Y:IUsMkPQuXMY:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/blogspot/gJZg?d=yIl2AUoC8zA\" border=\"0\">&lt;img&gt;</a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/blogspot/gJZg/~4/WbCPXzssu4Y\" height=\"1\" width=\"1\" alt=\"\">"
}