{
  "title":"Recreating Natural Voices for People with Speech Impairments",
  "date":"2021-08-30T10:41:23.850000-07:00",
  "author":"Google AI",
  "id":"tag:blogger.com,1999:blog-8474926331452026626.post-1379685519283622634",
  "link":"http://feedproxy.google.com/~r/blogspot/gJZg/~3/X94ceFo3RPU/recreating-natural-voices-for-people.html",
  "content":"<span class=\"byline-author\">Posted by Ye Jia, Software Engineer and Julie Cattiau, Product Manager, Google Research</span> <p>On June 2nd, 2021, Major League Baseball in the United States celebrated <a href=\"https://www.mlb.com/news/lou-gehrig-day-june-2nd-2021-details#:~:text=It%20will%20happen%20on%20June,at%20the%20age%20of%2037.\">Lou Gehrig Day</a>, commemorating both the day in 1925 that <a href=\"https://en.wikipedia.org/wiki/Lou_Gehrig\">Lou Gehrig</a> became the Yankees’ starting first baseman, and the day in 1941 that he passed away from <a href=\"https://en.wikipedia.org/wiki/Amyotrophic_lateral_sclerosis\">amyotrophic lateral sclerosis</a> (ALS, also known as Lou Gehrig’s disease) at the age of 37. ALS is a <a href=\"https://www.als.org/understanding-als\">progressive neurodegenerative disease</a> that affects motor neurons, which connect the brain with the muscles throughout the body, and govern muscle control and voluntary movements. When voluntary muscle control is affected, people may lose their ability to speak, eat, move and breathe. </p><p>In honor of Lou Gehrig, former <a href=\"https://en.wikipedia.org/wiki/National_Football_League\">NFL</a> player and ALS advocate <a href=\"https://en.wikipedia.org/wiki/Steve_Gleason\">Steve Gleason</a>, who lost his ability to speak due to ALS, recited Gehrig’s famous <a href=\"https://baseballhall.org/discover-more/stories/baseball-history/lou-gehrig-luckiest-man\">“Luckiest Man” speech</a> at the June 2nd event using a recreation of his voice generated by a machine learning (ML) model. Gleason’s voice recreation was developed in collaboration with Google’s <a href=\"https://sites.research.google/euphonia/about/\">Project Euphonia</a>, which aims to empower people who have impaired speaking ability due to ALS to better communicate using their own voices.  </p><p></p><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\"><tbody><tr><td/></tr><tr><td class=\"tr-caption\">Steve Gleason, who lost his voice to ALS, worked with Google’s Project Euphonia to generate a speech in his own voice in honor of Lou Gehrig. A portion of Gleason’s speech was broadcast in ballparks across the country during the 4<sup>th</sup> inning on June 2<sup>nd</sup>, 2021.</td></tr></tbody></table><p>Today we describe PnG NAT, the model adopted by Project Euphonia to recreate Steve Gleason’s voice. PnG NAT is a new <a href=\"https://en.wikipedia.org/wiki/Speech_synthesis\">text-to-speech synthesis</a> (TTS) model that merges two state-of-the-art technologies, <a href=\"https://arxiv.org/abs/2103.15060\">PnG BERT</a> and <a href=\"https://arxiv.org/abs/2010.04301\">Non-Attentive Tacotron</a> (NAT), into a single model. It demonstrates significantly better quality and fluency than previous technologies, and represents a promising approach that can be extended to a wider array of users. </p><p><b>Recreating a Voice</b><br>Non-Attentive Tacotron (NAT) is the successor to <a href=\"https://ai.googleblog.com/2017/12/tacotron-2-generating-human-like-speech.html\">Tacotron 2</a>, a sequence-to-sequence neural TTS model proposed in 2017. Tacotron 2 used an attention module to connect the input text sequence and the output speech spectrogram frame sequence, so that the model knows which part of the text to pay attention to when generating each time step of the synthesized speech spectrogram. Tacotron 2 was the first TTS model that was able to synthesize speech that sounds as natural as a person speaking. However, with extensive experimentation we discovered that there is a small probability that the model can suffer from robustness issues — such as babbling, repeating, or skipping part of the text — due to the inherent flexibility of the attention mechanism.  </p><p>NAT improves upon Tacotron 2 by replacing the attention module with a duration-based upsampler, which predicts a duration for each input <a href=\"https://en.wikipedia.org/wiki/Phoneme\">phoneme</a> and upsamples the encoded phoneme representation so that the output length corresponds to the length of the predicted speech spectrogram. Such a change both resolves the robustness issue, and improves the naturalness of the synthesized speech. This approach also enables precise control of the speech duration for each phoneme of the input text while still maintaining highly natural synthesis quality. Because recordings of people with ALS often exhibit disfluent speech, this ability to exert per-phoneme control is key for achieving the fluency of the recreated voice. </p><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\"><tbody><tr><td><a href=\"https://1.bp.blogspot.com/-XV_ji-X7EFo/YSfC6k9H9JI/AAAAAAAAICA/bUSBpTSQjScN_n8hPkvtPwL18ahmuot0QCLcBGAsYHQ/s419/image3.jpg\"><img border=\"0\" height=\"640\" src=\"https://1.bp.blogspot.com/-XV_ji-X7EFo/YSfC6k9H9JI/AAAAAAAAICA/bUSBpTSQjScN_n8hPkvtPwL18ahmuot0QCLcBGAsYHQ/w436-h640/image3.jpg\" width=\"436\"></a></td></tr><tr><td class=\"tr-caption\">Non-Attentive Tacotron (NAT) model.</td></tr></tbody></table><p>While NAT addresses the robustness issue and enables precise duration control in neural TTS, we build upon it to further improve the natural language understanding of the TTS input. For this, we apply PnG BERT, which uses an approach similar to <a href=\"https://ai.googleblog.com/2018/11/open-sourcing-bert-state-of-art-pre.html\">BERT</a>, but is specifically designed for TTS. It is pre-trained with self-supervision on both the phoneme representation and the grapheme representation of the same content from a large text corpus, and then is used as the encoder of the TTS model. This results in a significant improvement of the <a href=\"https://en.wikipedia.org/wiki/Prosody_(linguistics)\">prosody</a> and pronunciation of the synthesized speech, especially in difficult cases.  </p><p>Take, for example, the following audio, which was synthesized from a regular NAT model that takes only phonemes as input: </p><table align=\"center\"><tbody><tr><td><audio src=\"https://google.github.io/tacotron/publications/png_bert/two_vs_too/h_nat.wav\"/></td></tr></tbody></table><p>In comparison, the audio synthesized from PnG NAT on the same input text includes an additional pause that makes the meaning more clear.  </p><table align=\"center\"><tbody><tr><td><audio src=\"https://google.github.io/tacotron/publications/png_bert/two_vs_too/h_png.wav\"/></td></tr></tbody></table><p>The input text to both models is, “<em>To cancel the payment, press one; or to continue, two.</em>” Notice the different pause lengths before the ending “<em>two</em>” in the two versions. The word “<em>two</em>” in the version output by the regular NAT model could be confused for “<em>too</em>”. Because “<em>too</em>” and “<em>two</em>” have identical pronunciation (and thus the same phoneme representation), the regular NAT model does not understand which of the two is appropriate, and assumes it to be the word that more frequently follows a comma, “<em>too</em>”. In contrast, the PnG NAT model can more easily tell the difference, because it takes graphemes in addition to phonemes as input, and thus makes more appropriate pause.   </p><p>The PnG NAT model integrates the pre-trained PnG BERT model as the encoder to the NAT model. The hidden representations output from the encoder are used by NAT to predict the duration of each phoneme, and are then upsampled to match the length of the audio spectrogram, as outlined above. In the final step, a non-attentive decoder converts the upsampled hidden representations into audio speech spectrograms, which are finally converted into audio waveforms by a neural vocoder. </p><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\"><tbody><tr><td><a href=\"https://1.bp.blogspot.com/-ulBEbqJp56o/YSe96CEBKkI/AAAAAAAAIBw/yMpTpbfu4dUREOr-cpNyirdQnkF2pwkNgCLcBGAsYHQ/s747/image2.jpg\"><img border=\"0\" height=\"389\" src=\"https://1.bp.blogspot.com/-ulBEbqJp56o/YSe96CEBKkI/AAAAAAAAIBw/yMpTpbfu4dUREOr-cpNyirdQnkF2pwkNgCLcBGAsYHQ/w640-h389/image2.jpg\" width=\"640\"></a></td></tr><tr><td class=\"tr-caption\">PnG BERT and the pre-training objectives. Yellow boxes represent phonemes, and pink boxes represent graphemes.</td></tr></tbody></table><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\"><tbody><tr><td><a href=\"https://1.bp.blogspot.com/-5ELecOClGzk/YSe-AghH9DI/AAAAAAAAIB0/nksuYHxjWasVHldd1W6denDoQ3wqrb91QCLcBGAsYHQ/s604/image1.jpg\"><img border=\"0\" height=\"474\" src=\"https://1.bp.blogspot.com/-5ELecOClGzk/YSe-AghH9DI/AAAAAAAAIB0/nksuYHxjWasVHldd1W6denDoQ3wqrb91QCLcBGAsYHQ/w640-h474/image1.jpg\" width=\"640\"></a></td></tr><tr><td class=\"tr-caption\">PnG NAT: PnG BERT replaces the original encoder in the NAT model. The random masking for the Masked Language Model (MLM) pre-training is removed.</td></tr></tbody></table><p>To recreate Steve Gleason’s voice, we first trained a PnG NAT model with recordings from 31 professional speakers, and then fine-tuned it with 30 minutes of Gleason’s recordings. Because these latter recordings were made after he was diagnosed with ALS, they exhibit signs of slurring. The fine tuned model was able to synthesize speech that sounds very similar to these recordings. However, because the symptoms of ALS were already present in Gleason’s speech, they exhibited some similar disfluencies.  </p><p>To mitigate this, we leveraged the phoneme duration control of NAT as well as the model trained with professional speakers. We first predicted the durations of each phoneme for both a professional speaker and for Gleason, and then used the geometric mean of the two durations for each phoneme to guide the NAT output. As a result, the model is able to speak in Gleason’s voice, but more fluently than in the original recordings. </p><p>Here is the full version of the synthesized Lou Gehrig speech in Gleason’s voice: </p><table align=\"center\"><tbody><tr><td><audio src=\"https://google.github.io/tacotron/publications/png_bert/gleason/luckiest_man.mp3\"/></td></tr></tbody></table><p>  <p>Besides recreating voices for people with ALS, PnG NAT is also powering voices for a variety of customers through <a href=\"https://cloud.google.com/text-to-speech/custom-voice/docs\">Google Cloud Custom Voice</a>. </p><p><b>Project Euphonia</b><br>Of the millions of people around the world who have neurologic conditions that may impact their speech, such as ALS, <a href=\"https://en.wikipedia.org/wiki/Cerebral_palsy\">cerebral palsy</a> or <a href=\"https://en.wikipedia.org/wiki/Down_syndrome\">Down syndrome</a>, many may find it difficult to be understood, which can make face-to-face communication challenging. Using voice-activated technologies can be frustrating too, as they don’t always work reliably. <a href=\"https://sites.research.google/euphonia/about/\">Project Euphonia</a> is a Google Research initiative focused on helping people with impaired speech be better understood. The team is researching ways to improve speech recognition for individuals with speech impairments (see <a href=\"https://blog.google/outreach-initiatives/accessibility/project-euphonia-1000-hours-speech-recordings/\">recent blog post</a> and <a href=\"https://www.today.com/video/new-google-technology-is-helping-people-with-als-record-their-voices-78999109798 \">segment in TODAY show</a>), as well as customized text-to-speech technology (see <a href=\"https://www.youtube.com/watch?v=V5aZjsWM2wo\">Age of AI documentary</a> featuring former NFL player Tim Shaw). </p><p><b>Acknowledgements</b><br><em>Many people across Google Research, Google Cloud and Consumer Apps, and Google Accessibility teams contributed to this project and the event, including Michael Brenner, Bob MacDonald, Heiga Zen, Yu Zhang, Jonathan Shen, Isaac Elias‎, Yonghui Wu, Anne Keck, Danielle Notaro, Kevin Hogan, Zack Kaplan, KR Liu, Kyndra Price, Zoe Ortiz.</em></p><p></p><div class=\"feedflare\">\r\n<a href=\"http://feeds.feedburner.com/~ff/blogspot/gJZg?a=X94ceFo3RPU:VYtz9-7L5Ek:yIl2AUoC8zA\"><img src=\"http://feeds.feedburner.com/~ff/blogspot/gJZg?d=yIl2AUoC8zA\" border=\"0\">&lt;img&gt;</a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/blogspot/gJZg/~4/X94ceFo3RPU\" height=\"1\" width=\"1\" alt=\"\"></p>"
}