{
  "title":"Level Up: Build a Quiz App with SwiftUI – Part 3",
  "date":"2021-08-28T09:41:00.000000-07:00",
  "author":null,
  "id":"https://stackoverflow.blog/?p=18708",
  "link":"https://stackoverflow.blog/2021/08/28/level-up-build-a-quiz-app-with-swiftui-part-3/",
  "content":"\n<p>In the third lesson of the series, we’ll continue to incorporate the MVVM architecture and build a view model for our quiz app which mediates communication between the view and the model. Additionally, we’ll build a game model structure and add more questions and functionality for new questions to appear as the user advances through the quiz. </p>\n\n\n\n\n\n\n\n<p>Here are some Stack Overflow questions related to the work we did in today’s session:</p>\n\n\n\n<p><a href=\"https://stackoverflow.com/questions/24003918/does-swift-have-access-modifiers\">Does Swift have access modifiers? </a></p>\n\n\n\n<p><a href=\"https://stackoverflow.com/questions/57826430/swiftui-and-mvvm-communication-between-model-and-view-model\">SwiftUI and MVVM – Communication between model and view model</a></p>\n\n\n\n<p>If you want to ask any questions or provide feedback on the lesson, you are welcome to leave a comment on the <a href=\"https://www.youtube.com/watch?v=k0MEIuOxssE&amp;t=84s\">YouTube recording</a> of this lesson. If you’d like to watch a session live, follow the <a href=\"https://www.youtube.com/c/codecademy/featured\">Codecademy YouTube channel</a>.</p>\n\n\n\n<p>Finally, if you want even more SwiftUI content, you can sign up for the <a href=\"https://www.codecademy.com/learn/paths/build-ios-apps-with-swiftui\">Build iOS Apps with SwiftUI</a> Skill Path this series was based on.  The Skill Path goes into much more detail about the Swift language and provides a deeper foundation that you can use to build sophisticated applications.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2021/08/28/level-up-build-a-quiz-app-with-swiftui-part-3/\">Level Up: Build a Quiz App with SwiftUI – Part 3</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}