{
  "title":"Podcast 365: Fake your own voice with AI, podcasting has never been easier",
  "date":"2021-08-09T21:40:00.000000-07:00",
  "author":null,
  "id":"https://stackoverflow.blog/?p=18600",
  "link":"https://stackoverflow.blog/2021/08/10/podcast-365-andrew-mason-descript-ai-machine-learning/",
  "content":"\n\n\n\n\n<p>We chat with Andrew Mason, a serial entrepreneur who has worked on Groupon, Detour, and now Descript. His latest company harnesses machine learning for automatic transcription, but also for more unique features. Messed up a line or mispronounced a name? Descript can generate new words from scratch that match a speaker’s voice.</p>\n\n\n\n<h2 id=\"h-episode-notes\">Episode Notes</h2>\n\n\n\n<p>Mason began his career as a developer, went on to be a CEO, but also found time to produce <a href=\"https://techcrunch.com/2013/07/01/andrew-mason-raises-your-hands-up-in-the-air/#:~:text=If%20you're%20a%20tech,how%20to%20run%20your%20startup.\">80s alt rock album</a> full of advice on how to run your startup.</p>\n\n\n\n<p>Slack began life as a video game company, eventually pivoting to make an internal chat tool it had built into its main business. Descript had a similar journey, taking  the editing software Mason and his team developed at Detour, and moving it to become the center of a new business after <a href=\"https://medium.com/detour-dot-com/detour-the-next-chapter-6f1aa2d97a14\">Detour was acquired by Bose</a>.</p>\n\n\n\n<p>Headquartered in Montreal, <a href=\"https://www.descript.com/lyrebird\">Lyrebird</a> is the AI division of Descript . It was founded by PhD students studying under Yoshua Bengio, who won the Turing Prize in 2019 for his pioneering research into deep learning and neural networks.</p>\n\n\n\n<p>Our lifeboat badge of the week goes to Avinash, who explained what to do with a <a href=\"https://stackoverflow.com/questions/51259814/invalid-syntax-error-on-running-aws-command/51298492#51298492\">invalid syntax error that arises while running an AWS command</a></p>\n\n\n\n<p><a href=\"https://the-stack-overflow-podcast.simplecast.com/episodes/editing-audio-and-video-as-simply-as-a-word-document/transcript/\"> TRANSCRIPT</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2021/08/10/podcast-365-andrew-mason-descript-ai-machine-learning/\">Podcast 365: Fake your own voice with AI, podcasting has never been easier</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}