{
  "title":"Level Up: Build a Quiz App with SwiftUI – Part 1",
  "date":"2021-08-14T06:00:00.000000-07:00",
  "author":null,
  "id":"https://stackoverflow.blog/?p=18602",
  "link":"https://stackoverflow.blog/2021/08/14/level-up-build-a-quiz-app-with-swiftui-part-1/",
  "content":"\n<p>SwiftUI is Apple’s newest framework for building iOS applications.  It uses the best features of the Swift language to enable writing performative, declarative code.  If you’ve ever wanted to build your own iOS applications, now is an excellent time to get started.</p>\n\n\n\n<p>The <a href=\"https://www.codecademy.com/resources/blog/codecademy-live-build-ios-apps-with-swiftui/\">Codecademy Live: Build a Quiz App with SwiftUI series</a> will be hosted by Codecademy Curriculum Developers <a href=\"https://www.linkedin.com/in/ben-stone-7859b637/\">Ben Stone</a> and <a href=\"https://www.linkedin.com/in/galina-podstrechnaya/\">Galina Podstrechnaya</a> who created the <a href=\"https://www.codecademy.com/learn/paths/build-ios-apps-with-swiftui\">Build iOS Apps with SwiftUI course</a> on <a href=\"https://www.codecademy.com/\">Codecademy</a>.  </p>\n\n\n\n<p>The live series will start with an introduction to Xcode and building simple views.  Over the course of the series, we’ll create a fully functional quiz application.  We’ll be building off of the skill path, but making adjustments to cover some additional content.</p>\n\n\n\n<p>In the first lesson of the series, we’ll walk through what tools are needed to start developing apps for iOS.  We’ll learn how to use Xcode, how to add views to your app, and how to customize them using view modifiers.</p>\n\n\n\n\n\n\n\n<p>Here are some Stack Overflow questions related to the work we did in today’s session:</p>\n\n\n\n<p><a href=\"https://stackoverflow.com/questions/56452250/whats-with-constraints-in-swiftui/56471369#56471369\">What’s with Constraints in SwiftUI?</a></p>\n\n\n\n<p><a href=\"https://stackoverflow.com/questions/56437036/swiftui-how-do-i-change-the-background-color-of-a-view\">SwiftUI – How do I change the background color of a View?</a></p>\n\n\n\n<p>If you want to ask any questions or provide feedback on the lesson, you are welcome to leave a comment on the <a href=\"https://www.youtube.com/watch?v=mFT21IzGW1w\">YouTube recording</a> of this lesson. If you’d like to watch a session live, follow the <a href=\"https://www.youtube.com/c/codecademy/featured\">Codecademy YouTube channel</a>.</p>\n\n\n\n<p>Finally, if you want even more SwiftUI content, you can sign up for the <a href=\"https://www.codecademy.com/learn/paths/build-ios-apps-with-swiftui\">Build iOS Apps with SwiftUI</a> Skill Path this series was based on.  The Skill Path goes into much more detail about the Swift language and provides a deeper foundation that you can use to build sophisticated applications.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2021/08/14/level-up-build-a-quiz-app-with-swiftui-part-1/\">Level Up: Build a Quiz App with SwiftUI – Part 1</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}