{
  "title":"The full data set for the 2021 Developer Survey now available!",
  "date":"2021-08-30T07:00:00.000000-07:00",
  "author":null,
  "id":"https://stackoverflow.blog/?p=18705",
  "link":"https://stackoverflow.blog/2021/08/30/the-full-data-set-for-the-2021-developer-survey-now-available/",
  "content":"\n<p>Every year, we ask developers what the state of software engineering looks like for them, and tens of thousands of you answer. Generously, you tell us all about who you are, how you work, and perhaps most importantly, what languages and tools you use. As in every year, the results are sure to spark a few heated discussions—is Rust really all that great?—as people start reading the results. </p>\n\n\n\n<p>But you know what developers like more than arguing about which programming language is best? Data. Lots and lots of data. </p>\n\n\n\n<p>Now that we’ve shared <a href=\"https://stackoverflow.blog/2021/08/02/2021-stack-overflow-developer-survey-results/\">our take on the results</a>, we’re offering you the chance to <a href=\"https://insights.stackoverflow.com/survey\">check out the full data set</a> and come up with your own conclusions. Want to know what countries prefer specific programming languages? Check the data. Think we’re missing the real story? Start analyzing the data set and let us know. </p>\n\n\n\n<p>The results set contains over 80,000 responses from almost every country on Earth. Because of data export restrictions, we were unable to survey developers in Cuba, Iran, North Korea, Syria, and the Crimea region of Ukraine (including Sevastopol). </p>\n\n\n\n<p>In previous years, people have used the data as part of <a href=\"https://www.kaggle.com/razamh/stack-overflow-developer-survey-analysis\">data analysis tutorials</a>, <a href=\"https://www.freecodecamp.org/news/stack-overflow-developer-survey-2020-programming-language-framework-salary-data/\">additional salary insights</a>, and <a href=\"https://blog.glitch.com/post/discover-insights-explore-developer-survey-results-2019\">even more accessible versions of the data</a>.  If you’re using the database in any academic research, we love to hear about that as well. Drop us a line and we’ll see about featuring your work on this blog. </p>\n\n\n\n<p>Note you are free to share, adapt, and create derivative works from the public 2021 Stack Overflow Developer Survey results as long as you attribute them to Stack Overflow, keep the database open (if you redistribute it), and continue to share-alike any adapted database under the <a href=\"https://opendatacommons.org/licenses/odbl/\">ODbL</a>.</p>\n\n\n\n<p>Huge thanks to all of the developers who took the survey and the larger programmer community at large. We wouldn’t be here without you, and we hope to continue to be your number one source for answers to programming questions. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2021/08/30/the-full-data-set-for-the-2021-developer-survey-now-available/\">The full data set for the 2021 Developer Survey now available!</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}