{
  "title":"The 2021 Stack Overflow Developer Survey is here!",
  "date":"2021-08-02T08:12:59.000000-07:00",
  "author":null,
  "id":"https://stackoverflow.blog/?p=18530",
  "link":"https://stackoverflow.blog/2021/08/02/2021-stack-overflow-developer-survey-results/",
  "content":"\n<p>Hello and welcome to the 2021 Developer Survey. This year over 80,000 respondents took the time to share their feedback on the tools and trends that are shaping software development. As always, we are so grateful to those who took the time to participate. </p>\n\n\n\n<p>This year’s survey was a little different than ones in years past. We opened our 2020 survey in February, and by the time we got around to publishing the results, the reality of work and daily life had shifted dramatically for people around the globe. The pandemic continues to exert a strong influence on the shape of our economy and society, so we tried to keep this year’s survey shorter and focused on things outside the traditional office.</p>\n\n\n\n<p>We learned a lot about the way developers learn. ﻿For the rising cohort of coders under the age of 18, online resources like videos and blogs are more popular than books and school combined, a statistic that doesn’t hold for any of our other age cohorts. ﻿﻿Overall the developer profession is full of new joiners, with more than 50% indicating they have been coding for less than a decade, and more than 35% having less than five years in the trade.</p>\n\n\n\n<p>Roughly a third of respondents responded to our question on mental health. This is twice the percentage that offered feedback in 2020 and may reflect the growing awareness of mental health’s importance and the impact of the ongoing pandemic.</p>\n\n\n\n<p>Another trend that may be linked to the pandemic is work status. We see a greater percentage of respondents working part-time or in school, while those indicating full time employment decreased. This may reflect the effects of the pandemic, which saw workers from all industries stepping back and reevaluating their relationship to a five day work week and in-person employment.</p>\n\n\n\n<p>As always, there were a few new languages on our leaderboards and some interesting shifts among the most Loved, Dreaded, and Wanted technologies. We also introduced a new insight to this section, measuring technologies developers have <a href=\"https://meta.stackoverflow.com/questions/410519/what-is-worked-with-vs-want-to-work-with-and-loved-dreaded-wanted\">Worked With vs. Want to Work With.</a> There are some very cool, interactive visuals showing the languages, databases, and frameworks that existing developers want to migrate towards. </p>\n\n\n\n\n\n\n\n<p>Be sure to check out all the data and insights from the <a href=\"https://insights.stackoverflow.com/survey/2021\">full Dev Survey here</a>. Beyond this annual event, we are expanding our research efforts and planning to run a number of smaller, more topically focused surveys throughout the year. We published one on <a href=\"https://stackoverflow.blog/2021/06/07/most-developers-believe-blockchain-technology-is-a-game-changer-3/\">blockchain technology</a> earlier this year and have one about the cloud coming up soon. </p>\n\n\n\n<p>We recently updated our mission statement at Stack Overflow. As an organization, we strive to empower the world to develop technology through collective knowledge. Your contributions allow us to build and refine our knowledge of the developer community and the state of software. As always, we will make the data from the survey available to the public shortly, so stay tuned for information on how to download. Thanks for helping us to create this report, please enjoy and share, and we’ll see you again next year.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2021/08/02/2021-stack-overflow-developer-survey-results/\">The 2021 Stack Overflow Developer Survey is here!</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}