{
  "title":"Podcast 368: Extending the legacy of Admiral Grace Hopper",
  "date":"2021-08-20T09:40:00.000000-07:00",
  "author":null,
  "id":"https://stackoverflow.blog/?p=18647",
  "link":"https://stackoverflow.blog/2021/08/20/podcast-367-extending-the-legacy-of-admiral-grace-hopper/",
  "content":"\n<p>In this episode, we talk with Quincy Brown, the head of programs at AnitaB.org and former computer science professor. This organization supports women in engineering and organizes the Grace Hopper Celebration, while providing scholarships, advocacy, and policy support for women in engineering.</p>\n\n\n\n\n\n\n\n<h2 id=\"h-show-notes\">Show notes</h2>\n\n\n\n<p>In 1987, Anita Borg, AnitaB.org’s namesake, saw how few women were at a “systems” conference. A few casual chats turned into the listserv, Systers, which continues to offer a place for women in engineering to meet and discuss. </p>\n\n\n\n<p>Grace Hopper—that’s Navy Rear Admiral Hopper to you, civilian—was the first to devise a theory of programming languages that were machine-independent. She created the FLOW-MATIC programming language, which served as the basis for <a href=\"https://stackoverflow.blog/2020/04/20/brush-up-your-cobol-why-is-a-60-year-old-language-suddenly-in-demand/\" rel=\"noreferrer noopener\">COBOL</a>. </p>\n\n\n\n<p>Quincy started in electrical engineering and learned FORTRAN. That experience with how computers operate on hardware helped her teach C++. The difference is like listening to vinyl vs. mp3s. </p>\n\n\n\n<p>Should UX designers create technology that you need to adapt to or adapts to you? And will different generations create different interaction paradigms?</p>\n\n\n\n<p>We’re out of lifeboat badges, so we summoned a Necromancer winner! Congrats to <a href=\"https://stackoverflow.com/users/9143529/stealth\">stealth</a> who was awarded the badge for their answer to the question, <a href=\"https://stackoverflow.com/questions/27195977/adding-multiple-columns-in-mysql-with-one-statement\">Adding multiple columns in MySQL with one statement.</a></p>\n\n\n\n<p><a href=\"https://the-stack-overflow-podcast.simplecast.com/episodes/extending-the-legacy-of-admiral-grace-hopper/transcript\">TRANSCRIPT</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2021/08/20/podcast-367-extending-the-legacy-of-admiral-grace-hopper/\">Podcast 368: Extending the legacy of Admiral Grace Hopper</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}