{
  "title":"Podcast 370: Changing of the guards: one co-host departs, and a new  one enters",
  "date":"2021-08-26T21:40:00.000000-07:00",
  "author":null,
  "id":"https://stackoverflow.blog/?p=18702",
  "link":"https://stackoverflow.blog/2021/08/27/podcast-370-changing-of-the-guards-one-co-host-departs-and-a-new-one-enters/",
  "content":"\n<p>Our co-host Paul Ford is stepping back from a lot of his technology related duties, including as CEO of Postlight and sadly, as co-host of this podcast. But that means our frequent collaborator Cassidy Williams will be joining us more often. Paul passes the torch on this episode.</p>\n\n\n\n\n\n\n\n<h2 id=\"h-show-notes\">Show notes</h2>\n\n\n\n<p>Paul is stepping away down as CEO of <a href=\"https://postlight.com/\">Postlight </a>to focus more on understanding climate change and how we can address it. The science hurts his brain. </p>\n\n\n\n<p>Cassidy Williams, currently at <a href=\"https://www.netlify.com/\">Netlify</a>, has published articles on our blog and provides links in our newsletter.</p>\n\n\n\n<p>We dig into some of the results of the<a href=\"https://stackoverflow.blog/2021/08/02/2021-stack-overflow-developer-survey-results/\"> dev survey</a>, including how kids today are learning to code on the internet. There’s so much to learn from now!</p>\n\n\n\n<p>Did everyone step back from working full time? Our survey data shows a decrease in full time employed respondents. Was there an existential moment for everyone during the pandemic where they thought that there must be something else?</p>\n\n\n\n<p>Our surveyed devs love Svelte but get paid the most for Ruby on Rails. </p>\n\n\n\n<p>This week’s Lifeboat badge goes to Suren Raj for his answer to <a href=\"https://stackoverflow.com/questions/23533695/java-convert-bytes-to-file/23533769#23533769\">Java convert bytes[] to File.</a></p>\n\n\n\n<p><a href=\"https://the-stack-overflow-podcast.simplecast.com/episodes/changing-of-the-guards-one-co-host-departs-and-a-new-one-enters/transcript\">TRANSCRIPT</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2021/08/27/podcast-370-changing-of-the-guards-one-co-host-departs-and-a-new-one-enters/\">Podcast 370: Changing of the guards: one co-host departs, and a new  one enters</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}