{
  "title":"Communities are a catalyst for technology development",
  "date":"2021-08-02T10:07:45.000000-07:00",
  "author":null,
  "id":"https://stackoverflow.blog/?p=18541",
  "link":"https://stackoverflow.blog/2021/08/02/q3-2021-ceo-blog-post-communities-catalyst/",
  "content":"\n<p>In June, I wrote to announce that Prosus, one of the world’s leading technology operators and investors, had agreed to acquire Stack Overflow. Today, I’m pleased to say that the <a href=\"https://www.prosus.com/news/prosus-closes-acquisition-of-stack-overflow-for-us18-billion/\">deal has been finalized</a>. This is a tremendous milestone for our company and community, a testament to the hard work and dedication that have built Stack Overflow over the last 13+ years. </p>\n\n\n\n<p>We’re excited to continue working towards our existing goals and priorities with no changes to our focus on creating and maintaining a vibrant community and our core SaaS business model. With Prosus, we can accelerate plans and be even more ambitious about scaling our public and private platforms.</p>\n\n\n\n<p>Over the last quarter, we revisited our mission statement to reflect our unwavering commitment to knowledge sharing and consolidated the many versions that have surfaced over the last several years into one:</p>\n\n\n\n<h1 class=\"has-text-align-center\" id=\"h-empower-the-world-to-develop-technologythrough-collective-knowledge\">Empower the world to develop technology<br>through collective knowledge.</h1>\n\n\n\n<p>We, and Prosus, understand that our commitment to spreading knowledge and building community is the engine of our success. Democratizing information is the only way to empower learners to develop the future of technology. We hope to further invest in the community so an even wider group can benefit from it – technologists in countries around the world who are all on their unique learning journeys.</p>\n\n\n\n<h2>Public Platform and Community</h2>\n\n\n\n<p>Q2 was a time of strong growth for our public platform. We saw more new accounts being created than ever, with April, May, and June trending at or above our highest levels from last year. Part of the credit here certainly goes to our public platform and community teams, which continue to push improvements to the user experience and work to ensure our sites are becoming more welcoming, inclusive, and diverse. But there are also macro trends at work. </p>\n\n\n\n<p>As we join Prosus’s edtech portfolio, we do so alongside companies like Udemy, Brainly, and Codecademy. The number of people around the globe seeking careers as software developers is increasing. So too is the number of professions, from finance to life sciences to climate studies, where writing code is not the primary task, but is fundamental in transforming those professions to become more automated and to drive innovation.  </p>\n\n\n\n<p>As our community grows, we must continue to invest in supporting it. As I’ve outlined to all our employees, <strong>keeping the community at our center</strong> is a core value. We’re pleased to announce that we’ve recently hired a new VP of community, Philippe Beaudette. Philippe has a storied career, beginning in the days of AOL chat rooms, through the early days of Wikipedia, and most recently at Reddit. He brings a great wealth of experience in building safe, inclusive communities where users feel empowered to express their curiosity and share their knowledge. We’re thrilled that Philippe, with his deep community background, will be hyper focused on working closely with the community to help make the Stack Exchange ecosystem even more vibrant. You can read his blog post on <a href=\"https://stackoverflow.blog/2021/07/29/the-loop-our-community-public-platform-roadmap-for-q3-2021/\">our upcoming roadmap</a> and listen to a podcast interview with him below.</p>\n\n\n\n\n\n\n\n<p>Speaking of hiring, we have over <a href=\"https://lnkd.in/eBV_G5i\">100 open roles</a> across our company. If you want to be part of a high growth organization that works to accomplish a powerful mission at global scale, take a look and see if there is an opportunity available that speaks to you. </p>\n\n\n\n<figure class=\"wp-block-pullquote\"><blockquote><p>“We want to communicate through the work that we’re doing and not create more meetings, more time spent figuring out where to look or who to ask. Stack Overflow for Teams plays a big role in InnerSource because it helps us document all these answers that are needed for engineers to move quicker. Stack Overflow helps on unblocking engineers, and that’s a big thing we didn’t use to have.”</p><cite>Rocio Montes, Staff Software Engineer, Intuit</cite></blockquote></figure>\n\n\n\n<h2>Product</h2>\n\n\n\n<p>Q2 saw the launch of a new product, <a href=\"https://stackoverflow.com/collectives\">Collectives<img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/2122.png\" alt=\"™\" class=\"wp-smiley\"> on Stack Overflow</a>, which aims to increase value for our users, community, and clients by organizing Q&amp;A and Articles around a certain technical topic, for example a programming language or cloud services platform. We had two great customers come onboard to help us launch this product: Google Cloud and Google’s Go Language, and we will be announcing many more Collectives in coming months. Our approach to development is product-led AND community-driven. By learning from and serving our community, we can be a force multiplier for companies that want to empower users of their technology. </p>\n\n\n\n<p><strong>The two Collectives we’ve launched for Google Cloud and GOLang are reaching hundreds of millions of Stack Overflow users.</strong></p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"1896\" height=\"1307\" src=\"https://149351115.v2.pressablecdn.com/wp-content/uploads/2021/08/q2-2021-ceo-google-cloud-go-stats.png\" alt=\"\" class=\"wp-image-18549\"><figcaption>Statistics from the <a href=\"https://stackoverflow.com/collectives/google-cloud\">Google Cloud</a> and <a href=\"https://stackoverflow.com/collectives/go\">GOLang</a> Collectives. August 2021.</figcaption></figure>\n\n\n\n<p>We’re excited for this new approach to organizing knowledge and community on Stack Overflow, and have already seen over 10,000 users sign up to follow our Collectives. I believe that Collectives will help our community to organize and share knowledge around clusters of technology, for example the wide array of development happening in the blockchain space. We recently ran a survey on this topic, and got some <a href=\"https://stackoverflow.blog/2021/06/07/most-developers-believe-blockchain-technology-is-a-game-changer-3/\">fascinating results</a>. There are Stack Exchanges focused on <a href=\"https://bitcoin.stackexchange.com/\">Bitcoin</a>, <a href=\"https://ethereum.stackexchange.com/\">Ethereum</a>, <a href=\"https://cardano.stackexchange.com/\">Cardano</a>, <a href=\"https://iota.stackexchange.com/\">Iota</a>, <a href=\"https://eosio.stackexchange.com/\">EOS.IO</a>, <a href=\"https://tezos.stackexchange.com/\">Tezos</a>, and <a href=\"https://monero.stackexchange.com/\">Monero</a>. I’m sure more will emerge as this space continues to grow.</p>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://stackoverflow.blog/2021/06/07/most-developers-believe-blockchain-technology-is-a-game-changer-3/\"><img width=\"2400\" height=\"1256\" src=\"https://149351115.v2.pressablecdn.com/wp-content/uploads/2021/08/pulse-survey-social-want-to-develop.png\" alt=\"Results from the Blockchain survey: 61.85% of those of you who have not developed with blockchain want to.\" class=\"wp-image-18552\"></a></figure>\n\n\n\n<p>Collectives is part of our Reach and Relevance product offerings, and we’ve had an incredible start to this line of business in 2021. Earlier this year we combined our Advertising and Talent products under one umbrella. We moved away from discrete hiring to focus more on advertising and brand awareness. We are seeing tremendous traction in this space, with firms like AWS, JP Morgan Chase, and Accenture coming on board for brand awareness campaigns.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-full is-resized\"><img src=\"https://149351115.v2.pressablecdn.com/wp-content/uploads/2021/08/q2-2021-ceo-user-logos-1.png\" alt=\"AWS, JP Morgan Chase, and Accenture logos\" class=\"wp-image-18557\" width=\"600\" height=\"222\"><figcaption>Some of Stack Overflow’s recent brand awareness campaign clients</figcaption></figure></div>\n\n\n\n<p>Just as there are an ever growing number of new users signing up for the public platform, there is a steady increase in the number of organizations that want to reach developers. Some are looking to hire great talent, others want developers to try their product, and others simply want developers to use their platform, tools, or ecosystem. We can help them do it all, and we do it while respecting developer’s privacy and avoiding invasive tracking.</p>\n\n\n\n<p>As I’ve written before, <strong>Predictable and Reliable Financial Performance</strong> is one of our strategic priorities. In Q2 we introduced another new product, sponsored podcasts, and our content marketing business is on track to more than double in size over last year. Put together, Advertising and Collectives delivered an exceptional quarter, the biggest in the company’s history.</p>\n\n\n\n<figure class=\"wp-block-pullquote\"><blockquote><p>“The number of daily searches stood out as a healthy sign of people changing their behavior and coming to Stack Overflow for answers. Anecdotal evidence showed that even at this early stage, many actually found what they were looking for and therefore gained value without actively participating. Even the SMEs, who had to put in some extra effort up front, reported noticeable time savings, specifically when a ’hot topic’ had a good SO answer they could just point people to instead of repeating the answer on Slack”</p><cite>Tzach Zohar, System Architect, Skai</cite></blockquote></figure>\n\n\n\n<p>Q2 also saw continued traction towards our other strategic priority for 2021: <strong>Product-led Transformation</strong>. After our launch of our Freemium Teams tier in Q1, we saw a steady stream of thousands signups and users trying out the Teams product. From storied innovators like <a href=\"https://stackoverflowsolutions.com/teams/xerox-case-study\">Xerox</a> to rising unicorns like <a href=\"https://stackoverflowsolutions.com/teams/doctolib-case-study\">Doctlib</a>, we continue to see an ever growing cohort of organizations leveraging Stack Overflow for Teams in a range of use cases to ultimately innovate faster through knowledge sharing and collaboration.</p>\n\n\n\n<p>One key metric we focus on as we evaluate how our users see value in our Teams product is  something we call <strong>Knowledge Reuse</strong>. While the number of questions and answers added to a Team are meaningful, we believe the true value is best quantified by understanding how often users are able to quickly find a solution to the problem at hand. On our public site, we note how many people a particular user has reached with their answers. It’s incredible to realize that the contributions of an individual can help tens, even hundreds of millions of others learn and grow.</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img src=\"https://149351115.v2.pressablecdn.com/wp-content/uploads/2021/08/q2-2021-ceo-user-1200x630.png\" alt=\"Illustration of a Stack Overflow user\" class=\"wp-image-18564\" width=\"840\" height=\"441\"></figure>\n\n\n\n<p>The same outsized impact happens within private Teams. At companies like Xerox, Doctolib, and Unqork, knowledge is reused hundreds of times a month. That’s hundreds of emails or chat messages avoided, time saved for the person asking the question and for their colleagues. </p>\n\n\n\n<p>One of our most viewed questions on Stack Overflow is a question that asks “What is a NullPointerException, and how do I fix it?” That was asked 12 years and 7 months ago. It has 31 different answers or solutions provided. That question has been viewed 3.2 million times. That’s 3.2 millions times that knowledge was reused. We have one piece of knowledge on our own internal instance that’s had more than 1,000 views in the past two years – How do I submit a Salesforce Case?</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img width=\"1200\" height=\"368\" src=\"https://149351115.v2.pressablecdn.com/wp-content/uploads/2021/08/q2-2021-ceo-doctolib-stats-1-1200x368.png\" alt=\"\" class=\"wp-image-18572\"></figure>\n\n\n\n<p>Another major impact Teams can have is to break down silos within an organization. Great solutions may not come from the teammate or department you expect. We continue to use Teams internally, where it helps us <strong>learn, share, and grow. </strong>There are great conversations happening across legal, marketing, sales, product, and engineering. <a href=\"https://stackoverflowsolutions.com/teams/wisetech-case-study\">Wisetech Global</a> tells us that at their company all hands, Stack Overflow for Teams has been used to help discuss and debate the best ways to implement some of the company’s core mantras and values. “We have recently been running a program where we’re taking a number of the mantras that we hold dear in the business and we’ve been amplifying that to the global audience,” explains Ian Larsen, GM of software operations. “We’ve been using Stack Overflow for Teams as a discussion forum. It’s a place for people to raise questions, get additional clarity, or just discuss the nuances. So I think that has been great.”</p>\n\n\n\n<figure class=\"wp-block-pullquote\"><blockquote><p>“We have a highly complex and proprietary tech stack and have recently expanded rapidly. Our senior engineers were spending a lot of their very valuable time answering the same questions to different people. Having our own Stack Overflow (for Teams) setup means they only have to answer it once and can provide code samples, details descriptions etc. It also has the benefit of this knowledge being available outside of our time-zone’s working hours so our engineers in the US and Asia can get quick, detailed answers without having to wait until our UK office opens. It has significantly helped boost our productivity”</p><cite>Global Cyber Security Provider</cite></blockquote></figure>\n\n\n\n<h2>Diversity &amp; Inclusion</h2>\n\n\n\n<p>A year ago I made a commitment to include updates on our diversity and inclusion progress in these quarterly posts. We are making a significant investment in DEI (diversity, equity and inclusion) at the company. We are compiling and preparing to share DEI metrics with employees, evolving our hiring practices, rolling out inclusion training to all employees, and we are in the process of hiring a Director of DEI to lead these efforts. We’ve also committed to a quarterly DEI newsletter compiled by our growing number of affinity groups collectively, which is launching this week.</p>\n\n\n\n<p>Over the last three months, we’ve also hosted panels featuring employees and external experts open to the full company on issues and experiences facing our Asian &amp; Pacific Islander community and our LGBTQIA+ community. Hearing shared and individual experiences was eye opening, and I truly believe learning about others’ experiences makes us a stronger, more thoughtful organization in the long run.</p>\n\n\n\n<p>There is so much work to be done, but we’re continuing to take steps towards a diverse and inclusive culture that we believe sets the tone for the community we foster online.</p>\n\n\n\n<h2>Conclusion</h2>\n\n\n\n<p>As we look out to the second half of 2021, there are many big opportunities we are considering. How can we leverage the global scale of Prosus to expand our business and bring a broader cohort of users, from around the world, onto our public platform? How do we enable beginner developers to leverage Stack Overflow so they become engaged participants, not just casual visitors? What kind of strategic partnerships and alliances are possible with other edtech companies, leveraging our scale and their expertise so that Stack Overflow can offer a wider variety of options for finding solutions and learning new skills? </p>\n\n\n\n<p>The completion of our deal with Prosus isn’t the only exciting news I get to share today. Today we <a href=\"https://insights.stackoverflow.com/survey/2021\">published our annual Developer Survey</a>. It contains many fascinating insights, but one in particular stood out to me. For the rising cohort of coders under the age of 18, online resources like videos, websites, and blogs are more popular than books and school combined, a statistic that doesn’t hold for any of our other age cohorts. Overall the developer profession is full of new joiners, with more than 50% indicating they have been coding for less than a decade, and more than 35% having less than five years in the trade.</p>\n\n\n\n<p>So much of what drives us is the desire to empower this new generation of developers and technologists. The resources available to us through this acquisition and the continued growth of our product and public platform give me great confidence that we will continue to unlock new potential, and that we will grow Stack Overflow into an enduring global brand with a vibrant community that continues to empower the world to develop technology through collective knowledge.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2021/08/02/q3-2021-ceo-blog-post-communities-catalyst/\">Communities are a catalyst for technology development</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}