{
  "title":"Podcast 364: What’s the blast radius when your database goes down?",
  "date":"2021-08-05T21:40:00.000000-07:00",
  "author":null,
  "id":"https://stackoverflow.blog/?p=18588",
  "link":"https://stackoverflow.blog/2021/08/06/podcast-364-mark-porter-mongodb-database/",
  "content":"\n\n\n\n\n<p>We chat with Mark Porter, CTO of MongoDB, about his history using and building some of the foundational databases of the last four decades. We walk through his time at Oracle and AWS, then delve into the trends he’s focused on at MongoDB, such as time series capabilities and serverless instances.</p>\n\n\n\n<h2 id=\"h-episode-notes\">Episode Notes</h2>\n\n\n\n<p>Mark started out on a 4k TRS-80 Model I. He had to program it in assembly language, as there wasn’t enough memory to use the local Basic copy.</p>\n\n\n\n<p>Throughout his career, he’s oscillated between using databases and building databases. He started at Caltech and NASA, using databases to store and organize space data and chip data. Then he built databases at Oracle, including versions, 5 6, 7, and 8.</p>\n\n\n\n<p>After that it was back to using databases at NewsCorp for huge student data systems. </p>\n\n\n\n<p>He built databases at AWS with Amazon RDS, then moved to Grab Taxi, the Uber of Southeast Asia, and finally back to MongoDB, where he is building again.</p>\n\n\n\n<p>You can find Mark on Twitter <a href=\"https://twitter.com/marklovestech\">here</a>.</p>\n\n\n\n<p>This week’s lifeboat badge goes to Erik Kalkoken, who answered the question: <a href=\"https://stackoverflow.com/questions/42662450/in-a-slack-is-there-a-way-to-see-all-the-members-that-is-part-of-that-channel/42663087#42663087\">In a Slack, is there a way to see all the members that is part of that channel?</a></p>\n\n\n\n<p><a href=\"https://the-stack-overflow-podcast.simplecast.com/episodes/whats-the-blast-radius-when-your-database-goes-down/transcript/\">TRANSCRIPT</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2021/08/06/podcast-364-mark-porter-mongodb-database/\">Podcast 364: What’s the blast radius when your database goes down?</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}