{
  "title":"You’re living in the Metaverse, you just don’t know it yet.",
  "date":"2021-08-23T07:00:00.000000-07:00",
  "author":null,
  "id":"https://stackoverflow.blog/?p=18683",
  "link":"https://stackoverflow.blog/2021/08/23/youre-living-in-the-metaverse-you-just-dont-know-it-yet/",
  "content":"\n<p>Like many families dislodged by the pandemic, my wife and I sent our children to a new school last year. They had to make new friends, and they had to do it while wearing masks that hid their faces and staying six feet apart on the playground. Social distancing, as the name implies, is not conducive to creating strong new social relationships.</p>\n\n\n\n<p>Luckily, my children and their peers had a world where they could hug, jump, and run together. After school, they would meet up in the virtual world of Brookhaven, a digital city you can explore inside the Roblox universe. When it came to building rapport with their peers, the clothing, vehicles, and dwellings you can purchase inside of this app were more important to them than what they actually wore to school, the kind of car we drove, or the kind of home we lived in.</p>\n\n\n\n<p>There has been a lot of chatter lately about the Metaverse, sparked by <a href=\"https://www.theverge.com/22588022/mark-zuckerberg-facebook-ceo-metaverse-interview\">Mark Zuckerberg’s repeated declarations that building a virtual world is his company’s next big ambition</a>, and the announcement of Horizon Workrooms brings that ambition closer to reality. A question worth asking is, why now? The concept of the Metaverse was coined by sci-fi author Neal Stephenson decades ago, and technologists have been writing about it on and off ever since. Facebook isn’t the first major company to declare its ambition to build the metaverse; see for example this tweet from <a href=\"https://twitter.com/TimSweeneyEpic/status/1157841800385695744\">Epic Games in 2019</a> or <a href=\"https://www.matthewball.vc/all/forwardtothemetaverseprimer\">this wonderful essay</a> from Matthew Ball published at the beginning of 2020. Have we reached some meaningful inflection point in our journey towards this dream? </p>\n\n\n\n<p>I think the answer is yes, and I think the tipping point is two fold. First, an ongoing pandemic has driven many to more fully adopt remote work. Companies like Facebook <a href=\"https://www.nytimes.com/2021/08/19/technology/can-facebook-make-virtual-reality-happen-for-real-this-time.html\">are betting</a> that will lead to a boost in offices  relying on virtual reality and digital avatars to forge connections and recapture some of the spark that comes from face to face interactions. A plethora of other digital tools and worlds will also try to improve the quality and immediacy of remote work. </p>\n\n\n\n<p>Second, but perhaps more novel, is the growing appetite for digital artifacts like <a href=\"https://money.stackexchange.com/questions/142866/why-do-nfts-have-value\">NFTs</a> (non-fungible tokens). Most of us already live in a Metaverse to varying degrees, and it’s increasing presence in our lives will be fostered by a slow accumulation of digital worlds and goods growing deeper roots into our personal and social selves. </p>\n\n\n\n<p>Unique digital assets with potentially enormous monetary value have broken free of the siloed worlds created by gaming companies and come into their own on the open web. The rise of the crypto economy has generated new forms of currency and collectibles, allowing creatives new ways to monetize, and encouraging humans to do what comes naturally to them, seeking out new ways to grow their social and financial capital.</p>\n\n\n\n<h2 id=\"h-the-creeping-spread-of-the-metaverse\">The creeping spread of the Metaverse</h2>\n\n\n\n<p>The Metaverse slips into daily life differently depending on who you are. Let’s say you’re a hermit who lives in a cabin surrounded by woods. Life for you resembles a contest in <a href=\"https://en.wikipedia.org/wiki/Alone_(TV_series)\">Alone</a>. You spend each day attending to the basic needs of food and shelter. Your contact with the Metaverse is nil. </p>\n\n\n\n<p>What about a senior citizen who grew up in an age before the internet? Maybe you spend as much time away from a screen as in front of it, or more. The bridge game with your friends and the early bird special with your neighbors are as important to you as the number of likes on your occasional Facebook post. </p>\n\n\n\n<p>But you might also be a grandmother who spends as much time posting on Facebook as potting plants. The conversation around an anonymous figure like Q, who has no material form, might be your guiding maxim these days. Without noticing, you have allowed an entirely digital entity to become the center of your life. </p>\n\n\n\n<p>Now, take a geriatric millennial like me. Growing up, I cared deeply about what video games my friends played, but we had to be in the same room to enjoy Nintendo’s multiplayer experience, and we cared about the cartridges someone physically owned, not the clothes the characters wore. I’ve paid money to own digital cards in a game like Hearthstone, but their purpose is to help me enjoy the game, not to act as a status symbol to others I meet online. I can’t deny however, that some of my identity is bound up in my status, or lack thereof, on social media. I crave attention and adulation there, even if it comes in the form of likes from total strangers.</p>\n\n\n\n<p>You may believe NFTs are a flash in the pan, but the value of digital artifacts has been growing for decades. Teenagers understand the money they can make t<a href=\"https://joshkaufman.net/everything-i-know-about-business-i-learned-from-world-of-warcraft/\">rading virtual sword and shields in World of Warcraft</a> or <a href=\"https://www.engadget.com/animal-crossing-video-game-sales-diablo-ii-virtual-economies-131547613.html\">selling bells they harvested in Animal Crossing</a>. Top players in esports like League of Legends are earning six and seven figure salaries. And people well outside the world of tech are paying for moments on NBA Top Shot, giving them ownership of a GIF. </p>\n\n\n\n<p>I am still struggling to accept that a patch of pixels could be worth millions, but my kids won’t have these same reservations. From the time they entered primary school, digital objects and virtual interactions had as much significance as real world playdates or toys. Adults, sensing opportunity or simply curious to create and explore, are venturing into this same mindset. I have many friends and acquaintances in the world of media and technology who have stepped more deeply into the Metaverse. They have spent thousands, even tens of thousands of dollars on their digital avatars. They collect and trade NFTs, which hold value to them as an investment and a signal of one’s social status and disposition. The value of the <a href=\"https://finance.yahoo.com/news/nft-trading-surges-8x-penguins-212053864.html\">NFT market continues to swell</a>.</p>\n\n\n\n<figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"><div class=\"wp-block-embed__wrapper\">\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">NFTs gave me ________ .</p>— ⟠⟠⟠ tommyk.eth ⟠⟠⟠ (@tommyk_eth) <a href=\"https://twitter.com/tommyk_eth/status/1425098014167871499?ref_src=twsrc%5Etfw\">August 10, 2021</a></blockquote>\n</div></figure>\n\n\n\n<p>NFTs extend the logic that has been driving the value of in-game items. Create a digital artifact, but don’t limit it to the universe of a single game with a corporate overlord. Make it something that can be used across the open web and give it at least the veneer of a unique, singular object by tokenizing it. Sure, anyone can copy paste your $50,000 <a href=\"https://www.newyorker.com/culture/infinite-scroll/why-bored-ape-avatars-are-taking-over-twitter\">bored ape</a> avatar or <a href=\"https://www.nytimes.com/2021/08/12/technology/penguin-nft-club.html\">pudgy penguin</a> PNG. But only you can resell it. </p>\n\n\n\n<h2 id=\"h-a-life-lived-online\">A life lived online</h2>\n\n\n\n<p>There is a <a href=\"https://builtin.com/design-ux/virtual-world-design-ethics\">grand vision</a> of a network of fully realized virtual worlds where users connect as believable avatars and carry their digital lives between VR, AR, and IRL. That’s not how most people live today, but we’re moving along a continuum where more of everyday life is mediated through digital worlds and personas with each passing year. </p>\n\n\n\n<p>As someone who has struggled with an addiction to video games, I’m afraid of the world my children are growing into. It seems likely that, the earlier you step into the Metaverse, the greater the chances it will hold a deep and lasting significance as you age. While virtual connections were a lifeline during a pandemic lockdown, when seeing each other in person was dangerous, I’m troubled by research that indicates teenagers whose everyday lives are dominated by their social interactions online are <a href=\"https://www.psycom.net/social-media-depression-teens\">more likely to experience depression</a>. </p>\n\n\n\n<p>What gives me hope is that there seems to be a <a href=\"https://www.theguardian.com/society/2018/aug/29/teens-desert-social-media\">cohort of young people</a> who understand the risks and are rejecting a life lived completely online. And <a href=\"https://theconversation.com/flawed-data-led-to-findings-of-a-connection-between-time-spent-on-devices-and-mental-health-problems-new-research-162585\">new research</a> indicates that the connection between a life lived online and mental health struggles may not be as significant as early work claimed. The pandemic has been a powerful reminder that video calls and multiplayer games can only provide so much social sustenance. Once it’s safe to gather again, I think we’ll see a swell of offline activities. Meanwhile, the building blocks for the Metaverse continue to be laid into a foundation.</p>\n\n\n\n<p>Let us know your thoughts on the Metaverse and where you see it becoming more fleshed out in your own life in the comments.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2021/08/23/youre-living-in-the-metaverse-you-just-dont-know-it-yet/\">You’re living in the Metaverse, you just don’t know it yet.</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}