{
  "title":"Podcast 367: Building a better developer platform",
  "date":"2021-08-16T21:40:00.000000-07:00",
  "author":null,
  "id":"https://stackoverflow.blog/?p=18633",
  "link":"https://stackoverflow.blog/2021/08/17/podcast-367-building-a-better-developer-platform/",
  "content":"\n<p>We chat with Stack Overflow’s CEO about the close of the Prosus acquisition and how the deal helps us empower our global community to develop technology through collective knowledge. We also discuss what our Reach and Relevance business means for you.</p>\n\n\n\n\n\n\n\n<h2 id=\"h-episode-notes\">EPISODE NOTES</h2>\n\n\n\n<p>We’re officially part of the Prosus family now that the acquisition has closed. It’s a huge milestone and a big deal for our company and community.</p>\n\n\n\n<p>Prosus has a global reach and will help us meet the needs of developers and technologists everywhere. </p>\n\n\n\n<p>Have no fear: there will not be a paywall on the community sites. We have separate free and paid products for a reason. </p>\n\n\n\n<p>We combined our Ads and Talent businesses into Reach &amp; Relevance, which gives companies the opportunity to showcase their products and engineering organizations to software engineers around the world. </p>\n\n\n\n<p>Remote work is here to stay, and a lot of knowledge workers are starting to adapt the processes that software engineers have been using for years. </p>\n\n\n\n<p>Our lifeboat shoutout goes to Jordi Castilla for the answer to the question: <a href=\"https://stackoverflow.com/questions/32885682/convert-hhmmss-into-minute-using-javascript\" rel=\"noreferrer noopener\">Convert HH:MM:SS into minute using JavaScript</a></p>\n\n\n\n<p><a href=\"https://the-stack-overflow-podcast.simplecast.com/episodes/building-a-better-developer-platform/transcript\">TRANSCRIPT</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2021/08/17/podcast-367-building-a-better-developer-platform/\">Podcast 367: Building a better developer platform</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}