{
  "title":"The strange domain names that developers bought",
  "date":"2021-08-11T14:02:32.000000-07:00",
  "author":null,
  "id":"https://stackoverflow.blog/?p=18609",
  "link":"https://stackoverflow.blog/2021/08/11/the-strange-domain-names-that-developers-bought/",
  "content":"\n<p>These days, a domain name is about as easy to acquire as it is to conceive of. If no one else already has your idea, you can get whatever nonsense you can think of for less than US$20 per year. When it comes to developers, it turns out that twenty bucks is not that much to pay for a joke. </p>\n\n\n\n<p>Over the years we noticed that asking about domain names was always a great conversation starter at Stack Overflow. So we asked around on Twitter and Facebook, as well as our engineering team, to see what everyone’s strangest domain purchases were. </p>\n\n\n\n<p>For the record, I’ve had my share of goofy domains. Before joining Stack Overflow, I had robertstackoverflow.com, a stray thought that I decided to take too far and then gave up on when I couldn’t suss out the video editing software. Speaking of dumb jokes, I also have allis.horse, after a conversation about horse cults. For my dad’s birthday one year, he asked me to get him faciebookie.com because he hates Facebook and wanted to put up counter-programming there. Place your bets on its future, but nothing has happened with it so far. </p>\n\n\n\n<p>With the responses that we got, there was a common theme: a playful idea that someone purchased on a whim but never took any further. Heck, here at Stack Overflow, the company has bought its share of weird domains. A selection of them are presented here without comment:</p>\n\n\n\n<ul><li><a href=\"https://stackoverflow.blog/2012/10/29/se-podcast-35-a-biscuit-away-from-jerry-stiller/\">abiscuitawayfromjerrystiller.com</a></li><li>diablo3acts.com</li><li>hatfight.com</li><li>isstackoverflowdownforeveryoneorjustme.com</li><li>liehound.com</li><li>ninjawanted.com</li><li>stackofdice.com</li><li>stackosphere.com</li><li>vast-and-endless-sea.com</li></ul>\n\n\n\n<p>Our adoring fans had plenty of ridiculous domains to share as well. Note that there are strange domain names here and some that have lapsed ownership, so no direct links will be given. Visit them at your own risk. </p>\n\n\n\n<h2 id=\"h-a-joke-made-real\">A joke made real</h2>\n\n\n\n<p>A large number of the oddball domains that we heard about were little jokes people took from their heads to a domain registrar, like my own robertstackoverflow.com. <a href=\"https://www.facebook.com/go4prateek?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODA5MjkzOTk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Prateek Singh</a> on Facebook was on my level here, admitting to purchasing heapunderflow.com. </p>\n\n\n\n<p>The king of the joke domains was <a href=\"https://twitter.com/jessejjohnson\">@jessejjohnson</a> on Twitter. He shared takemetoprom.com, opensourceidiots.com, buffmasterflex.com, and, threateningly, “so many more.” One wonders how many of these actually had a website behind them. </p>\n\n\n\n<p>Our own Director of Brand Design, David Longworth shared his internal joke. “I bought planofasnack.com based on an impulse while looking for dinner one night after a few drinks ‘Whats our food plan of attack? Wait, our plan of a snack?!’” </p>\n\n\n\n<p>Senior Software Engineer Michael Stum had the nerdiest joke: “I used to own 14159265358979323846264338327950288419716939937510582097494459.net, with one subdomain, 3. Made for a fun email address for a bit.”</p>\n\n\n\n<p>Sometimes you can’t get the joke you want. Site reliability engineer Jade Sprague told us about her consolation prize of a domain: “I have xebec.ws, but there’s not really a story behind that one, other than at the time, krabouillator.ws was taken and that’s the one I really wanted. In Warhammer 40K, the Orks faction have a big robot called a Stompa, but in French it gets translated as ‘Krabouillator’ for some reason. The Stompa looks nothing like a crab, so nobody remembers why it got translated to ‘Krabouillator.’ The Spanish, Portuguese, Italian, and Romanian translations are nothing like that. As for Xebec, it’s a type of sailing ship, but mostly it’s an odd-looking word that’s memorable.”</p>\n\n\n\n<p>Most of these domains shouldn’t be followed. That goes double for <a href=\"https://twitter.com/NNekoru\">@NNekoru</a>’s friend, who owned suspicious.link. </p>\n\n\n\n<p>Ever had a typo for breakfast? <a href=\"https://twitter.com/medium_bot\">@medium_bot</a> had Buscuit.org.</p>\n\n\n\n<p>This next one is really childish, but not inaccurate. <a href=\"https://twitter.com/Henok45724681\">@Henok45724681</a> shared assfart.gas. In that same vein, <a href=\"https://www.facebook.com/SphincterBoy?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODE2ODkxNDk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Joe Hoyle</a> has squirrelturd.com in his portfolio. “Not sure what to use it for,” he said, “but It makes me smile.”</p>\n\n\n\n<p>Animal themed jokes are always in fashion, like <a href=\"https://www.facebook.com/alexander.stopher.1?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODE5MDc4OTk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Alexander Stopher</a>’s rab.bet. “I had literally no use for it and it expired without ever being used.”</p>\n\n\n\n<ul><li><a href=\"https://www.facebook.com/alpereryurt?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODMxODU4NDk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Alper Eryurt</a> had one for the theoretically worst holiday on the planet: worldbadhairday.com.</li><li>With the arrival of new top-level domains, you could prank your friends using technology. <a href=\"https://www.facebook.com/dominic.weldon?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODEyMTcyOTk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Dom Weldon</a> said, “I own several name-of-some-friend.sexy domains, usually bought whilst in the pub.” It looks like <a href=\"https://www.facebook.com/nat.zimmermann?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODExODMzOTk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Nat Zimmermann</a> was on the same wavelength and bought corbyn.sexy for who I assume is his best mate, Jeremy Corbyn. </li><li>A couple of jokers went for deep cut references. <a href=\"https://www.facebook.com/jonny.cameron.3?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODEzNDA0NDk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Jonny Cameron</a> said, “likelikeatemyshield.com is my personal dev blog (yes I’m a Zelda fan).” Meanwhile, <a href=\"https://www.facebook.com/sheabelsky?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODQwNTYwNDk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Shea Hunter Belsky</a> doesn’t need your vote, Senator Amidala: “iamthesen.net is mine!”</li><li><a href=\"https://www.facebook.com/harsh.munjal?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODExODI4OTk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Harsh Munjal</a> had a salesperson’s dream site: onetwothreesold.com. At least until he sold it, I assume.</li></ul>\n\n\n\n<h2 id=\"h-a-very-specific-application\">A very specific application</h2>\n\n\n\n<p>Beyond just jokes, some of our responders had some very niche business and website ideas. We’re just waiting for science and/or public policy to catch up. . </p>\n\n\n\n<p><a href=\"https://app.slack.com/team/U0244S42TDK\">Vlad Jimenez</a> had himself a gold mine if he could pair his domain tacobeam.me with a teleporter of some sort. </p>\n\n\n\n<p><a href=\"https://twitter.com/readcodesing\">@readcodesing</a> got idiotdarts.com to implement someone else’s joke. “I wanted to implement Gallagher’s idea where you got several darts a month and could shoot them at other cars. If you saw a car covered in ’em, you know to steer clear. You could get a ticket for being too big of an idiot. But, you know, privacy and safety.”</p>\n\n\n\n<p><a href=\"https://twitter.com/diginaresh\">@diginaresh</a> must have figured that the market was saturated for smart hackers. So he got dumbhacker.com. </p>\n\n\n\n<p><a href=\"https://twitter.com/raddevus\">@raddevus</a> bought quotimal.com to increase the number of cute and inspirational cats on the internet. “It’s quotes with animal pictures of course.”</p>\n\n\n\n<p>I assume <a href=\"https://twitter.com/HKLilhore\">@HKLilhore</a> was tired of how long the world was taking, so he made his own at Fiveminuteworld.com.</p>\n\n\n\n<ul><li><a href=\"https://www.facebook.com/leahmedsaoudi?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODEwODI2OTk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Ahmed Saoudi</a> out here doing work in weird places. “I own isitworking.xyz to which I add different subdomains to test my side projects before their official launch.”</li><li><a href=\"https://www.facebook.com/onairthend?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODEwMjgxNDk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Onar Alili</a>, though, is the real hero asking the right questions. With his site, canacateat.it, I can only assume he’s compiled a massive database of bugs that cats have eaten. </li></ul>\n\n\n\n<p>Our last two in this category made websites to help other people interact with them. <a href=\"https://www.facebook.com/syedsaadahmeda?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODA4NzM3NDk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Syed Saad Ahmed</a> has takingchallenges.me, presumably to arrange wrestling matches, and <a href=\"https://www.facebook.com/schwar01?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODE5OTAzOTk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Joshua Schwartz</a> has email.me to avoid that awkward moment when you say your email address out loud. </p>\n\n\n\n<h2 id=\"h-a-professional-website-but-sillier\">A professional website but sillier</h2>\n\n\n\n<p>Several people shared the weird places where you can find their professional presences. For some, you can thank the wonders of new  TLDs in the tradition of walmart.horse. Others were poorly thought out domain names that professional companies wanted to use. </p>\n\n\n\n<p>Surprisingly (or not surprisingly, depending on how mad you are at us right now), several Stack Overflow developers have ridiculous TLDs with their name attached. Developer Benjamin Hodgson has benjamin.pizza as his personal site. Software Engineer Gabe Breda Koscky has gabe.fail but has failed to do anything with it. And Staff Engineer Adam Lear regrets his choice of website domain name:</p>\n\n\n\n<p>“It’s not super weird, more of a ‘that seemed like a good idea at the time.’ I own lear.rocks, which allows me to have an email address that’s honestly too awkward to give out and is also quite likely not to be accepted by various websites. For example, Ubisoft can’t send a recovery email to it, and Goodreads would only allow me to log in on the web, but not on the mobile app.”</p>\n\n\n\n<p>Other folks thought a long and clever domain name was the way to go. <a href=\"https://www.facebook.com/pawel.mach0?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODMxMTcxOTk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Paweł Mach</a> said, “I own notimplementedexception.pl. This is what I called my business. I thought it was funny until I had to spell it out for the fourth time.” <a href=\"https://www.facebook.com/mdxd3d4d674541540054544r45gfgfghh6ffh5klg35ogr?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODI2MTc4OTk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Michael Blanco</a> ran into the same problem with blueorangetekknologee.com. “I used to own it for my portfolio because I wanted to buy a cheap domain name, even if it’s difficult to memorize.”</p>\n\n\n\n<p>Even companies aren’t immune from having silly domain names. <a href=\"https://www.facebook.com/neil.prestemon?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODA5MjcyNDk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Neil Prestemon</a> bought klak.click for his employer at the time. “At that time, ‘.click’ was one of the cheapest TLDs you could register.”</p>\n\n\n\n<h2 id=\"h-camping-trips\">Camping trips</h2>\n\n\n\n<p>Last but not least are the domain names that people bought as strange speculations, miners on a digital gold rush. Not all of them paid off, but some of them did. </p>\n\n\n\n<p>Software Engineer Ben Kelly told us about his brush with fortune. “Not me personally, but I know a guy that owned stovetop.com (in 2016!). He foolishly let it lapse (I wanted it) and Kraft foods bought it. It is now on every box of stuffing you see in the grocery store.”</p>\n\n\n\n<p>Our own ancient mariner and Architecture Lead Nick Craver told us about Stack Overflow’s own camped domain. “We had <a href=\"http://thenewnewnewipad.com/\">thenewnewnewipad.com</a> as a business strategy for a while but Apple never bit.”</p>\n\n\n\n<p>Software engineer Kristina Lustig jumped at the chance of having a politically relevant typo domain: “Once during a presidential debate, Biden garbled his attempt at telling people how to learn more about him, and I looked up right away and bought that domain name. I never did anything with it and can’t remember what it was anyway.”</p>\n\n\n\n<ul><li><a href=\"https://www.facebook.com/tomalak?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODA4ODM5OTk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Tom Lachecki</a> wins the award for the bravest domain squat: “I owned mil.ht for a while so I could pretend I was the Haitian military. Thought someone would buy it. They did not.”</li><li><a href=\"https://www.facebook.com/jeannicolas.gauthier1?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODExNDI0OTk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Jean-Nicolas Gauthier</a> sang us a song of regret: “I had mykeysolution.com, which is not weird. But the day I didn’t renew it, it was bought and used by some Chinese company or whatever, so I guess they were waiting for that domain for a while. I wish I had sold it.”</li><li><a href=\"https://www.facebook.com/tdaugaard82?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODExOTg4OTk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Thomas Daugaard</a> isn’t exactly a camper with list.dk, but the clumsy-fingered discount shoppers sending him complaints might disagree: “I get a <em>ton </em>of emails directed at the grocery store LIDL (lidl.dk), including customer complaints, invoices, queries, and even job applications.”</li></ul>\n\n\n\n<p>Heavy is the head who wears the crown, and <a href=\"https://www.facebook.com/ADBjester?comment_id=Y29tbWVudDoxMDE1MTQzODA4NDUwOTk3MV8xMDE1MTQzODI1ODI2NDk3MQ%3D%3D&amp;__cft__[0]=AZWsgpbUu5nRW4NQ5Vmf8eiVtWel37xDpaspUnsD3PJewE4X9UbbQy9820AAsUM4rf0XZxYms8m_XlgZqXLEHhtkUlYRRKwLFDr-KOIBmK2shjyVPyWYYfiDMYlcMIb7sdPoSrYE6rmJeDP3mlFNOpvDDyPBeZRzWwVaFffP9qs-Lg&amp;__tn__=R]-R\">Jeff Woods</a> is that king: “I had four of note: </p>\n\n\n\n<ul><li>delta.com for my company, named after my fraternity (sold to Delta Funding in 1996 who flipped it to the airline) </li><li>poker.net (sold to a poker site before the poker boom) </li><li>hurricanes.com (snagged when the NHL team announced the new team name of the Hartford Whalers in 1997 without securing the domain—donated to them for no money, but for priority in season ticket location selection on the glass)</li><li>johngalt.com [<em>Ed. note: named after the protagonist of Ayn Rand’s novel, Atlas Shrugged</em>], which I sold to a company of the same name—had it solely to have the email address whois@johngalt.com.</li></ul>\n\n\n\n<p>Thank you to everyone who contributed to this list of the domains that made us weird. Did we miss yours? Holler in the comments. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2021/08/11/the-strange-domain-names-that-developers-bought/\">The strange domain names that developers bought</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}