{
  "title":"Fighting to balance identity and anonymity on the web(3) (Ep. 504)",
  "date":"2022-11-08T05:40:00.000000Z",
  "author":null,
  "id":"https://stackoverflow.blog/?p=21104",
  "link":"https://stackoverflow.blog/2022/11/08/from-taming-apples-app-store-to-reimagining-identity-on-the-web3-ep-504/",
  "content":"\n\n\n\n\n<p>Phillip Shoemaker thinks we’re at a critical turning point for the web, with identity and privacy being core, foundational priorities. Imagine an internet where it’s easy to provide just the data you want or need to exchange. Envision being able to protect your anonymity, no questions asked.</p>\n\n\n\n<p>Shoemaker isn’t exactly new to the topic of turning points for the web. He grew up in Cupertino, around the corner from Apple headquarters. His dad was an engineer at IBM. He eventually ended up working for Apple in 2009 where he helped the company navigate one of the biggest turning points in internet history — the launch of the App Store</p>\n\n\n\n<p>In today’s podcast episode, we reflect on Shoemaker’s career experiences and discuss why he’s now focused on decentralized networks of trust.</p>\n\n\n\n<p><strong>Episode notes:</strong></p>\n\n\n\n<p>Shoemaker spent his childhood in Silicon Valley and learned Assembly when he was just 16 years old.</p>\n\n\n\n<p>In his early 20s, he applied to work at Apple and was continually rejected. So he went to work for seven startups instead.</p>\n\n\n\n<p>Finally, in 2009, Shoemaker ended up at Apple overseeing the review process for the App Store.</p>\n\n\n\n<p>After seven years at Apple, Phillip became interested in cryptocurrency after discovering his personal information on the dark web.</p>\n\n\n\n<p>His interest grew in the topic of self sovereign identities, which led him to become CEO and co-founder of <a href=\"https://www.identity.com/\">Identity.com</a>.</p>\n\n\n\n<p>Phillip and Ben reflect on the utility of Web3 in gaming.</p>\n\n\n\n<p>Follow <a href=\"https://twitter.com/benpopper\">Ben</a> and <a href=\"https://twitter.com/pbsIdentity\">Phillip</a>.<br><br>Thank you to lifeboat badge winner <a href=\"https://stackoverflow.com/users/9435624/marchingband\">Marchingband</a> for their answer to the question about running C or C++ code from Node.js in an efficient way.</p>\n\n\n\n<p><a href=\"https://the-stack-overflow-podcast.simplecast.com/episodes/phillip-shoemaker-apple-app-store-web-3-identity/transcript/\">TRANSCRIPT</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2022/11/08/from-taming-apples-app-store-to-reimagining-identity-on-the-web3-ep-504/\">Fighting to balance identity and anonymity on the web(3) (Ep. 504)</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}