{
  "title":"Faster feedback loops make for faster developer velocity (Ep. 498)",
  "date":"2022-10-19T04:40:00.000000Z",
  "author":null,
  "id":"https://stackoverflow.blog/?p=20971",
  "link":"https://stackoverflow.blog/2022/10/19/faster-feedback-loops-make-for-faster-developer-velocity/",
  "content":"\n<h2>SPONSORED BY COUCHBASE</h2>\n\n\n\n\n\n\n\n<p>When some people hear the phrase “developer velocity,” they cringe and think about delivering an increasingly large number of story points during a sprint. Others push to tighten feedback loops for engineers in order to remove the roadblocks between writing code and getting it into production. But few will understand that much of the “feedback” in that loop is human, so giving them a little more slack lets them provide feedback faster. After all, if you want a fast highway, you should have fewer cars. </p>\n\n\n\n<p>On this sponsored episode of the podcast, Ben and Ryan talk with Matthew Groves, Senior Product Marketing Manager at Couchbase, and Cory House, the founder of Reactjsconsulting.com and a Pluralsight course author, about how to increase velocity without increasing pressure on your engineers, whether cloud native technologies can help (or hurt), and how to design your toolchain so it improves velocity. </p>\n\n\n\n<h2 id=\"h-show-notes\">Show notes</h2>\n\n\n\n<p>Having trouble with understanding your team’s productivity outside of frameworks and tooling? Create a backlog and work through it: Instant Agile! How much of that backlog you work through is a good baseline measure. </p>\n\n\n\n<p>The Stack Overflow blog recently featured an article from Stack Overflow’s Director of Engineering, Ben Matthews: <a href=\"https://stackoverflow.blog/2022/08/22/does-high-velocity-lead-to-burnout-that-may-be-the-wrong-question-to-ask/\">Does high velocity lead to burnout? That may be the wrong question to ask</a> </p>\n\n\n\n<p>If you’re interested in seeing how Couchbase’s SQL database solutions can help improve your team’s velocity, check out <a href=\"https://www.couchbase.com/products/capella\">Capella</a>.  </p>\n\n\n\n<p>Cory House helps teams deliver successful React projects through his consulting business, <a href=\"https://www.reactjsconsulting.com/\">ReactJS Consulting</a>.  </p>\n\n\n\n<p>If you want to learn more about Matt, check out his <a href=\"https://www.linkedin.com/in/mgroves/\">LinkedIn</a>.</p>\n\n\n\n<p>Congrats to Lifeboat badge winner, <a href=\"https://stackoverflow.com/users/42585/alohci\">Alohci</a>, who threw a great answer to rescue the question, <a href=\"https://stackoverflow.com/questions/27656634/button-display-inline-css/27658723#27658723\">Display button with  inline CSS</a>.</p>\n\n\n\n<p><a href=\"https://the-stack-overflow-podcast.simplecast.com/episodes/faster-feedback-loops-make-for-faster-developer-velocity/transcript/\">TRANSCRIPT</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2022/10/19/faster-feedback-loops-make-for-faster-developer-velocity/\">Faster feedback loops make for faster developer velocity (Ep. 498)</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}