{
  "title":"How to get more engineers entangled with quantum computing (Ep. 501)",
  "date":"2022-10-28T04:40:00.000000Z",
  "author":null,
  "id":"https://stackoverflow.blog/?p=21049",
  "link":"https://stackoverflow.blog/2022/10/28/quantum-computing-aws-helmut-katzgraber/",
  "content":"\n\n\n\n\n<p>Quantum computing has applications across communications, network building, financial modeling, cybersecurity, AI, and so much more. But getting involved with these projects has traditionally taken years of education at the most advanced academic levels. According to Helmut Katzgraber, Global Practice Lead at Amazon Quantum Solutions Lab, the scientific community could be doing a better job inviting more people to participate in discovering breakthroughs. </p>\n\n\n\n<p>In today’s podcast episode, Ben, Matt, and Ryan reflect on Katzgraber’s experience in the field, along with the steps he is taking to broaden access to education on quantum computing.</p>\n\n\n\n<p><strong>Episode notes:</strong></p>\n\n\n\n<p>Katzgraber speaks to <a href=\"https://katzgraber.org/contact/\">his time as a university professor up until 2020</a>. </p>\n\n\n\n<p>He shares why he enjoys working at Amazon.</p>\n\n\n\n<p>He walks us through a quantum computing challenge that he hosted with BMW <a href=\"https://aws.amazon.com/blogs/quantum-computing/a-guide-to-bmws-quantum-computing-for-automotive-challenges/\">through his role at Amazon</a> (and what real world applications he sees emerging from similar collaboration experiments).</p>\n\n\n\n<p>We discuss what inspires him to stay curious — raising the bar for scientific research, crowdsourcing breakthroughs, and opening up the playing field for more people to jump in.</p>\n\n\n\n<p>Follow <a href=\"https://twitter.com/benpopper\">Ben</a>, <a href=\"https://twitter.com/RThorDonovan\">Ryan</a>, <a href=\"https://twitter.com/mattkander\">Matt</a>, and <a href=\"https://twitter.com/katzgraber\">Helmut</a>.</p>\n\n\n\n<p>‘Til next time, all.</p>\n\n\n\n<p><a href=\"https://the-stack-overflow-podcast.simplecast.com/episodes/quantum-computing-aws-helmut-katzgraber/transcript/\">TRANSCRIPT</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2022/10/28/quantum-computing-aws-helmut-katzgraber/\">How to get more engineers entangled with quantum computing (Ep. 501)</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}