{
  "title":"He helped build .NET and VS Code — Now’s he working on Web3 (Ep. 499)",
  "date":"2022-10-21T04:40:00.000000Z",
  "author":null,
  "id":"https://stackoverflow.blog/?p=20975",
  "link":"https://stackoverflow.blog/2022/10/21/he-helped-build-net-and-vs-code-nows-he-working-on-web3-ep-499/",
  "content":"\n\n\n\n\n<p>Human beings are easily excitable creatures. We pump ourselves full of sugar, and then we crash. The cycle repeats. Now, here we are at a unique moment in Internet consciousness where we’ve experienced multiple crypto winters in addition to the phenomenon known as Dogecoin. Satoshi, wherever he may be, must be #facepalm to the moon. So should we take this stuff seriously—especially those of us who quit our jobs for crypto vaporware?</p>\n\n\n\n<p>On today’s podcast, we have an open source OG sharing his voice of reason—to show us what’s real in an avalanche of digital nonsense. <a href=\"https://www.linkedin.com/in/johnkdevadoss/\">John deVadoss</a> spent 18 years as a general manager at Microsoft where he helped build .NET and VSCode, among other things, during the early evolution of what are now widely adopted, even pivotal pieces of technology .</p>\n\n\n\n<p>So what brought him to blockchain land?</p>\n\n\n\n<p><strong>Episode notes:</strong></p>\n\n\n\n<p>John explains that Web3 is about the convergence of technology, economics, and social trends.</p>\n\n\n\n<p>He elaborates that foundations begin with service-based architecture (SOA), the notion of how to design loosely coupled systems that consist of economic services and components.</p>\n\n\n\n<p>He goes on to explain how DeFi represents this thinking of a loose composition of services.</p>\n\n\n\n<p>With all of this, blockchain brings together technology and economic incentives into a holistic equation—people contribute because they want to contribute.</p>\n\n\n\n<p>Nonsense it is not, says baby Yoda.</p>\n\n\n\n<p>Crypto isn’t the end game. It’s a segue along the way.</p>\n\n\n\n<p>Follow <a href=\"https://twitter.com/benpopper\">Ben</a>, <a href=\"https://twitter.com/mattkander\">Matt</a>, and <a href=\"https://twitter.com/john_devadoss\">John</a>.</p>\n\n\n\n<p>Learn more about the <a href=\"https://gbbcouncil.org/\">Global Blockchain Business Council</a> and John’s company, <a href=\"https://ngdenterprise.com/\">ngEnterprise</a>.</p>\n\n\n\n<p>Speaking of awesomeness, we’d like to give a shout out to Stellar Question Badge winner <a href=\"https://stackoverflow.com/users/383/gatekiller\">GateKiller </a>for asking a question “<a href=\"https://stackoverflow.com/questions/38039/how-can-i-get-the-datetime-for-the-start-of-the-week\">How can I get the DateTime for the start of the week?” </a>that has been bookmarked by a hundred people.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2022/10/21/he-helped-build-net-and-vs-code-nows-he-working-on-web3-ep-499/\">He helped build .NET and VS Code — Now’s he working on Web3 (Ep. 499)</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}