{
  "title":"Going from engineer to entrepreneur takes more than just good code (Ep. 503)",
  "date":"2022-11-04T16:40:24.000000Z",
  "author":null,
  "id":"https://stackoverflow.blog/?p=21096",
  "link":"https://stackoverflow.blog/2022/11/04/going-from-engineer-to-entrepreneur-takes-more-than-just-good-code-ep-503/",
  "content":"\n\n\n\n\n<p>At some point, a lot of developers think about becoming entrepreneurs. Some end up taking the jump. So what happens when it turns out that nobody wants your product?</p>\n\n\n\n<p>Cara Borenstein, co-founder at Stashpad, ended up in this exact situation. After a two year stint as a software engineer at Twilio, she saw an opportunity to create a notepad for developers to stay on top of context switching and manage knowledge-related tasks. V. 1 was a wiki that didn’t quite catch on.</p>\n\n\n\n<p>Embracing this reality, Borenstein and her team decided to dig deeper by talking with target customers. That process catalyzed a transformation of the core product into something people need and love, a second brain for busy developers that helps them stay focused and retain those stray thoughts that can add up to something big later on.</p>\n\n\n\n<p>In today’s podcast, Matt, Ceora, and Cassidy reflect on Cara’s founder journey.</p>\n\n\n\n<p><strong>Episode Notes:</strong></p>\n\n\n\n<p>Cara shares her experiences living in New York and San Francisco— and why she and her co-founder ultimately located <a href=\"https://www.stashpad.com/\">Stashpad</a> in North Carolina.</p>\n\n\n\n<p>She elaborates on the exact steps that she took to pivot her startup following limited initial interest in V1 of the product.</p>\n\n\n\n<p>Despite being in the Bay Area and working at Twilio, she was struggling to meet people because her full brain power was going to her products.</p>\n\n\n\n<p>She shares what it was like for her and her co-founder to hire Stashpad’s first employees.</p>\n\n\n\n<p>The group discusses Stashpad’s pathway to monetization in the context of developers wanting free tools.</p>\n\n\n\n<p>Follow, <a href=\"https://twitter.com/ceeoreo_\">Ceora</a>, <a href=\"https://twitter.com/mattkander\">Matt</a>, <a href=\"https://twitter.com/cassidoo\">Cassidy</a>, and <a href=\"https://twitter.com/cara_jacqueline?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\">Cara</a>.</p>\n\n\n\n<p><a href=\"https://stackoverflow.com/users/9435624/marchingband\">Marchingband</a> gets today’s lifeboat badge for their answer to the question about <a href=\"https://stackoverflow.com/questions/49100336/run-c-or-c-code-from-node-js-in-an-efficient-way/54216477#54216477\">running C or C++ code from Node.js in an efficient way</a>. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2022/11/04/going-from-engineer-to-entrepreneur-takes-more-than-just-good-code-ep-503/\">Going from engineer to entrepreneur takes more than just good code (Ep. 503)</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}