{
  "title":"Making location easier for developers with new data primitives",
  "date":"2022-11-02T04:37:00.000000Z",
  "author":null,
  "id":"https://stackoverflow.blog/?p=21088",
  "link":"https://stackoverflow.blog/2022/11/02/making-location-easier-for-developers-with-new-data-primitives/",
  "content":"\n<h2>SPONSORED BY FOURSQUARE</h2>\n\n\n\n\n\n\n\n<p>When <a href=\"http://foursquare.com\">Foursquare</a> launched in 2009, the app was consumer facing, letting you know where friends had checked in and what spots might appeal to you. People competed to be the “mayor” of certain locations and built guides to their favorite neighborhoods., The service expanded to allow merchants to offer discounts to frequent guests and track foot traffic in and out of the stores. While you can still use the Swarm app to find the best Manhattan in Manhattan, the company realized that real estate and data share the same three key rules: location, location, location. </p>\n\n\n\n<p>On this sponsored episode of the podcast, Ben and Ryan talk with Vin Sharma, VP of Engineering at Foursquare, about how they’re finding the atomic data that makes up their location data—their location data—and going from giving insight to individual app users about the locations around them to APIs that serve these location-based insights to developers at organizations like Uber, Nextdoor, and Redfin, who want to build location based insights and features into their own apps. </p>\n\n\n\n<h2 id=\"h-show-notes\"><strong>Show notes</strong></h2>\n\n\n\n<p>If you still want to check in at your local bakery and remember all the place you’ll go, the original Foursquare app is now <a href=\"https://swarmapp.com/\">Swarm</a>. </p>\n\n\n\n<p>If you’re looking to build on their data instead, you can start with <a href=\"https://developer.foursquare.com/docs\">their developer documentation</a>. </p>\n\n\n\n<p>They have almost 70 location attributes that they are starting to deconstruct and decompose into fundamental building blocks of their location data. Like data primitives—integers, booleans, etc.—these small bites of data can be remade with agility and at scale. </p>\n\n\n\n<p>Through the recent acquisition of <a href=\"https://foursquare.com/products/unfolded/\">Unfolded</a>, Foursquare allows you to visualize and map location data at any scale. Want to see patterns across the country? Zoom out. Want to focus on a square kilometer? Zoom in and watch the data move. </p>\n\n\n\n<p>Today’s lifeboat shoutout goes to <a href=\"https://stackoverflow.com/users/15747757/rohith-nambiar\">Rohith Nambiar</a> for their answer to <a href=\"https://stackoverflow.com/questions/71080518/visual-studio-not-installed-this-is-necessary-for-windows-development/71081696#71081696\">Visual Studio not installed; this is necessary for Windows development</a>. </p>\n\n\n\n<p>You can find <a href=\"http://foursquare.com\">Vin Sharma on </a><a href=\"https://twitter.com/ciphr?lang=en\">Twitter</a>. </p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\">\n\n\n\n<p><em>The Stack Overflow blog is committed to publishing interesting articles by developers, for developers. From time to time that means working with companies that are also clients of Stack Overflow’s through our advertising, talent, or teams business. When we publish work from clients, we’ll identify it as Partner Content with tags and by including this disclaimer at the bottom.</em></p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2022/11/02/making-location-easier-for-developers-with-new-data-primitives/\">Making location easier for developers with new data primitives</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}