{
  "title":"Hashgraph: The sustainable alternative to blockchain",
  "date":"2022-11-09T05:40:00.000000Z",
  "author":null,
  "id":"https://stackoverflow.blog/?p=21119",
  "link":"https://stackoverflow.blog/2022/11/09/hashgraph-the-sustainable-alternative-to-blockchain/",
  "content":"\n<h2>SPONSORED BY HEDERA HASHGRAPH</h2>\n\n\n\n\n\n\n\n<p>When most people talk about Web3 or cryptocurrencies and related technologies, they usually mean blockchains. But blockchain is only the first generation of distributed ledger technology (DLT). As with any new technology, once people see how it works, new generations come along rapidly to address the faults in the previous ones. </p>\n\n\n\n<p>On this sponsored episode of the podcast, Ben and Ryan chat with Matt Woodward, head of developer relations at <a href=\"https://swirldslabs.com/\">Swirlds Labs</a>. Swirlds Labs created the Hedera ecosystem, a DLT built on a hashgraph, not a blockchain. We chat about what the difference is between a blockchain and a hashgraph, Hedera’s focus on environmental sustainability, and why the Web3 version of “Hello, World!” takes a little more effort. </p>\n\n\n\n<h2 id=\"h-show-notes\">Show notes</h2>\n\n\n\n<p>Hedera’s hashgraph is a third-generation DLT: it’s an open-source consensus algorithm and a data structure that uses a <a href=\"https://en.wikipedia.org/wiki/Directed_acyclic_graph\">direct acyclic graph</a> and two novel inventions, the gossip about gossip protocol and virtual voting. </p>\n\n\n\n<p>Where Bitcoin can only handle between <a href=\"https://en.wikipedia.org/wiki/Bitcoin_scalability_problem\">three and seven transactions per second</a>, a hashgraph can support upwards of 10,000. </p>\n\n\n\n<p>There’s been <a href=\"https://www.whitehouse.gov/ostp/news-updates/2022/09/08/fact-sheet-climate-and-energy-implications-of-crypto-assets-in-the-united-states/\">a lot of talk about the environmental impact of cryptocurrencies</a>. Woodward says that a single Bitcoin transaction uses 1000kW-hours—the equivalent of driving a Tesla Model S 5,500 km—while Hedera uses just 0.00017kWh per transaction, about 5.8 million times less.</p>\n\n\n\n<p>Congrats to the winner of a Stellar Question badge, <a href=\"https://stackoverflow.com/users/49202/g-revolution\">g.revolution</a>, for their question <a href=\"https://stackoverflow.com/questions/980601/what-is-an-anti-pattern\">What is an anti-pattern?</a> 100 users saved it for later. </p>\n\n\n\n<p>Find out more about <a href=\"https://hedera.com/\">Hedera</a> and hit the <a href=\"https://hedera.com/get-started\">start button</a>. Connect with <a href=\"https://twitter.com/woodwardmatt\">Matt</a>, <a href=\"https://twitter.com/benpopper\">Ben</a>, or <a href=\"https://twitter.com/RThorDonovan\">Ryan</a> on Twitter.</p>\n\n\n\n<p><a href=\"https://the-stack-overflow-podcast.simplecast.com/episodes/hashgraph-the-sustainable-alternative-to-blockchain/TRANSCRIPT\">TRANSCRIPT</a></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\">\n\n\n\n<p><em>The Stack Overflow blog is committed to publishing interesting articles by developers, for developers. From time to time that means working with companies that are also clients of Stack Overflow’s through our advertising, talent, or teams business. When we publish work from clients, we’ll identify it as Partner Content with tags and by including this disclaimer at the bottom.</em></p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2022/11/09/hashgraph-the-sustainable-alternative-to-blockchain/\">Hashgraph: The sustainable alternative to blockchain</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}