{
  "title":"A flight simulator for developers to practice real world challenges and surprises (Ep. 500)",
  "date":"2022-10-25T04:40:00.000000Z",
  "author":null,
  "id":"https://stackoverflow.blog/?p=21004",
  "link":"https://stackoverflow.blog/2022/10/25/a-flight-simulator-for-developers-to-practice-real-world-challenges-and-surprises-ep-500/",
  "content":"\n\n\n\n\n<p>On Freund was one of the minds behind the scenes of the now-iconic WeWork startup story. He held three roles at the company: VP of Engineering, VP of Product, and Global Head of Markets at WeWork Labs. The software his team built demonstrated rigor, engineering grit, and strong logic. It’s the reason why WeWork is, at its core, a tech company. </p>\n\n\n\n<p>Now, Freund has entered into a new season of his career as co-founder and CEO of Wilco, which is a platform for developers of every skill level to advance in their talents and career journeys. Like a flight simulator, it offers challenges that are meant to prepare developers for the realities of what they will face on the job, moving beyond what they might learn in a classroom or boot camp to scenarios taken from real workplace experiences.</p>\n\n\n\n<p><strong>Episode notes:</strong><br><br>Freund reflects on his early days at <a href=\"https://www.appliedmaterials.com/\">Applied Materials</a>, where he worked on a machine that inspected silicon wafers.</p>\n\n\n\n<p>It was in this early role that Freund gained an appreciation for rigorous software testing protocols in the manufacturing process.</p>\n\n\n\n<p>At WeWork, Freund was fascinated by the idea of a full stack business, which is a business building itself.</p>\n\n\n\n<p>While Freund officially launched <a href=\"https://www.trywilco.com/\">Wilco</a> in 2021, the origin story for the company dates back to 2013 when he was hiring and managing a team of engineers—he saw a need in the market to help developers build critical skills to problems-solve in real-time.</p>\n\n\n\n<p>You can think of Wilco as the equivalent of a <a href=\"https://www.flightsimulator.com/\">flight simulator</a> for engineers.</p>\n\n\n\n<p>Shoutout to Lifeboat Badge winner <a href=\"https://stackoverflow.com/users/1125284/zico\">Zico</a> for their awesome answer to the question, “<a href=\"https://stackoverflow.com/questions/45834393/hiding-sensitive-information-in-response/45834649#45834649\">Hiding sensitive information in response</a>”</p>\n\n\n\n<p>Follow <a href=\"https://twitter.com/onfreund?lang=en\">On</a> and <a href=\"https://twitter.com/benpopper\">Ben</a>.</p>\n\n\n\n<p><a href=\"https://the-stack-overflow-podcast.simplecast.com/episodes/a-flight-simulator-for-developers-to-practice-real-world-challenges-and-surprises/transcript/\">TRANSCRIPT</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2022/10/25/a-flight-simulator-for-developers-to-practice-real-world-challenges-and-surprises-ep-500/\">A flight simulator for developers to practice real world challenges and surprises (Ep. 500)</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}