{
  "title":"Tips and tricks for succeeding as a developer emigrating to Japan (Ep. 505)",
  "date":"2022-11-15T05:40:00.000000Z",
  "author":null,
  "id":"https://stackoverflow.blog/?p=21146",
  "link":"https://stackoverflow.blog/2022/11/15/tips-and-tricks-for-succeeding-as-a-developer-emigrating-to-japan-ep-505/",
  "content":"\n\n\n\n\n<p>If you’re a developer, your skills are transferable across borders. If you’ve ever thought about relocating to Japan from outside of the country, you’ll find that there are some awesome job opportunities there. Finding a great opportunity, however, can be a needle in a haystack. It’s this pain point that led Eric Turner to create <a href=\"https://japan-dev.com/\">Japan Dev</a>, a job board that curates handpicked tech jobs in Japan.</p>\n\n\n\n<p>Eric, himself, is American—a graduate of the University of Pittsburgh. When he relocated to Japan, he needed to find a job, apartment, and all of the other things that come with moving to a new country. In today’s podcast, he talks to Matt about the experiences that led him to co-founding Japan Dev.</p>\n\n\n\n<p><strong>Episode notes:</strong></p>\n\n\n\n<p>Eric explains that great jobs are available for developers in Japan, but it can be tough to find these opportunities.</p>\n\n\n\n<p>We talk about interesting startups that are gaining traction in the Japanese tech sector (like <a href=\"https://visual-alpha.com/en\">Visual Alpha</a>, <a href=\"https://www.treasuredata.com/\">Treasure Data</a>, and <a href=\"https://exawizards.com/en/\">Exawizards</a>, to name a few examples of companies on the Japan Dev platform).</p>\n\n\n\n<p>Matt is impressed to learn Japan Dev generates an estimated $60,000/month in revenue, on average.</p>\n\n\n\n<p>Eric reflects on starting Japan Dev as a side project while he was employed full-time as an engineer.</p>\n\n\n\n<p>Eric elaborates on why he doesn’t think venture capital is a good fit for Japan Dev.</p>\n\n\n\n<p>Night owls unite! Eric says that his most productive hours are between midnight to 4AM.</p>\n\n\n\n<p>Follow <a href=\"https://twitter.com/mattkander\">Matt</a> and <a href=\"https://twitter.com/_etdev\">Eric</a>.</p>\n\n\n\n<p><br><a href=\"https://the-stack-overflow-podcast.simplecast.com/episodes/want-to-work-as-a-developer-in-japan/transcript/\">TRANSCRIPT</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2022/11/15/tips-and-tricks-for-succeeding-as-a-developer-emigrating-to-japan-ep-505/\">Tips and tricks for succeeding as a developer emigrating to Japan (Ep. 505)</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}