{
  "title":"CEO update: Breaking down barriers to unlock innovation",
  "date":"2022-10-26T14:04:46.000000Z",
  "author":null,
  "id":"https://stackoverflow.blog/?p=21009",
  "link":"https://stackoverflow.blog/2022/10/26/ceo-update-breaking-down-barriers-to-unlock-innovation/",
  "content":"\n<p>It’s time again for a quarterly update. I always like to use this quarterly post to pause and reflect on our impact at a micro and a macro level, but I am especially reflective given I just completed my third year as CEO of Stack Overflow and on the other side of our inaugural conference for technology leaders, Stack Overflow’s <a href=\"https://stackoverflow.blog/2022/10/07/missed-our-flow-state-conference-catch-up-on-all-the-sessions/\">Flow State</a>. We’re fortunate to continue to grow at a rapid pace. In dynamic times, whether it be in times of hyper growth or in times of market volatility, we are seeing from our community and customers alike that breaking down the barriers to knowledge is essential for success.</p>\n\n\n\n<p>As I mentioned, last month we hosted our first conference for technology leaders, Stack Overflow’s <a href=\"https://stackoverflow.blog/2022/10/07/missed-our-flow-state-conference-catch-up-on-all-the-sessions/\">Flow State</a>, in New York City and online. It was incredible to see so many people engaged in-person and virtually who are impacted by the work we are doing. Throughout the day, we heard from technology leaders at companies like Capgemini, Etsy, Indeed, and Salesforce about how they’re tackling major transformations, managing distributed environments, and empowering their developers and technologists to be more productive. Through multiple stories on stage, it was clear that creating easier ways for teams to onboard and learn as they work is just as critical on small teams as large teams. Stack Overflow’s suite of products, <a href=\"https://stackoverflow.co/teams/\">Stack Overflow for Teams</a>, <a href=\"https://stackoverflow.co/advertising/\">Stack Overflow Advertising</a>, <a href=\"https://stackoverflow.co/talent/\">Stack Overflow Talent</a>, and <a href=\"https://stackoverflow.co/collectives/\">Collectives on Stack Overflow</a>, are doing just that.</p>\n\n\n\n<p>I started my opening keynote by discussing major industry challenges like the fact that global talent shortage is expected to reach <a href=\"https://www.forbes.com/sites/forbestechcouncil/2021/06/08/is-there-a-developer-shortage-yes-but-the-problem-is-more-complicated-than-it-looks/?sh=5c7d316d3b8e\">85.2 million by 2030</a>. </p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh5.googleusercontent.com/ugEoqiXjMk-Q4a4NQrSOEHSAWfUa_R9Trywp_bBUePPEF_OEPf2KX080uy3h084lPG-aICY7O7aGFrYW7L3ZxdXOYVeAbZautlX_rdTyIf4dySigB4-C7M382NowbzSd67MFWGSXGQzJ5TK3zNCe5GP7hrR_ZMX7En8_0mjm8QQgrQ2xa0W5N2xBQA\" alt=\"Prashanth presents at the Flow State conference\"></figure>\n\n\n\n<p>At a macro level, we need to empower non-traditional learning so that the talent pool can expand faster to meet growing market demand. We have an opportunity to help individuals just as much as we help businesses. The average cost for a top 10 computer science undergraduate degree is over $38,000 per year depending on where you live and what school you go to. Yet, the median household income in the U.S. is just under $68,000 per year. At Stack Overflow, we’ve always seen it as our responsibility to ensure technical learning resources are accessible to all. Breaking down the barriers of entry to learn is one of the core reasons I joined Stack Overflow three years ago last month. I truly believe that in times of change, accessible learning will create great opportunities for all.</p>\n\n\n\n\n\n\n\n<h2 id=\"h-accessible-learning-is-the-birthplace-of-innovation\">Accessible learning is the birthplace of innovation</h2>\n\n\n\n<p>On the heels of my three year anniversary here at Stack Overflow, I can’t help but think about my career and how I got here. I often reflect back to when my father came home from a business trip decades ago with my first computer: a 286. Basic as it is compared to today’s standards, it represented limitless opportunities to me. It catalyzed my pursuit of a career in technology through exploration and learning. That desire to learn and contribute to something bigger exists in so many throughout the world, especially within aspiring technologists. In order to better our world, we must foster and not hamper that excitement.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh5.googleusercontent.com/ZQ9lp4JXWA-ZEt7NyzxxQNhtWGxwgtfwNA-aq0jUxPUbgN_MmWRkYhHcQitKQDS2tnEiLxt14PF3H0JHIt3je2e1b_eP1bDODFmRzdu6cbzxl4HO1uxpHOGawDuW07eNeRU1W0qA6RZNRHJlzB0yC6xmOUKsciuZPMJoaeLEN-mFGYi6HdRJvJ4_9A\" alt=\"Text reads, &quot;We're making online coding resources accessible to all.&quot; Shows a globe with the logos for Kiwix, BPI, IceCube, and Code 4000.\"></figure>\n\n\n\n<p>Stack Overflow’s dedication to making technical resources accessible is one of the core reasons I joined the company. I only wish Stack Overflow existed when I was learning to code many years ago! Over the past year, we took that commitment a step further with <a href=\"https://stackoverflow.blog/2022/10/20/introducing-the-overflow-offline-project/\">Overflow Offline</a>. Announced this month, Overflow Offline is a downloadable version of the public platform created in partnership with <a href=\"https://www.kiwix.org/en/\">Kiwix</a> as a resource for organizations that serve communities with limited access to the internet. We removed perhaps the biggest barrier of entry for technical learning—access to the internet. Whether it’s researchers in Antarctica, students that live in internet deserts, or courses for incarcerated individuals in the United States and the United Kingdom, Overflow Offline extends the impact of Stack Overflow to people previously without access to technical learning resources.</p>\n\n\n\n<p>We also launched our first <a href=\"https://stackoverflow.blog/2022/08/29/stack-overflow-student-ambassador-program-how-to-apply/\">Student Ambassador program</a> in partnership with <a href=\"https://mlh.io/\">Major League Hacking</a> (MLH) to accelerate learning across the public platform, participate in challenges, earn rewards, and more. We’re on track to reach over 200 universities and connect with over 10,000 students this year.</p>\n\n\n\n<p>For the 100 million people that already visit Stack Overflow every month, we introduced <a href=\"https://stackoverflow.blog/2022/10/04/meet-saves-the-tool-to-help-you-organize-your-favorite-content-on-stack-overflow/\">Saves</a> this month. According to research we conducted in April 2022, we found that 62% of survey respondents use bookmarks to save content for future use. This includes saving a question so that they can reference it later, building a repository, and creating a collection of high-quality content about a specific topic. Beyond bookmarking answers, Saves allows users to create custom lists and private notes on saved posts.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh6.googleusercontent.com/9luyhqzDSYvHfg0Nexc_MhaDZzotY3VmxaHSLnqAANmPgsPxrhM8xYBVp4v1bLCe9_gTy_FdDiU1bCO8_1VBPx8k2PprL7iPqxtnIb5tlK-Ja2WaCZKsMaQE2itj1a5wMUkD2Y90D0WJACD-RbKpSzX76pCbSa05Eh8Ev0Zl8MszkDzUV3mvpoHlGg\" alt=\"Introducing Saves blog post header image\"></figure>\n\n\n\n<p>Our vision is to become the most valuable destination for the world’s current and next generation of technologists. Breaking down barriers so that the community can grow, learn, and build innovative technologies faster is core to everything we do.</p>\n\n\n\n<h2 id=\"h-creating-opportunities-to-learn-starts-within-your-team\">Creating opportunities to learn starts within your team</h2>\n\n\n\n<p>Just as developers and technologists are learning in their free time, they spend an incredible amount of time at work evolving their skills. That’s not always easy given a whopping 62% of developers spend over eight hours a month searching for answers, and 46% of developers spend over eight hours a month answering others’ questions. On top of all that, over 50% of devs encounter knowledge silos every week. Breaking down barriers for teams to learn from each other helps our customers scale and optimize so that developers are happy and stay in their flow state.</p>\n\n\n\n<p>One of my favorite visuals of this is the chart I shared at Flow State (below). With Stack Overflow for Teams, Progressive saw saw two thirds of questions answered by folks in departments different from the person who asked the question. When you eliminate barriers between teams, you can unlock limitless cross-functional learning. You don’t need to have all the answers, and chances are you don’t, not even on a single team. You just need to know where to find the answers you need, when you need them. Sustaining that flow of knowledge between teams is where we focused much of our efforts over the last year. For example, monthly editing activity increased by over 600% in just 90 days among Stack Overflow for Teams customers using <a href=\"https://stackoverflow.co/company/press/archive/content-health\">Content Health</a>. Ensuring that knowledge remains resilient is the foundation of resilient teams.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh6.googleusercontent.com/jwAjtksyI4wIyo0goQNzXlIbGbeIpGgLtxnL1YvwwM5BrrvR32Sx0E2dcorjpWJH3qkFFOq_JDkCMRXtXBAeVYKEUB8k8X5cL7ybXsFsQDSnUlYz2bOY_EAbdDhf8KCDtSWLCLCpOxYSAcd8AD0C-34dsAcVgGc5KSkseIn8THpfjoJRuQVRm8ea5A\" alt=\"Quote from James Morgan\nOpen Source Developer Advocate at Progressive: “I think the only thing sometimes more intimidating than not knowing how to do something is not knowing who to ask for help. And Stack Overflow [for Teams] really helps with the second half of that problem.”\nStats: 1,000+ Questions asked and answered67% Questions asked which were answered outside of their immediate team\"></figure>\n\n\n\n<p>Last month, we released a study we commissioned from Forrester, <a href=\"https://stackoverflow.blog/2022/09/13/forrester-consulting-tei-study-five-ways-stack-overflow-for-teams-delivered-191-roi/#:~:text=Ultimately%2C%20Forrester%20found%20that%20Stack,(ROI)%20of%20191%25.\">The Total Economic Impact<img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/2122.png\" alt=\"™\" class=\"wp-smiley\"> of Stack Overflow for Teams</a>. It found that with Stack Overflow for Teams, employees saw an overall reduction in interruptions, with 65-85% of employee questions already answered in Stack Overflow for Teams. Forrester’s research concluded that Stack Overflow delivered $14.42 million in benefits to the composite customer over three years and cost $4.95 million over the same time period. This puts the net present value (NPV) of Stack Overflow for Teams just shy of $9.5 million, with a return on investment (ROI) of 191%.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh4.googleusercontent.com/3-EEiN8wmmwEgT5bjE-a4Iv4HwVt4D9dYx6f3x51dYgrjWRfFxXikwA2I0rIn75Bh_zAS7CmYW7aG-g8oIQonEaO8s6TjBms_qwz7F1yuM9vQlGqkeXLspKEYCHQKXaGUfp6Nehmaa8otESQDJ6bS-32a-EN9EQC0hBDdVCPZOnHm6j48gWtXGMuxg\" alt=\"Quote: “Stack Overflow for Teams is all about discoverability. I can go to one place and ask questions and get answers without having to search 12 different repositories. Before Stack Overflow for Teams, we had to do that, and\nit was very frustrating.”\n\nVP of Technology\nLarge, global Financial Services company\nStats: ROI 191%, NPV 9.46M, Fewer interruptions - 65-85% of employee questions had already been answered in Stack Overflow for Teams\"></figure>\n\n\n\n<p>We recently shared that <a href=\"https://stackoverflow.blog/2022/08/04/great-engineering-cultures-are-built-on-social-learning-communities/\">Stack Overflow is named as a Sample Vendor in the 2022 Gartner® Hype Cycle<img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/2122.png\" alt=\"™\" class=\"wp-smiley\"></a> for Agile and DevOps for Communities of Practice. This is a powerful step forward in enabling organizations of all sizes to build strong internal communities that foster collective learning.</p>\n\n\n\n<p>Our customers continue to share their experiences on G2, leading to Stack Overflow for Teams being named as a leader by G2 in the Knowledge Management and Q&amp;A Platform categories for the 15th consecutive quarter.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh3.googleusercontent.com/5KwwGcAfGo2APc1M3UmwVBUF11YRjVqwFhLKzh66YzacsHyVRgXy3hffc2Ho9UonQ5fEkizurF1xZAY7TJv5CWHbGzvyLmDxONoU8soM9PA7Vruk4et2laZDCK_HAXWUQt94B0-eY-Ppi2u7MPakcvOZFxcEjOMfsv37VcSFFCePSukKt4XRoAS5Qg\" alt=\"Images of the G2 customer awards that Stack Overflow won this quarter\"></figure>\n\n\n\n<p>To continue powering the flow state, we’ve always allowed people to leverage Stack Overflow’s API to embed tailored access directly into workflows. That also extends to Stack Overflow for Teams, which helps organizations like Spotify and their open source initiative, <a href=\"https://backstage.io/\">Backstage</a>. They use the API to <a href=\"https://stackoverflow.blog/2022/09/19/i-spent-two-years-trying-to-do-what-backstage-does-for-free/\">deeply integrate Stack Overflow into Backstage</a> to allow both active searching of public and team-only Stack Overflow answers, alongside information held only in Backstage. <a href=\"https://apiworld.co/awards/#winners\">Stack Overflow for Teams won an API Award</a> for the Communications API category for innovation, adoption, and reception by the developer community. Just another way breaking down barriers leads to innovative solutions for all.</p>\n\n\n\n<h2 id=\"h-looking-ahead\">Looking ahead</h2>\n\n\n\n<p>We accomplished a lot in the past few months, and we will continue building on recent momentum as we head towards the end of the calendar year. I find it so energizing to see some of these initiatives come to life. Meeting so many users, customers, and technology leaders at Flow State, seeing Student Ambassadors engage through our programs, and hearing about the impact of Overflow Offline are all powerful ways we’re continuing to make an impact.</p>\n\n\n\n<p>Of course, we cannot stress enough the importance of breaking down barriers to learn without examining how we are doing the same here at Stack Overflow. This month we’re rolling out what we call, “Learn, Share, Grow Days” (LSG Days) so that Stackers have the space and time to learn apart from their daily job tasks. This becomes even more important as we continue to hire across the globe. We accelerated growth during the summer months (summer here in the U.S., I should say), surpassing 200 Stackers hired in the last six months and surpassing over 500 employees for the first time in company history.</p>\n\n\n\n<figure class=\"wp-block-image\"><img src=\"https://lh3.googleusercontent.com/8EfXOOYgSoSNwzxaiJyLkWIjyMc_XZ6uzl6gLJXHxp3gwTVgha44xHPqPXQm4F2Zkg2cmufVd58RKKmuorDeE_PIytV9j5BfqL2hi6itSjTDnK0uSLiUkBfXVe7YyjGkNH7EqGXIM0EyDAIp8n83jPuvIzESowhulbmkWm4M7_Notyfb1ATriEcEsQ\" alt=\"images of the four Comparably awards that Stack Overflow won.\"></figure>\n\n\n\n<p>Thanks to feedback from Stackers, Comparably listed Stack Overflow among the top companies in four categories: Happiest Employees, Compensation, Work-Life Balance, and Perks &amp; Benefits. We’re continuing to hire in core areas. If you’re interested in joining us, check out our <a href=\"https://stackoverflow.co/company/careers/\">careers page</a>!</p>\n<p>The post <a rel=\"nofollow\" href=\"https://stackoverflow.blog/2022/10/26/ceo-update-breaking-down-barriers-to-unlock-innovation/\">CEO update: Breaking down barriers to unlock innovation</a> appeared first on <a rel=\"nofollow\" href=\"https://stackoverflow.blog\">Stack Overflow Blog</a>.</p>\n"
}