{
  "title":"Quansight Labs Blog: CZI EOSS4 Grants at Quansight Labs",
  "date":"2021-08-31T10:01:00.000000-07:00",
  "author":null,
  "id":"https://labs.quansight.org/blog/2021/08/czi-eoss4-grants-at-quansight-labs/",
  "link":"https://labs.quansight.org/blog/2021/08/czi-eoss4-grants-at-quansight-labs/",
  "content":"<div><p>Here, at Quansight Labs, our goal is to work on sustaining the future of Open Source. We make sure we can live up to that goal by spending a significant amount of time working on impactful and critical infrastructure and projects within the Scientific Ecosystem.</p>\n<p>As such, our goals align with those of the <a href=\"https://chanzuckerberg.com\">Chan Zuckerberg Initiative</a> and, in particular, the <a href=\"https://chanzuckerberg.com/rfa/essential-open-source-software-for-science/\">Essential Open Source Software for Science</a> (EOSS) program that supports tools essential to biomedical research via funds for software maintenance, growth, development, and community engagement.</p>\n<p>CZI’s Essential Open Source Software for Science program supports software maintenance, growth, development, and community engagement for open source tools critical to science. And the Chan Zuckerberg Initiative was founded in 2015 to help solve some of society’s toughest challenges — from eradicating disease and improving education, to addressing the needs of our local communities. Their mission is to build a more inclusive, just, and healthy future for everyone.</p>\n<p>Today, we are thrilled to announce that the team at Quansight Labs <a href=\"https://chanzuckerberg.com/newsroom/czi-awards-16-million-for-foundational-open-source-software-tools-essential-to-biomedicine/\">has been awarded</a> five EOSS Cycle 4 grants to work on several projects within the PyData ecosystem. This post will introduce the successful grantees and their objectives for these two-year long grants.</p>\n<p><a href=\"https://labs.quansight.org/blog/2021/08/czi-eoss4-grants-at-quansight-labs/\">Read more…</a> (5 min remaining to read)</p></div>"
}