{
  "title":"PyBites: How to package and deploy CLI applications with Python PyPA setuptools build",
  "date":"2021-08-30T13:01:45.000000-07:00",
  "author":null,
  "id":"https://pybit.es/articles/how-to-package-and-deploy-cli-apps/",
  "link":"https://pybit.es/articles/how-to-package-and-deploy-cli-apps/",
  "content":"<p>This article covers how to package your Python code as a CLI application using just the official <a href=\"https://www.pypa.io\" rel=\"noopener\">PyPA</a> provided tools, without installing additional external dependencies.</p>\n\n\n\n<p>If you prefer reading code to reading words, you can find the full example demo code discussed in this article here: <a href=\"https://github.com/yaythomas/python-cli-pypa-build-example\" rel=\"noopener\">example repo of Python CLI packaged with PyPA setuptools build</a></p>\n\n\n\n<h2>Run your Python code from the command line</h2>\n\n\n\n<h3>Run a Python file as a script</h3>\n\n\n\n<p>Since Python is a scripting language, you can easily run your Python code from the CLI with the Python interpreter, like this:</p>\n\n\n\n<div class=\"hcb_wrap\"><pre class=\"prism undefined-numbers lang-bash\"><code># run a python source file as a script\n$ python mycode.py\n\n# run a python module\n$ python -m mycode</code></pre></div>\n\n\n\n<h3>Create a CLI shortcut to bootstrap your Python application</h3>\n\n\n\n<p>If you want to run your Python script as a CLI application with a user-friendly name and not have to type in the Python interpreter &amp; path in front of it, you could of course just create an executable shortcut file in your <code>/bin</code> directory like this:</p>\n\n\n\n<div class=\"hcb_wrap\"><pre class=\"prism undefined-numbers lang-bash\"><code>#!/bin/sh\n\npython3 /path/to/mycode.py &quot;$@&quot;</code></pre></div>\n\n\n\n<p><img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/1f4a1.png\" alt=\"💡\" class=\"wp-smiley\"> The <code>&quot;$@&quot;</code> passes all the CLI arguments from your shortcut launcher to your Python script.</p>\n\n\n\n<p>But this is not all that useful when you actually want to distribute your code, because you’d still have to create &amp; permission this executable file on all your end-users’ machines somehow, in addition to provisioning the actual Python dependencies and your app itself.</p>\n\n\n\n<p>Thankfully, Python has great well-tested &amp; widely used built-in mechanisms for doing exactly this for you – so no, you don’t even need to jerry-rig your own shortcut like this at all!</p>\n\n\n\n<h2>How to package your Python code as a CLI application the proper way</h2>\n\n\n\n<p>The standard way to package your Python code is to use <a href=\"https://setuptools.readthedocs.io/\" rel=\"noopener\">setuptools</a>. You use <strong>setuptools</strong> to create distributions that you can install with <a href=\"https://pip.pypa.io/\" rel=\"noopener\">pip</a>.</p>\n\n\n\n<p><strong>setuptools</strong> has been around for ages, and is currently (August 2021) in a bit of a transitional phase. This has been the case for a few years. This means that there are different ways of achieving the same thing using this tool-set, as the new and improved ways slowly have been supplanting the old:</p>\n\n\n\n<ul><li><strong>setup.py</strong> – the old way</li><li><strong>setup.cfg</strong> – the sort-of newer</li><li><strong>pyproject.toml</strong> (aka PEP 517 &amp; PEP 518) – shiny &amp; new</li></ul>\n\n\n\n<p>The key to creating your own CLI application is to specify an <a href=\"https://setuptools.readthedocs.io/en/latest/userguide/entry_point.html\" rel=\"noopener\">entry_point</a> in either your <strong>setup.cfg</strong> or <strong>setup.py</strong> file.</p>\n\n\n\n<p>The <strong>pyproject.toml</strong> specification does define this property (as <code>[project.scripts]</code>), but the standard PyPA build has not yet implemented actually doing anything with this property yet.</p>\n\n\n\n<h2>Should you use setup.cfg, setup.py or pyproject.toml to configure Python packaging?</h2>\n\n\n\n<p>The short answer is: for the moment, you probably should have all three.</p>\n\n\n\n<p>Now for the longer answer. You don’t <em>necessarily</em> have to have all three, but if you don’t you need to be sure you know exactly what you’re doing and why, otherwise you’re setting yourself up for mysterious errors down the line. If you’re not interested in the evolution &amp; background of these mechanisms, feel free to skip to the next section.</p>\n\n\n\n<h3>In the beginning was setup.py</h3>\n\n\n\n<p><strong>setup.py</strong> is the older, traditional way of packaging Python projects. Since <strong>setup.py</strong> is literally a Python script in itself, it is very powerful because you can script whatever advanced installation functionality you want as part of the install.</p>\n\n\n\n<p>But just because you <em>can</em>, doesn’t mean you <em>should</em>. The more unusual scripting you do as part of your install, the more your install becomes brittle &amp; unpredictable on diverse client machines where you don’t necessarily have strict control over the state &amp; configuration of those machines.</p>\n\n\n\n<h3>Evolution to setup.cfg</h3>\n\n\n\n<p>By comparison, <strong>setup.cfg</strong> is a config file, not an installation script like <strong>setup.py</strong>. <strong>setup.cfg</strong> is static, <strong>setup.py </strong>is dynamic.</p>\n\n\n\n<p><strong>setup.cfg</strong> lets you specify declarative config – meaning that you can define your project meta-data without having to worry about scripting. This is a good thing because you avoid having to run arbitrary code during installs, which will make your security &amp; ops teams happy, and you don’t have to maintain boilerplate code in your source. Bonus!</p>\n\n\n\n<p>Although it has been there alongside <strong>setup.py</strong> since the beginning, <strong>setup.cfg</strong> has taken more of a central role over the years. You can more or less accomplish the same thing with either, so from this perspective it doesn’t really matter which you use.</p>\n\n\n\n<p>However, even if you do ALL your configuration in <strong>setup.cfg</strong> you do still need a stub <strong>setup.py</strong> file <em>unless</em> you are running a PEP517 build. We’ll discuss this new build system in the next section.</p>\n\n\n\n<h3>Enter pyproject.toml</h3>\n\n\n\n<p><strong>pyproject.toml</strong> is the official, anointed successor to <strong>setup.py</strong> and <strong>setup.cfg</strong>, but it has not reached feature parity with its predecessors yet. This new file format has come as a result of the <a href=\"https://www.python.org/dev/peps/pep-0517/\" rel=\"noopener\">PEP517 build specification</a>.</p>\n\n\n\n<p>One of the notable features of the new Python build mechanisms specified in PEP517 is that you don’t<em> have</em> to use the <strong>setuptools</strong> build system – other build &amp; packaging tools like <a href=\"https://python-poetry.org\" rel=\"noopener\">Poetry</a> and <a href=\"https://flit.readthedocs.io/\" rel=\"noopener\">Flit</a> can use the same <strong>pyproject.toml</strong> specification file (PEP621) to package python projects.</p>\n\n\n\n<p>Eventually all these tools <em>should</em> be using the exact same <strong>pyproject.toml</strong> file format, but be aware that historically build tools other than <strong>setuptools</strong> have had their own ways of specifying CLI entry-points, so be sure to check the documentation for whichever tool you end up using to double-check that it’s conforming to the latest PEP621 standard. Here, we are just going to focus on how to do this with <strong>setuptools</strong>.</p>\n\n\n\n<p>While the latest version of the <strong>pyproject.toml</strong> specification did add definitions for project meta-data that you will usually find in <strong>setup.cfg</strong> and/or <strong>setup.py</strong>, the <strong>setuptools</strong> build tool does NOT yet support using the meta-data from <strong>pyproject.toml</strong>. Other PEP517 compliant tools like Flit &amp; Poetry do support projects with<em> only</em> a <strong>pyproject.toml</strong> file, so if you use those you don’t need <strong>setup.py</strong> and/or <strong>setup.cfg</strong>.</p>\n\n\n\n<p>You can find the <a href=\"https://www.python.org/dev/peps/pep-0621/\" rel=\"noopener\">full file format specification for pyproject.toml in PEP621</a>.</p>\n\n\n\n<p>For all the gory details &amp; progress of implementing full support for <strong>pyproject.toml </strong>metadata in <strong>setuptools</strong>, you can track the discussion here: <a href=\"https://github.com/pypa/setuptools/issues/1688\" rel=\"noopener\">https://github.com/pypa/setuptools/issues/1688</a></p>\n\n\n\n<h3>Recommended Python packaging setup in 2021</h3>\n\n\n\n<p>If you are using PyPA’s <strong>setuptools</strong> during this transitional phase of Python packaging, while you can get away with using one or the other combination of <strong>setup.py</strong>, <strong>setup.cfg</strong> &amp; <strong>pyproject.toml</strong> to specify your meta-data and build attributes, you probably want to cover your bases and avoid subtle problems by having all 3 as follows:</p>\n\n\n\n<ol><li>have a minimal <strong>pyproject.toml</strong> to specify the build system</li><li>put all project related config in <strong>setup.cfg</strong></li><li>have a simple shim <strong>setup.py</strong></li></ol>\n\n\n\n<p>By “subtle problems” I mean inconsistencies like editable installs not working or builds that look like they’re working but they’re not actually using the meta-data you thought you specified (which you might only discover at deployment, urk!). So let’s avoid the unpleasantness!</p>\n\n\n\n<p>In this setup, since <strong>pyproject.toml</strong> and <strong>setup.py</strong> are only minimalist shims, your individual project related configuration is only contained in the one place in <strong>setup.cfg</strong>. Therefore you’re not needlessly duplicating values between different files.</p>\n\n\n\n<h2>Create CLI entry point configuration for your Python project</h2>\n\n\n\n<h3>Sample project structure</h3>\n\n\n\n<p>Let’s work through an example of a simple CLI application.</p>\n\n\n\n<p>The project structure looks like this:</p>\n\n\n\n<pre class=\"wp-block-preformatted\">.\n│ my-repo/\n\t│- mypackage/\n\t\t│- mymodule.py\n\t│- pyproject.toml\n\t│- setup.cfg\n\t│- setup.py\n</pre>\n\n\n\n<h3>mypackage/mymodule.py</h3>\n\n\n\n<p>This is just some arbitrary code that we want to call directly from the CLI:</p>\n\n\n\n<div class=\"hcb_wrap\"><pre class=\"prism undefined-numbers lang-python\"><code>def my_function():\n    print('hello from my_function')\n\n\ndef another_function():\n    print('hello from another_function')\n\n\nif __name__ == &quot;__main__&quot;:\n    &quot;&quot;&quot;This runs when you execute '$ python3 mypackage/mymodule.py'&quot;&quot;&quot;\n    my_function()</code></pre></div>\n\n\n\n<h3>setup.py</h3>\n\n\n\n<p>To allow editable installs (useful for your local dev machine) you need a shim <strong>setup.py</strong> file.</p>\n\n\n\n<p>All you need in this file is this bit of boilerplate:</p>\n\n\n\n<div class=\"hcb_wrap\"><pre class=\"prism undefined-numbers lang-python\"><code>from setuptools import setup\n\nsetup()</code></pre></div>\n\n\n\n<p><img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/1f4a1.png\" alt=\"💡\" class=\"wp-smiley\"> You could actually skip the <strong>setup.cfg</strong> file and set your properties in <code>setup()</code> itself in <strong>setup.py</strong>, but this will make your migration harder in the future when the new PEP517 build system, like a death-star, is fully operational. I mention this because you’ll see a lot of examples on <a href=\"https://stackoverflow.com\" rel=\"noreferrer noopener\">Stack Overflow</a> &amp; friends that go this way – it is not wrong, per se, but be aware that it is the older way of doing things.</p>\n\n\n\n<p>An old-style <strong>setup.py</strong> file would look something like this:</p>\n\n\n\n<div class=\"hcb_wrap\"><pre class=\"prism undefined-numbers lang-python\"><code>from setuptools import setup\n\nsetup(\n\tname='mypackage',\n\tversion='0.0.1',\n    # To provide executable scripts, use entry points in preference to the\n    # &quot;scripts&quot; keyword. Entry points provide cross-platform support and allow\n    # pip to create the appropriate form of executable for the target platform.\n    entry_points={\n        'console_scripts': [\n            'myapplication=mypackage.mymodule:my_function'\n        ]\n    },\n)</code></pre></div>\n\n\n\n<h3>setup.cfg</h3>\n\n\n\n<p>The <strong>setup.cfg</strong> file is where the real magic happens. This is where you set your project-specific properties.</p>\n\n\n\n<div class=\"hcb_wrap\"><pre class=\"prism undefined-numbers lang-plain\"><code>[metadata]\nname = mypackage\nversion = 0.0.1\n\n[options]\npackages = mypackage\n\n[options.entry_points]\nconsole_scripts =\n    my-application = mypackage.mymodule:my_function\n    another-application = mypackage.mymodule:another_function</code></pre></div>\n\n\n\n<ul><li><strong>name</strong><ul><li>The build system uses this value to generate the build output files.</li><li>If you do not specify this, your output filename will have “UNKNOWN” instead of a more user-friendly name.</li></ul></li><li><strong>version</strong><ul><li>The build system uses this value to add a version number to your output files.</li><li>If you do not specify this, your output filename will contain “0.0.0”.</li></ul></li><li><strong>packages</strong><ul><li>Use this property to tell the build system which packages to build.</li><li>This is a list, so you can specify more than one package.</li><li>If you’re not sure what a “package” is in Python, just think of it as the name of the directory your code lives in.</li><li><img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/2757.png\" alt=\"❗\" class=\"wp-smiley\">If you do not specify this, your build output will not actually contain your code. If you forget to specify this, your package &amp; deploy will look like it’s working, but it won’t actually package the code you want to run and it will not actually deploy correctly.</li></ul></li><li><strong>console_scripts</strong><ul><li>This property tells the build system to create a shortcut CLI wrapper script to run a Python function.</li><li>This is a list, so you can create more than one CLI application from the same code-base.</li><li>In this example, we are creating two CLI shortcuts:<ul><li><strong>my-application</strong>, which calls <strong>my_function</strong> in <strong>mypackage/mymodule.py</strong>.</li><li><strong>another-application</strong>, which calls <strong>another_function</strong> in <strong>mypackage/mymodule.py</strong>.</li></ul></li><li>The syntax for an entry is: <strong>&lt;name&gt; = [&lt;package&gt;.[&lt;subpackage&gt;.]]&lt;module&gt;[:&lt;object&gt;.&lt;object&gt;]</strong>.</li><li>The name on the left will become the name of your CLI application. This is what an end-user will type in the CLI to invoke your application.</li><li>If you do not specify this property, your build will not create any CLI shortcuts for your code.</li><li><img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/2757.png\" alt=\"❗\" class=\"wp-smiley\">Remember that you have to include the root package of the code you reference here under <code>options.packages</code>, otherwise the build tool will not actually package the code you’re referencing here!</li></ul></li></ul>\n\n\n\n<p>There are many more meta-data properties that you can (and maybe should!) specify in <strong>setup.cfg</strong> – here is a <a href=\"https://setuptools.readthedocs.io/en/latest/userguide/declarative_config.html\" rel=\"noopener\">more comprehensive setup.cfg example</a>. Given here instead is the bare minimum for a tidy build &amp; packaging experience.</p>\n\n\n\n<p><img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/1f4a1.png\" alt=\"💡\" class=\"wp-smiley\"> Of the additional unlisted properties, of especial interest is <strong>install_requires</strong>, with which you specify dependencies – in other words, any external packages that your code depends on and that you want the installer to install alongside your application.</p>\n\n\n\n<div class=\"hcb_wrap\"><pre class=\"prism undefined-numbers lang-plain\"><code>[options]\ninstall_requires =\n    requests\n    importlib; python_version == &quot;2.6&quot;</code></pre></div>\n\n\n\n<h3>pyproject.toml</h3>\n\n\n\n<p>All you need in your minimalist <strong>pyproject.toml</strong> file is:</p>\n\n\n\n<div class=\"hcb_wrap\"><pre class=\"prism undefined-numbers lang-plain\"><code>[build-system]\nbuild-backend = &quot;setuptools.build_meta&quot;\nrequires = [&quot;setuptools&quot;, &quot;wheel&quot;]</code></pre></div>\n\n\n\n<p><img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/1f4a1.png\" alt=\"💡\" class=\"wp-smiley\"> In the <strong>pyproject.toml</strong> specification, <code>project.scripts</code> is the equivalent to <code>console_scripts</code> in <strong>setup.py</strong> and <strong>setup.cfg</strong>. However, at present this functionality is not implemented yet by the <strong>setuptools</strong> build system.</p>\n\n\n\n<h2>Use python -m build to create a python distribution</h2>\n\n\n\n<p><strong>build</strong>, aka PyPA build, is the more modern PEP517 equivalent of the older <code>setup.py sdist bdist_wheel</code> build command with which you might be familiar.</p>\n\n\n\n<p>If you’ve not done this before, you can install the build tool like this:</p>\n\n\n\n<div class=\"hcb_wrap\"><pre class=\"prism undefined-numbers lang-bash\"><code>$ pip install build</code></pre></div>\n\n\n\n<p>Now, in the root of your project directory, you can run:</p>\n\n\n\n<div class=\"hcb_wrap\"><pre class=\"prism undefined-numbers lang-bash\"><code>$ python -m build</code></pre></div>\n\n\n\n<p>This will result in two output files in the <code>dist</code> directory:</p>\n\n\n\n<ul><li>dist/mypackage-0.0.1.tar.gz</li><li>dist/mypackage-0.0.1-py3-none-any.whl</li></ul>\n\n\n\n<p>The tool will create the <strong>./dist</strong> directory for you if it doesn’t exist already.</p>\n\n\n\n<p>What this command does is to create a source distribution tarball (the <strong>tar.gz</strong> file), and then also create a wheel from that source distribution. A wheel (<strong>.whl</strong>) is a versioned distribution format that deploys faster because during installation you can skip the build step necessary for source distributions, and there are better caching mechanisms for it.</p>\n\n\n\n<p>The output filenames you see here follow a defined format that you can find specified in the <a href=\"https://www.python.org/dev/peps/pep-0427/#file-name-convention\" rel=\"noopener\">PEP427 wheel file name convention</a>.</p>\n\n\n\n<p>You’ll notice that the build tool uses <strong>name</strong> and <strong>version</strong> from <strong>setup.cfg</strong> to generate these filenames – which is why, even though you strictly speaking don’t<em> need</em> to specify these properties, they are useful if you want nicely named &amp; easily identifiable outputs.</p>\n\n\n\n<h2>Install your wheel with pip</h2>\n\n\n\n<p>You can use <a href=\"https://pip.pypa.io/\" rel=\"noopener\">pip</a> to install the distribution you just created. (I’m sure <strong>pip</strong> doesn’t need any introduction to any Pythonista…)</p>\n\n\n\n<div class=\"hcb_wrap\"><pre class=\"prism undefined-numbers lang-bash\"><code>$ pip install dist/mypackage-0.0.1-py3-none-any.whl</code></pre></div>\n\n\n\n<h3>How PyPA build creates CLI shortcuts</h3>\n\n\n\n<p>The pip install command will install your package and create the CLI shortcuts (the ones you specified in <strong>setup.cfg</strong>) in the current Python environment’s <code>bin</code> directory.</p>\n\n\n\n<ul><li>{Python Path}/bin/my-application</li><li>{Python Path}/bin/another-application</li></ul>\n\n\n\n<p>Under the hood, these shortcut files are actually just a more sophisticated version of the quick-and-dirty bash file we created in the beginning. The auto-generated <strong>my-application</strong> shortcut file in the <code>bin/</code> directory looks like this:</p>\n\n\n\n<div class=\"hcb_wrap\"><pre class=\"prism undefined-numbers lang-python\"><code>#!/bin/python3\n# -*- coding: utf-8 -*-\nimport re\nimport sys\nfrom mypackage.mymodule import my_function\nif __name__ == '__main__':\n    sys.argv[0] = re.sub(r'(-script\\.pyw|\\.exe)?$', '', sys.argv[0])\n    sys.exit(my_function())</code></pre></div>\n\n\n\n<h3>Testing your install in a clean environment</h3>\n\n\n\n<p><img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/1f4a1.png\" alt=\"💡\" class=\"wp-smiley\">If you want to test whether your shiny new package is installable, create a fresh new virtual environment and install your package into it so that you can test it in isolation.</p>\n\n\n\n<div class=\"hcb_wrap\"><pre class=\"prism undefined-numbers lang-bash\"><code># create virtual environment\n$ python3 -m venv .env/fresh-install-test\n\n# activate your virtual environment\n$ . .env/fresh-install-test/bin/activate\n\n# install your package into this fresh environment\n$ pip install dist/mypackage-0.0.0-py3-none-any.whl\n\n# your shortcuts are now in the venv bin directory\n$ ls .env/fresh-install-test/bin/\nmy-application\nanother-application\n\n# so you can run it directly from the cli\n$ my-application\nhello from my_function\n\n# and run the second application\n$ another-application\nhello from another_function</code></pre></div>\n\n\n\n<h2>Publishing &amp; distributing your Python package</h2>\n\n\n\n<p>Publishing means <em>how</em> you make your Python package available to your end-users.</p>\n\n\n\n<p>How you publish your package depends on your deployment plan for your specific requirements. A full discussion of these is beyond the scope of this article, but just to get you started, some of the options are:</p>\n\n\n\n<ul><li>You can publish to and <a href=\"https://pip.pypa.io/en/stable/topics/vcs-support/\" rel=\"noopener\">use pip to install from a private git repository</a>.</li><li>You can create your own <a href=\"https://packaging.python.org/guides/hosting-your-own-index/\" rel=\"noopener\">private Python repository manager</a>.</li><li>You could just use <strong>pip</strong> to install the <strong>whl</strong> or <strong>sdist</strong> from a file-share in your organization.</li><li>If you are planning to release your application publicly to the official <a href=\"https://pypi.org\" rel=\"noopener\">PyPI</a> repository, you can use <a href=\"https://twine.readthedocs.io/\" rel=\"noopener\">twine</a> to upload the distribution to PyPi.<ul><li>Be aware that you very probably should be a lot more detailed in filling in your project’s meta-data than the deliberately bare-bones minimal example given here if you are planning to create a public package.</li></ul></li><li>Whereas <strong>pip</strong> installs to whichever Python environment is active at the time, this can get messy on end-user machines that you do not control – for example, shared dependencies can clash with other applications’ requirements.<ul><li>If you want to install your application into an isolated environment, purposely separate just for your app with the dependencies for your app isolated from and not polluting the main system-wide Python installation, you can use <a href=\"https://pypa.github.io/pipx\" rel=\"noopener\">pipx</a> to install from a git repo (such as a private repo in your organization) or even just a file-path.</li></ul></li><li>You can email your wheels around as attachments and tell people to install. Just kidding, just kidding! Don’t do this – just because it’s been known to happen doesn’t make it <em>right</em>. . .</li></ul>\n\n\n\n<h2>How to structure a Python CLI project</h2>\n\n\n\n<p>For the sake of clarity, this example just directly calls a simple Python function from the CLI. Your code is very likely to be more involved.</p>\n\n\n\n<p>How best to structure your code in any given application is, of course, a very. . . debatable. . . topic <img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/1f62c.png\" alt=\"😬\" class=\"wp-smiley\">. So instead of making bold claims about what is “best”, lets instead just look at what a typical tidy structure might look like… which is to say, while this is a relatively common way of doing things, it’s not necessarily THE way.</p>\n\n\n\n<pre class=\"wp-block-preformatted\">.\n│ my-repo/\n  │- mypackage/\n    │- mynamespace/\n      │- anothermodule.py\n    │- anothernamespace/\n      │- arbmodule.py\n    │- mymodule.py\n    │- cli.py\n    │- pyproject.toml\n    │- setup.cfg\n    │- setup.py</pre>\n\n\n\n<p>If you create your entry-point function as <code>def main()</code> in <strong>cli.py</strong> then your <strong>setup.cfg</strong> file <strong>entry_points </strong>configuration simply becomes:</p>\n\n\n\n<div class=\"hcb_wrap\"><pre class=\"prism undefined-numbers lang-plain\"><code>[options.entry_points]\nconsole_scripts =\n    my-application = mypackage.cli:main</code></pre></div>\n\n\n\n<p>You can think of your functional code as a library, and the CLI is effectively a client or consumer of that library. Break your code into namespaces and modules that make sense for you – you can group together code by functional area, or by dependency, or by object, or by whatever categorization scheme works for you.</p>\n\n\n\n<p>If you think of the CLI as a consumer of your library’s API, it makes sense to encapsulate the code specific to CLI handling in its own module. You can name this what you like, but <strong>cli.py</strong> does have the benefit of being snappy. In this module you will very probably import something like <a href=\"https://docs.python.org/3/library/argparse.html\" rel=\"noopener\">argparse</a>, to parse your CLI input arguments, print out errors when someone invokes your CLI with the wrong arguments, assign defaults and generate help &amp; usage messages.</p>\n\n\n\n<p>Here is a real-life example of a large project structured like this, with a <a href=\"https://github.com/pypyr/pypyr/blob/master/pypyr/cli.py\" rel=\"noopener\">CLI handling module</a> that encapsulates all CLI functionality and invokes the underlying program being called like you would an API.</p>\n\n\n\n<h2>Alternative packaging tools in Python</h2>\n\n\n\n<p>In this article we just focused on using the “official” minimalist way of packaging &amp; building your Python projects. But there are other 3rd party options out there that provide some extra functionality over and above what the vanilla setuptools <strong>build</strong> tool does.</p>\n\n\n\n<p>We’ve already mentioned PEP517 compliant build tools <strong>poetry</strong> and <strong>flit</strong>. With these, as with the standard PyPA <strong>build</strong>, the end-user has to have an active Python run-time on their machine. Your code installs into that Python environment.</p>\n\n\n\n<p>Whereas other utilities follow a completely different approach by creating a single file executable of your application and its Python dependencies – these 3rd party utilities create a standalone platform-native executable of your app for you. This means that the end-user does not even need to have a Python distribution on their machine – they can just run your executable file by itself.</p>\n\n\n\n<p>In no particular order, some free tools in this space are:</p>\n\n\n\n<ul><li><a href=\"https://www.pyinstaller.org\" rel=\"noopener\">PyInstaller</a></li><li><a href=\"https://www.py2exe.org\" rel=\"noopener\">p2exe</a></li><li><a href=\"https://github.com/schmir/bbfreeze\" rel=\"noopener\">bbFreeze</a> (unmaintained)</li><li><a href=\"https://cx-freeze.readthedocs.io/\" rel=\"noopener\">cx_Freeze</a></li><li><a href=\"https://beeware.org/project/projects/tools/briefcase/\" rel=\"noopener\">Briefcase</a></li><li><a href=\"https://nuitka.net\" rel=\"noopener\">Nuitka</a></li><li><a href=\"https://py2app.readthedocs.io/\" rel=\"noopener\">py2app</a> (Mac-only)</li><li><a href=\"https://pyoxidizer.readthedocs.io\" rel=\"noopener\">PyOxidizer</a></li></ul>\n\n\n\n<p>Each of these has its own way of specifying which function to call from the CLI, so if you do want to go in this direction, be sure to check the documentation for your chosen tool.</p>\n\n\n\n<p><img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/1f64c.png\" alt=\"🙌\" class=\"wp-smiley\"> Much thanks for these excellent tool suggestions to <a href=\"https://twitter.com/driscollis\" rel=\"noopener\">Mike Driscoll</a> and <a href=\"https://github.com/markgreene74\" rel=\"noopener\">markgreene</a> from the <a href=\"https://pybit.es/community/\">PyBites Community</a>, which you can freely join on slack! <img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/1f64c.png\" alt=\"🙌\" class=\"wp-smiley\"></p>"
}