{
  "title":"Glyph Lefkowitz: Unproblematize",
  "date":"2021-08-31T00:03:00.000000-07:00",
  "author":null,
  "id":"https://glyph.twistedmatrix.com/2021/08/unproblematize.html",
  "link":"https://glyph.twistedmatrix.com/2021/08/unproblematize.html",
  "content":"<p>The essence of software engineering is <em>solving problems</em>.</p>\n<p>The first impression of this insight will almost certainly be that it seems\nlike a good thing.  If you have a problem, then solving it is great!</p>\n<p>But software engineers are more likely to have mental health problems<sup id=\"fnref:1:unproblematize-2021-8\"><a class=\"footnote-ref\" href=\"https://glyph.twistedmatrix.com/feeds/all.atom.xml#fn:1:unproblematize-2021-8\" id=\"fnref:1\">1</a></sup> than\nthose who perform mechanical labor, and I think our problem-oriented world-view\nhas something to do with that.</p>\n<p>So, how could solving problems be a problem?</p>\n<hr></hr>\n<p>As an example, let’s consider the idea of a <em>bug tracker</em>.</p>\n<p>For many years, in the field of software, any system used to track work has\nbeen commonly referred to as a “bug tracker”.  In recent years, the labels have\nbecome more euphemistic and general, and we might now call them “issue\ntrackers”.  We have Sapir-Whorfed<sup id=\"fnref:2:unproblematize-2021-8\"><a class=\"footnote-ref\" href=\"https://glyph.twistedmatrix.com/feeds/all.atom.xml#fn:2:unproblematize-2021-8\" id=\"fnref:2\">2</a></sup> our way into the default assumption that\nany work that might need performing is a degenerate case of a <em>problem</em>.</p>\n<p>We can contrast this with other fields.  Any industry will need to track work\nthat must be done.  For example, in doing some light research for this post, I\ndiscovered that the relevant term of art in construction<sup id=\"fnref:3:unproblematize-2021-8\"><a class=\"footnote-ref\" href=\"https://glyph.twistedmatrix.com/feeds/all.atom.xml#fn:3:unproblematize-2021-8\" id=\"fnref:3\">3</a></sup> is typically\n“Project Management” or “Task Management” software.  “Projects” and “Tasks” are\nno less hard work, but the terms do have a different <em>valence</em> than “Bugs” and\n“Issues”.</p>\n<p>I don’t think we can start to fix this ... problem ... by attempting to change\nthe terminology.  Firstly, the domain inherently lends itself to this sort of\nlanguage, which is why it emerged in the first place.</p>\n<p>Secondly, Atlassian has desperately been trying to get everybody to call their\nbug tracker a “software development tool” where you write “stories” for years,\nand nobody does.  It’s an issue tracker where you file bugs, and that’s what\neveryone calls it and describes what they do with it.  Even they have to\nprotest, perhaps a bit too much, that it’s “way more than a bug and issue\ntracker”<sup id=\"fnref:4:unproblematize-2021-8\"><a class=\"footnote-ref\" href=\"https://glyph.twistedmatrix.com/feeds/all.atom.xml#fn:4:unproblematize-2021-8\" id=\"fnref:4\">4</a></sup>.</p>\n<hr></hr>\n<p>This pervasive orientation towards “problems” as the atom of work does extend\nto any knowledge work, and thereby to any “productivity system”.  <em>Any</em> to-do\nlist is, at its core, a list of problems.  You wouldn’t put an item on the list\nif you were happy with the way the world was.  Therefore every unfinished item\nin any to-do list is a little pebble of worry.</p>\n<p>As of this writing, I have almost 1000 unfinished tasks on my personal to-do\nlist.</p>\n<p>This is to say nothing of any tasks I have to perform at work, not to mention\nthe implicit\n<a href=\"https://en.wikipedia.org/wiki/Aleph_number#Aleph-nought\">א‎<sub><small>0</small></sub></a>\nof additional unfinished tasks once one considers open source issue trackers\nfor projects I work on.</p>\n<p>It’s not really reasonable to opt out of this habit of problematizing\neverything.  This monument to human folly that I’ve meticulously constructed\nout of the records of aspirations which exceed my capacity <em>is</em>, in fact,\n<em>also</em> an excellent prioritization tool.  If you’re a good engineer, or even\njust good at making to-do lists, you’ll inevitably make huge lists of problems.\nOn some level, this is what it means to set an intention to make the world — or\nat least your world — better.</p>\n<p>On a different level though, this is how you set out to systematically give\nyourself anxiety, depression, or both.  It’s clear from a wealth of\nneurological research that repeated experiences and thoughts change neural\nstructures<sup id=\"fnref:5:unproblematize-2021-8\"><a class=\"footnote-ref\" href=\"https://glyph.twistedmatrix.com/feeds/all.atom.xml#fn:5:unproblematize-2021-8\" id=\"fnref:5\">5</a></sup>.  Thinking the same thought over and over literally re-wires\nyour brain.  Thinking the thought “here is another problem” over and over again\nforever is bound to cause some problems of its own.</p>\n<p>The structure of to-do apps, bug trackers and the like is such that when an\nitem is completed — when a problem is <em>solved</em> — it is subsequently removed\nfrom both physical view and our mind’s eye.  What would be the point of simply\nlingering on a completed task?  All the <em>useful work</em> is, after all, problems\nthat <em>haven’t</em> been solved yet.  Therefore the vast majority of our time is\nspent contemplating nothing but problems, prompting the continuous\npotentiation<sup id=\"fnref:6:unproblematize-2021-8\"><a class=\"footnote-ref\" href=\"https://glyph.twistedmatrix.com/feeds/all.atom.xml#fn:6:unproblematize-2021-8\" id=\"fnref:6\">6</a></sup> of neural pathways which lead to despair.</p>\n<hr></hr>\n<p>I don’t want to pretend that I have a <em>cure</em> for this self-inflicted ailment.\nI do, however, have a humble <em>suggestion</em> for one way to push back just a\n<em>little</em> bit against the relentless, unending tide of problems slowly eroding\nthe shores of our souls: a positivity journal.</p>\n<p>By “journal”, I do mean a <em>private</em> journal.  Public expressions of\npositivity<sup id=\"fnref:7:unproblematize-2021-8\"><a class=\"footnote-ref\" href=\"https://glyph.twistedmatrix.com/feeds/all.atom.xml#fn:7:unproblematize-2021-8\" id=\"fnref:7\">7</a></sup> can help; indeed, some social and cultural support for\nexpressing positivity is an important tool for maintaining a positive mind-set.\nHowever, it may not be the best starting point.</p>\n<p>Unfortunately, any public expression becomes a discourse, and any discourse\ninevitably becomes a\n<a href=\"https://www.merriam-webster.com/dictionary/dialectic\">dialectic</a>.  Any\nexpression of a view in public is seen by some as an invitation to express its\nopposite<sup id=\"fnref:8:unproblematize-2021-8\"><a class=\"footnote-ref\" href=\"https://glyph.twistedmatrix.com/feeds/all.atom.xml#fn:8:unproblematize-2021-8\" id=\"fnref:8\">8</a></sup>.  Therefore one either becomes invested in defending the\nboundaries of a positive community space — a psychically exhausting task in its\nown right — or one must constantly entertain the possibility that things are,\nin fact, bad, when one is <em>trying</em> to condition one’s brain to maintain the\nability to <em>recognize</em> when things are actually good.</p>\n<p>Thus my suggestion to write something for yourself, and <em>only</em> for yourself.</p>\n<p>Personally, I use a template that I fill out every day, with four sections:</p>\n<ul>\n<li>\n<p>“Summary”.  Summarize the day in one sentence that encapsulates its positive\n   vibes.  Honestly I put this in there because the Notes app (which is what\n   I’m using to maintain this) shows a little summary of the contents of the\n   note, and I was getting annoyed by just seeing “Proud:” as the sole content\n   of that summary.  But once I did so, I found that it helps to try to\n   synthesize a positive narrative, as your brain may be constantly trying to\n   assemble a negative one.  It can help to write this last, even if it’s up at\n   the top of your note, once you’ve already filled out some of the following\n   sections.</p>\n</li>\n<li>\n<p>“I’m proud of:”. First, focus on what <em>you personally</em> have achieved through your\n   skill and hard work.  This can be very difficult, if you are someone who has\n   a habit of putting yourself down.  Force yourself to acknowledge that you\n   did something useful, even if you didn’t finish anything, you almost\n   certainly made progress and that progress deserves celebration.</p>\n</li>\n<li>\n<p>“I’m grateful to:”.  Who are you grateful to?  Why?  What did they do for you?  Once\n   you’ve made the habit of allowing yourself to <em>acknowledge</em> your own\n   accomplishments, it’s easy to <em>see</em> those; pay attention to the ways in\n   which others support and help you.  Thank them by name.</p>\n</li>\n<li>\n<p>“I’m lucky because:”.  Particularly in post-2020 hell-world it’s easy to\n   feel like every random happenstance is an aggravating tragedy.  But good\n   things happen randomly all the time, and it’s easy to fail to notice them.\n   Take a moment to notice things that went well for no good reason, because\n   you’re <em>definitely</em> going to feel attacked by the universe when bad things\n   happen for no good reason; and they will.</p>\n</li>\n</ul>\n<p>Although such a journal is private, it’s helpful to <em>actually write out</em> the\nanswers, to focus on them, to force yourself to get really specific.</p>\n<p>I hope this tool is useful to someone out there.  It’s not going to <em>solve any\nproblems</em>, but perhaps it will make the world seem just a little brighter.</p>\n<div class=\"footnote\">\n<hr></hr>\n<ol>\n<li id=\"fn:1:unproblematize-2021-8\">\n<p id=\"fn:1\"><a href=\"https://www.infoq.com/articles/mental-health-software-teams/\">“Maintaining Mental health on Software Development\nTeams”</a>, Lena\nKozar and Vova Vovk, in InfoQ <a class=\"footnote-backref\" href=\"https://glyph.twistedmatrix.com/feeds/all.atom.xml#fnref:1:unproblematize-2021-8\" title=\"Jump back to footnote 1 in the text\">↩</a></p>\n</li>\n<li id=\"fn:2:unproblematize-2021-8\">\n<p id=\"fn:2\"><a href=\"https://en.wikipedia.org/wiki/Linguistic_relativity\">Wikipedia page for “Linguistic Relativity”</a> <a class=\"footnote-backref\" href=\"https://glyph.twistedmatrix.com/feeds/all.atom.xml#fnref:2:unproblematize-2021-8\" title=\"Jump back to footnote 2 in the text\">↩</a></p>\n</li>\n<li id=\"fn:3:unproblematize-2021-8\">\n<p id=\"fn:3\"><a href=\"https://medium.com/construction-project-management/construction-task-and-project-tracking-4d637cb50ce3\">“Construction Task and Project\nTracking”</a>,\nfrom Raptor Project Management Software <a class=\"footnote-backref\" href=\"https://glyph.twistedmatrix.com/feeds/all.atom.xml#fnref:3:unproblematize-2021-8\" title=\"Jump back to footnote 3 in the text\">↩</a></p>\n</li>\n<li id=\"fn:4:unproblematize-2021-8\">\n<p id=\"fn:4\"><a href=\"https://www.atlassian.com/software/jira/features\">Jira Features List</a>, Atlassian Software <a class=\"footnote-backref\" href=\"https://glyph.twistedmatrix.com/feeds/all.atom.xml#fnref:4:unproblematize-2021-8\" title=\"Jump back to footnote 4 in the text\">↩</a></p>\n</li>\n<li id=\"fn:5:unproblematize-2021-8\">\n<p id=\"fn:5\"><a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3409833/\">“Culture Wires the Brain: A Cognitive Neuroscience\nPerspective”</a>,\nDenise C. Park and Chih-Mao Huang, Perspect Psychol Sci. 2010 Jul 1; 5(4):\n391–400. <a class=\"footnote-backref\" href=\"https://glyph.twistedmatrix.com/feeds/all.atom.xml#fnref:5:unproblematize-2021-8\" title=\"Jump back to footnote 5 in the text\">↩</a></p>\n</li>\n<li id=\"fn:6:unproblematize-2021-8\">\n<p id=\"fn:6\"><a href=\"https://pubmed.ncbi.nlm.nih.gov/8624136/\">Long-term potentiation and\nlearning</a>, J L Martinez Jr, B E\nDerrick <a class=\"footnote-backref\" href=\"https://glyph.twistedmatrix.com/feeds/all.atom.xml#fnref:6:unproblematize-2021-8\" title=\"Jump back to footnote 6 in the text\">↩</a></p>\n</li>\n<li id=\"fn:7:unproblematize-2021-8\">\n<p id=\"fn:7\">The <a href=\"https://twitter.com/hashtag/positivePython?f=live\">#PositivePython hashtag on\nTwitter</a> was a lovely\nexperiment and despite my cautions here about public solutions to this\nproblem, it’s generally pleasant to participate in. <a class=\"footnote-backref\" href=\"https://glyph.twistedmatrix.com/feeds/all.atom.xml#fnref:7:unproblematize-2021-8\" title=\"Jump back to footnote 7 in the text\">↩</a></p>\n</li>\n<li id=\"fn:8:unproblematize-2021-8\">\n<p id=\"fn:8\"><a href=\"https://wondermark.com/1k62/\">As we well know.</a> <a class=\"footnote-backref\" href=\"https://glyph.twistedmatrix.com/feeds/all.atom.xml#fnref:8:unproblematize-2021-8\" title=\"Jump back to footnote 8 in the text\">↩</a></p>\n</li>\n</ol>\n</div>"
}