{
  "title":"Mike Driscoll: PyDev of the Week: Sarah Abderemane",
  "date":"2022-11-14T13:30:54.000000Z",
  "author":null,
  "id":"https://www.blog.pythonlibrary.org/2022/11/14/pydev-of-the-week-sarah-abderemane/",
  "link":"https://www.blog.pythonlibrary.org/2022/11/14/pydev-of-the-week-sarah-abderemane/",
  "content":"<p dir=\"ltr\">This week we welcome Sarah Abderemane (<a href=\"https://twitter.com/sabderemane_\">@sabderemane_</a>) as our PyDev of the Week! Sarah is a full-stack developer who is very active in the Django community. You can learn more about Sarah by checking out her <a href=\"https://sarahabd.com/blog\">website</a> or visiting Sarah's <a href=\"https://github.com/sabderemane\">GitHub Profile</a>.</p>\n<p dir=\"ltr\">Let's spend some time getting to know Sarah better!</p>\n<h2 dir=\"ltr\">Can you tell us a little about yourself (hobbies, education, etc):</h2>\n<p dir=\"ltr\">Hi, I'm a software developer for a few years now and I’m currently working at TKT Thinking Technology in Paris, France.</p>\n<p dir=\"ltr\">I got a master's degree in Computer Science while working for them. Before that, I had a professional degree in web and mobile design and integration and a two-year university degree in marketing techniques. I started to learn programming by myself after my degree in marketing techniques. I continued my studies in this way because I liked it.</p>\n<p dir=\"ltr\">I spend most of my spare time contributing to open source projects on <span class=\"il\">Python</span> ecosystem, in particular in Django projects, as I love this community. I volunteer for Django conferences, especially as a mentor for the Django Girls. Moreover, I’m organizing Django Paris Meetups as I’m living in France and helping djangonauts via<a href=\"https://discord.gg/57MMPEES\" rel=\"noopener\"> Discord</a>.</p>\n<p dir=\"ltr\">When I'm not in front of the computer, I'm enjoying dancing especially dancehall and hip hop style and watching series on diverse streaming platform. Also, I never say no to chocolate or sweets...</p>\n<h2 dir=\"ltr\">Why did you start using <span class=\"il\">Python</span>?</h2>\n<p dir=\"ltr\">During my first year of master, I was studying in block release training with <span class=\"il\">weeks</span> at school and <span class=\"il\">weeks</span> in a company. I discovered <span class=\"il\">Python</span> with my mentor for some company’s projects while I was learning PHP during the courses. I really liked the <span class=\"il\">Python</span> language so I started to learn about it in my free time.</p>\n<p dir=\"ltr\">What other programming languages do you know and which is your favorite?</p>\n<p dir=\"ltr\">I know PHP as I said before, HTML, CSS, JavaScript and I know some Bash. I learned Go in High School. I also used C and Java when I started programming but that was a long time ago.</p>\n<p dir=\"ltr\">I wouldn't say, I have a favorite programming language apart from <span class=\"il\">Python</span>, but I really like JavaScript besides it.</p>\n<h2 dir=\"ltr\">What projects are you working on now?</h2>\n<p dir=\"ltr\">I’m checking to move the <a href=\"https://github.com/python/bedevere\" rel=\"noopener\">Bedevere</a> bot for pull requests in <span class=\"il\">Python</span> to GitHub Actions and I’m currently implementing a dark mode in Django documentation. You can already check my work in the documentation haha, but there are still some parts which have no dark mode like the issue tracker. I’m also trying to improve the accessibility in Django project.</p>\n<p dir=\"ltr\">Aside from my Django contribution, I’m working on multiple projects at my job but the last one was about a platform to help professionals search and compare real estate transactions in a few clicks.</p>\n<h2 dir=\"ltr\">Which <span class=\"il\">Python</span> libraries are your favorite (core or 3rd party)?</h2>\n<p dir=\"ltr\">I think my favorite <span class=\"il\">python</span> libraries would be itertools and collections from core and pandas which is amazing as a 3rd party library.</p>\n<p dir=\"ltr\">Why did you choose Django over other <span class=\"il\">Python</span> web frameworks?</p>\n<p dir=\"ltr\">I wouldn’t say I choose Django over other <span class=\"il\">python</span> web frameworks, but I’m trying to choose the best framework according the project I have to do, and most of the time, Django suits well my needs.</p>\n<h2 dir=\"ltr\">What are the top three things in Django that you like?</h2>\n<p dir=\"ltr\">As a developer, I really like the simplicity of using it, but if I had to pick 3 things I would say:</p>\n<ul>\n<li dir=\"ltr\">\n<p dir=\"ltr\">The admin, you can have something ready very quickly.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">The ORM, it’s really powerful and you can do so many things easily.</p>\n</li>\n<li dir=\"ltr\">\n<p dir=\"ltr\">The documentation, it’s one of the most complete in the world of open source software for a project of this scale.</p>\n</li>\n</ul>\n<h2 dir=\"ltr\">Is there anything else you’d like to say?</h2>\n<p dir=\"ltr\">I started writing and sharing more on <a href=\"https://twitter.com/sabderemane_\" rel=\"noopener\">Twitter</a> and on my <a href=\"https://sarahabd.com/\" rel=\"noopener\">blog</a>. I really made some great connections to awesome people, I really appreciate meeting new folks <img class=\"an1\" src=\"https://fonts.gstatic.com/s/e/notoemoji/14.0/1f642/72.png\" alt=\"????\"></p>\n<p dir=\"ltr\">If you want to start to contribute to in Django ecosystem or need some help with your contribution, don’t hesitate to ask questions in discord, I’m not so far and there is always someone to help.</p>\n<p dir=\"ltr\"><strong>Thanks for doing the interview, Sarah!</strong></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.blog.pythonlibrary.org/2022/11/14/pydev-of-the-week-sarah-abderemane/\">PyDev of the Week: Sarah Abderemane</a> appeared first on <a rel=\"nofollow\" href=\"https://www.blog.pythonlibrary.org\">Mouse Vs Python</a>.</p>"
}