{
  "title":"Reuven Lerner: Level up your career with PythonDAB — the Python Data Analytics Bootcamp",
  "date":"2022-11-14T09:09:46.000000Z",
  "author":null,
  "id":"https://lerner.co.il/2022/11/14/level-up-your-career-with-pythondab-the-python-data-analytics-bootcamp/",
  "link":"https://lerner.co.il/2022/11/14/level-up-your-career-with-pythondab-the-python-data-analytics-bootcamp/",
  "content":"<p>The economy has been feeling a bit shaky as of late, with lots of layoffs, shakeups, and general uncertainty about what’s coming next.</p>\n\n\n\n<p>With the right skills, you need not be too nervous. That’s because companies are always interested in people who can help them to create new products, understand and improve the ones they’re already making, and suggest new directions for the future.</p>\n\n\n\n<p>In other words: Having such skills is like having a career superpower, one that ensures you’ll always be able to get a great job — with a great salary and benefits, solving interesting problems alongside smart, motivated colleagues.</p>\n\n\n\n<p>What skills am I talking about?</p>\n\n\n\n<ul><li>Python</li><li>Version control and collaboration with Git</li><li>Data analytics with NumPy and Pandas</li></ul>\n\n\n\n<p>If you can program in Python, analyze data with NumPy and Pandas, and collaborate with colleagues using Git, then you’re in a great position to level up your current career — to move ahead at your current job, or to get a new, better job using these skills.</p>\n\n\n\n<p>Maybe, but how can you acquire these skills? There are so many options, it’s hard to know where to start.</p>\n\n\n<div class=\"wp-block-image\">\n<img src=\"https://lerner.co.il/wp-content/uploads/2022/05/DAB-Logo-1024x667.png\" alt=\"Reuven Lerner's Python Data Analytics Bootcamp\" class=\"wp-image-2398\" width=\"378\" height=\"246\"></div>\n\n\n<p>Starting November 30th, I’ll be running a cohort of PythonDAB, my Python Analytics Bootcamp. Over four months, you’ll learn Python, Git, NumPy, and Pandas — with tons of interactions with me (a live instructor), and by collaborating with others in your cohort.</p>\n\n\n\n<p>PythonDAB is meant for smart, hard-working people who want to advance their careers in a part-time, online bootcamp. Between video lectures, collaborative problem-solving, twice-weekly office hours, and a private forum, you’ll learn everything you need to gain data analytics superpowers.</p>\n\n\n\n<p>Sounds interesting? You can learn more here: https://PythonDAB.com/ </p>\n\n\n\n<p>And of course, if you have questions, feel free to e-mail me at <a href=\"mailto:reuven@lerner.co.il\">reuven@lerner.co.il</a>. I’ll gladly answer you ASAP.</p>\n<span class=\"tve-leads-two-step-trigger tl-2step-trigger-0\"></span><span class=\"tve-leads-two-step-trigger tl-2step-trigger-0\"></span><p>The post <a rel=\"nofollow\" href=\"https://lerner.co.il/2022/11/14/level-up-your-career-with-pythondab-the-python-data-analytics-bootcamp/\">Level up your career with PythonDAB — the Python Data Analytics Bootcamp</a> appeared first on <a rel=\"nofollow\" href=\"https://lerner.co.il\">Reuven Lerner</a>.</p>"
}