{
  "title":"Sebastian Witowski: How to Benchmark (Python) Code",
  "date":"2022-11-17T00:00:00.000000Z",
  "author":null,
  "id":"https://switowski.com/blog/how-to-benchmark-python-code/",
  "link":"https://switowski.com/blog/how-to-benchmark-python-code/",
  "content":"<p>While preparing to write the &quot;Writing Faster Python&quot; series, the first problem I faced was &quot;How do I benchmark a piece of code in an objective yet uncomplicated way&quot;.</p>\n<p>I could run <code>python -m timeit &lt;piece of code&gt;</code>, which is probably the simplest way of measuring how long it takes to execute some code<sup class=\"footnote-ref\"><a href=\"https://switowski.com/blog/how-to-benchmark-python-code/#fn1\" id=\"fnref1\">[1]</a></sup>. But maybe it's too simple, and I owe my readers some way of benchmarking that won't be interfered by sudden CPU spikes on my computer?</p>\n<p>So here are a couple of different tools and techniques I tried. At the end of the article, I will tell you which one I chose and why. Plus, I will give you some rules of thumb for when each tool might be handy.</p>\n<h2 id=\"python-m-timeit\" tabindex=\"-1\">python -m timeit <a class=\"direct-link\" href=\"https://switowski.com/blog/how-to-benchmark-python-code/#python-m-timeit\">#</a></h2>\n<p>The easiest way to measure how long it takes to run some code is to use the <a href=\"https://docs.python.org/3/library/timeit.html\">timeit</a> module. You can write <code>python -m timeit your_code()</code>, and Python will print out how long it took to run whatever <code>your_code()</code> does. I like to put the code I want to benchmark inside a function for more clarity, but you don't have to do this. You can directly write multiple Python statements separated by semicolons, and that will work just fine. For example, to see how long it takes to sum up the first 1,000,000 numbers, we can run this code:</p>\n<pre class=\"language-bash\"><code class=\"language-bash\">python -m timeit <span class=\"token string\">&quot;sum(range(1_000_001))&quot;</span><br><span class=\"token number\">20</span> loops, best of <span class=\"token number\">5</span>: <span class=\"token number\">11.5</span> msec per loop</code></pre>\n<p>However, <code>python -m timeit</code> approach has a major drawback - it doesn't separate the setup code from the code you want to benchmark. Let's say you have an import statement that takes a relatively long time to import compared to executing a function from that module. One such import can be <code>import numpy</code>. If we benchmark those two lines of code:</p>\n<pre class=\"language-python\"><code class=\"language-python\"><span class=\"token keyword\">import</span> numpy<br>numpy<span class=\"token punctuation\">.</span>arange<span class=\"token punctuation\">(</span><span class=\"token number\">10</span><span class=\"token punctuation\">)</span></code></pre>\n<p>the import will take most of the time during the benchmark. But you probably don't want to benchmark how long it takes to import modules. You want to see how long it takes to execute some functions from that module.</p>\n<h2 id=\"python-m-timeit-s-setup-code\" tabindex=\"-1\">python -m timeit -s &quot;setup code&quot; <a class=\"direct-link\" href=\"https://switowski.com/blog/how-to-benchmark-python-code/#python-m-timeit-s-setup-code\">#</a></h2>\n<p>To separate the setup code from the benchmarks, timeit supports <code>-s</code> parameter. Whatever code you pass here will be executed but won't be part of the benchmarks. So we can improve the above code and run it like this: <code>python -m timeit -s &quot;import numpy&quot; &quot;numpy.arange(10)&quot;</code>.</p>\n<h3 id=\"python-m-timeit-s-setup-code-n-10000\" tabindex=\"-1\">python -m timeit -s &quot;setup code&quot; -n 10000 <a class=\"direct-link\" href=\"https://switowski.com/blog/how-to-benchmark-python-code/#python-m-timeit-s-setup-code-n-10000\">#</a></h3>\n<p>We can be a bit more strict and decide to execute our code the same number of times each time. By default, if you don't specify the '-n' (or --number) parameter, timeit will try to run your code 1, 2, 5, 10, 20, ... until the total execution time exceeds 0.2 seconds. A slow function will be executed once, but a very fast one will run thousands of times. If you think executing different code snippets a different number of times affects your benchmarks, you can set this parameter to a predefined number.</p>\n<h2 id=\"docker\" tabindex=\"-1\">docker <a class=\"direct-link\" href=\"https://switowski.com/blog/how-to-benchmark-python-code/#docker\">#</a></h2>\n<p>One of the issues with running benchmarks with <code>python -m timeit</code> is that sometimes other processes on your computer might affect the Python process and randomly slow it down. For example, I've noticed that if I run my benchmarks with all the usual applications open (multiple Chrome instances with plenty of tabs, Teams and other messenger apps, etc.), they all take a bit longer than when I close basically all the apps on my computer.</p>\n<p>So while trying to figure out how to avoid this situation, I decided to try to run my benchmarks in Docker. I came up with the following solution:\n<code>docker run -w /home -it -v $(pwd):/home python:3.10.4-alpine python -m timeit -s &quot;&lt;some setup code&gt;&quot; &quot;my_function()&quot;</code></p>\n<p>The above code will:</p>\n<ol>\n<li>Run Python alpine Docker container (a small, barebones image with Python).</li>\n<li>Mount the current folder inside the Docker container (so we can access the files we want to benchmark).</li>\n<li>Run the same timeit command as before.</li>\n</ol>\n<p>And the results <em>seemed</em> more consistent than without using Docker. Rerunning benchmarks multiple times, I was getting results with smaller deviations. I still had a deviation - some runs were slightly slower, and some were slightly faster. However, that was the case for short code examples (running under 1 second). For longer code examples (running at least a few seconds), the difference between runs was even around 5% (I've tested docker with my bubble sort example from <a href=\"https://switowski.com/blog/how-to-benchmark-python-code/blog/upgrade-your-python-version/\">Upgrade Your Python Version</a> article). So, as one vigilant commenter suggested, Docker doesn't really help much here.</p>\n<h2 id=\"python-benchmarking-libraries\" tabindex=\"-1\">Python benchmarking libraries <a class=\"direct-link\" href=\"https://switowski.com/blog/how-to-benchmark-python-code/#python-benchmarking-libraries\">#</a></h2>\n<p>At some point, you might decide that getting a &quot;best of 5&quot; number that timeit returns by default is not enough. What if I need to know what's the most pessimistic scenario (the maximum time it took to run my code)? Or what's the difference between the slowest and fastest run? Is this difference huge, and my function runs in a completely unpredictable amount of time? Or is it so tiny that it's almost negligible?</p>\n<p>There are better benchmarking tools that offer more statistics about your code.</p>\n<h3 id=\"rich-bench\" tabindex=\"-1\">rich-bench <a class=\"direct-link\" href=\"https://switowski.com/blog/how-to-benchmark-python-code/#rich-bench\">#</a></h3>\n<p>The first tool I checked was the <a href=\"https://github.com/tonybaloney/rich-bench\">rich-bench</a> package that was created by Anthony Shaw together with his <a href=\"https://github.com/tonybaloney/anti-patterns\">anti-patterns</a> repository for a PyCon talk. This small tool can benchmark a set of files with different code examples and present the results in a nicely formatted table. Each benchmark will compare two different functions and present the mean, min, and max of the results, so you can easily see the spread between the results.</p>\n<p><img alt=\"richbench in action\" class=\"\" src=\"https://switowski.com/img/tVenp5rnN2-250.jpeg\" width=\"1840\" height=\"397\"></p>\n<h3 id=\"pyperf\" tabindex=\"-1\">pyperf <a class=\"direct-link\" href=\"https://switowski.com/blog/how-to-benchmark-python-code/#pyperf\">#</a></h3>\n<p>If you need a more advanced benchmarking tool, you probably can't go wrong if you choose the official tool used by the <a href=\"https://pyperformance.readthedocs.io/\">Python Performance Benchmark Suite</a> - <em>an authoritative source of benchmarks for all Python implementations.</em> <a href=\"https://github.com/psf/pyperf\">pyperf</a> is an exhaustive tool with many different features, including automatic calibration, detection of unstable results, tracking memory usage, and different modes of work, depending if you want to compare different pieces of code or get a bunch of stats for one function.</p>\n<p>Let's see an example. For the benchmarks, I will use a simple but inefficient function to calculate a sum of powers of the first 1,000,000 numbers:\n<code>sum(n * n for n in range(1_000_001))</code>.</p>\n<p>Here is the output from timeit module:</p>\n<pre class=\"language-bash\"><code class=\"language-bash\">$ python -m timeit <span class=\"token string\">&quot;sum(n * n for n in range(1_000_001))&quot;</span><br><span class=\"token number\">5</span> loops, best of <span class=\"token number\">5</span>: <span class=\"token number\">41</span> msec per loop</code></pre>\n<p>And here is the output of the <code>pyperf</code>:</p>\n<pre class=\"language-shell\"><code class=\"language-shell\">$ python -m pyperf timeit <span class=\"token string\">&quot;sum(n * n for n in range(1_000_001))&quot;</span> -o bench.json<br><span class=\"token punctuation\">..</span><span class=\"token punctuation\">..</span><span class=\"token punctuation\">..</span><span class=\"token punctuation\">..</span><span class=\"token punctuation\">..</span><span class=\"token punctuation\">..</span><span class=\"token punctuation\">..</span><span class=\"token punctuation\">..</span><span class=\"token punctuation\">..</span><span class=\"token punctuation\">..</span>.<br>Mean +- std dev: <span class=\"token number\">41.5</span> ms +- <span class=\"token number\">1.1</span> ms</code></pre>\n<p>The results are very similar, but with the <code>-o</code> parameter, we told pyperf to store the benchmark results in a JSON file, so now we can analyze them and get much more information:</p>\n<pre class=\"language-bash\"><code class=\"language-bash\">$ python -m pyperf stats bench.json<br>Total duration: <span class=\"token number\">14.5</span> sec<br>Start date: <span class=\"token number\">2022</span>-11-09 <span class=\"token number\">18</span>:19:37<br>End date: <span class=\"token number\">2022</span>-11-09 <span class=\"token number\">18</span>:19:53<br>Raw value minimum: <span class=\"token number\">163</span> ms<br>Raw value maximum: <span class=\"token number\">198</span> ms<br><br>Number of calibration run: <span class=\"token number\">1</span><br>Number of run with values: <span class=\"token number\">20</span><br>Total number of run: <span class=\"token number\">21</span><br><br>Number of warmup per run: <span class=\"token number\">1</span><br>Number of value per run: <span class=\"token number\">3</span><br>Loop iterations per value: <span class=\"token number\">4</span><br>Total number of values: <span class=\"token number\">60</span><br><br>Minimum:         <span class=\"token number\">40.8</span> ms<br>Median +- MAD:   <span class=\"token number\">41.3</span> ms +- <span class=\"token number\">0.2</span> ms<br>Mean +- std dev: <span class=\"token number\">41.5</span> ms +- <span class=\"token number\">1.1</span> ms<br>Maximum:         <span class=\"token number\">49.6</span> ms<br><br>  0th percentile: <span class=\"token number\">40.8</span> ms <span class=\"token punctuation\">(</span>-2% of the mean<span class=\"token punctuation\">)</span> -- minimum<br>  5th percentile: <span class=\"token number\">40.9</span> ms <span class=\"token punctuation\">(</span>-1% of the mean<span class=\"token punctuation\">)</span><br> 25th percentile: <span class=\"token number\">41.2</span> ms <span class=\"token punctuation\">(</span>-1% of the mean<span class=\"token punctuation\">)</span> -- Q1<br> 50th percentile: <span class=\"token number\">41.3</span> ms <span class=\"token punctuation\">(</span>-0% of the mean<span class=\"token punctuation\">)</span> -- median<br> 75th percentile: <span class=\"token number\">41.5</span> ms <span class=\"token punctuation\">(</span>+0% of the mean<span class=\"token punctuation\">)</span> -- Q3<br> 95th percentile: <span class=\"token number\">41.9</span> ms <span class=\"token punctuation\">(</span>+1% of the mean<span class=\"token punctuation\">)</span><br>100th percentile: <span class=\"token number\">49.6</span> ms <span class=\"token punctuation\">(</span>+20% of the mean<span class=\"token punctuation\">)</span> -- maximum<br><br>Number of outlier <span class=\"token punctuation\">(</span>out of <span class=\"token number\">40.7</span> ms<span class=\"token punctuation\">..</span><span class=\"token number\">41.9</span> ms<span class=\"token punctuation\">)</span>: <span class=\"token number\">3</span></code></pre>\n<h2 id=\"hyperfine\" tabindex=\"-1\">hyperfine <a class=\"direct-link\" href=\"https://switowski.com/blog/how-to-benchmark-python-code/#hyperfine\">#</a></h2>\n<p>And in case you want to benchmark some code that is not Python code, there is always the <a href=\"https://github.com/sharkdp/hyperfine\">hyperfine</a> that can be used to benchmark any CLI command. hyperfine has a similar set of features as the pyperf does. It automatically does warmup runs, clears the cache, and detect statistical outliers. And all that, with nice progress bars and colors, just makes the output looks beautiful.</p>\n<p>You can run it for one command, and it will return the usual information like the mean, min, and max time, standard deviation, number of runs, etc. But you can also pass multiple commands, and you will get a comparison of which one was faster:</p>\n<p><img alt=\"hyperfine in action\" class=\"\" src=\"https://switowski.com/img/Ns5BwziReF-250.jpeg\" width=\"1840\" height=\"553\">\n<img alt=\"hyperfine in action\" class=\"\" src=\"https://switowski.com/img/LKhj3Qc88A-250.jpeg\" width=\"1840\" height=\"552\"></p>\n<h2 id=\"timeit-is-just-fine-for-me\" tabindex=\"-1\">timeit is just fine...for me <a class=\"direct-link\" href=\"https://switowski.com/blog/how-to-benchmark-python-code/#timeit-is-just-fine-for-me\">#</a></h2>\n<p>In the end, I chose a very simple way of benchmarking: <code>python -m timeit -s &quot;setup code&quot; &quot;code to benchmark&quot;</code>. I don't have to use the <em>perfect</em> benchmarking method (if it even exists). . That would be necessary if I were to benchmark one piece of code and share the results with the world. I couldn't use a random, inefficient method of measuring and tell you &quot;this piece of code is bad because it runs in 15 seconds&quot;. You could use a better benchmarking tool, run it on a powerful computer and end up with the same code running in 1.5 seconds.</p>\n<p>Comparing two pieces of code is a different story. Sure, a good, reliable benchmarking methodology is important. But in the end, we care about the relative speed difference between the code examples. If my computer runs &quot;Example A&quot; in 10 seconds and &quot;Example B&quot; in 20 seconds, but your computer runs them in 5 and 10 seconds respectively, we can both conclude that &quot;Example B&quot; is twice as slow.</p>\n<p>Using <code>timeit</code> is good enough. It lets me separate the setup code from the actual code I want to benchmark. And if you want to run the same benchmarks on your computer, you can do this right away. You already have <code>timeit</code> installed with your distribution of Python. You don't have to install any additional library or set up Docker.</p>\n<p>Much more important thing than the most accurate tool is how you set up your benchmarks.</p>\n<h2 id=\"beware-of-how-you-structure-your-code\" tabindex=\"-1\">Beware of how you structure your code <a class=\"direct-link\" href=\"https://switowski.com/blog/how-to-benchmark-python-code/#beware-of-how-you-structure-your-code\">#</a></h2>\n<p>Running benchmarks is the easy part. The tricky part is to remember to write your code in a way that won't &quot;cheat&quot;. When I first wrote <a href=\"https://switowski.com/blog/sorting-lists/\">Sorting Lists</a> article, I was so happy to find that <code>sort()</code> was so much faster than <code>sorted()</code>. &quot;OMG, I found the holy grail of sorting in Python&quot; - I thought. Then someone pointed out that <code>list.sort()</code> sorts the list in place. So if I run my benchmarks, the first iteration will sort the list (which is slow), and each next iteration will sort an already sorted list (which is much faster). I had to update my article and start paying more attention to how I organize my benchmarks.</p>\n<h2 id=\"conclusion\" tabindex=\"-1\">Conclusion <a class=\"direct-link\" href=\"https://switowski.com/blog/how-to-benchmark-python-code/#conclusion\">#</a></h2>\n<p>Depending on your use case, you might reach for a different tool to benchmark your code:</p>\n<ul>\n<li><code>python -m timeit &quot;some code&quot;</code> for the simplest, easiest-to-run benchmarks where you just want to get <em>&quot;a number&quot;</em>.</li>\n<li><code>python -m timeit -s &quot;setup code&quot; &quot;some code&quot;</code> is a much more useful version if you want to separate some setup code from the actual benchmarks.</li>\n<li><code>docker</code> - while it looked like it did a better job separating my benchmarks from other processes, thus lowering the deviation between runs, after thorough testing, that seemed to be the case for very short examples. For longer ones it didn't really change much.</li>\n<li><code>rich-bench</code> looks like a nice solution if you need a dedicated tool with additional statistics like min, max, median, and nice output formatting. But you will need to set up your benchmarks in a specific structure that rich-bench requires.</li>\n<li><code>pyperf</code> gives you the most advanced set of statistics about your code. And it's used by the official Python benchmarks, so it's an excellent tool for advanced benchmarks.</li>\n<li><code>hyperfine</code> is a great tool to benchmark any command, not only Python code. Or to compare two different commands.</li>\n</ul>\n<hr class=\"footnotes-sep\">\n\n<ol class=\"footnotes-list\">\n<li id=\"fn1\" class=\"footnote-item\"><p>Ok, technically, I could print the current time with <code>time.time()</code>, run my code, print <code>time.time()</code> again, and subtract those two values. But, come on, that't not simple, that's rudimentary. <a href=\"https://switowski.com/blog/how-to-benchmark-python-code/#fnref1\" class=\"footnote-backref\">↩︎</a></p>\n</li>\n</ol>"
}