{
  "title":"Django Weblog: 2023 DSF Board Candidates",
  "date":"2022-11-16T02:36:01.000000Z",
  "author":null,
  "id":"https://www.djangoproject.com/weblog/2022/nov/15/2023-dsf-board-candidates-list/",
  "link":"https://www.djangoproject.com/weblog/2022/nov/15/2023-dsf-board-candidates-list/",
  "content":"Thank you to the thirty individuals who have chosen to stand for election. \n\nOur deepest gratitude goes to our departing board members for your contributions and commitment to the Django community.\n<ul>\n<li>Anna Makarudze</li>\n<li>Mfon Eti-mfon</li>\n<li>William Vincent</li>\n<li>Žan Anderle</li>\n</ul>\nDSF members please take the time to review the candidates so that you can make an informed vote. Clicking on a candidates name will expand their candidate statement.\n<hr>\n<strong>Daniel Andrlik</strong> <i>King of Prussia, PA, USA</i><br><small>Secretary</small><blockquote><p>I’m passionate about Django as a web framework, though my professional experience has been primarily in management roles. In addition, I’ve previously served on the board of directors for for non-profit transportation agencies for disabled individuals. As a result I both have experience with the internal processes of running a non-profit entity and also am passionate about outreach to historically disadvantaged individuals.  </p></blockquote><hr>\n<strong>Aaron Bassett</strong> <i>Florida, USA</i><br><small>President, Vice President</small><blockquote><p>It appears this year that several members of the board will be stepping down. It saddens me to see them go as I have really enjoyed serving with them over the years. The work they have done, mostly behind the scenes, has been vital to the ongoing success of Django and the community as a whole. I cannot thank them enough.<br>\n<br>I am also excited at the potential for new people to join the board. I can't wait to see what fresh ideas and initiatives they bring.<br>\n<br>As a previous VP and long serving member of the board I have a lot of experience and knowledge that I believe would be valuable to these new members. I am nominating myself so that I can provide some continuity and context to the board during this time of transition. </p></blockquote><hr>\n<strong>Peter Baumgartner</strong> <i>Colorado, USA</i><br><small>President, Vice President, Treasurer</small><blockquote><p>I've been a part of the Django community for over 15 years. I'm an open-source contributor, a regular speaker at DjangoCon US, and the co-author of High Performance Django.<br> In 2007, I founded Lincoln Loop, a web agency that leverages Django extensively in its work. Lincoln Loop has financially sponsored the DSF and DjangoCon for many years, and I'm looking for other ways to give back to a community that has given us so much.<br>\n<br>At Lincoln Loop, I have to wear many hats and deeply understand the financial ramifications of our decisions as a company. I believe the experience of running a business will be directly applicable to a position on the DSF board, and I look forward to applying that experience if elected.</p></blockquote><hr>\n<strong>Vicent Coll Borreda</strong> <i>Spain, Alicante</i><br><small>President, Vice President, Treasurer, Secretary</small><blockquote><p>I consider myself a very fun person who generates a good teamwork environment knowing when a smile is needed and when concentration and seriousness are needed, at the same time I always try to help my colleagues to be more proactive while learning. quickly from people better than me. Also, above all, I consider myself a problem solver.</p></blockquote><hr>\n<strong>Ryan Cheley</strong> <i>California, United States</i><br><small>Treasurer, Secretary</small><blockquote><p>As a member of the Django Software Foundation Board may goals are to:<br>\n<br>1. Ensure that applications developed using Django can be easily deployed by advocating for &quot;production settings&quot; as part of the &quot;batteries included&quot; aspect of Django<br>\n2. Make it easier to contribute to Django<br>\n<br>I have been using Django since 2018 and have contributed a couple of documentation updates to DjangoProject.com. \n<br>Additionally, I have made several contributions to DjangoPackages.org.<br>\n<br>I attended my first DjangoCon US in October of 2022 and I was inspired by the inclusive and welcoming people I encountered.  I would love to become more involved and find more ways to give back to this amazing community. \n<br>Ryan</p></blockquote><hr>\n<strong>Gajendra Deshpande</strong> <i>India</i><br><small>Vice President</small><blockquote><p>Hello Everyone, \n<br>I am Gajendra Deshpande, and I am using Python since 2013 for academic research and development activities. I develop prototypes and applications in Natural Language Processing, Machine Learning, Cyber Security, and Web applications using Python and its ecosystem. I am working as a faculty of Computer Science and run a start-up in cyber security. I am an active member of the PyCon India community and served as program committee lead for PyCon India 2021. I have presented approximately 80 talks, 20 Workshops, and 15 posters across the globe at prestigious conferences like DjangoCon US, DjangoCon EU, DjangoCongress Japan, PyData Global, PyCon APAC, PyCon AU, EuroPython, SciPy India, SciPy USA, PyCon USA, JuliaCon, FOSDEM, and several other Python and FOSS conferences. I have helped Python and FOSS Conferences by reviewing the talk and tutorial proposals, mentoring first-time speakers, participating in the discussions, and organizing the events. I am passionate about community work and would love to continue contributing to the Django community. I believe that as a member of the DSF board I can contribute to the community more effectively.<br>\n<br>Goals as a DSF board member (2023)<br>\n1. Start regional Django communities (especially in Asia and other regions) to spread awareness about Django. Introduce more people to the Django community and facilitate them to become contributors to the community in various capacities such as Speakers, Volunteers, and core Django developers.<br>\n<br>2. Work as a facilitator to start more regional Django conferences (e.g., DjangoCon Asia) and City level chapters in the Global South. I started the BelPy conference in 2021 which is a regional conference in Belagavi, India. I have Initiated the organization of Django conference and grow it to DjangoCon in Asia region like DjangoCon US and DjangoCon EU. The Django Conference is in the planning stage and will be organized in the last week of March or the first week of April 2023. Our university has agreed to host the same at no cost.<br>\n<br>3. Work with industries to develop Python/Django courses and enable the adoption of industry-aligned Python/Django courses in universities and colleges. These courses can be offered as a part of the curriculum wherever possible or as add-on courses. The goal is to make more people employable in a short time using the “Train-to-Deploy” approach. The courses shall be made available free of cost to the Python/Django community and especially for those who are suffering from economic hardships.<br>\n<br>4. Work with start-ups for adoption of Django in product development thereby encourage them to contribute towards and Python/Django community and DSF. \n<br>5. Create awareness among people regarding the activities of DSF, Python/Django conferences, Projects, and grants. Motivate and mentor people from diverse backgrounds to apply for grants and projects.<br>\n<br>\n6. Work with present DSF board members and actively contribute to the Django community especially in Global South to increase inclusivity and diversity.<br>\n<br>For more information about me kindly visit https://gcdeshpande.github.io/<br>\n<br>Thank you everyone for stopping by and going through my nomination. I ask for your vote, and I look forward to earning your trust to serve the Python community.<br>\n<br>Stay Safe. Take Care.<br>\n<br>Best Regards<br>\n<br>Gajendra Deshpande</p></blockquote><hr>\n<strong>Thomas Dignan</strong> <i>Edinburgh Scotland UK</i><br><small>President, Vice President</small><blockquote><p>Hello,\n<br>I am interested in running for the President or Vice President position of the Django DSF Board.<br>\n<br>I am currently managing director of Tracesense (Tracesense.com) and our main technology uses the Django Framework.<br>\n<br>Without the Django Framework we would not have such a great product to offer to our customers.<br>\n<br>Previously to running Tracesense I have senior management experience in the manufacturing industry from a variety of roles including IT Manager, Production Manager, H&amp;S Manager etc.<br>\n<br>When i discovered Django i fell in love with coding &amp; want to see it continue to develop and be used into the future.<br>\n<br>I can commit to minimum of the required time stated although when required I can commit more of my time.<br>\n<br>Thanks<br>\nTom<br>\n</p></blockquote><hr>\n<strong>Mohamed Amine Fouzai</strong> <i>Tunisia</i><br><small>President</small><blockquote><p>comunity improvment in tunisia ,developing new ideas and enhance django ecosystems</p></blockquote><hr>\n<strong>Jon Gould</strong> <i>United Kingdom</i><br><small/><blockquote><p>I have a long term involvement within the Django community in the UK. I first learned about Django in 2008 and have been involved in the community since. Rather than being a coder or technical, I am a recruiter. For the last 14 years, I have worked with companies and developers that use Django. I have hosted, run and attended Django meetups and conferences throughout this time. If elected to the board I have a lot of experience I can offer from a non-technical perspective to draw upon. I have a different way of thinking and a perspective from the outside.<br><br>\nI would be particularly interested in working on fundraising projects and increasing external understanding of what the DSF does and needs support with. I see this as working with sponsors/donors on behalf of the DSF to help raise awareness beyond the &quot;logo on the website&quot;. This is not necessarily about increasing the direct ROI for sponsors but appealing to the bigger organisations who use Django to encourage donations and tech support. I believe that everyone working with Django should contribute in whatever way they can to help improve Django for everyone. As an example, I have pledged to give 5% of my company's annual profits to the DSF.<br><br>\nAway from fundraising, I can see that participation in the DSF can be promoted further within the wider Django community. With over a million users of Django globally there is a missed opportunity to bring more people together to support the DSF and guarantee its future. Tech companies now routinely employ people specifically to work in DevRel/DevAdvocacy roles for their products. I don't think that employing someone via the DSF to do this is viable but there must be some members already who would be passionate enough to volunteer to do this on our behalf. I would also be interested in contributing in this area as a board member.<br> <br>\nI owe the success in my career to the Django community and see now as the perfect time to give back. I am in the early stages of building my own business and flexible with my time, allowing me to concentrate on projects that are important to me both personally and professionally. Being on the board of the DSF would be an honour and a privilege and I would work as hard on this as I would my own business. <br><br>\nTo add some context, over the years, I have helped over 250 Django developers secure roles and I have been involved and helped with the following groups/events.<br><br>\nDJUGL - (Django User Group London) co-organised, organised, sponsored and hosted consistently from 2010-2019<br>\nLondon Django Meetup - Regular attendee, promote through socials<br>\nDjango.Social - meetup group that I started earlier this year to bring people together regularly without the organising that a meetup takes. Simple, free and engaging meetups. Currently groups set up in London, Berlin, New York and Porto<br>\nDjangoDay Copenhagen 2022 - supporter and speaker (lightning talk)<br>\nDjangoCon Europe 2022 - Sponsor, attendee, Lightning talk and helped organise and run the conference party<br>\nLondon Python Meetup - Currently on the team of organisers, working to find sponsors, venues and speakers. Event re-launched this year.<br>\nReading Python Dojo - Host and Sponsor, I previously helped the Reading Python Dojo (2 years) by providing a venue and the refreshments.<br>\n</p></blockquote><hr>\n<strong>Kel Hanna</strong> <i>Durham, NC</i><br><small/><blockquote><p>I am a perpetual learner committed to improving workplace culture through the lens of human-centered organizational design. I connect dots. I set the table for decision-making. I help people build meaningful partnerships that expand cooperative collaboration and inspire creative action. I help humans get work done. \n<br>https://nervous-scallop-431.notion.site/The-Tesseract-s-Guide-for-Attempting-Tessellations-c7f9a9107593452a9e1cd8877eda448a</p></blockquote><hr>\n<strong>Irfan Harun</strong> <i>Ahmedabad, India</i><br><small>Secretary</small><blockquote><p>Django had been my bread and butter. Lives of people around me has been uplifted since I started working on Django. It only makes sense to give back to community in terms of knowledge, experience and\\n\\n time.</p></blockquote><hr>\n<strong>Jacob Kaplan-Moss</strong> <i>Oregon</i><br><small/><blockquote><p>Hi, I'm Jacob. I was one of the original maintainers of Django, and was the original founder and first President of the DSF. But I haven't been directly involved in Django for years: I haven't contributed code in like a decade, and I haven't been involved in the DSF since steeping down as President in 2010-ish. I'm feeling ready to get involved again, and I think joining the DSF board is a way I can be most helpful. I'd be coming back to the DSF with a bunch of experience in executive leadership and more experience working with nonprofits. I think I can apply those skills, along with my general knowledge of the Django community, to push things forward.<br>\nWhat that means, specifically, isn't entirely clear yet. I'd plan to spend the first months of my board term asking a bunch of questions and listening. I'd want to talk to our membership, our sponsors, members of the development community, etc., about what the DSF is doing well, what we could be doing better, and where we need to grow. Then I'd, you know, work on those things<br>\n<br>I have some hypotheses already: I think we could be better-supporting DjangoCons in the US and especially EU; I think we could be expanding our sponsorship base substantially; I think we could be supporting the Django Fellows in more ways; I think we could be expanding where and how we spend our funds to move the framework forward. But these are all hypoethesis; I'd want to validate that these are indeed useful lines of work before diving in.</p></blockquote><hr>\n<strong>Sanyam Khurana</strong> <i>New Delhi, India</i><br><small>President, Vice President, Treasurer, Secretary</small><blockquote><p>I've been a CPython bug-triager, contributor to Django and maintainer of djangoproject.com<br>\n<br>I was part of core-organizing team for PyCon India from 2016 - 2018, where I helped with logistics, venue selection, registration desk, website updates, etc. I've also volunteered and spoken at DjangoCon AU 2018, DjangoCon US 2018 and DjangoCon US 2022.<br>\n<br>I've been an individual DSF member since 2018. I'd like to work with DSF board. My idea is to provide mentorship opportunities to people who are willing to contribute to Django. I strongly feel that there are contributors out there, but many of them do not feel they have the skill-set to contribute to an open source project. Contributing to a very mature framework like Django is very intimidating and overwhelming for people who are looking to make their first-contribution. I think DSF board can provide mentorship programme to help people getting onboarded to the project and a safe space where their questions can be answered.<br>\n<br>I owe all my learnings to the community because what I've learned has always because of contributing to open source projects and I think being part of the board would be great learning experience for me, and hopefully I can help Django to move forward and give back to the community which is so supportive. In the first year, I would ideally like to be in a supportive role to understand the process from the people who are more experienced.<br>\n</p></blockquote><hr>\n<strong>Chaim Kirby</strong> <i>Maryland, USA</i><br><small>President</small><blockquote><p>It has been a privilege to serve on the DSF board for the last two years. I am running for another term because I still have goals that I want to realize for myself and the DSF.<br>\nOver the last two years serving a year as Secretary and another as Vice President I have worked to be a proactive member of the board. I take pride in having created the membership survey that recently circulated, so as to hopefully provide the next board steps towards a roadmap on how better to serve and integrate the DSF membership. I believe my most lasting contribution of the last two years will be the new staggered two year board terms that I proposed and drafted. It should act as a guarantee of continuation of institutional knowledge<br><br>\nBut there is so much more work to be done. If re-elected I would want to focus on three areas that I think are crucial for the long term health of the DSF and Django community.<br><br>\nFirst, I want to explore and implement a shift of the Board from a position of bureaucratic oversight to one of mission, vision, and governance. Everything the board and DSF does should be evaluated in the light of our state mission to Support and Promote the development and use of Django; to Protect the Intellectual Property and long term-viability of Django; and to Advance the state of the art in Web development. We have been especially lax in the Promote aspect of our charter.<br><br>\nSecond, I hope to expand the ranks of our membership. Not just for the sake of a bigger number, but because the DSF membership is our most dedicated individuals and the DSF’s first line of support for furthering our goals. Asking the same dedicated individuals for support will result in burn out and an empty bench when we are looking to a new generation of leaders and assistance in our mission.<br><br>\nThird, engage the growing membership with the work of mission, vision, and governance. Having more people able and comfortable contributing to the DSF and Django community is out best bulwark against falling into obscurity or irrelevance.<br><br>\nMy experiences to this point gives me the skill and confidence to believe that I am the right person to help the DSF achieve all of these things, and more. I know it takes more work than the hour long monthly board meeting, effort that I have and will continue to give. As an engineer of over 20 years I can contribute to the technical aspects a growing DSF will require. As a trained attorney I can support and informally advise the board on topics that touch legal areas. And as a current member of the Board I can provide institutional knowledge, continuity, and insight to the next board.<br><br>\nI hope that I have served you well my last two terms on the board, and I hope you believe that I deserve your vote for another term. Thank you\n</p></blockquote><hr>\n<strong>Marcelo Elizeche Landó</strong> <i>Paraguay</i><br><small/><blockquote><p>For this nomination I will like to cover a few things: My motivation, my background and what from my point of view will be good for improving Django the community.<br>\n<br>Motivation<br>\nIf I have to be honest before assisting to DjangoConUS I have never thought about the Django Community apart from the Python community. That changed for me when I saw this great community that supports their members but also tries to make any newcomer (as I was) as welcomed as a longtime member.<br>\nA few Django Community members suggested that I should run as a board member and I thought that could be interesting to help the community in any capacity. Also not many people know about and how wonderful this community is and I'd like that to be known worldwide and I think I can help with that :)<br>\n<br>\nI feel awkward nominating myself [0,1] as a Board Member for the Django Software Foundation, so I asked some friends from the Python community in Paraguay to help me write about myself for my background, so here we go:<br>\n<br>Background:<br>\nI’m the co-founder and organizer of the Paraguayan Python community. In 2015 I co-organized the first PyDay in Paraguay, which was a rotund success [2] (seriously, see those pictures!), and started the community's momentum.<br>\n<br>Since then, I have organized dozens of community events all over the country [3], as well as workshops [4]. My efforts have not only consolidated the community, but also turned it into the most successful and active community to date in Paraguay [5], with over a thousand members (no small feat for a small country).<br>\n<br>Besides these efforts, I helped popularize Django as a tool for social activism. I’m the creator of AyudaPy [6], a platform that enabled thousands of Paraguayans to help each other during the worst of the COVID-19 pandemic [7,8,9] and I gave a talk about this project at DjangoConUS 2022. I’m also the creator of ListaHu [9](also made with Django), a platform that helps people protect their privacy and assets from extortionists and scammers using crowdsourcing [11]. I’m also the co-creator of AireLibre [12], a community-managed network of air quality sensors.<br>\n<br>Improving Django:<br>\n<br>* I think one of the main issues with Django adoption is the learning curve, there's so many different external tutorials for but the official tutorial is kinda of basic. I would like help to create a few other django tutorials from what I learnt in the first one so Django is not intimidating for newcomers.<br>\n<br>* Another thing that could make the Django experience better is at least suggesting a few deploy strategies so newcomers can have a full picture of what it means to successfully deploy a Django Application in production.<br>\n<br>* After you manage to use and understand one of Django's issues that sometimes is difficult is to get a Job using Django, one thing that could help is create a new Job Posting board with “better” data as: compensation, salary range and required level.<br>\n<br>* From the top of my head I would think that the Spanish documentation is great(and it is) but probably we’re not sure how great it is for other languages, for that I would love to add to the Django Developer Survey this kind of data: Preferred or used Language, locale, and how good the documentation is in the native language of the developer. Knowing what to fix and where to ask for help is the first step for improving.<br>\n<br>I think that the current path of this community is the right one and I would be so honored if I have the chance to contribute to this community as a board member.<br>\n<br>Refs:<br>\n0. marce@melizeche.com<br>\n1. https://melizeche.com<br>\n2. https://elblogdehumitos.com/posts/pydayasuncion-un-exito-arrollador/<br>\n3. https://www.meetup.com/Python-Paraguay/events/past/<br>\n4. https://twitter.com/melizeche/status/1114298187395883008<br>\n5. https://t.me/pythonparaguay<br>\n6. https://ayudapy.org<br>\n7.https://cienciasdelsur.com/2020/04/14/covid-19-web-permite-conseguir-alimentos-y-medicamentos-a-miles-de-paraguayos/<br>\n8. https://www.youtube.com/watch?v=XK-tqP57tS8<br>\n9. https://www.youtube.com/watch?v=8msEDu9lCxU<br>\n10. https://listahu.org<br>\n11. https://us.pycon.org/2018/schedule/presentation/234/<br>\n12. https://airelib.re<br>\n<br>\n</p></blockquote><hr>\n<strong>Mariana Bedran Lesche</strong> <i>Recife, Brasil</i><br><small>Secretary</small><blockquote><p>I've been part of the Python community in Brazil since 2008 when I started to attend the coding dojo sessions in Rio that year. Programming was a hobby for me for a long time until I decided I didn't want to work as a teacher anymore and looked at coding as an alternative to my career. After changing professions I got more involved with the Python community and got the chance to attend more conferences as my income grew. I've given talks in local, national and intenatinal events and I have been a volunteer in some events. I worked as an instructor in a Django Girls tutorial, I helped organize a regional Python conference in Brazil (Python Nordeste 2019), I was part of the Django Con Europe 2021 content selection group and this year I've been part of the work group responsible for the financial aid for the Python Brasil conference. I've only started in this area because of the time and effort other people dedicated to this community, so I think it's only fair that I give some of that back by keeping this community moving.<br>\n<br>In the last few years we've seen great changes in the Brazilian Python community. We have more people from underrepresented groups each year in our local and national conferences and groups. I'd like to bring some of that experience to help the Django community to reach more people.</p></blockquote><hr>\n<strong>Oscar Martin Cortez Martinez</strong> <i>Nicaragua/Colombia</i><br><small>Vice President, Secretary</small><blockquote><p>I've been thinking a lot about this, and when I look back in my time I see the Django version 1.3 with the cherry views package and how much my life and the Django ecosystem has changed since that moment until today. I own more to Django, than what I can offer to itself, but then I think this opportunity will be a good moment for me to return something to the Django project and the community.<br>\n<br>Coming from a country under development has taught me from the first hand what people needs in order to succeed in their career, and how harder is to start and achieve something. If I have the opportunity to join the DSF I'll work harder to improve the relation between Latin America communities and the DSF, help make the DjangoCon more accesible to under represented groups with initiative such as DjangoCharlas, and as well produce more localized content to enhance the skills of newcomers developers. </p></blockquote><hr>\n<strong>Nyasha Matongo</strong> <i>Zimbabwe</i><br><small>Secretary</small><blockquote><p>I'm a Django enthusiast. I love volunteering for django coding classes and teaching students around the continent on the benefits of Django. </p></blockquote><hr>\n<strong>Katie McLaughlin </strong> <i>Melbourne, Australia</i><br><small/><blockquote><p>I have previously served on the DSF (and PSF), and would like to offer my service to help continue to not only keep the lights on, but also help enable those from the community who wish to enact change in how the DSF does things. \n<br>I am a previous DjangoCon keynote, speaker, organiser and volunteer across EU, US, and AU.<br>\n<br>Bias disclaimer: I am a developer advocate for Google Cloud, working with Python, Django, and Serverless. My unsuccessful nomination to the board will not preclude me from continuing my advocacy. Depending how voting is run, do not vote for me if you feel other under-representative voices should be heard. I have served time on the DSF, others should get the chance above me. </p></blockquote><hr>\n<strong>Paolo Melchiorre</strong> <i>Italy</i><br><small>Vice President</small><blockquote><p>I’ve been a Django developer for more than 10 years, in which I’ve contributed in various areas: documentation, code, website (in particular full-text search) and Italian translation. I’ve presented a lot of Django talks in meetups and conferences, including DjangoCon. I’ve organized and participated in many sprints on Django. I’ve written many articles on Django and I’m a promoter of Django online. I participated as a coach in DjangoGirls workshops and I’m organizing one in my city.<br>\n<br>Each of these activities has made me grow as a developer, community member and human being and I think serving on the DSF board can be a way to give back to the Django community what I have received.<br>\n<br>As a member of the DSF board I’d like to bring a different point of view, close to newcomers, who live and work in small realities and who do not speak English as their first language or do not speak it at all. I’d like to work to remove some language and cultural barriers that still remain for some members of the community. I’d like to give a boost to the development of great new features with the organization of Sprint dedicated to Django code. I’d like to increase collaboration with the Python community and create synergies with other sub-communities to make Django grow again on the web.</p></blockquote><hr>\n<strong>Kátia Yoshime Nakamura</strong> <i>Berlin, Germany</i><br><small/><blockquote><p>I would like to be reelected to continue contributing with the DSF Board. I've been part of the DSF Board since 2020 and the last 3 years brought us many challenges. I want to bring more ideas to continue supporting our community - bringing more diversity and inclusiveness. Besides that, I'd like to help establishing a long term plan for the Django Conferences (specifically in Europe but hopefully beyond that) as the the DjangoCon liaison.</p></blockquote><hr>\n<strong>Renato Oliveira</strong> <i>Recife, Brazil</i><br><small/><blockquote><p>I've been part of the Python community since 2010. Helped organize dozens of local group meetings and one edition of Python Brasil (Brazilian PyCon) in 2014 while serving on the Associação Python Brasil (Brazilian PSF) board. I owe most of my professional achievements to the Python and Django community, and I'd like to give back to the community. Also, something I'd like to see is more Django Conferences around the world. It is a privilege to travel abroad, so I'd like to help foment conferences in other continents so more people can experience what just a few of us can.</p></blockquote><hr>\n<strong>Carewen Owen</strong> <i>Edmonton, Canada (moving to the UK early 2023)</i><br><small/><blockquote><p>During my time with using the Django web development framework, I have encountered many examples of the best of the Open Source spirit. I have received help from other more experienced Django developers in learning how to unlock the potential of this outstanding framework. With this in mind, I am motivated to put my name forward to serve on the DSF Board.<br>\n<br>I would like to highlight my experience as both a Volunteer Instructor and Trainer with the Board Development Program (Alberta, Canada): https://www.alberta.ca/board-development-program.aspx. More specifically, I have experience in educating Not For Profit Boards in governance best practices in evolving from good to great, and have served on a number of Boards. \n<br>In contemplating whether or not to put my name forward, I engaged in a brief assessment of the DSF based on externally available information and email exchanges with the current DSF Board. Through this I learned of plans to lay out a &quot;path from a wholly volunteer-run organization to something more formal with actual paid staff.&quot; I can think of no better time for the quality of DSF's governance to be given attention than this; for such a path can only benefit from the evolution of the DSF's Board governance practices.<br>\n<br>It is often the reality that Board members are asked to do much with little. Great Not For Profit governance is the unsung hero of many a meaningful endeavour. However, with this self-nomination I am not only offering a high-level plan for consideration and discussion, but I am also putting my name forward to do the legwork to help organize and make this happen. \n<br>However, evolving, improving, Board governance is not a solitary endeavour. The reality is, even though I will happily do much of the legwork there will be a need for others to collaborate, and for the Board as a whole to receive recommendations and ratify what is to be done. And yet, I have confidence that good people always find a way to make great things happen.<br>\n<br>To help with understanding what I am proposing I am including a draft high-level plan for what I propose is required. Should the DSF Membership vote for me to become a Board member I will be proposing the following:<br>\n<br>1) Create a Terms of Reference (ToR) policy for committee formation and reporting. ToRs provide clarity for:<br>\n- The type of committee (Standing/Sub-committee/Ad hoc) and its general purpose<br>\n- Committee composition and meeting schedule<br>\n- Committee resource allocation<br>\n- Specific committee objectives, including reporting target dates<br>\n- Committee evaluation process<br>\n- And finally, key duties and responsibilities (authority/reporting)<br>\n<br>\n2) The DSF Board strike a &quot;Governance Evolution and Maturation&quot; Committee (GEM):<br>\n- The first committee to utilize the newly formed ToR Policy would be the GEM Committee<br>\n- GEM would be given the authority to, Investigate and report on the current DSF Governance structure, and to take action as ratified by the DSF Board<br>\n- As a DSF Board member I would be willing to chair this committee.<br>\n- I recommend a total of 3-5 volunteers for this committee with experience in Board governance best-practices, organizational development, and/or change management<br>\n<br>\n3) Implement the first-year GEM plan. While it is very early to offer more than a high-level plan, and I have barely scratched the surface through preliminary analysis, I offer the following to support discussion:<br>\n- Review existing DSF bylaws<br>\n<br>- Draft a DSF Policy framework:<br>\n- - For those conversant with such matters I would pull upon my past experience with Alberta's Board Development Program's framework. This framework has the following sections:<br>\n- - - Purpose: Who the DSF is and what it intends to do (Purpose/Vision/Mission)<br>\n- - - Board Self-Governance: How the Board governs and assesses itself<br>\n- - - Progress: How things get done, operations, budgeting, people<br>\n- - - Identity: How the Board communicates with the membership/community and advocates for its Purpose, Vision and Mission<br>\n- - This activity would pull together various existing policies into a central organized body, and identify new policies to be brought forward to the Board<br>\n<br>- Identify information management requirements and evaluate existing information management within the DSF for the purpose of bylaw and policy availability:<br>\n- - Not only does documentation need to be accounted for, but also management of this information needs to be reviewed<br>\n- - If there is an existing DSF Committee engaged in such activity I would recommend collaboration between the two committees (no need to re-invent the wheel or blur GEM's mandate)<br>\n<br>- Provide internal consulting to other DSF Committees in drafting and presenting their ToR to the DSF Board<br>\n<br>\nI would anticipate that the first year could see great progress. While the above list may seem complex, I also bring experience and resources to train those who have interest in volunteering with the GEM Committee as necessary. \n<br>I believe that the DSF currently has a good foundation for its future evolution. My proposal is that we now engage in an effort to take it from good to great! \n<br>Thank you for your consideration.</p></blockquote><hr>\n<strong>Vishvajit Pathak </strong> <i>Pune, India </i><br><small>President, Vice President, Treasurer, Secretary</small><blockquote><p>I have been using python for all my professional life( &gt;10y). My startup marsdevs.com runs on python so it's time for me give it back to the community. </p></blockquote><hr>\n<strong>Kuldeep Pisda</strong> <i>Raipur, CG, India</i><br><small>Treasurer, Secretary</small><blockquote><p>I have been a django develoepr for the past several years, and am a fan of the Django in general. I have been an advocate of open source softwares, and would love to be a part of the journey of the Django framework. If selected I would love to spend some time focusing on the promotion, growth and development of the Django Developers across the globe.</p></blockquote><hr>\n<strong>Ed Rivas</strong> <i>El Salvador</i><br><small/><blockquote><p>Django means a lot to me. It single handedly got me into programing in general and Python specifically over a decade ago, and it stands in my mind as THE model of what a healthy open source community looks like.<br>\n<br>I've been a DSF member for a while, but after the latest djangocon US and careful consideration I believe it's time for me to take a more active role in the advancement of Django and its community around the world. I'm not interested in a particular seat on the board but would love to help realize new initiatives such as a mentorship program, new sponsorship opportunities, and a renewed focus on the Spanish speaking community</p></blockquote><hr>\n<strong>Cagil Ulusahin Sonmez</strong> <i>London/UK, formerly Istanbul/Turkey</i><br><small>President, Vice President</small><blockquote><p>I have started using Django since its early days (~2008) and have been building Django/Python apps since.<br>\n<br>Between 2015-2018, I have co-organised more than 10 DjangoGirls events in Istanbul and other cities in Turkey. I learned a lot being part of the DjangoGirls community. For this reason, I am trying to give back to the community. That is also one of the reasons why I started co-organising the London Django Meetup since 2018. Also I'm happy to be part of the organiser team of the first-ever PyCon Turkey too. PyCon Turkey happened with the help of the Django community supporting the idea in the DjangoCon Europe 2019.<br>\n<br>I regularly attend DjangoCons and different Python conferences and volunteer as much as I can. Attending conferences was a privilege I got after moving to the UK. I want to share that privilege with those communities who cannot attend the events, mostly due to financial reasons. Thus, I am also very interested in supporting the funding of open-source projects and looking forward to supporting DSF as a board member and working on grants, reports, and improving the corporate sponsor experience/relations. \n<br>Another topic is diversity. I think the best way I can help increase diversity is by being more present as an underrepresented gender and member of a minority group. \n<br>We need to make sure we have more role models from underrepresented groups. I believe that is the key to increase the diversity within our communities. So one of my motivations for joining the board is to work on diversity and inclusion within the community. The support of DSF and PSF plays a crucial role for many local communities and the individuals within those groups. (I experienced that firsthand as one of the members of the local Turkish Django community.)<br>\n<br>I believe our Django (and Python) community is very special. We are better when we are working together, sharing, and supporting each other. I am hoping we can make every individual member of the community feel included.</p></blockquote><hr>\n<strong>Arsalan Wahidi</strong> <i>Afghanistan</i><br><small>Treasurer, Secretary</small><blockquote><p>I am welling to work abroad.</p></blockquote><hr>\n<strong>Carina C. Zona</strong> <i>Europe</i><br><small/><blockquote><p>The extent of warmth, generosity, and inclusiveness in Django community stands out among open source communities. Django Software Foundation is at its best when it serves as a champion for the good ideas percolating up from this global community's members and connects budding organizers with transformative resources such as information, referrals, funding, mentorship, partnerships, and moral support. My goal is to work on strengthening DSF's capacity to provide seed resources sustainably.<br>\n<br>This would be my first year on DSF's board, so my initial agenda is to build on momentum developed by the previous board, while helping DSF solidify its role as a stable source of assistance for grassroots Django communities around the world. What I would bring to that: (a) commitment to upholding the spirit of Django's welcoming culture, and (b) decades of experience in supporting and promoting open source community development, diversity and inclusion, nonprofit fundraising, and empathetic leadership. This is work that I am passionate about anyway, and here it is opportunity to pay forward the kindness this community has always shown me.</p></blockquote><hr>\n<strong>Cory Zue</strong> <i>Cape Town, South Africa</i><br><small>Vice President, Treasurer, Secretary</small><blockquote><p>I'm applying to the board because I saw a tweet that I thought perfectly applied to me.[1] Django has been invaluable in my career and I would love the opportunity to give back to the project with my time and skills. \n<br>While I've never contributed to the Django codebase, I have been involved with Django and the community for more than 10 years. I was CTO for 11 years of the technology startup and social enterprise, Dimagi[2]. While at Dimagi, I ran the team that built what is (to my knowledge) the biggest open-source Django application in the world[3], as measured by code contributions. I currently earn a living working for myself building my own software products with Django[4], or for the Django ecosystem[5]. It would not be an exaggeration to say that I currently rely on Django for the overwhelming share of my income and success.<br>\n<br>What would I bring to the board? Hopefully quite a lot.<br>\n<br>First and foremost, I’m an avid Django user. I understand what it’s like to build web applications with Django as well as anyone. This means I know who the Django stakeholders are, which makes it easier for me to reach, understand and communicate with them.<br>\n<br>I also know how to work with people. While leading a team of 30+ people I learned how to work with different personalities, build consensus, and make difficult collaborative decisions. My experience stewarding a large open-source product means that I understand how to build and nurture communities of developers. More recently I’ve focused more on writing (including creating educational content for Django developers[6][7]), which should help with any DSF communications that need to go out. \n<br>And I understand the non-technical aspects of organizations. My work as an executive at a 200-person company, as well as running my own small businesses, have exposed me to many other aspects relevant to the DSF, including finances, fundraising, marketing, and governance.<br>\n<br>Finally, because I currently work for myself and have a good amount of independence, I'm confident I will be able to make the time to invest in the DSF however I can be useful. I control my own time, so when I commit that time to support this board, I know I’ll be able to deliver on this commitment. I’ve been actively looking this past year for ways to use my time to “give back” to my communities - and serving the Django software community would be a great way for me to do so.<br>\n<br>To some extent my personal success is tied to the success of Django, which makes me strongly incentivized to do what I can to ensure the continued success of Django. I’d be happy to do that in whatever capacity the DSF thinks would be useful.<br>\n<br>Thanks for your consideration. :)<br>\n<br>[1]: https://twitter.com/jacobian/status/1583162695309631488<br>\n[2]: https://www.dimagi.com/<br>\n[3]: https://github.com/dimagi/commcare-hq<br>\n[4]: https://www.placecard.me/<br>\n[5]: https://www.saaspegasus.com/<br>\n[6]: https://www.saaspegasus.com/guides/<br>\n[7]: https://www.youtube.com/watch?v=bz33cFQIC9Q<br>\n</p></blockquote><hr>"
}