{
  "title":"Lex and Ius in Football",
  "date":"2022-11-14T16:39:27.000000Z",
  "author":null,
  "id":"https://iusetiustitium.com/?p=1856",
  "link":"https://iusetiustitium.com/lex-and-ius-in-football/#utm_source=rss&utm_medium=rss&utm_campaign=lex-and-ius-in-football",
  "content":"\n<p>What do you do in an official sporting event when something patently unfair happens? As it is football season in the US, I thought we could use a famous play as a light-hearted and enlightening example about <em>lex</em>, <em>ius</em>, the common good, and statutory interpretation. Now, I should be clear at the outset that judges and referees are not exactly the same. Referees are tasked with determining violations of the rules, and those rules are set based on the good of the game, not necessarily the good of the players involved. The referee also typically has little discretion about the implementation of those rules. Nevertheless, as the following story shows, on some occasions even referees look beyond the mere rules of the game.</p>\n\n\n\n<p>Our story concerns the 1954 Cotton Bowl played between the mighty University of Alabama Crimson Tide and my <em>alma mater</em>, the lowly Rice University Owls. The Rice Owl football program has not had much historical success. At one time the Owls went 45 years—1961 to 2006—without earning a berth to a postseason bowl games. In 1962, when President John F. Kennedy announced that the US manned space program would send a man to the Moon, he gave the speech at Rice Stadium in Houston, Texas. As part of that speech, Kennedy asked rhetorically, “But why, some say, the Moon? Why choose this as our goal? And they may well ask why climb the highest mountain? Why, 35 years ago, fly the Atlantic? <em>Why does Rice play Texas?</em> We choose to go to the Moon. We choose to go to the Moon in this decade and do the other things, not because they are easy, but because they are hard.” So, yes, Rice has a bit of a reputation for historical football futility.</p>\n\n\n\n<p>That was not the case in 1953, however, when Rice went 9-2 and won the Southwest Conference championship. On New Year’s Day in 1954, Rice played in the Cotton Bowl in Dallas, Texas against the champions of the Southeastern Conference, the Alabama Crimson Tide. Rice running back Dicky Moegle* turned in the game of his life, rushing for 265 yards and 3 touchdowns on <em>11 carries.</em> (That’s an average of 24.1 yards per carry. For our international readers to understand how much this is, the current season’s leading individual rusher’s average is 7.5 yards per carry.)</p>\n\n\n\n<span id=\"more-1856\"></span>\n\n\n\n<p>The most famous run came in the second quarter, when Rice had the ball on its own 5 yard line. Moegle took the handoff, broke around the right side, and dashed up the sideline in front of the Alabama bench. Moegle had a mostly clear path to the end zone, although one or two Alabama players probably could have caught him. But at about the Alabama 45-yard line, Alabama’s Tommy Lewis, who was sitting on the bench, came off the sideline and made a surprise blind tackle on Moegle, leaving him sprawled out at about the 40 yard line. Lewis sheepishly snuck back onto the sideline and sat on the bench with his head in his hands. In interviews after the game, he was profusely apologetic to Moegle, saying later that he “was just too full of Alabama” to let Moegle run roughshod over the overmatched Crimson Tide defense.</p>\n\n\n\n<p>So back to our question—what happens when something patently unfair occurs? In this case, there is a proper penalty—a penal law, you might say—to assess against Lewis. It would be illegal participation, a 5-yard penalty that would have left Rice with the ball at about the 40 yard line. But that penalty would certainly not fit the inequity of what occurred. A man clearly not involved in the game at the time came off the bench and tackled Moegle. When the drafters of the football rulebook considered “illegal participation” a 5-yard penalty, surely this was not what they had in mind.</p>\n\n\n\n<p>The referees conferred and decided that, for the good of the game and fair play, Moegle would be awarded the touchdown rather than just assessing the illegal participation penalty. This is despite the fact that at least one other Alabama player could probably have tackled Moegle or pushed him out of bounds before reaching the end zone. And so Moegle was given credit for a 95-yard touchdown rush, which counted towards his official statistics for the game. As one newspaper put it afterward, it was the first time “where a runner received credit for a touchdown while flat on his back 38 yards from the goal line.”</p>\n\n\n\n<p>If we think of the head referee as a judge making a legal decision for applying a statutory rule, what mode of legal analysis most persuasively supports the referee? It is not “textualism”–either the referee awarded a plainly improper remedy for the penalty of illegal participation, or the referee acted on the basis of no written rule at all. Is it “originalism,” in the sense that one must look to the meaning of the rule drafters? Perhaps one could say that what Lewis did was not actually illegal participation as the rule drafters intended–but then, the rulebook would be silent on the matter, and there would be no rule covering Lewis’ illegal tackle. This leads to the same place as wooden textualism. Perhaps one could argue that the <em>intent</em> or <em>purpose </em>of the expressed rules of the rulebook was to promote the general rule of fair play, but even under such an intentionalistic or purposivistic analysis, we have little guidance on how Lewis’ tackle should be punished. For example, no other penalty in the rule book allows the referee to award a touchdown when the player was tackled 38 yards from the goal line. Finally, one could make a guess at what the rule drafters would have done in such a situation, but unless one relies upon a commonly held background morality about the sense of fair play in football, there is no way to make that determination or to determine the right penalty. Therefore textualism, originalism, intentionalism, purposivism, and dynamic interpretation all fail to provide a convincing account for the referee’s decision to award Moegle the touchdown.</p>\n\n\n\n<p>But the classical natural law concepts of <em>lex</em>, <em>ius</em>, and the common good come to the rescue. In essence, what we have here is a play where the official rules, the <em>lex</em> of American football, did not account for a unique and unforeseen action on the field that violated the background sense of fair play, integrity, and the common good of the game, the <em>ius</em>. There was a rule that did literally fit the definition of the play, but that no one watching the game would have agreed would be a proper penalty for Lewis’ actions. Therefore, the referee took it upon himself to step outside the rulebook and award what was in his mind the most just result—Moegle would be given credit for the touchdown run. Moreover, this decision acts as a deterrent against similar such actions. If a player knew that coming off the bench to tackle a player on a clear scoring play would result in only a 5-yard penalty, there would be no reason not to do that. The referees in this instance acted like a judge turning to the natural law to fill in the gaps where the positive law would have generated an unjust result. That background law relied upon the common moral understanding of those involved in the game to recognize what was clearly unfair in view of the good of the game. </p>\n\n\n\n<p>Today, as a result of the famous “Bench Tackle,” the official college football rule book now states that in the event of a “palpably unfair act,” the referee may award a penalty he believes is most fitting to address the injustice. The <em>lex</em> now expressly implements the <em>ius</em>, but even in 1954, the referee enforced the sense of the <em>ius</em> where the <em>lex</em> failed to provide a reasonably just result.</p>\n\n\n\n<p>Behind Moegle’s sensational game, Rice beat Alabama 28-6. Until 2017, Moegle’s 95-yard touchdown-that-wasn’t was the longest play from scrimmage in Rice history—a fitting result for a school known as much for its students’ quirky sense of humor as for athletic success. Meanwhile, as Rice subsequently went through decades of futility, Alabama became a powerhouse, claiming 13 national titles since 1954. But as I like to remind my friends who cheer on the Tide, Rice is 3-0 all-time against Alabama–the only team to play Alabama multiple times without a loss. Sometimes the last shall be first, even in the crazy business of college football.</p>\n\n\n\n<p>Ultimately, while it is not correct that judges are like referees, merely calling balls and strikes, sometimes referees must act like judges: implementing the rules the best they can, but turning to background principles when those rules would operate an injustice against the game. Perhaps Chief Justice Roberts spoke truer than he knew.</p>\n\n\n\n<p>*<em>Moegle is pronounced with a long “a,” like “Maegle,” the spelling to which he later changed his name. As the newspaper reports and playing records use “Moegle,” I have kept that spelling here.</em></p>\n\n\n\n<p><em>You can see Tommy Lewis’ Bench Tackle below.</em></p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-4-3 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<div class=\"jetpack-video-wrapper\"></div>\n</div></figure>\n\n\n\n<p></p>\n"
}