{
  "title":"The Common Good As A Legal Concept",
  "date":"2022-11-16T14:15:38.000000Z",
  "author":null,
  "id":"https://iusetiustitium.com/?p=1880",
  "link":"https://iusetiustitium.com/the-common-good-as-a-legal-concept/#utm_source=rss&utm_medium=rss&utm_campaign=the-common-good-as-a-legal-concept",
  "content":"<p><em>What follows are unedited remarks, without footnotes, delivered at the Abigail Adams Institute’s colloquium on the common good, held at Harvard University on Thursday, November 10. Thanks to the organizers and to fellow speakers Fr. Jeff Langan, Mary Hirschfeld, and Darel Paul.</em></p>\n<hr>\n<p>I’ll talk today about the common good as a <em>legal</em> concept. And I hope you can hear in my voice that legal is in italics. That is, I’m going to sketch with criminal celerity the more distinctively legal side of the classical tradition and say a few words in praise of the civilian jurists as opposed to the philosophical and theological side of the tradition.</p>\n<p>Let me begin with a simple point that the book emphasizes, but which some of the commentators have overlooked, although others have not. “The common good” in the legal sense is not to be seen, at least not solely, as an external concept, that the analyst uses to justify or evaluate the legal system. Rather, it is a concept used by actors <em>within</em> the system. And it is an absolutely ubiquitous concept. Indeed, it is often literally embodied in the language of enacted provisions and judicial doctrines. Lawyers have constantly to construe provisions or work with doctrines that refer in terms to “the common good,” “the public interest,” “the general welfare,” or similar terms. (I follow the comparativist Elisabeth Zoller’s analysis of the concept of <em>res publica</em> in treating these versions of the common good as relatives and cognates of one another).</p>\n<p>In order to illustrate how lawyers have to work with the common good as a concept within the legal system, I’m going to begin by introducing some provisions, and even cite some cases, to provide a few scattershot examples from around the law and its history, at all levels of legal systems (and these examples could be multiplied almost indefinitely). So buckle up everyone, it’s going to be a wild ride.<span id=\"more-1880\"></span></p>\n<p>At the level of constitutional provisions, the Massachusetts Constitution of 1780 is the world’s oldest functioning written constitution and was often cited as a model for the federal Constitution. And the Massachusetts Constitution specifies both that “all shall be governed by certain laws for the common good,” and that “[g]overnment is instituted for the common good, for the protection, safety, prosperity, and happiness of the people, and not for the profit, honor, or private interest of any one man, family, or class of men.”</p>\n<p>Following suit, the United States’ federal Constitution of 1789 both specifies in its preamble that one of the master aims of the Constitution is to “promote the general Welfare,” and grants Congress the power “To lay and collect Taxes, Duties, Imposts and Excises, to pay the Debts and provide for the common Defence and general Welfare of the United States.” The interpretation of these provisions has been and still is contested. Although the Supreme Court interpreted the second narrowly in 1936, during its ill-fated resistance to the New Deal, the originalist credentials of that interpretation are, ironically enough, highly debatable. For those interested, I would recommend recent scholarship on the general welfare clause(s) by David Schwartz at the University of Wisconsin.</p>\n<p>The general welfare language in the U.S. Constitution influenced provisions around the world. It has well-known connections to the famous Polish constitution of 3 May 1791, often called the first written constitution in Europe, which specifies that it is made, among other aims, “for the general welfare.” These and related provisions also had a profound influence on 19th-century constitution-making in Latin America and on pan-American framework treaties and instruments to which the United States is a signatory (whether or not the Senate has ratified them). Thus the preamble of the Constitution of Argentina specifies that one of the purposes of the federal or national government is to “promote the general welfare,” and, in a Schwarzian interpretation, the Argentine Supreme Court once held that the General Welfare clause of the Argentine Constitution confers on the the federal government a general source of authority for national legislation. So too, the American Convention on Human Rights specifies that “The rights of each person are limited by the rights of others, by the safety of all, and by the just demands of the common good.”</p>\n<p>At the level of statutes, in the United States, the Federal Communications Act of 1934 gave the Federal Communications Commission sweeping regulatory powers to act in “the public interest,” using that phrase no less than 102 times. Similar organic statutes are everywhere in American public law; taken together, as I argue elsewhere, they amount to no less than an American version of the classical <em>lex regia</em>, transferring broad authority to the executive and the administrative agencies to make rules with the force of law.</p>\n<p>At the level of judge-made legal doctrines, consider, as one example chosen nearly at random, the four-part test for the granting of a preliminary injunction by a federal court, of which the last part is whether granting an injunction is in “the public interest.” As that and the other examples show, the public interest is often invoked *within* adjudication or legal interpretation.</p>\n<p>As the book tries to show, these provisions, doctrines and principles draw upon even more ancient sources, going right back to the origins of European law, sources such as the <em>Etymologies</em> of Isidore of Seville in the 7th century, which says that laws properly so-called are formulated “for no private benefit, but for the common well being (<em>communis utilitas</em>) of the citizens.” It is probably a fruitless exercise to try to locate the ultimate source of such ideas, like a deranged explorer searching for the origin of the Nile. But one location that must be mentioned here, a profoundly influential source, is Papinian’s injunction, later recorded in the opening book of the <em>Digest of Justinian</em>, that the ground for the validity of the <em>ius honorarium</em>, the legal principles and doctrines developed by magistrates called praetors, is that it serves the public interest, the <em>utilitatem publicam</em>. As Papinian puts it (in Alan Watson’s translation), “praetorian law is that which in the public interest the praetors have introduced in aid or supplementation or correction of the <em>jus civile</em>.” And this basic approach becomes a standard too for civilian lawyers, not just in the Republic but throughout the Principate, the Dominate, and the medieval <em>ius commune </em>and into the Ango-American law<em>.</em></p>\n<p>The examples are quotidian and on the ground level of the law. Suppose ship cargo has to be jettisoned in a storm to save the ship—where should the loss fall? The <em>Digest</em> tells us that “[t]he Rhodian law [of the sea] provides that if cargo has been jettisoned in order to lighten a ship, the sacrifice for the common good must be made good by common contribution.” Is a sentence of punishment suspended pending appeal? Generally yes, except as to “persons whom it is in the public interest to punish immediately on condemnation, such as notorious brigands or stirrers of sedition or leaders of gangs.” So too, the praetor will, in the public interest, give fourfold damages against those who engage in looting after a fire or natural disaster. And so forth. The jurists spend a decent chunk of their time making the common good concrete, workable, and sensible.</p>\n<p>As the book argues, the best current analogue for this work of the praetors, the imperial bureaucracy, and the imperial and medieval jurists in aiding, supplementing or correcting the baseline civil law in the public interest is the work of the administrative state. Like the praetors, magistrates without the formal power to enact statutes who nonetheless spoke with the force of law through interpretation and supplementation of statutes, so too our agencies interpret, enforce, and supplement the law under broad delegations from Congress. Like the <em>ius honorarium</em> of the praetors, the rules made by the administrative state are the “living voice” of our law.</p>\n<p>What is the larger significance of these provisions, legal doctrines, cases and juristic arguments? You will notice some names that haven’t appeared in my talk so far: Aristotle, Aquinas, Heinrich Rommen, Charles De Koninck, John Finnis, and so forth. It is not that I do not respect these figures; on the contrary, I have the deepest respect and admiration for them, especially for the Angelic Doctor. But I do mean to highlight that the common good as a legal concept has ancient roots on what we might call the civilian juristic side of the tradition, and that the common good as a legal concept is part of a tradition of thought, legal theory and practical application that is partially independent of the philosophical and theological tradition of the common good. Indeed, a somewhat neglected topic is the influence running from the legal side of the tradition to its philosophical side. Appropriately, the Angelic Doctor, who knew everything, straddles both traditions. His citations in the relevant sections of the <em>Summa</em>, such as the so-called <em>Treatise on Law</em> and the sections on right, justice and judgment, are as often to civilian jurists as to philosophers or theologians or even canon lawyers.</p>\n<p>To explain this partial independence of the distinctively legal common good, let me make more explicit my methodological premises, and even express a very amicable methodological complaint, delivered in quiet tones.</p>\n<p>So, to begin with some broad premises: law (or more precisely jurisprudence, understanding that term in the civilian sense rather than the Anglo-American academic sense) is best seen as a department of political morality, a <a href=\"https://iusetiustitium.com/jurisprudence-as-a-subaltern-science/\" rel=\"noopener\">subaltern science</a>. In particular, it is the department that attempts to embody in practical reasoning the virtue of what Aquinas called general or legal justice, the rendering of each his due, a virtue intrinsically ordered to the common good of the community. But, and conversely, this means law is also a special department of political morality; it is not to be assimilated or dissolved into political morality as such, let alone morality <em>simpliciter</em>. Law has to treat justice in special ways because practical reason applied to governance through law ordered to the common good is a prudential activity, one that faces distinctive problems.</p>\n<p>For example, is it always desirable to change a rule of positive law that can be seen to be harmful or that has become obsolete? Not necessarily; one has to consider the disruption and confusion inherent in any change of legal rules, even if the change is an improvement taken in itself, and one also has to consider the reliance interests of those who have structured their affairs in light of the old rule. Law is full of dilemmas and tradeoffs like this. There is no general algorithm for resolving them, which is why governance through law requires the virtue of regnative prudence, and why law is an art or a craft of judgment, rather than a technique like doing a math problem (or like the mere technique of interpretation that modern textualist judges claim to possess). Thus, as the jurist Celsus put it, as given by Ulpian in the <em>Digest of Justinian</em>, law is the “<em>ars boni et aequi</em>,” the <em>art</em> of the good and equitable.</p>\n<p>Now to my mild methodological complaint. In the white-hot debates over the classical legal tradition and the natural law tradition in the past three years, but also more broadly, there has been a distinct tendency in my view to emphasize what might be called the philosophical and theological side of the classical tradition. One often sees something like the following sequence: the theorist discusses Aristotle, gives Augustine a brief nod, discusses Aquinas extensively, and then immediately and somewhat bewilderingly skips forward to post World War II theorists and delves deeply into controversies over DeKoninck, over Finnis’ evolving views of the common good, and so forth. Ironically enough, this is somewhat parallel to the bad habit of liberal theorists of starting with the Greeks — offering an interpretation of Polybius that somehow makes him sound remarkably like Madison — then skipping straight to Machiavelli and then on to Locke and the American founders, with Rawls looming in the distance. What is left out here is the millennia-long legal tradition of the common good as an operative, working legal system, one that tried to bring the abstractions down to earth and implement them in concrete, beneficial ways.</p>\n<p>Put another way, construing legal provisions or working with legal doctrines of the sort I illustrated is not like doing straight philosophy or theology. That is, the provisions are not directly open to philosophical debates over the common good in the way that certain styles of architecture are directly open to the outside air. Rather they are partially independent of underlying philosophical concepts, insofar as law is a distinctive department of political morality, the art or craft of practical reasoning about legal justice that takes into account distinctive considerations arising from the institutional embodiment of the legal system. I stress only partially, because <a href=\"https://iusetiustitium.com/enriching-legal-theory/\" rel=\"noopener\">the classical view</a> is that background principles of legal justice (<em>ius</em>) inhere in and permeate positive provisions of law (<em>lex</em>) and help constitute even the semantic meaning of <em>lex</em>, and are <em>a fortiori</em> used to interpret <em>lex</em> when the latter is general, vague, ambiguous, or overbroad relative to the lawmaker’s aims. But the <em>ius</em> that inheres in <em>lex</em> and is used to interpret <em>lex</em> is not just “morality” as such. It is a system of principles that are themselves relevant to and embody legal justice, such as, to pick some random examples, the principle that no man should be judge in his own cause, or the principle that no man should profit from his own wrong.</p>\n<p>Given that such provisions and doctrines have to be interpreted and applied for legal purposes that are partly independent of high-level philosophical and theological debates, two conclusions follow. First, the working lawyer or judge cannot simply recline back into some sort of general skepticism about the common good or its determinacy, intoning “who decides?” For legal purposes, the jurists decide. Morever, in contrast to the academic legal theorist (or the part-time theorist who also happens to wear a judicial robe), the working lawyer or judge cannot wave a refined hand in the air and say “I’m not sure what that means — let the seminar go on.” A provision or doctrine that says, in terms, “the common good” or “public interest” or “general welfare,” has to be given some interpretation or other by the working lawyer and especially by the judge. Now, one way the lawyer or judge can lighten his own burdens is to interpret the provision as commanding deference within a reasonable range to an executive body, and this is an ordinary way our law works. But that too is a substantive interpretation. It is not philosophical skepticism.</p>\n<p>Second, for concrete legal purposes one usually does not have to choose between high-level, contested sub-conceptions of the common good. Philosophers and theologians debate so-called distinctive, aggregative, and instrumental conceptions of the common good, among others. The book adopts the classical or distinctive conception of the common good, because I think it is the conception that unites Aristotle, Augustine and Aquinas, and for the sake of concreteness, and because I think it is true. But very little in the operative interpretations of our constitutional order offered in the book, and very little in the quotidian work of law generally, turns on contested philosophical refinements of the common good at the outer boundaries of debate. As George Duke observed, the differences among high-level conceptions of the common good often make little difference in the work of practical reason. Those conceptions can travel a long way together, and this is a problem both for the jurisprude (in the Anglo-American sense) who is eager to plunge into conceptual refinements and also for the skeptic about the common good or natural law. Instead the quotidian activity of practical reasoning about the legal common good serves concrete ends, on which different speculative conceptions of the common good usually converge in practice. It condemns the abuse of official power for private purposes like nepotism or peculation; it underwrites equitable and public-regarding interpretations of semantic meaning; and it helps to prevent a kind of pointless and fetishistic legal formalism that benefits few and harms all.</p>\n<p>In short — and here I am attempting to summarize a major theme of the book — I would urge that lawyers and legal commentators pay rather less attention to debatable philosophical refinements of the common good and rather more attention to the civilian-lawyer side of the<em> ius commune</em>, in which <em>bonum commune</em> or common good does not refer in the first instance to some debatable philosophical conception or other. By no means do I want to deny the philosophers their fun, but to the extent lawyers are capable of having fun, it’s of a somewhat different kind.</p>\n<p>-Adrian Vermeule</p>\n"
}