{
  "title":"Enriching Legal Theory",
  "date":"2022-11-04T14:49:07.000000Z",
  "author":null,
  "id":"https://iusetiustitium.com/?p=1848",
  "link":"https://iusetiustitium.com/enriching-legal-theory/#utm_source=rss&utm_medium=rss&utm_campaign=enriching-legal-theory",
  "content":"\n<p>What follows are my notes from a semi-extemporaneous response I delivered at the <a href=\"https://www.harvard-jlpp.com/symposia/cgc-symposium/\">conference on Common Good Constitutionalism</a> organized by the <em>Harvard Journal of Law and Public Policy</em> and the Harvard Federalist Society on October 29, after receiving some but not all of the papers in advance and listening to the discussion. The other participants’ papers and presentations were largely working drafts of final products that will appear in the <em>Journal</em>. The oral delivery differed from these notes in minor ways. A full version of the talk with footnotes will appear in the <em>Journal</em> in due course.</p>\n\n\n\n<p><em>The editors wish to thank Mario Fiandeiro, editor-in-chief of the </em>Harvard Journal of Law and Public Policy<em>, and the </em>Journal<em> editorial board for their gracious permission to publish this in advance of the </em>Journal<em>’s publication.</em></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity is-style-wide\">\n\n\n\n<p>Thanks to everyone for coming. I think it’s been a fascinating event and suggests that these debates have only begun and will continue for a long time. Yet these debates also have an ancient history. The discussions we have had today are iterations, with appropriate variation, of discussions that happened in and during the last revival of classical legal theory, in the US and Europe in the 1950s and 1960s in the shadow of Nuremberg, when legal positivism for a time seemed patently inadequate. And those in turn were variants of many earlier iterations, going all the way back to debates over legal interpretation between the schools of Proculeian and Sabinian lawyers in Rome. Indeed, as will become clear shortly, the eternal recurrence of this sort of debate is itself, in my view, one of the great facts of history that we have to recover to make sense of our discussion today.</p>\n\n\n\n<span id=\"more-1848\"></span>\n\n\n\n<p>It’s hard to do a response of this kind, in part because the discussion is still fresh, in part because one must inevitably be selective. I won’t be able to respond to all of the speakers or all of the points made by even the speakers I do have something to say to. Moreover, I will in some cases refrain from comment on the papers until I see them (and thanks to those who sent versions or partial versions of the papers in advance). So let me just try to organize a few thoughts around the theme of <em>enriching legal theory</em> that I hope will be of general interest. By legal theory, I will very much mean to include legal practice as a central interest of legal theory, as I will explain.</p>\n\n\n\n<p>In some ways, the situational premise for the book is a sense that legal theory, especially American legal theory, has become or had become rather desperately impoverished. One felt, or at least I felt, that most of the products of the law reviews were either immediate advocacy arguments in the service of some immediate cause or another, or else examples of theory that had settled into a kind of steady-state equilibrium of alternation or even duopoly between a couple of predictable positions and research programs — in the American case, chiefly progressive legal realism and originalism. Each of these churned up a great deal of activity, but were in my view making fewer and fewer contributions, although there were, especially in the case of originalism, a bewildering proliferation of variants and epicycles on known ideas and positions, not all of which were consistent with one another — law’s analogue to what philosophers of science call a degenerating research program.</p>\n\n\n\n<p>Meanwhile, judicial practice had or has increasingly diverged from the theories of the academy, as Judge Matey’s illuminating paper points out. As Michael Smith put it recently, unfortunately not in the paper he presented here, “academic discussions of originalism and original public meaning are severely disconnected from judicial and political realities.” In many respects, the practicing judges and lawyers have been ahead of the theorists, in that – at least in the actual work of judging – they are more alert to the fundamental condition of legal work that the positive law cannot even be understood or interpreted apart from practical reasoning in light of normatively inflected background principles – a point to which I will return.</p>\n\n\n\n<p>Against this backdrop, the constructive effort behind the recovery or revival of classical legal theory (without speaking for other participants in the revival) is to in some way re-enrich legal theory – an effort to make it broader, more continuous with our history before the advent of 20th century positivism and with the legal approaches of other nations, in a sense more inclusive.</p>\n\n\n\n<p>Now, such an effort does not at all entail originality in any straightforward sense. It is a bad assumption of Romanticism that scholarship should or must strive for originality. Sometimes the way scholarship can make a contribution, in a paradoxical combination of new and old, is a recollection or re-appropriation of enduring principles that have for contingent reasons been temporarily forgotten or abandoned. But it is a feature of the classical law that the possibility of and resources for such recovery is itself built into the theory, because the theory itself distinguishes what is universal from what is particular. Michael Foran’s paper nicely illustrates this distinction, by drawing upon the principles of equal dignity of all human beings as such, deeply rooted in the natural law and identified by  classical lawyers as inconsistent with the positive civil law of their own day – a point I would recommend to Darrell Miller’s attention.</p>\n\n\n\n<p>Here Foran works in a venerable tradition. To choose only one example from a myriad, the great 14th century jurist Baldus de Ubaldis adapted the principles of the <em>Corpus Juris Civilis</em> to the circumstances of the independent city-state republics of northern Italy. In so doing he did not attempt to directly transpose all the particular rules of the positive civil law of republican or imperial Rome, an absurd program. But he translated and developed the general principles of the corpus for his very different circumstances, resulting in an approach that seamlessly combines what is enduring with what is local and contingent. The watchword here  should be<em> non nova, sed nove</em>  — “not a new thing, but in a new way.” The book, therefore, is in part and in one sense proudly unoriginal, and I’m afraid my disagreements with Lee Strang’s paper began at the first sentence, when he said “common good constitutionalism offers a new theory of constitutional interpretation.”</p>\n\n\n\n<p>Here let me briefly answer a few of Linda McClain’s questions, although given my constraints and the number of papers we have heard today, I do worry that once again I won’t be able to satisfy her that I have done them justice. First, the criteria for valid adaptation or translation of enduring principles are actually set out in a chapter of the book. They are drawn from the account of development of doctrine offered by the 19th century Oxford don and theologian, St. John Henry Newman, which I take to be firmly in the mainstream of the classical tradition. We can disagree how to apply such criteria, but that is because the classical legal tradition itself provides a framework within which different prudential determinations can occur, and within which reasonable disagreements can be had with respect to those determinations, as Ryan Meade and others observed. Second, given the limits of my own expertise, I will have to leave further debates within the classical framework on the subjects Linda is interested in to scholars who know what they’re talking about and are already working in this area, such as Erika Bachiochi in her widely discussed recent book, and Julia Mahoney in a recent article. I do protest mildly that it is unreasonable for scholars in every given area to demand that I personally figure out what I think about the areas or cases of greatest interest to them; rather the book is meant as an invitation for others to work these things out in a broad range of areas, many well beyond my ken. Third, also actually in the book is a section on democracy, which argues — as one of Larry Solum’s slides showed — that democracy, rightly understood as and when oriented to the common good, is one perfectly valid way to structure a polity on the classical view. So I’m slightly comforted by the reflection that the book already answers at least some of Linda’s questions.</p>\n\n\n\n<p>A nice example of the positive approach I am urging is on display in the paper by Conor Casey, which illustrates in a concrete and illuminating way the diversity of determinations, subject to reasonable prudential disagreement, that can occur within the framework of classical principles. This unique combination — stability of principle and flexibility of application — is what creates the famous capacity for the classical tradition to undergo repeated revivals over two millennia, in widely varying circumstances.</p>\n\n\n\n<p>In this light, the latest recovery of the classical approach hopes to enrich legal theory on at least four dimensions: <em>temporal</em>, <em>comparative</em>, <em>professional</em>, and <em>methodological</em>. Let me explain.</p>\n\n\n\n<p>Temporally, a legal theory that is richer is one that offers not only justification and fit with present law, synchronically, but also diachronic fit and justification — fit and justification that takes into account the past of our law and legal theory, putting in in its best light, and accounting to the extent possible for the evolution of our  current law, legal institutions and legal practice from our own past. It is a chain novel that doesn’t start abruptly with the <em>Erie</em> case, or with Hart, or with Bork.</p>\n\n\n\n<p>Conversely, it is a grievous form of temporal parochialism to talk about law as though everyone before Hart or Bork simply failed to understand the true nature of law or of legal interpretation. A slightly subtler form of intertemporal parochialism is to colonize the past, creating invented traditions that project modern positivism, originalism or progressivism onto the legal conceptions held by the Americans of the founding era or the 19th century — a mistake against which legal historians have rightly warned.</p>\n\n\n\n<p>Here let me mention a scintillating paper by Emad Atiq, a legal philosopher from Cornell, who has no particular stake in the interpretive debates and is interested for philosophical reasons in the historical credentials of legal positivism, or rather the lack of such credentials. Relying on professional legal historians, Atiq walks through the classical legal tradition from its origins right through the Anglo-American common law, the founding era and the 19th century, and discusses a set of illustrative cases to show that American judges offered “[an] exceptionally clear treatment of unsourced principles of fairness as <em>bona fide</em> law.” Overall, in his view, “[classical American] jurists did not explain the legality of moral principle by adverting to social facts, judicial choice, or more fundamental laws; on the contrary, they seemed to treat ‘moral laws’ as self-evident, unchangeable, and applicable <em>ex proprio vigore </em>[of their own force].” In other words, these judges did <em>not</em> invoke these background principles only because they were already included elsewhere in social fact, but because they were law in their own right. For Atiq, the jurisprudential significance of all this is that it puts a challenge to current legal positivists, who can save “positivism’s truth” only by admitting that positivism of the post-World War II variety is historically “parochial,” and thereby requires developing very different justifications for positivism than currently exist.</p>\n\n\n\n<p>And, I would add — especially in light of Judge Matey’s excellent and important discussion of Blackstone’s classical premises and its great influence on the Founders — the problem of historical or temporal parochialism is most severe for originalists, who stand in the paradoxical and difficult position of claiming to adhere to the original understanding while propounding a conception of law itself that is antithetical to the classical understanding of law the founders and their successors themselves held.</p>\n\n\n\n<p>Comparatively, a richer legal theory is one that takes into account what we might call the <em>ius gentium</em> or law of nations at a higher-order level, the level of views about law and legal practice. An enriched theory takes into account what is thought about law not only in the United States, but in Europe, Latin America, and the rest of the world. Here a parochial legal theory is one that offers claims about the inherent nature of law, or of legal interpretation, or of legal communication, or of constitutionalism that do not capture or even flatly contradict conceptions of law and its practice that appear in the great variety of the world’s legal systems, approximately none of which practice originalism in anything like the American sense, if at all, and many of which do not understand themselves in the terms of 20th century Anglo-American positivism.</p>\n\n\n\n<p>Professionally, a richer legal theory is one that both takes into account the internal perspective of practicing lawyers and judges, putting their self-conceptions in their best light, and that also fits with the development of our institutions outside the courts and the legal profession altogether. This is central to the book’s concerns. As to the activity of judges, it seems to me undeniable that when push comes to shove, most visibly in hard cases but not only in hard cases, judges — very much including judges who profess originalism — routinely read texts in light of general background principles of legal rationality and legal justice. These judges often show no real anxiety about grounding such principles in positive sources of law, yet take those principles to be an internal part of law’s fabric and integral to the activity of interpreting the law, not something imported into law and used to guide an exercise of legislative discretion writ small.</p>\n\n\n\n<p>Methodologically, a richer legal theory is one that has a richer legal ontology and that puts the various sources of law into a well-ordered relationship to one another. The very thin positivist ontology on display in someone like Hart, who can see only rules, zones of “discretion,” and positive conventions, is profoundly impoverished and cannot account for the experience of legal practice, in which lawyers and judges do not take themselves to be doing something other than law when they draw upon background principles in order to understand the semantic meaning of texts, to disambiguate, specify, or supplement them, or otherwise to derive legal meaning from semantic meaning.</p>\n\n\n\n<p>This view of course supposes that semantic meaning is fixed in a thin sense. To use an example that came up earlier, I do very much hope that the “Republican Form of Government” clause does <em>not</em> mean that Mitch McConnell is to be our sole governor. But this thin sense of fixation turns out to be absolutely common ground across originalist and non-originalist legal systems. European judges who think originalism is absurd may and do assent to it just as well. Hence this thin sense does not at all entail any of the further premises of modern American originalism, as Conor and I have argued at length elsewhere and I need not rehash here. (I note for Josh Hammer that if I didn’t wade into these issues in my old Atlantic piece but left them for the book and later papers, it is because it was a piece in the Atlantic. Try getting the phrase “semantic meaning” past the editors there.)</p>\n\n\n\n<p>This brings us to what I take to be a serious conceptual mistake, an instance of circular reasoning, that I fear I have heard at a few points today and elsewhere, for example in the talk by Lee Strang, in work by Joel Alicea, and possibly in a recent review by Jeff Pojanowski and Kevin Walsh — although the review is almost as long as the book and I have only had a chance to skim it to date.</p>\n\n\n\n<p>It begs all the key questions posed by the classical view to simply assume that the task of identifying <em>legal</em> meaning, an exercise of practical reasoning, can be reduced to the task of identifying <em>semantic</em> meaning. Put otherwise, it begs all the key questions to assume that even the semantic meaning of positive <em>lex</em>, however fixed, can be understood independently of background principles of <em>ius</em>. The classical view, as the book attempts to argue, is that those principles always already inform and permeate and inhere in <em>lex</em>, as it were, because <em>lex</em> is itself a determination or concretization of <em>ius, </em>inherits the nature and boundaries of practical reason inherent in<em> ius, </em>and is therefore interpreted to harmonize with <em>ius</em>. On the classical view, <em>ius</em> is promulgated just as much as <em>lex</em>, and itself serves, in part, coordinating functions. Conversely I think Lee Strang and others purporting to work within the natural law tradition have quietly and no doubt inadvertently dropped a key element of the the classical definition of <em>lex. </em>On<em> </em>that definition, even positive law is not only an ordination that serves the common good, but is also, always and essentially, an ordination <em>of reason</em>, not merely positive fiat. An ordination of reason is not merely an ordination that is made because there are good second-order reasons (like coordination) to make an ordination, resulting in a reason-independent or reason-excluding ordination of fiat, full stop. Instead an ordination of reason itself inextricably incorporates reason into its terms; reason inheres even in <em>lex</em>. As Dick Helmholz puts it in his wonderful book on <em>Natural Law in Court</em>, “[decisions of the <em>ius commune</em>] illustrate what might be called <em>the ‘internalist’ role played by the law of nature.</em> <em>It was used to discover the meaning of existing laws</em> [and] to help supply the answer to a legal question where the import of positive law was uncertain ….” (my emphasis).</p>\n\n\n\n<p>This key feature of the classical view is very much, I think, the same point that Professor Rodriguez-Blanco made earlier today, in powerful terms, about the inextricability of the normative in interpretation of the law. Now, the classical view may or may not be correct, but it cannot be stipulated away by brute force. To tacitly assume that <em>lex</em> can be understood entirely independently of <em>ius</em> assumes the very conclusion that the positivist or originalist wants to prove. The claim of the classical lawyer is that reading <em>lex</em> in the light of <em>ius</em> is the right and indeed unavoidable way the work of law as law reads texts.</p>\n\n\n\n<p>It is thus a misstep, however appealing it may appear, to argue (as “natural law originalists” do) that the common good enters in only at the level of justifying the enactment of positive law by the civil authorities. To repeat, this drops an essential element of the classical conception: law is not merely an ordination for the common good (resting on second-order reasons like coordination), but is itself constituted as an ordination of reason. As Finnis puts it (actually I am here quoting Conor both quoting and summarizing Finnis), “constitutional interpretation can never reasonably strive to be exclusively historical and seek to confine itself to ascertaining socio-historic facts. That is, from a normative perspective officials should not deliberately try to entirely exclude considerations of political morality during interpretation. It is defined into the nature of the posited law of a particular community that it derives from higher law that it determines and specifies…. [Legal] interpretation is an act that ‘can and should’ be ‘guided by moral principles and rules’ that are a matter of ‘objective reasonableness….’”</p>\n\n\n\n<p>I have two examples of this. The first is the rules of chess, which Steve Sachs offered as an example (indeed the only example he mentioned) of a domain in which interpretation proceeds solely on the basis of social fact. I’m tempted to just say that law is not like chess, because it is not. Law, unlike chess, is not a closed system. But it turns out in any event that interpretation of the rules of chess does not at all operate the way Steve  described; quite the opposite. Periodically a debate breaks out in the chess community over whether tacit, unspoken agreement on draws between grandmasters (as by repetition of moves), in tournaments where express verbal draw offers are banned (at least before a certain move), counts as  circumvention of the rules or even a kind of cheating. Although of course there are fixed rules of chess, whose terms are settled by an authoritative body, participants on all sides of this debate offer interpretive arguments about the <em>point</em> of the rules, arguments sounding in fit and justification — arguments that try to reach reflective equilibrium among the point and purpose of all the written and unwritten rules of chess jointly and severally, and also among competing conceptions of sporting honor. With chess gone, we have no example on the table of an activity in which interpretation is not inevitably normative.</p>\n\n\n\n<p>Let me now give a serious legal example, from a modern judge, of this view that even semantic meaning is always already to be understood and interpreted in light of background principles of <em>ius</em>. The case is called <em>Webster v. Doe</em>, and the judge is none other than Justice Scalia. The text at issue in <em>Webster</em> authorized the Director of the CIA, “in his discretion,” to terminate any CIA employee “whenever he shall deem such termination necessary or advisable in the interests of the United States.” The question was whether a termination was or was not reviewable by the courts on various grounds. The majority said that the text created a pure zone of discretion such that there was “no law to apply,” and the text authorized termination for any reason whatsoever — although the majority then immediately undermined its own holding by also saying that Congress had not meant to preclude review on constitutional grounds, as opposed to statutory grounds. Justice Scalia took an entirely different and entirely classical view. He observed that, quote, “there is no governmental decision that is not subject to a fair number of legal constraints precise enough to be susceptible of judicial application – <em>beginning with the fundamental constraint that the decision must be taken in order to further a public purpose rather than a purely private interest</em>.” This is to understand both the legal and indeed semantic meaning of the text at issue as <em>already</em> embodying a set of fundamental background principles, here the bedrock classical conception that law rightly understood must be rationally oriented to the public interest or common good. That conception is, on the classical view, a principle of the <em>ius naturale</em> itself. As Cicero put it in a treatise on public offices, “<em>sed communis utilitatis derelictio contra naturam est: est enim injusta</em>” (to disregard the common good is against nature; it is injustice itself). Note here, crucially, that Scalia goes well beyond Lee Strang’s idea of using the common good merely as a justification for positive lawmaking by civil authorities. Instead, like the classical lawyers, he invokes it <em>within</em> adjudication itself, as a ground or precondition of lawmaking that is always constitutive of and inherent within even the semantic meaning of legal texts.</p>\n\n\n\n<p>I hope this example also clears up what I take to be another issue that appears in Lee’ Strang’s paper and in the Pojanowski and Walsh review, the question of different philosophical conceptions of the common good. As a first-order matter, the book adopts, straight from the tradition that runs consistently from Aristotle to Augustine to Aquinas, the Thomistic or distinctive conception of the common good, most clearly and concretely illustrated in my view when Aquinas says that “the individual good is impossible without the common good of the family, state, or kingdom. Hence Valerius Maximus says of the ancient Romans that ‘they would rather be poor in a rich empire than rich in a poor empire.’” Lee seems to opts for a different conception of the common good, the instrumental conception, one which is idiosyncratic among natural lawyers, and which John Finnis more or less abandoned after (and perhaps because) his work was critiqued by Fortin, as discussed in another recent paper by Erika Bachiochi.</p>\n\n\n\n<p>That said, here is the more important point: as George Duke once rightly observed, and as Conor and I have written jointly and severally, for concrete legal purposes  the lawyer or judge usually need not choose between high-level philosophical conceptions of the common good. (<em>Pace</em> a suggestion by Lee Strang, I fail entirely to see any inconsistency between that point and the first-order view I happen to hold). In particular, for the humdrum purposes of the classical lawyer, who works with the rough instruments of the law, refinements at the contested outer edges of the philosophical debates are  usually irrelevant. Law is a department of political morality, but as it were a special department with its own distinctive problems and commitments. Principles of <em>ius</em> are thus not co-extensive with ‘morality’ <em>tout court</em>; they are, as the tradition puts it, principles of legal justice, and law is not seminar-room reasoning about morality, but rather the distinctive craft or “art” of the good and the equitable (<em>ars boni et aequi</em>). </p>\n\n\n\n<p>The cases thus involve the sort of questions of practical legal reason Justice Scalia adverted to in <em>Webster v. Doe</em>, such as whether the CIA director really should be able to fire an employee in order to, say, give the job to his nephew. Thus I would urge that we lawyers pay rather less attention to debatable philosophical refinements of the common good and rather more attention to the civil-lawyer side of the <em>ius commune</em>, in which <em>bonum commune</em> or common good does not refer to some contested philosophical conception. Instead it serves very concrete ends. It condemns the abuse of official power for private purposes like nepotism or peculation; it underwrites equitable and public-regarding interpretations of semantic meaning; and it helps to prevent a kind of pointless and fetishistic legal formalism that benefits few and harms all.</p>\n\n\n\n<p>In general, there are here two risks to avoid, two monsters between whom we have to steer. Law has two functions that are inextricably intertwined, settlement or coordination of social disputes and rational governance for the common good, and (hence) two aspects, fiat and reason. The twin errors arise when one or another side of these antinomies is made the master of the other — either near-exclusive concern for the settlement and coordinating function of law on the part of originalists and positivists, or excessive attention to pure speculative and normative reason on the part of the philosophers and jurisprudes. The classical lawyer, working <em>as</em> a lawyer, aims to hold these in a kind of productive balance, using both fit and justification. The book is thus very much a lawyer’s book, working <em>within</em> law in a way that is interpretive rather than purely positive or purely normative. It is a misapprehension of genre to read it as a philosophical exercise. Following another excellent paper by Emad Atiq, my suggestion for doctrinally trained law professors as such is that we rarely have much to contribute to technical debates in legal philosophy, but happily we rarely have any need to do so.</p>\n\n\n\n<p>Here I should briefly re-emphasize a point I and others have made before, in order to clear up a misconception that I’ve heard at a few points today. On the classical view, judicial assessment of the common good is by no means an open-ended and unstructured imposition of judicial views of the common good in the name of higher constitutional law. To think this way is to adopt a framework oriented fundamentally to constitutional judicial review as a check or trump that invalidates political action — a  quite recent framework that, as Helmholz has repeatedly pointed out, is marginal at best in the classical tradition. I was thinking about this as I listened to Stephanie Barclay’s interesting and admirably lawyerly paper. Originalists especially need, I think, to internalize the demonstrations by Helmholz, Jud Campbell, and others that constitutional review was by and large a sideshow in the Founding era. As Campbell puts it, “natural rights at the Founding scarcely resembled our modern notion of rights as determinate legal constraints on governmental authority.”</p>\n\n\n\n<p>Rather, on the classical approach, judicial assessment of the common good is sharply limited and structured in at least three ways. First, it is primarily a subconstitutional interpretive tool, which reads and interprets legislative texts within the horizon of <em>ius, </em>including an orientation to the common good as a key element of <em>ius</em>. On this approach, putative acts of lawmaking that violate natural law or natural rights are seen as defective or perverse pseudo-lawmaking. But it is an entirely separate question whether a court, for example, has the authority to ignore, set aside or “strike down” the law, as both Aquinas and the classical lawyers make very clear, and it is usually a marginal question. Second, as the mainstream of classical American caselaw shows, classical judicial assessment of the common good is presumptively deferential within reasonable boundaries, not only or not primarily because of concerns about limited judicial capacities, but more fundamentally because the inherent office of the lawmaker is to provide reasonable specification or determination of background principles of <em>ius</em>. Third, as the book tries to make clear, the ordinary framework of judicial review in classical American law is at bottom analogous to what we would see today as an administrative-law conception of review, one that asks whether the action of the civil authorities is based on plausible reasons oriented to the public interest.</p>\n\n\n\n<p>Here I thought Stephanie Barclay makes a slight misstep by assuming that asking government “to explain why it is not regulating in even-handed ways” and to offer a proper public-regarding motive is not a part of the classical administrative law model of review. On the contrary: as to the former, Aquinas argues that equal sharing of burdens is constitutive of the common good. As to the latter, the  classical decisions, the classically-oriented Scalia opinion in <em>Webster v. Doe, </em>and indeed a quite recent decision of the Court in the census case illustrate that although general principles of law afford a presumption of regularity to official action, administrative law review for invalid purpose or pretext is possible, where no public-regarding motive is plausible in light of the scope and design of the action.</p>\n\n\n\n<p>A final methodological point is that it is important not to run together two distinct issues that I fear are often conflated. Enrichment of our legal ontology need not produce more indeterminacy and disagreement at the level of interpretation; indeed it will in some range of cases produce less. As Helmholz argues throughout his work, and as Conor Casey illustrated from recent Irish law, a standard way classical lawyers draw upon <em>ius</em> is to invoke settled and traditional background principles in order to <em>reduce</em> indeterminacy that would otherwise obtain in the positive law. Whenever I hear stock points about the indeterminacy of <em>ius</em> or about disagreement about the content of <em>ius</em>, I think immediately of both the extraordinary proliferation of mutually opposed originalisms at the academic level and of the chronic disagreements that afflict originalist and positivist judges almost daily. And then I wonder why so many academic defenses of originalism implicitly assume that positive texts are fully determinate (practicing judges and lawyers are less susceptible to this), while also assuming that <em>ius</em> is chronically indeterminate. And I also wonder why the points about indeterminacy and disagreement are rarely run through consistently and comparatively across legal theories.</p>\n\n\n\n<p>The fact is that disagreement, like fallibility, is just a universal condition of life for cognitively bounded and constrained human beings. It is just a condition of the fallen state of man. It applies to all legal theories if it applies to any; it cuts in all directions; or, to change the metaphor, it cuts too much ice and thereby ends up cutting none. When someone raised the old trope that “natural law theories are subject to bad-faith hijacking,” I thought “plug any theory into that blank. No legal theory, as such, can guarantee the conditions for its own enforcement.” To do so is not the province of legal theory.</p>\n\n\n\n<p>This theme of disagreement is a good place to end.  If history is any guide, these debates will continue ad infinitum, one side having the upper hand for a time, and then the other. None of that is inconsistent with believing that there is a right answer, as Dworkin used to stress. But it is perhaps at least a good reason to take a broader, more cosmopolitan attitude to those disagreements and to appreciate or even savor the rich variety both of law’s history and of law’s manifold forms around the world today.</p>\n"
}