{
  "title":"Classical Political Forms, the Mixed Regime, and the State of Emergency—Roman, Byzantine, Muscovite?",
  "date":"2022-10-27T16:48:32.000000Z",
  "author":null,
  "id":"https://iusetiustitium.com/?p=1836",
  "link":"https://iusetiustitium.com/classical-political-forms-the-mixed-regime-and-the-state-of-emergency-roman-byzantine-muscovite/#utm_source=rss&utm_medium=rss&utm_campaign=classical-political-forms-the-mixed-regime-and-the-state-of-emergency-roman-byzantine-muscovite",
  "content":"\n<p><em>Ius &amp; Iustitium welcomes submissions from academics, practicing lawyers, and students interested in the classical legal tradition.</em> <em>The following essay was submitted by Julian G. Waller, Professorial Lecturer in Political Science at George Washington University, a Visiting Scholar at the Institute for European, Russian and Eurasian Studies, and a Non-Resident Fellow at Elliott School of International Affairs’ Illiberalism Studies Program. All views are his own and do not represent his employers or affiliated organizations. </em></p>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity is-style-wide\">\n\n\n\n<p>Interest in the <a href=\"https://iusetiustitium.com/reviving-the-classical-legal-tradition-in-an-age-of-legal-barbarism/\">classical legal tradition</a> and the classical philosophies on political regime and <a href=\"https://iusetiustitium.com/catholic-constitutionalism-a-primer/\">political order</a> from which it emerged have grown significantly, as this very publication outlet <a href=\"https://iusetiustitium.com/rights-and-the-common-good/\">can</a> <a href=\"https://iusetiustitium.com/on-the-tyranny-of-rights/\">attest</a>. This revival is particularly interesting because until recently the categories and frames of reference central to the classical tradition have been largely outside the mainstream of scholarly work across an array of academic genres, from legal theory to political science and beyond. </p>\n\n\n\n<p>Given this, I wanted to invite the readers of <em>I&amp;I</em>’s attention to a recent attempt at melding older understandings of political regime with modern scholarship – thus far still a rare occasion. This summary is an encouragement for those interested in classical political concepts and their relevance to the classical legal tradition to engage with both the promise and pitfalls of this approach to the scholarly study of political order and political regime. Most scholarship today does not consciously rely on classical frameworks for these topics. It is therefore important to understand the difficulty of translating old and new ways of typifying regime, and to take interest whenever such a mixing, or an attempt at application, is undertaken. </p>\n\n\n\n<span id=\"more-1836\"></span>\n\n\n\n<p><strong>Old and New in the Study of Comparative Authoritarianism </strong></p>\n\n\n\n<p>My own field of <a href=\"https://www.cambridge.org/core/journals/british-journal-of-political-science/article/abs/institutional-turn-in-comparative-authoritarianism/DF3E2FF1E79A8D41E3E60F1D45A1B5C5\">comparative authoritarianism</a> studies – that is, the political science (sub-)subfield tasked with explaining the nature of, functioning, output, and patterned variations in non-democratic rule across societies – owes a great debt to classical thinking on the structural contours of political regime. Yet it also studiously ignores the primary categorizations of that legacy. These older frameworks, well developed in classical thought, largely coalesce around the interaction between a <a href=\"https://plato.stanford.edu/entries/aristotle-politics/#GeneTheoConsCiti\">simple tripartite division</a> of <em>de facto</em> rulership structure (single-few-many) with the motivating orientation of that given regime (for the common good/‘just’ vs. for personal benefit/‘unjust’). Thus, we have inherited terms, and their mirror-images, such as monarchy (tyranny), aristocracy (oligarchy), and polity (democracy). </p>\n\n\n\n<p>Other derivations from the classical tradition include the core split between monarchy and republic, abstract understandings of the <em>res publica</em> or ‘commonwealth,’ and the interlocking institutional puzzle-pieces of the ‘mixed regime.’ Some of these terms have partially retained their old meaning, although often applied in distinct ways, while others have been entirely divorced from their original conceptualizations or simply discarded. </p>\n\n\n\n<p>Indeed, when describing variations in political regime today we often prefer to think in terms of <a href=\"https://v-dem.net/media/publications/dr_2022.pdf\">spectra of relative political pluralism</a> with a binary cut-point (liberal democracy/electoral democracy vs. electoral authoritarianism/closed authoritarianism) framed around electoral institutions. Or, alternatively, we rely on a subset of classification types constructed around distinct <a href=\"https://www.cambridge.org/core/journals/perspectives-on-politics/article/abs/autocratic-breakdown-and-regime-transitions-a-new-data-set/EBDB9E5E64CF899AD50B9ACC630B593F\">organizational patterns</a> (monarchy, military junta, party-state, personalist dictatorship, electoral authoritarianism, and ‘hybrid’ regimes). </p>\n\n\n\n<p>In neither preferred framework do we explicitly use normative criteria (for example, ‘just’ or ‘unjust’) to determine category inclusion. Implicit normative associations are, of course, certainly present – but they are distinct from any given classifying exercise itself. This disjuncture in categorization approaches between modern and classical regime studies has major ramifications for how we delineate the empirical world into meaningful conceptual boxes, given that the desire for ideal-typical classification is just as strong today as it was two and a half millennia ago. </p>\n\n\n\n<p>This leaves us in a strange place, where contemporary scholars are highly indebted to classical legacies of categorizing political order, yet we generally do not follow (or sometimes even remember) those older schemas. Any project to rehabilitate the classical tradition must grapple with the fact that we have dropped both the terms and the normative way of thinking that undergirded that intellectual heritage. </p>\n\n\n\n<p>The problem therefore cuts both ways: while it is important for contemporary social scientists to think seriously about what may be gained by engaging once more with the classical tradition of regime study, it is also clear that those formed in the classical tradition can similarly gain from reflection on the results of <a href=\"https://politicalorders.substack.com/p/regime-types-and-their-limitations\">modern frameworks</a> and our (sometimes) <a href=\"https://www.cambridge.org/core/journals/perspectives-on-politics/article/autocratic-breakdown-and-regime-transitions-a-new-data-set/EBDB9E5E64CF899AD50B9ACC630B593F\">empirically-derived</a> conceptualizations. As an example of correction on the social scientific side, in an ongoing book project with coauthors, we suggest that the comparative authoritarianism literature has likely made an error in some of its <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4033720\">hidden assumptions</a> baked into generic terms like ‘autocracy,’ which we sometimes use to describe all non-democratic regimes. </p>\n\n\n\n<p>These frames tend to take as a baseline assumption that all types of non-democracy share internal dynamics best expressed by the classical form of ‘tyranny’ (singular rulership motivated solely for the ruler’s own gain and survival). This has led us to assume the existence of a leader-directed, intentional politics of ‘autocracy’ that is often at odds with the institutional, ideological, and unintentional realities of real authoritarian politics across a vast set of country-cases over the last century or more. So let us turn to a recent use of classical concepts in modern scholarship, and how this can both be a success, and yet also lead to potential confusions that must be dealt with head-on. </p>\n\n\n\n<p><strong>An Example in Bringing Classical Political Forms into Modern Scholarship</strong></p>\n\n\n\n<p>Revitalizing promoters of the classical tradition face strong headwinds given that the vast majority of research output on politics largely elides that same tradition. It is therefore relevant to be aware of instances where the classical tradition’s theories are applied in contemporary social sciences and the political humanities. This brings us to a recent issue of <em>Slavic Review,</em> one of the <a href=\"http://www.slavicreview.illinois.edu/\">premier academic journals</a> focusing the post-Soviet Eurasian region published by the interdisciplinary regional association <a href=\"https://www.aseees.org/\">ASEEES</a>.</p>\n\n\n\n<p>A curious article – and set of responses – was published in the Fall 2021 issue that dealt with the classical concept of the ‘mixed regime’ and its relation to the Schmittian/Agambenic ‘<a href=\"https://iusetiustitium.com/meditations-on-the-emergency/\">state of exception</a>,’ in reference to the political history of Rome, Byzantium, and medieval Muscovy. The article in question, “<a href=\"https://www.cambridge.org/core/journals/slavic-review/article/abs/authority-and-power-in-russia/2949CB5EFECD85C08AE8D2EBF8DBD0CA\">Authority and Power in Russia</a>” by the Russian scholar Oleg Kharkhordin, was followed by responses from the classicist Anthony Kaldellis (“<a href=\"https://www.cambridge.org/core/journals/slavic-review/article/abs/response-to-authority-and-power-in-russia/95899DF3C3251CFFF044AC7138A92E60\">Response to ‘Authority and Power in Russia’</a>”), the historian Nancy Shields Kollman (“<a href=\"https://www.cambridge.org/core/journals/slavic-review/article/abs/muscovite-republic/57B9784F515957556B06A20161C5A1F3\">A Muscovite Republic?</a>”), and the political theorist Miguel Vatter (“<a href=\"https://www.cambridge.org/core/journals/slavic-review/article/abs/third-rome-and-russian-republicanism-a-comment-on-oleg-kharkhordin-power-and-authority-in-russia/8A85A9CCD9D28A1350AF8A88988E48F5\">The Third Rome and Russian Republicanism: A Comment on Oleg Kharkhordin ‘Power and Authority in Russia’</a>”). The article follows on Kharkhordin’s 2018 book, <a href=\"https://www.hup.harvard.edu/catalog.php?isbn=9780674976726\"><em>Republicanism in Russia</em></a>. </p>\n\n\n\n<p>Kharkhordin’s article is summarized in its journal abstract as such: </p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p><em>Can classical political theories of mixed constitution from Polybius to Cicero help us shed new light on Russian politics? In order to so, this article first considers political structures of such non-parliamentary republics as medieval Novgorod and Venice, while choosing Constantinople as a basis for their comparison. Second, using Anthony Kaldellis’s recent book that has reinterpreted Byzantium in terms of the classical theory of </em>res publica<em>, it analyzes the question of </em>auctoritas<em> in ancient republican Rome and then imperial Constantinople. Third, the author employs Giorgio Agamben’s book on the state of exception, in order to see how mechanisms of power and authority that the Roman emperors had employed might help us interpret anew the phenomenon of tsardom, given that Ivan the Terrible was the first in Russia to be crowned as tsar, that is, Ceasar </em>[sic]<em>. This might have a lasting significance even for present day politics.</em></p></blockquote>\n\n\n\n<p>The overview Kharkhordin’s argument – or several wandering arguments, as it turns out – below is a means to engender interest in what otherwise would be held within the paywalled confines of academic humanities and social scientific journals. The reader of <em>I&amp;I</em> may take it as is, but of course the best use of scholarship is to build on that which is useful and contest that which is off-target. Those engaged in the project of revitalizing the classics will find much to recommend and reject in this particular exercise in applied conceptualization and classification. As it is one of the few recent examples of an application of classical political theory beyond core European cases, it acts as a useful test-case in how such theories may – or may not – travel well.</p>\n\n\n\n<p><strong>Brief Summary of “Authority and Power in Russia” </strong></p>\n\n\n\n<p>Kharkhordin’s article is framed as a discussion of the deep legacies of Russian politics today (and how they sit in enduring relation to the modern Putin regime), but he is far more interested in a few key thematic questions of political history and regime classification. He relies entirely on classical concepts, rather than modern theories of authoritarianism or political regime. </p>\n\n\n\n<p>First, Kharkhordin asks to which medieval Russian polity the ‘Third Rome’ epithet properly should be given. In assessing this, he makes the claim that both the historical Roman and Byzantine polities were examples of classical ‘mixed regimes.’ The northern state of Novgorod the Great fits this model far closer than the Rus successor states or Muscovy. In bringing the classical concept of the mixed regime into contact with non-Western political history, he makes special reference to the role of popular acclamation – the ‘democratic’ element of the mixed regime – as being of especially underappreciated conceptual relevance. </p>\n\n\n\n<p>Second, Kharkhordin attempts to delineate medieval Muscovy’s relation to the mixed regime concept, having recourse to the concept of the ‘state of exception’ (or ‘state of emergency’), which he takes from Giorgio Agamben (and by implication Carl Schmitt). With this, he claims that the Muscovite autocracy, and its Russian successor, was itself a strange beast – a perversely institutionalized regime of emergency that nevertheless held in some ways to a mixed regime substrate. The article is a provocative set of conceptual interventions, all of which rely heavily on interpreting and applying classical political concepts beyond their original places of development in the Mediterranean basin. I draw out his claims in more detail below – where the interested reader will find a variety of classical concepts being used in quite distinct ways. </p>\n\n\n\n<p><strong>Mixed Regimes, Popular Acclamations, States of Emergency, and Redefining Autocracy</strong></p>\n\n\n\n<p>At its core, Kharkhordin’s rather meandering narrative makes the argument that Russian politics in its <em>longue durée</em> should be understood as a fusion of an “excessive zeal of the powers that be and their insufficient formalism,” which is, in his view, strongly related to the legacy of “classical (non-parliamentary) republics” and their partial implantation in Russian political history (Kharkhordin, p. 470).</p>\n\n\n\n<p>Kharkhordin starts by making a comparison of the famous mixed regime of medieval Venice with the more poorly-understood regime of Novgorod the Great – a northern Russian polity that was eclipsed and ultimately destroyed by Muscovy in the 16<sup>th</sup> century. He suggests that Novgorod was evolving towards something like the Venetian mixed regime ideal (embodied as the threefold Doge-Senate-Great Council division of political authority) in a process of “progressive oligarchization” of its popular elements, but without a concomitant crystallization of a guiding aristocracy (Kharkhordin pp. 471-472). Why does this matter? To Kharkhordin, the mixed regime is not only a vision of ‘republicanism’ as it partially existed in medieval Russia but is nothing less than a legacy of the Byzantine Empire. </p>\n\n\n\n<p>In making this claim, he relies on a recategorization of Byzantium as a <em>res publica</em> (a classical “republic”) found in the <a href=\"https://www.hup.harvard.edu/catalog.php?isbn=9780674365407\">revisionist account</a> of Anthony Kaldellis. This account of a “<em>res publica </em>in its monarchical form” included “elements of popular sovereignty… [such that the] Byzantine people could reclaim its sovereignty for a moment if a given emperor was losing popularity or in those instances when one emperor was being replaced by another” (Kharkhordin p. 473). </p>\n\n\n\n<p>Kharkhordin contends that this possibility for popular input via revolt and objection undergirded a political order in which popular acclamation was critical to the “maintenance of power” through a “continual referendum” that in calm times defaulted to giving power to a republican <em>qua</em> imperial executive. He further argues that it “explains to a large extent the common non-dynastic succession of the rulers as well as the Byzantine horrors of deposing a former emperor…in order to finally elicit acceptable public acclamation on the part of the people in the hippodrome or some other public venue.” (Kharkhordin p. 474). </p>\n\n\n\n<p>Armed with this reframing of Byzantium as a <em>res publica </em>in monarchical garb, Kharkhordin turns to Muscovy proper, his primary interest. He controversially discounts the usual categorization of the Muscovite regime as an “unbridled autocracy” and argues instead that it was still “sometimes dependent on democratic contributions, coupled frequently with a very slight aristocratic element” (Kharkhordin p. 475). He suggests that the reign of Ivan IV Grozny (Ivan the Terrible, Grand Prince of Muscovy 1533-1547; Tsar of All Russias 1547-1587) is an example of republican Caesarism established through a permanent ‘state of exception,’ operating on a political system that otherwise largely inherited the structural underpinnings of the Byzantine mixed regime. Here he brings in work by Giorgio Agamben, who has revived the Schmittian account of the <em>stato di eccezione</em>. </p>\n\n\n\n<p>Using the crisis-ridden politics of late republican Rome as the primary case for how the mixed regime and the state of exception interact, Kharkhordin argues that during this period of political troubles Rome remained a mixed regime despite its troubles in this era. Yet he also states that, “[in] this republic of mixed government, however, there was a special condition that was designated under the name of <em>iustitium</em>, under which all laws came to a standstill and courts stopped their normal functioning,” and that “the reason for the introduction of <em>iustitium</em> was a condition called <em>tumulti</em>, internal or external disorders that threatened to topple <em>res publica</em> altogether.” (Kharkhordin p. 477). </p>\n\n\n\n<p>In this retelling, “[t]he state of exception, or <em>iustitium</em>, was ushered into Rome during the pre-imperial days by authority of the Senate, not by decision of the consuls or the people. Therefore, after a transfer of <em>auctoritas</em> from the Senate to the emperor, he became the living embodiment of the right to declare the state of exception in order to save <em>patria</em> from collapse.” (Kharkhordin pp. 477-478). </p>\n\n\n\n<p>Kharkhordin runs through a terminological discussion of the differences between <em>auctoritas</em>, <em>potestas</em>, and <em>imperium</em> – traditional conceptual differentiations found in the classical Roman political ecosystem – as well as how this translated itself into the Christianized late empire and even the conceptual innovation of the <a href=\"https://thejosias.com/2016/03/03/integralism-and-gelasian-dyarchy/\">Gelasian Dyarchy</a> in early post-Roman Christendom. One imagines that this unusual understanding of the concept of iustitium alone will be of interest to readers here at I&amp;I. All of this is in service to an argument whose goal is to apply the concept of a state of exception in a mixed regime to polities well beyond the Western historical remit. </p>\n\n\n\n<p>Kharkhordin then returns to Ivan Grozny’s reign of terror, and makes the claim that the Tsar and his infamous <em>oprichnina</em> (a personal regiment of warriors which bloodily enforced Ivan’s rule and whose membership, origin, and power remains still disputed today) displaced the mixed regime of the monarchical Muscovite ruler and the aristocratic Boyar Duma, which had developed organically over the course of the first half of the 16<sup>th</sup> century. “[Yet] [t]his process of deliberation and counselling still functioned save for the <em>oprich</em>΄ lands, where Ivan Groznyi had established his court at Aleksandrovskaia Sloboda to be run like a monastery. During the night the tsar prayed, during the day he tortured and punished, and during his joint meals with the courtiers of the exceptional realm he read the Holy Writ.” (Kharkhordin p. 480). </p>\n\n\n\n<p>Kharkhordin points to Ivan’s own assessment of the failed Byzantine <em>res publica</em>, in a written testament where he “striv[ed] to prove that the emperors there relied far too much on their counsellors, and their struggles and intrigues had ruined the great Roman empire.” In this way, Ivan argued that “while the <em>ipaty</em> (consuls), the <em>sinklity</em> (senators), and the <em>eparkhi</em> (local dignitaries) were engaged in warfare for power and privilege, the territory of the Byzantine empire was shrinking, and Greek tsardom, as Ivan calls it, was crumbling.” (Kharkhordin p. 480). He points to the Tsar’s rejection of a distinct ecclesiastical authority and his emphasis on a unitary, millenarian caesaropapism as central to characterizing this state of exception.</p>\n\n\n\n<p>Here, he points to a different conceptual division of rulership derived from Deacon Agapetus under the Emperor Justinian and its revision by the jurist Ioannes Lydus: <em>ennomos basileia</em> (“when the basileus rules according to laws”), tyranny (“when he ignores them or rules according to caprice”), and <em>autocratia </em>or <em>samoderzhavie</em> (“that is…supreme military command…and authority”). This third account is “<em>autarcheia kai authentia</em> [or] <em>imperium auctoritasque</em>” which sits conceptually alongside a ‘state of exception’ understanding of the Caesarian <em>res publica</em>. (Kharkhordin p. 483). </p>\n\n\n\n<p>In this way, Kharkhordin implies that Ivan’s Muscovy was a sort of institutionalized (post-) commissary dictatorship <em>per</em><a href=\"https://www.worldcat.org/title/dictatorship-from-the-origin-of-the-modern-concept-of-sovereignty-to-proletarian-class-struggle/oclc/865144021\"> Schmitt</a>, in which the autocratic emergency regime sat above an inherited, but unused, mixed-regime structural base. He concludes that the case is indeed simple, that “[i]t is illuminating to interpret [Ivan] Groznyi’s behavior with the help of the Byzantine notion of a Caesar-<em>autokrator</em> who combines power and authority in the same hands.” (Kharkhordin p.484). </p>\n\n\n\n<p>Throughout the article, one is struck by the conceptual reliance on Roman, Byzantine, and medieval Russian sources in this account of certain premodern authoritarian political orders. Many of those who mine the classical tradition on political regime will find new sources and new ways of understanding very old terms of rulership and their justification – as well as controversial definitions and their uneven application. </p>\n\n\n\n<p>Some of Kharkhordin’s contributions are more innovative. For example, the serious appraisal of symbolic acclamation (let alone real, <em>de facto</em> politically relevant forms of acclamation and objection) as an important element to political rule is something that has been lost in many accounts of authoritarianism, but fits quite well with concepts of Caesarism, Bonapartism, and other accounts that look to popular legitimacy as crucial to rule, for example. </p>\n\n\n\n<p>Treating this at the end of the essay, Kharkhordin even suggests that acclamation is the political substance which “laud[s] a ruler, whose authority [then] allows him or her to introduce a state of exception at his or her discretion” (Kharkhordin p. 487). Finessing this to somehow be a primary source of political legitimacy for Russia’s varied forms of authoritarianism through the centuries is a more difficult argument to make, of course, and it ultimately raises more questions about the state of emergency concept itself than anything else. </p>\n\n\n\n<p><strong>The Difficulty with Using Classical Concepts Authoritatively </strong></p>\n\n\n\n<p>So, does any of this actually work? In perfect frankness, the article is easily criticized on a number of dimensions, both conceptual and empirical, and I have made no effort to smooth over what amounts to a very confused narrative. The clunky summary above indeed fits the tone of the article. The primary claim that Muscovy can be plausibly identified as a kind of republican ‘mixed regime’ is weak at best, while the wide-ranging discussion of rather dissimilar imperial polities of Mediterranean civilization leaves the argument prone to ungrounded gestures rather than clear case-analysis. This comes out in the responses included in the journal issue, as one might expect. </p>\n\n\n\n<p>Anthony Kaldellis, for one, does not buy the claim that his own revisionist account of the Byzantine polity really travels to the dark decades of Ivan IV. He points to the high conceptual bar in his own work to describe such a state as a ‘republican monarchy,’ requiring:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p> “(a) a robust conception of the public interest and public property to which the monarch is subordinated in normative texts issued both by the monarchy itself and its elites; (b) a conception of a legally- or ethnically-defined populace whose material wellbeing forms the sole legitimating factor for the operation of government, even if that populace lacks formal institutions by which to take direct political action itself; (c) historical instances of popular intervention in the sphere of politics that were accepted by elites as legitimate, indeed often as constitutive of their own power and positions; and (d) documented continuity between that polity and the ancient Roman <em>res publica</em>, coupled with awareness of that continuity.” (Kaldellis p. 489). </p></blockquote>\n\n\n\n<p>Even excising part (d) as a definitional overspecification, it does not work for Muscovy, and likely does not even work for Novgorod. Kaldellis as a reviewer is more interested in the state of exception discussion in relation to Ivan’s <em>oprichnina</em>, although reviewing the limited evidence, he does not find real substance behind the assertion that the polity rests on a philosophical claim to accountability to a public sphere <em>per se</em>. That is, unlike in his Byzantine account, “there is no conception of a polity defined by a specific populace to which the monarch is beholden and whose moral presence alone can legitimate (or delegitimate) his acts” (Kaldellis p.490). From Kaldellis’s perspective, this dooms the attempt at regime classification that runs through Kharkhordin’s article. </p>\n\n\n\n<p>From a different perspective, Nancy Shields Kollman situates Kharkhordin’s argument in a historiographic frame, noting that “decades (since the 1930s) if not three centuries (since the Enlightenment) of ‘Byzantine Studies’ have distorted the historical record by ignoring <em>politeia</em> in favor of <em>avtokratia</em>,” and that this fails to allow for a fuller understanding of the key paradox of the Roman <em>res publica</em>: that “the ruler was posited as above the law even though he was supposed to rule according to the law” (Kollman p. 493). This useful endeavor, in her view, does not work in the cases assessed here, however. In application to Novgorod, Kollman finds the article deficient in empirical sourcing and underappreciative of the oligarchic nature of that polity, and for Muscovy the case is even more stretched. </p>\n\n\n\n<p>In alignment with Kaldellis, she is most intrigued by the focus on the state of exception, rather than the ‘republican’ regime-classification claims made for these polities. Even given arguments made by some recent historians of Muscovite and Russian political culture that stress a focus on consensus rather than just unbridled autocracy, its characterization as a <em>res publica</em> goes too far in her view. Still, Kollman falls in this revisionist camp (i.e. those that emphasize consensus mechanisms in Russian history) to some degree, and concludes her review stating that, “Muscovite political culture was more than religiously based, the power of the ruler was <em>de facto</em> limited by dense networks of theory, custom, and political pragmatism, ‘autocracy’ was not absolute, and multiple social forces played a role in keeping the realm legitimate.” (Kollman p. 497). Whether Kharkhordin’s effort of translating classical political regime theory into medieval Russia yielded real fruit that fits this description, however, she is less certain. </p>\n\n\n\n<p>Finally, Miguel Vatter returns to the opening claims in Kharkhordin’s article, comparing Novgorod the Great and Venice as mixed regimes, as well as the reassessment of Byzantium along non-caesaropapist lines as a <em>res publica</em> properly speaking (that is, in his words, “always characterized by a republican organization, and not by a fusion of imperial power with Christian religion, that is, by a politico-theological structure of power” (Vatter p. 498)). Enjoyably, Vatter disputes Kaldellis’ own conceptualization of a “republican monarchy” as “a contradiction in terms,” leaving the Kharkhordin argument undermined at the terminological level by Vatter’s very different account of Aristotle and Plato’s understanding of <em>politeia </em>(‘polity’) and its connection to <em>res publica</em>. Thus, the troubles of terminology balloon quite quickly, even just within the confines of the classical sources. </p>\n\n\n\n<p>In doing so, Vatter contests Kharkhordin’s claim of any sort of connection between medieval Russian polities and modern Russia with its “dictatorship of laws”: “[i]n reality, [Putin’s] use of the term ‘dictatorship’ was more likely invoking the Schmittian idea of the dictator (or autocrat) as holder of constituent power whereby his will is <em>ipso facto</em> law. Dictatorship is a rule by decrees; constitutionalism is a rule of law. They are mutually exclusive.” (Vatter p. 500). In this sense, Vatter nods to more modern conceptualizations of authoritarianism, constitutionalism, and political order – underlining the relevance of bringing both classical and contemporary accounts of regime into clearer dialogue. </p>\n\n\n\n<p>Vatter is overall unconvinced by most of the claims in the essay, bringing in a different account of Agamben’s vision of the state of exception as well as the role of acclamation (“the acclamation is a politico-theological device of imperial sovereignty, and not a republican institution”) as well as the uncertain genealogical account of <em>iustitium</em> used by Kharkhordin (Vatter p. 502). Indeed, Vatter sees much in Kharkhordin’s case descriptions that do not fit with the theoretical frameworks on offer, including Kaldellis’ work, the ‘republican monarchy,’ and even the role of popular “tumults” as constituting a regime practice in and of itself. He finds these all to be of dubious relevance to the actual record of political history in Muscovy (or Byzantium, in the case of his dispute with Kaldellis). </p>\n\n\n\n<p>Vatter concludes by reformulating the article, stating that, “[i]n the end, if I understand Kharkhordin correctly, he believes that republicanism is characterized by a mixed form of government, and that this is best delivered by a Venetian model, because the Roman one (in the case of all three imperial Romes) ultimately tends to collapse into a Weberian <em>Führer-Prinzip</em> (to employ an anachronistic formula) in which the emperor assumes absolute power and all legal authority on the basis of the acclamation of ‘his’ people (or troops)” (Vatter p. 503). The problem of case categorization and application remains far from overcome, in Vatter’s reading, while also posing serious questions about the concept of the state of emergency, its potential for political institutionalization, and its relation to the structural assumptions of the mixed regime classification. </p>\n\n\n\n<p><strong>Useful Takeaways from a Curious Exercise</strong></p>\n\n\n\n<p>Where does this leave us? It should leave us pleased with the vast vistas which can be opened when one takes classical concepts seriously and brings them into application beyond their origin. It should also forcefully remind us of the potential difficulties and complications in doing so, which cannot be assumed or wished away. There are tremendous open fields to explore, dispute, and engage with classical political concepts in contemporary scholarship, but these opportunities have to be balanced with the reality that such terms and interpretations are far more uncertain and disputed than we might sometimes like to think. </p>\n\n\n\n<p>The belief that there is a singularly authoritative conceptual tradition from which to draw easily and uncomplicatedly cannot be sustained, at least not when faced with empirical application. Yet for those interested in either the classical political forms or the ‘state of exception’ concept found in 20<sup>th</sup> century heterodox political thought, there is much to be mined and much more to be careful with. </p>\n\n\n\n<p>My own view is that those newly working in the classical tradition sometimes rely on an overly truncated set of literature dealing with these sorts of questions. Sticking only to the Aristotelian-Polybian models of political order leads one to miss a great deal of complexity in how we understand regime, and premodern sources are sometimes shockingly imprecise. </p>\n\n\n\n<p>Look only to the <em>specula principum</em> (‘<a href=\"https://postliberalorder.substack.com/p/mirror-of-princes\">mirrors for princes’</a>) genre of political advice literature, which has classical antecedents but was particularly popular in the Medieval and Early Modern periods. This genre, produced by both Catholic and Protestant thinkers, struggled with ideal-typical questions of political regime, authority, and order in dialogue with the actually-existing challenges of rule for practicioners. Indeed, just glance at works by <a href=\"https://isidore.co/aquinas/DeRegno.htm\">Saint Thomas Aquinas</a>, <a href=\"https://plato.stanford.edu/entries/cusanus/\">Nicholas of Cusa</a>, <a href=\"https://plato.stanford.edu/entries/bodin/\">Jean Bodin</a>, and <a href=\"https://oll.libertyfund.org/title/althusius-politica\">Johannes Althusius</a>, among many others, for disputes about what the ‘mixed regime’ alone really entails. </p>\n\n\n\n<p>Translating these core accounts out-of-area – to Byzantium, to Muscovy, and elsewhere – further illustrates the difficulties of conceptualization at both the ideal-typical and empirical level. And this challenge is hardly new. Yet if we want to engage seriously in the comparative study of political regimes, that is exactly what one must do. </p>\n\n\n\n<p>In the end, Kharkhordin’s ultimately quite flawed article remains a valuable resource and instructive example of all these difficulties – as well as the opportunities provided when able to work through such issues seriously. Connecting classical frameworks to contemporary accounts of political order (authoritarian or otherwise) will likely bear considerable fruit in time. The project to bring the classical tradition into dialogue with the modern age, mining it for insights and using it as a touchstone point from which to reassess and strengthen scholarship, is a worthy one, but we must be cognizant of both its possibilities and its problems. </p>\n\n\n\n<p><strong>A Note for Interested Readers </strong></p>\n\n\n\n<p>For those with university library access (or membership with ASEEES), the articles briefly and insufficiently summarized here should be <a href=\"https://www.cambridge.org/core/journals/slavic-review/issue/E2569DFC6D671B5D5F5EDDA5847FBE73\">available</a> in PDF format for free. For those without, you are welcome to <a href=\"https://julianwaller.weebly.com/contact-information.html\">message me</a>.</p>\n\n\n\n<p><strong>Selected Bibliography</strong>: </p>\n\n\n\n<p>Kharkhordin, Oleg. “Authority and Power in Russia.” <em>Slavic Review</em> 80, no. 3 (2021): 469–88. doi:10.1017/slr.2021.144.</p>\n\n\n\n<p>Kaldellis, Anthony. “Response to ‘Authority and Power in Russia.’” <em>Slavic Review</em> 80, no. 3 (2021): 489–91. doi:10.1017/slr.2021.150.</p>\n\n\n\n<p>Kollmann, Nancy Shields. “A Muscovite Republic?” <em>Slavic Review</em> 80, no. 3 (2021): 492–97. doi:10.1017/slr.2021.152.</p>\n\n\n\n<p>Vatter, Miguel. “The Third Rome and Russian Republicanism: A Comment on Oleg Kharkhordin ‘Power and Authority in Russia.’” <em>Slavic Review</em> 80, no. 3 (2021): 498–503. doi:10.1017/slr.2021.151 </p>\n"
}