{
  "title":"Bleeding Montana",
  "date":"2022-11-11T18:37:45.000000Z",
  "author":null,
  "id":"https://iusetiustitium.com/?p=1863",
  "link":"https://iusetiustitium.com/bleeding-montana/#utm_source=rss&utm_medium=rss&utm_campaign=bleeding-montana",
  "content":"\n<p>In August, Kansas voters rejected a constitutional amendment specifying that the Kansas Constitution did not protect a right to abortion or require the state government to fund abortion. In response, <a href=\"https://iusetiustitium.com/the-price-of-victory-in-kansas/\">I wrote a </a><a rel=\"noreferrer noopener\" href=\"https://iusetiustitium.com/the-price-of-victory-in-kansas/\">piece</a><a href=\"https://iusetiustitium.com/the-price-of-victory-in-kansas/\"> here</a> pointing out that this was precisely the result that the conservative legal movement sought via the Supreme Court’s decision in <em>Dobbs</em>. The only principled position, we have been told, is neutrality. The voters can approve or disapprove abortion as they like, but what matters is that the voters decide. The Constitution does not tell them what they must or must not do, and judges must not interfere with this posture of principled neutrality. </p>\n\n\n\n<p>Such a position does not have deep roots in the classical legal tradition, which certainly does not hold that the law can be neutral on essential questions of morality, letting the voters decide such basic questions as who is alive. And one can find arguments against the idea in the American tradition, including in Abraham Lincoln’s arguments against Stephen Douglas’s principled neutrality on the question of slavery. I said so. <em>New York Times</em> columnist Ross Douthat took issue, <a href=\"https://twitter.com/douthatnyt/status/1554966481590489088?s=61\" rel=\"noreferrer noopener\">saying</a> that I “complain[ed] the Court did Something when it could have just done Everything itself.” The Institute for Human Ecology at the Catholic University of America even took a short break from posting pictures of the saint the day to amplify Douthat’s criticism. (Don’t worry: the Institute got back to posting pictures of the saint of the day.) </p>\n\n\n\n<p>However trenchant the criticism may have seemed to Douthat and his friends at the Institute in August, it is by no means clear that it is so trenchant today. Five states had measures on the ballot relating to abortion. In California, Michigan, and Vermont, the question was whether to amend the state constitution to create an explicit right to reproductive freedom, which is of course a euphemism for abortion. In Kentucky, the question was about an amendment specifying that nothing in the state constitution protected a right to abortion. And in Montana there was a proposal to establish that children born alive were persons and entitled to legal protection. In each state, the pro-life position was rejected. In every state where life was put to the vote, the voters chose the other option. As Douthat says, the Court did Something instead of Everything—and what a Something! </p>\n\n\n\n<span id=\"more-1863\"></span>\n\n\n\n<p>The rejection of the Montana ballot question, Referendum 131, has gotten significant attention, probably because its rejection is shocking. The most relevant provision of the Montana law, if it had been adopted, stated first that, “[a] born-alive infant, including an infant born in the course of an abortion, must be treated as a legal person under the laws of the state, with the same rights to medically appropriate and reasonable care and treatment.” Next it provided that “[a] health care provider who is present at the time a born-alive infant is born shall take all medically appropriate and reasonable actions to preserve the life and health of the infant.” Neither provision addresses abortion <em>per se</em>, but the question of infants born alive during abortion procedures has come up before. President George W. Bush signed the Born-Alive Infants Protection Act into law in 2002, for example.</p>\n\n\n\n<p>About fifty-two percent of Montana voters voted against the provision. Already, at <em>National Review</em>, Wesley Smith <a rel=\"noreferrer noopener\" href=\"https://www.nationalreview.com/corner/why-montana-voters-rejected-the-born-alive-infant-protection-act/\">has argued</a> that Referendum 131 failed because it was badly drafted and failed to make clear that there were potential exceptions to the requirement to provide treatment. Based on this bad drafting, he argues, abortion supporters were able to twist the proposal’s text and argue that the law would ban legitimate palliative care for gravely ill infants. On the other hand, House Bill 167, which is the legislation underlying Referendum 131, was drafted by Matt Regier, a Montana legislator since 2016, who has drafted numerous bills during his legislative career (a fact Smith ignores). That is to say, the author of the law was not a well meaning but inexperienced pro-life advocate but a member of the Montana legislature with plenty of experience drafting laws. </p>\n\n\n\n<p>Certainly, it is possible that the Montana drafters’ failure to produce nuanced legislation simply turned off moderate voters. This view would be consistent with the attitude expressed more broadly by Ed Whelan, of <em>National Review</em> and the Ethics and Public Policy Center, who <a href=\"https://twitter.com/EdWhelanEPPC/status/1590376544111063045\">noted on Twitter</a> that “the <em>Roe</em> regime made it easy for [the] pro-life movement to be absolutist and not to think seriously about the sort of legislative compromises (e.g., rape exception) necessary in real-world politics.” But there are, of course, limits to such realism. In another <a href=\"https://twitter.com/EdWhelanEPPC/status/1590368547821465600\" rel=\"noreferrer noopener\">tweet</a>, Whelan argued “[i]f [the] Court had failed to overturn <em>Roe</em> in <em>Dobbs</em>, lots of social conservative voters would have been badly demoralized, given up on Republican party.” One can think of worse things that would have happened, of course, but the electoral fortunes of the Republican Party are not nothing. </p>\n\n\n\n<p>But such realism—whatever its limits may be—ultimately misses the point. Voters rejected the proposition that an infant born alive “must be treated as a legal person under the laws of the state, with the same rights to medically appropriate and reasonable care and treatment.” We have gone from letting the people decide—as Justice Brett Kavanaugh framed it in his important concurrence in <em>Dobbs</em>—whether a fetus is a human life to letting the people decide whether an infant born alive is a human life. One may argue that the failure of Referendum 131 was not foreseen by <em>Dobbs</em> and the failure of the bill should not be credited to <em>Dobbs</em>. (This is, I suppose, what Ross Douthat would argue.) </p>\n\n\n\n<p>Recall, however, what Justice Kavanaugh said: “The issue before this Court is what the Constitution says about abortion. The Constitution does not take sides on the issue of abortion. The text of the Constitution does not refer to or encompass abortion.” One can simply swap “the moment a ‘fetus’ becomes an ‘infant’” for “abortion,” and the statements would be no less true. Silence, on Justice Kavanaugh’s account, is neutrality: “On the question of abortion, the Constitution is therefore neither pro-life nor pro-choice. The Constitution is neutral and leaves the issue for the people and their elected representatives to resolve through the democratic process . . . .” Silence means neutrality; neutrality means the voters get to decide the question however they see fit. </p>\n\n\n\n<p>Of course, on the classical conception of law, this is absurd. Law is something pertaining to reason, as a rule and measure of human actions (ST I-II q.90 a.1 co.). As such, the law must be ordered to the common good (ST I-II q.90 a.2 co.). Aquinas tells us what this means: “Est autem ultimus finis humanae vitae felicitas vel beatitudo, ut supra habitum est. Unde oportet quod lex maxime respiciat ordinem qui est in beatitudinem. Rursus, cum omnis pars ordinetur ad totum sicut imperfectum ad perfectum; unus autem homo est pars communitatis perfectae, necesse est quod lex proprie respiciat ordinem ad felicitatem communem”—“Now the first principle in practical matters, which are the object of the practical reason, is the last end: and the last end of human life is bliss or happiness, as stated above. Consequently the law must needs regard principally the relationship to happiness. Moreover, since every part is ordained to the whole, as imperfect to perfect; and since one man is a part of the perfect community, the law must needs regard properly the relationship to universal happiness.” (<em>Id.</em>)</p>\n\n\n\n<p>If one takes the silence in the federal constitution as a sort of reservation of rights, which seems to be the thrust of Justice Kavanaugh’s argument, this does not mean that there is absolute neutrality, leaving the people to do as they please. The people still have the obligation to seek the objective common good. As Charles de Koninck put it in <a href=\"https://thejosias.com/2020/05/04/the-correspondence-between-charles-de-koninck-and-charles-n-r-mccoy/\" rel=\"noreferrer noopener\">a 1946 letter to Charles McCoy</a>, “it is not the will of the people that makes the good it pursues a real good, not even a common good per accidens; it may be only a bonum apparens.” To put it another way, the will of the people regarding a putative good is not the decisive question. The common good is the common good notwithstanding the will of the people. And the essence of political life is to seek the common good. </p>\n\n\n\n<p>And we see similar principles at work elsewhere. In a case when the lawgiver has not foreseen the effects of the law under particular circumstances, one may act beside the letter of the law precisely because the lawgiver generally orders his laws to the common good (ST I-II q.96 a.6 co.). Responding to an objection, Aquinas observes “nullius hominis sapientia tanta est ut possit omnes singulares casus excogitare, et ideo non potest sufficienter per verba sua exprimere ea quae conveniunt ad finem intentum”—“No man is so wise as to be able to take account of every single case; wherefore he is not able sufficiently to express in words all those things that are suitable for the end he has in view” (ST I-II q.96 a.6 ad 3). In such cases, the general intention of the lawgiver is what matters, and the general intention is always the common good (else the law would not be a true law). </p>\n\n\n\n<p>The idea, expressed in <em>Dobbs</em>, that constitutional silence leaves the field altogether open for the people to do whatever pleases them is, therefore, alien to the classical view of law. The common good, which is to say the happiness of the body politic (or, to put it another way, the concord of order), is still the end of law regardless of whether a given written instrument says so or not. The will of the people cannot transform an apparent good into even an accidental common good, least of all when the will of the people is opposed directly to the common good. As De Koninck tells us, when the people do not seek even an accidental common good, they are perverse and lose their political nature. (De Koninck also reminds us, “to say that man is by nature a political animal does not mean that they necessarily have the proximate disposition to be citizens; man is by nature many things that he does not actually acquire or become.”) </p>\n\n\n\n<p>Indeed, we have seen that Justice Kavanaugh’s idea that silence equals neutrality is squarely contrary to the classical idea that “nullius hominis sapientia tanta est ut possit omnes singulares casus excogitare, et ideo non potest sufficienter per verba sua exprimere ea quae conveniunt ad finem intentum” (ST I-II q.96 a.6 ad 3). In cases when the lawgiver has not taken account of a given case, the general intention toward the common good supplies the lacuna. The silence of the lawgiver does not create a zone free of the common good, where each person (or group of people or subordinate political entity) can do as he or she pleases. Yet once one rejects the classical concept and adopts the view that silence equals neutrality, the result in Montana follows the result in <em>Dobbs</em> as night follows day. </p>\n\n\n\n<p>A lack of nuance, as Wesley Smith argues, or a failure to make the hard real-world compromises that lawmaking requires, as Ed Whelan implies, is not the problem with the rejection of the Montana referendum. It is fundamentally the idea that, because the Constitution is silent on a particular question, the electorate should be free to decide when a “fetus” becomes an “infant,” and therefore a bearer of subjective rights, including the right to medical treatment. Yet this freedom is precisely what <em>Dobbs</em> establishes, at least, according to Justice Kavanaugh, who provided the essential fifth vote for the majority opinion. To be sure, there is plenty of room for nuance and compromise in the law. But not here. </p>\n"
}