{
  "title":"Theology of the Bowels",
  "date":"2021-08-20T11:07:58.000000-07:00",
  "author":null,
  "id":"http://thomism.wordpress.com/?p=24044",
  "link":"https://thomism.wordpress.com/2021/08/20/theology-of-the-bowels/",
  "content":"\n\n\n\n<p> John 7 : 37-38</p>\n<blockquote>\n<p>On the last day, the great day of the feast, Christ stood and cried out saying “If anyone thirsts, let him come to me and drink. As Scripture says, <em>the one believing in me, rivers of living water will flow out of his bowels</em>.”</p>\n</blockquote>\n<p>Bowels here translates κοιλία or the Vulgate’s <em>venter, ventris </em>which are the hollow interior parts of persons starting under the ribs and ending at the genitals. The usual scriptural meaning is <em>womb </em>but often <em>belly,</em> and so signifies the principle of human life and its continuation. Human life comes forth from the κοιλία and continues by filling it again. </p>\n<p>1.) <em>Human life has a principle in the hollow or emptiness</em>. The κοιλία are fundamentally a hollow or dark cavity within. We don’t come forth from a treasury or fortress nor do we live with a storehouse at our center but from parts that cannot create unless they first receive, and what we receive is enough not for all life but for the day or even for the hour. </p>\n<p>2.) <em>God blesses the κοιλία. </em>This is clearest in Elizabeth’s inspired praise of Mary <em>blessed are you among women, and blessed is the fruit of your κοιλία. </em>Elizabeth might here be drawing from the praises of <a href=\"_wp_link_placeholder\">Deutoronomy 28</a>.  The blessing upon man is from the beginning, a blessing that is more primordeal than even his own existence. This is verified most of all in Christ, who was in his person blessed from all ages and the principle of the blessing of all other things. Christ gives this blessing primarily by giving the spirit, as is clear from John’s explanation of the quotation at the head of the post “he said this concerning the spirit whom the ones believing in him were about to receive.”</p>\n<p>3.) <em>The κοιλία is also under the place where we bear our curse. </em>This is clearest in the cursing of the serpent: <em>on your κοιλία shall you crawl all the days of your life, and dust you shall eat. </em>The sense is that he must act (crawl) only on the principle of his own life, and even then not according to how it was meant to function but only by its exterior part. As a consequence he will not be fed (dust you shall eat.) The life of sin seeks to attribute agency to what is in itself fundamentally receptive and as a consequence feeds on what cannot nourish.  </p>\n\n\n<p>4.) <em>The <em>κοιλία</em></em> <em>are the place of compassion. </em>Whereas we tend to ascribe tenderness to the heart Scripture speaks more often of the <a href=\"https://www.blueletterbible.org/lexicon/g4698/kjv/mgnt/0-1/#lexResults\">bowels of compassion</a> which are attributed even to the divine nature (cf. <a href=\"https://www.blueletterbible.org/kjv/luk/1/78/t_conc_974078\">Luke 1: 37</a>.)</p>\n"
}