{
  "title":"Theocentric Theology",
  "date":"2021-08-07T09:55:04.000000-07:00",
  "author":null,
  "id":"http://thomism.wordpress.com/?p=24014",
  "link":"https://thomism.wordpress.com/2021/08/07/theocentric-theology/",
  "content":"<p>In commenting on a rubric specifying that the altar of the church should be positioned so as to allow a liturgy <em>versus populum, </em>the commentary on the Novus Ordo says:</p>\n<blockquote><p>A theocentric theology occasioned the iconostasis and the altar apart from the people in the Eastern branches of Christendom as well as the people and the priest together facing God in Latin Christendom during and after the Middle Ages; an anthropocentric emphasis in theology has occasioned the current stance of the priest and people in immediate dialogue with each other. Each approach has its values and also its deficiencies. When the deficiencies of either approach become sufficiently evident, the pendulum swings in the opposite direction. Balanced, mature understanding is conscious of this tension.</p>\n<p><em>The New Order of the Mass. </em>Commentary on Para. 262</p></blockquote>\n<p>It’s hard to read this as anything other than a devastating criticism of the Novus Ordo. If “an anthropocentric emphasis in theology” is here taken as incompatible with “a theocentric theology” then it’s hard to see how this is anything but fatal to the anthropocentric emphasis. What else could theology <em>be </em><em>except </em>theocentric? It’s as though one were proposing a theory of chemistry incompatible with chemical elements or a theory of medicine opposed to health.</p>\n<p>But there are obviously silly understandings of the commentary passage. First of all, whatever the passage is saying, it isn’t talking about a shift to idolatry. An anthropocentric emphasis can’t be a shift in the object of worship. The terms of the opposition also require us to understand whatever this shift is within theology as such or a discourse or attention upon God.</p>\n<p>As a Thomist, I’m brought to mind of the divisions of Thomas’s Summae, the first which might be called a theocentric theology (The Prima Pars, Books 1 and 2 of <em>Contra gentiles</em>) and the second a theology with an anthropocentric emphasis (The Secunda Pars, Book III of the <em>Contra gentiles.</em>) As Thomas explains it, the possibility of this shift in emphasis is from the person being in the image of God and so to study himself in precisely this way is a properly theological act. But it’s better to follow Thomas’s larger sweep of thought by seeing both these dimensions of theology as contained in the mystery of Christ. This is obvious not only from the <em>Summae</em> themselves but also from Thomas’s own life, in which his final and culminating theological statement was spoken to Jesus himself in which he asked for nothing but Jesus Christ. So while no Christian can understand an anthropocentric shift as a shift in the ultimate object of theology or <em>any </em>object of worship, we also can’t rule out the possibility of an anthropocentric emphasis within the ambit of theology.</p>\n<p>The commentary itself sees this emphasis within theology as unstable and periodic, insisting that we are eventually driven from one emphasis to the other by theology itself, which probably arises from the centrality of Christ and history as the theater of revelation since history is proper to human beings (there being neither progress or eras for elm trees or angels.) I’m familiar with this from my own life as a Thomist, which flips back and forth between fascination with Thomas’s account of God as one, triune and creator and fascination with his account of the human soul and human happiness. This happens in one’s love of Augustine too, who adds the dimension of both emphases working themselves out in history, though in doing this he is clearly just following the the lead of Scripture. The dialectic in theology that flips between Patristic-Scholastic abstraction and scientific theology and the more modern approach that is linguistic and historical is probably another example of this same thing.</p>\n<p>But how does this shift play out in liturgy? The commentary claims that it arises by the impossibility of symbolizing both separation and communion. The symbology of separation gives us an iconostasis, Latin, prayers <em>in secreto</em>, altar rails, symbols that are exotic or outside of familiar symbology, etc and by the second we get open-concept churches or even churches in the round, vernacular, microphones, simplification of symbols, etc. The first approach <em>symbolizes</em> the holy as separate from the world, numinous and potentially dangerous; the second as self-giving and interpersonal. The first approach runs the risk of identifying piety with formalism and religion with clerics, the second runs the risk of the banality of a liturgical action that all can perform; though the ultimate risk of each approach is simply that it can’t provide the benefits of the other and the degree to which this bothers us is one cause of our criticism of liturgy and the demand for its reform.</p>\n"
}