{
  "title":"Determinism and occasionalism",
  "date":"2021-08-27T11:22:54.000000-07:00",
  "author":null,
  "id":"http://thomism.wordpress.com/?p=24060",
  "link":"https://thomism.wordpress.com/2021/08/27/determinism-and-occasionalism/",
  "content":"<p> 1.) If God’s action of determining the will to act makes my action not free then his action of determining the fire to burn makes its action not natural. Creation negates nature as soon as freedom. </p>\n<p>2.) Thomas divides a free cause from a first cause since some free causes are secondary or instrumental causes secundum quid. If he didn’t do this then to establish something is free would be ipso facto to prove it was divine. The reasonableness of the distinction should be clear to anyone who gave a cosmological argument  that inferred divinity immediately from any free choice. </p>\n<p>3.) In discussions of science and religion it’s a truism to seek a rapprochement by claiming that God is the author of nature. But if God’s authorship of nature – even in its concrete expression – allows nature to act naturally and not destroy it then his authorship of free agents and actions – even in their concrete expression here and now of and even my writing this word – does not destroy freedom. </p>\n<p>4.) Is the sense that nature can be subordinate in a way that freedom is not? This is true, since natural action has less autonomy and self-action than a free action. For all that, free actions simpliciter can be secondary causes secundum quid.  </p>\n<p>5.) If you throw up your hands and say “well then I guess that there isn’t free action <em>or</em> natural action” then here again you’re right in a sense, since the way in which God’s action is free and natural is proper and unique to him and not communicable to creatures. If you decide that free action or natural action <em>just is </em>the action of a first cause, then what you’ve discovered is not the negation of freedom and nature but the <em>first analogue </em>of freedom and nature. Your problem is not in your theory of causality but your theory of divine names that imputes univocal predicates to God and creatures. </p>\n<p> </p>\n\n\n<p></p>\n"
}