{
  "title":"Thomas on dualism/physicalism",
  "date":"2021-08-14T08:22:35.000000-07:00",
  "author":null,
  "id":"http://thomism.wordpress.com/?p=24033",
  "link":"https://thomism.wordpress.com/2021/08/14/thomas-on-dualism-physicalism/",
  "content":"\n<p>1.) Thomas’s most extensive treatment of what we now call the mind-body problem or the debate between dualism and physicalism is his treatise on the union of the soul and the body in II <em>Contra gentiles</em> c. 56-72. </p>\n\n\n\n<p>2.) Though he synthesizes themes in many philosophical traditions, Thomas here as elsewhere uses Aristotle as the base for integration. The choice is not one of taste: Thomas positions the dualist-physicalist debate as both forcing an Aristotelian solution and finding their only solution in it. Materialism came first as the basis of any honest man’s attempt to understand mind, Plato was the first to spotlight its insufficiencies and contradictions in a way that preserved the rigor and clarity of the materialist project, but Plato himself overcorrected and lost the genuine insights of materialism. </p>\n\n\n\n<p>3.) As a virtue is opposed to both vices <em>simpliciter</em> while still being closer to one extreme than another in a qualified sense, Thomas’s Aristotelian account of the soul is opposed to both dualism and materialism while being closer to dualism in a qualified sense. Nevertheless, Thomas criticizes dualism at length with arguments that any materialist would be happy to use, fundamentally in his insistence that natural beings are essentially material human beings are natural simply because they are seen, smelled, heard and born. </p>\n\n\n\n<p>4.) Thomas’s solution is that man is a hylomorphic composite of an immaterial and material principle, but he’s not blithe about the difficulties this involves. He lists five up front: </p>\n\n\n\n<p>a.) Two substances can’t make one while being both actual, so if man is actually physical he can’t be actually immaterial. </p>\n\n\n\n<p>b.) Hylomorphism is the union of matter and form, but matter and form are one genera and immaterial and material beings are not. </p>\n\n\n\n<p>c.) Something in matter as its form is a material form. </p>\n\n\n\n<p>d.) Forms are not separate, but an immaterial form is separate. </p>\n\n\n\n<p>e.) What exists in a body has bodily existence, and what has bodily existence has bodily operation, so if mind exists in body it has a bodily operation. The claim here is the same as saying “I am material and I think, therefore matter thinks.” </p>\n\n\n\n<p>5.) we know ourselves as material first and there is no end of insightful explanations we can give of ourselves as material beings. Natural science might have years of low-hanging fruit in evolutionary, neuroscientific, and psychological accounts of human action, and attributing thought to computers might one day become as exclusive as attributing mowing to lawn mowers and other machines. To expand on that,  <em>mower </em>was once a name for a man and not a machine, like the harvesting peasants described in Part 3 c. 2 of <em>Anna Karenina. </em>So if I call a mower whatever can do what I want with a plant-cutting blade, why not call a thinker whatever can do what I want with words or symbols?  </p>\n"
}