{
  "title":"The desire for an empirical world",
  "date":"2021-08-21T10:38:42.000000-07:00",
  "author":null,
  "id":"http://thomism.wordpress.com/?p=24047",
  "link":"https://thomism.wordpress.com/2021/08/21/the-desire-for-an-empirical-world/",
  "content":"\n<p><em>Whenever A and B are really distinct and found together, whether simultaneously or as terms of a motion, this is not because an actual A is actually B but either because a potential B is an actual B or two potential Cs are actually so.  </em></p>\n\n\n\n<p>Parmenides figured out everything up to the “but” but did not leverage the truth into an insight into the difference between the potential and actual and so attributed real distinction in things to an act of the intellect. If a butterfly goes from Nevada to Utah this is not because Nevada becomes Utah (which is impossible) but because some butterflies outside Utah have the power to get there. If brown sugar is sweet it is not because it is so <em>as brown, </em>since this is both a category mistake and impossible. While it’s true that sugar is sweet as sugar (or, if one wanted to quibble about this, all I’m targeting is some essential accident of a substance) nevertheless this is not because substances are accidents, even their essential ones. Here too there are orders of potentiality and act: the substance actualizing the accident’s potential being absolutely and the accident actualizing the substance’s potential being with some qualification. </p>\n\n\n\n<p>Absent potential being we’ll have to deny real distinctions being found together as Parmenides does. One halfway- house step is to call all things heaps of properties as Hume does, but in good logic he should also call motions heaps of termini, and just as he denies any substance of an apple that is red and sweet so too he has to deny any traveller that goes from La Flèche to Edinburgh. In some sense Hume does this in his denial of causality which would have to deny even the material and agent causality of a traveller, but this too leaves us with the Parmenidean world of motion only existing in the intellect or human opinion. </p>\n\n\n\n<p>The Parmenidean or Humean world is both desirable and more fundamental. Potency is not empirical <em>simpliciter</em> as though one could distill out a ghostly pink goo from things that was somehow equivalent to all the substances or accidents they could acquire or become. Potency isn’t real in the normal, pound-the-table sense of reality and this to some extent justifies its empirical dismissal. Potency is not some tertium quid in addition to observable qualities but a different order of reality necessary to account for the unities we find among a things with diverse temporal and non-temporal parts. </p>\n\n\n\n<p>The Empiricist is right that there is no need for such a shadowy-subtending world except that the purely luminous world he wants to look at and lay before his listener is not the physical world but the domain of God and the saints. Again, Empiricism is right that our understanding of the fundamental order of things is one where there are only heaps of qualities without substances, which qualities are held together <em>in their division</em> only by an act of the mind, but these heaps are the divine essence virtually distinguished by our intellect into diverse attributes but which is in itself the transcendent foundation of what we conceive in disjunction. Empiricism can thus only be perfectly verified in the beatific vision, but short of this it has to allow for not just being <em>simpliciter</em> but also a subtending and less-real <em>secundum quid</em> being of potency. We have to get rid of these Scholastic niceties, just not now but eschatologically. </p>\n"
}