{
  "title":"Translating Ignatius’s Rules for discernment",
  "date":"2021-08-31T13:33:31.000000-07:00",
  "author":null,
  "id":"http://thomism.wordpress.com/?p=24080",
  "link":"https://thomism.wordpress.com/2021/08/31/translating-ignatiuss-rules-for-discernment/",
  "content":"\n<p>The multiple manuscripts for Ignatius’s Rules of Discernment have significant differences (for a comparison of the Autograph Spanish text and the Vatican approved <em>Vulgata </em><a href=\"https://ams.ceu.edu/2010/Sabau.pdf\">see here</a>.) The most common English translation is Mullan’s 1914 translation from the Spanish text, which gives Rule One as </p>\n\n\n\n\n\n<blockquote class=\"wp-block-quote\"><p>In the persons who go from mortal sin to mortal sin, the enemy is commonly used to propose to them apparent<br>pleasures, making them imagine sensual delights and pleasures in order to hold them more and make them<br>grow in their vices and sins. In these persons the good spirit uses the opposite method, pricking them and biting<br>their consciences through the process of reason.</p></blockquote>\n\n\n\n<p>The 1835 Latin text, however, is </p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>To those persons who easily sin mortally and add sin to sin our enemy is usually accustomed to set forth forbidden delights of the flesh and of the senses to keep them filled with sins and to always add to the number of those sins. The good spirit, on the other hand, continually pricks their conscience and deters them from sin through the service of conscience and reason. </p></blockquote>\n\n\n<p>The 1835 text gives clearer descriptions of at least four things: </p>\n<p>1.)<em> Sinners</em>. The 1914 text describes the sinner metaphorically as “going” from sin to sin whereas the Latin text describes him literally as sinning with ease and adding one after another. 1914 gives only one distinguishing criteria of the sinner, 1835 gives two. </p>\n<p>2.) <em>The enemy or bad spirit. </em>In 1914 the spirit blandly offers temptations to the imagination so as to make them grow in sins. In 1835 it keeps them both <em>filled with sins</em> and goads them to <em>add to their number</em> in its insistence on a binging consumption without rest. </p>\n<p>3.) <em>The object of temptation. </em>In 1914 it is the almost incoherent “apparent pleasures” of “sensual delights and pleasures.” One can make this work with a theory that pleasures of sense that are contrary to reason are only pleasant per accidens (since they are not pleasures for man as man, and so not per se.) It’s simpler to just call them illicit and then to divide them into the carnal and those of “the senses”, i.e. the lust of the flesh and the lust of the eyes. As the commentary on 1835 puts it, the carnal pleasures are the animal ones and the sensual the lower pleasures proper to man like desire for honor or money. </p>\n<p>4.) <em>The good spirit. </em>It’s on this score that 1835 is incomparably better.  In 1914 the good spirit is said to “bite” the sinner, i.e. to attack in hostility in a way proper to an animal so as to wound him, just as in Rule Two the evil spirit is said to “bite” those who are striving to go from good to better. In 1835 the good spirit <em>pricks </em>those in sin, i.e. he gives a sharp, short lived pain that is meant entirely as a warning that makes one “ouch!” <em>and then its over.</em> The good spirit deals even with those in the basement of the spiritual life with minimal pain and compassion, with a sudden sharp warning so long as they keep reaching into spiritual thorns.  One <em>can </em>interpret 1914 in this way, but the “bite” of the good spirit has to be understood differently from the “bite” of the bad one. Ignatius is clear in later rules that the bad spirit threatens, acts aggressively, presses his advantage whenever he can, etc. but any bite of the good spirit is not like this.  1835 also describes the good spirit as acting though the <em>officium </em>of synderesis and reason, the sense being that he appeals to powers doing their proper work of service from within us. The attack of the evil spirit is never an <em>officium </em>and can never appeal to any of our <em>officia. </em></p>\n\n\n<p></p>\n"
}