{
  "title":"The point of criminalization",
  "date":"2021-08-11T18:06:06.000000-07:00",
  "author":null,
  "id":"http://thomism.wordpress.com/?p=24023",
  "link":"https://thomism.wordpress.com/2021/08/11/the-point-of-criminalization/",
  "content":"\n<p>So what’s the point of criminalizing drugs? </p>\n\n\n\n<p>The question isn’t rhetorical: I’m in favor of criminalization. But the implicit assumption most persons have about drug criminalization is unsustainable, namely that the point of continuing a policy of criminalization is to diminish the illegal drug supply or at least interrupt its supply chains in significant ways. All this is implicit in the paradigm metaphor of American criminalization as a “War on Drugs” since the point of wars is to make significant advances leading to eventual defeats of one’s enemies or at least to significantly interrupt their activity. A perpetual war is literally Orwellian, being one of the central features of the regime described in <em>1984. </em></p>\n\n\n\n<p>While the literature on drug statistics is not unanimous, if we understand criminalization as a <em>war </em>it is hard to see how any measurable gains (decreased number of overdoses in ERs?) are proportionate to its extent and expense. Even if decriminalization would lead to an increase in use, the war does not diminish the use we have. So why not legalize and regulate? </p>\n\n\n\n<p>The mistaken assumption in all this is that the point of criminal law or the justice system is to eliminate crime or somehow cure us of it. To say the assumption out loud is to immediately realize its absurdity: we don’t take non-diminishing or even increasing rates of murder, rape, car theft, perjury or insider trading as evidence for their legalization. The typical criminal code is sufficiently justified by punishing evils and does not require the additional justification of eliminating them, especially not in a grand an universal way. </p>\n\n\n\n<p>To be sure, drugs can be taken for therapeutic reasons, but therapeutic use by definition tries to minimize addiction and work for the good of the patient whereas the point of the drug trade is to make and exploit addicts and maintain them in a minimal state of health, diverse interests, balanced living and self-control. Dealing dehumanizes and degrades and those who do so need to be punished. As with any crime there are extenuating circumstances and exculpatory factors that need to be taken into account, but after all those are taken into consideration we still need to live in a world where Pablo Escobar ends up in jail. Perhaps more to the point, we deserve to live in a world where a corporate executives end up in jail if they intentionally set out to make and exploit addiction to opiates, ADHD drugs, or sugary food. This last point is ultimately why I’d reject both the “war on drugs” and legalization, since the first wrongly thinks that laws can do away with evils and the second in practice means that those with a monetary incentive to make and exploit addicts aren’t punished for doing so. </p>\n"
}