{
  "title":"Transcending the perfections of work and rest",
  "date":"2021-08-28T16:59:17.000000-07:00",
  "author":null,
  "id":"http://thomism.wordpress.com/?p=24068",
  "link":"https://thomism.wordpress.com/2021/08/28/transcending-the-perfections-of-work-and-rest/",
  "content":"<p>Augustine concludes <em>Confessions</em>: </p>\n<blockquote>\n<p>52. For even then shall You so rest in us, as now You work in us; and thus shall that be Your rest through us, as these are Your works through us. But You, O Lord, always work, and are always at rest. Nor do You see in time, nor do You move in time, nor do You in time; and yet You make the scenes of time, and the times themselves, and the rest which results from time.</p>\n</blockquote>\n<p><em>You always work and are always at rest. </em>Both reduce to the divine goodness, the first by his work of creating and redeeming the world and the second by the impossibility of his being perfected by anything or acquiring make him better. His creation was moreover for the sake of drawing creation to himself above all in sharing the goodness of his divine essence by salvation, and so the same divine goodness that is the principle of his actions outside himself in redemption is the goodness in virtue of which he remains ever at rest within himself. </p>\n<p>As the Thomist tradition generalized this there is one formal ratio of divine action and divine inaction (cf. John of St. Thomas, <em>Cursus Theologicus</em>, q. 19 disp. V a. 1), not because the divine nature escapes or even flouts the principle of contradiction but because the divine infinity and pure act make any property formally present in him so far as his essence transcends the way in that property is opposed to another among finite things. Just as the friendship of virtue is pleasant and useful while both the friendships of utility and of pleasure are opposed to each other, so too the divine essence includes both action and inaction formally in its transcendence while action and inaction on their own level are opposed to each other.* So <em>action </em>(or inaction) in a created thing is just action (or inaction) but in God it is the divine essence so far as action is formally in an essence that transcends the opposition between action and inaction as diverse perfections described by Augustine (cf. Cajetan <em>in Primam Partem</em>, c. XIII c. 5 esp ¶ VII and VIII).  </p>\n\n\n<p>The divine simplicity is virtually multiple so far as the simplicity itself unites perfections that, as understood and signified by us, are limited to themselves and thus opposed to other perfections. The divine infinity is of course incompatible with finitude and so with any opposition of perfections. This is the sort of argument that seems to be always overlooked by Analytic philosophers and some contemporary Eastern theologians who think that the contingency of creation has to be traced back to some destruction of necessity in divine action or that divine freedom is incompatible with the perfections of necessity. The Analytic-Eastern mistake smells like a return of the teaching of Eunomius, where “God knows no more of his own substance than we do; nor is this more known to him, and less to us: but whatever we know about the Divine substance, that precisely is known to God; and on the other hand, whatever he knows, the same also you will find without any difference in us (<a href=\"https://www.newadvent.org/fathers/26014.htm\">Church History</a> Book IV c. 7.)” </p>\n\n\n\n<p>______</p>\n\n\n\n<p>This property also often belongs to virtue as such. Virtue is a <em>mean</em> between two extremes by transcendently containing the perfections of the extremes, e.g. if gluttony is one extreme seeking primarily pleasure in food and anorexia is another extreme seeking self-control with respect to it, only temperance is essentially taking pleasure both in food and one’s own self-control.  </p>\n"
}