{
  "title":"God and evidence",
  "date":"2021-08-24T15:44:31.000000-07:00",
  "author":null,
  "id":"http://thomism.wordpress.com/?p=24050",
  "link":"https://thomism.wordpress.com/2021/08/24/god-and-evidence/",
  "content":"\n<p>I overheard two Twelve-year-olds arguing about religion and one stated with great confidence to the other “you have no physical evidence for that<em>.” </em>I put me in mind of Bertrand Russell’s quip that if he died and found himself face to face with God he’d protest “there wasn’t enough evidence.” So we all seem to be working from a theory of <em>evidence </em>that invests it with an omnipotence (or even a super-omnipotence) capable of going toe-to-toe with divinity and winning. <em>Evidence</em>! is a sort of one word exorcism sufficing to drive out the gods. This all involves a theory of evidence whose clarity and unity is largely imaginary, and which has been tendentiously rigged to exclude testimonial evidence and rigorous argumentation, but I’ll ignore this <em>arguendo</em> and see what I get.</p>\n\n\n\n<p>On the one hand, expecting evidence for the supernatural is like expecting blood work for a rigged election or DNA results for the translation of cuneiform. The means of proof are disproprtioned to the object, or even in different categories. Like many elements of experience God is not a technology or a consensus reached by naturalists after a series of physical trials. Should he be? Maybe if we’re talking about his interventions in history, but then we’re on the familiar terrain of sifting through depositions, eyewitness accounts, canonization documents, etc. Even then, Scripture doesn’t give a historical narrative of continual worldwide miracles but a few moments of intense miraculous activity at nodal points in the history of salvation, sc. the Exodus, the beginning of the prophetic age, Christ’s public ministry, and the apostolic age. The Church also sees miracles as part of canonization as a sign that a person should be raised to public veneration, which is a sort of new node in the history of salvation, and it looks forward to some miracles at the end of the world, but outside of this God seems to show his preference for the ordinary course of nature. This befits God since creation is his first effect, but it might also be necessary since a new nodal point in salvation history only has meaning against a backdrop of the ordinary course of nature. Miraculous interventions are not usually made in order to meet even very sincere and pressing needs but to announce that something new is breaking out in history. At such times we’d expect some evidence, but the overwhelming number of times are not such times, which should inform our expectations of intercessory prayers which we’d want to suspend the natural order. To be sure, miracles aren’t limited to the narrow transition moments of salvation history but they are also part of extraordinary providence as opposed to some typical law or rule of the spiritual life, so expecting miracles on demand under the sort of controlled circumstances that yield physical evidence is unrealistic even if not presumptive. Another complicating factor is <a href=\"https://biblehub.com/luke/16-31.htm\">Christ’s insistence that</a> miracles don’t convert hearts <em>ex opere operato </em>but only by antecedent grace. Would I know one even if I saw it?</p>\n\n\n\n<p>So what is God doing in the meantime moments of salvation history like our own? In the Christian dispensation he’s freeing from sin so as to give the gift of himself. I suppose we could demand evidence of this, but it’s not obvious what it would look like. The union of the heart to God is not entirely interior: public ritual, moral transformation, works of mercy, evangelization and some sorts of devotion take place in the physical world but the cause that makes all these visible actions different from playacting or autosuggestion is supernatural and therefore not observable, and anything working within the heart, whether supernatural or not, whether convincing us of theism or atheism, is by definition not publicly verifiable.</p>\n\n\n\n<p>If I had a scientific theory of the working of the human heart I suppose I could compare it to whatever I think is supernatural and see whether I’m misinterpreting the evidence that convinces me to believe, but the difficulties with such a theory start right out of the gate. We all have hearts but no one could take a “science of the heart” seriously, but for all that it’s at work whether we worship God or deny him for love of evidence.</p>\n"
}