{
  "title":"Conditional necessity of acts, with grace and without",
  "date":"2022-10-28T16:02:50.000000Z",
  "author":null,
  "id":"http://thomism.wordpress.com/?p=26118",
  "link":"https://thomism.wordpress.com/2022/10/28/conditional-necessity-of-acts-with-grace-and-without/",
  "content":"<blockquote><p>(1) Every time God permits sin, the man will sin</p>\n<p>(2) Every time God does not permit sin but rather gives grace, man will not sin.</p></blockquote>\n<p>Thomas believes both conditionals are <em>necessarily </em>true, but that their necessity is only in the composed sense and not in the divided sense. The analysis is the same as <em>if you are sitting, you cannot be standing</em>, namely, <em>given </em>you are sitting it is impossible for you to be simultaneously standing; but the truth of the conditional is not a proof for your <a href=\"https://en.wikipedia.org/wiki/Astasis\">astasis</a>, just as the truth of (1) or (2) is not a proof for your sins not being done freely.</p>\n<p>The necessity of the composed sense in (1) is not the same as (2.) In (1) the antecedent is a sheer<em> sine qua non</em> for the consequent, while in the second the antecedent is an efficient cause. By a <em>sheer</em> sine qua non, moreover, we mean it does not enter into the proper account of why the consequent arose, like when one says <em>if an angel did your homework, it would not be missing. </em>The conditional is true, but it plays no role in the proper account of why the homework is missing, because the sufficient cause of the missing homework is something apart from the angels, just as a sufficient cause of sin is the fallibility of the creature.</p>\n<p>The efficient causality of (2) is of a primary cause and not a secondary one, and so cannot be understood as a rival to the autonomy of its effect but as presupposed to it. This is simply how we find things: if there is created free act, by definition there is an creating efficient cause prior to the created free act. If a free act had no efficient causal antecedents, any free act would be a divine act, and any claim to free choice would be a claim to divinity.</p>\n<p>Again, assume you had always understood the relation between God and freedom like this: “God makes persons exist, then persons make their acts exist.”  This is fine, but you don’t mean either that persons produce actions <em>ex nihilo </em>or that God does not. So <em>exists </em>is being said in analogous ways, first in the manner of a primary cause and next in the manner of a secondary one. Both act freely, and the freedom is an indetermination of alternatives, but the primary cause’s alternatives between being and non being simpliciter are not the same as the secondary cause’s alternatives between being and non being secundum quid. More to the point, “to act in the manner appropriate to a primary cause” is to act precisely as establishing a secondary cause in its being as autonomous.</p>\n"
}