{
  "title":"Gerrigou on permission of sin vs. withholding of efficacious Grace",
  "date":"2022-10-26T21:16:43.000000Z",
  "author":null,
  "id":"http://thomism.wordpress.com/?p=26113",
  "link":"https://thomism.wordpress.com/2022/10/26/gerrigou-on-permission-of-sin-vs-withholding-of-efficacious-grace/",
  "content":"<p>Gerrigou distinguishes four moments in the commission of sin:</p>\n<blockquote><p>1.) God allows a moral defect in a creature.</p>\n<p>2.) The creature sins, or sets up some impediment to grace.</p>\n<p>3.) God withholds efficacious grace.</p>\n<p>4.) The creature sins.</p></blockquote>\n<p>The sequela of 1 and 3 are the same, but (3) is a punishment while (1) is not a punishment, and even seems necessary for moral creatures to exist at all.</p>\n<p>(2) Is understood as thwarting the development of sufficient grace, or harming the proximate potential to receive efficacious grace.</p>\n<p>O’Neill explains that (1) is not a <em>cause </em>of (2) but only a condition:</p>\n<blockquote><p>[I]f I do not give my beerless (and thus pitiable) neighbor the last beer in my refrigerator, this does not mean I have caused his beerlessness, although it is true that my not giving him my last beer is an indispensable condition of his not having beer. If I had given it to him he would not be in his sorry state of beerlessness.</p></blockquote>\n<p>Notice the causal hiatus between (1) and (2.) While NON permission of moral defect makes sin impossible, it does not follow that non-permission plays any role in the <em>explanation</em> of sin. If an angel did Johnny’s homework, it’s impossible that it be missing, but this doesn’t give Johnny any right to invoke the angels (still less to blame them) in his explanation for why he didn’t turn it in.</p>\n<p>One element in all this is that we have to see humans as in some way as sufficient causes, and even first causes of sin. If sin had a god, it would be us. This is hyperbole, of course, since sin at least has exterior conditions while divine causality does not, and sin does not formally have causes, since causes confer being. Nevertheless, we have a radical sufficiency in the order of moral evil that we simply don’t have in the order of moral goodness, which latter involves a real dependency on the first cause. The complete causal story of the good we do needs to take into account our participation in supreme goodness, but the complete causal story of the evil we do need not invoke participation in anything outside ourselves. Nevertheless, we still need to cry out to God to not permit us to fall into sin.</p>\n"
}