{
  "title":"Liberal punishment: the contradiction",
  "date":"2022-11-06T15:04:17.000000Z",
  "author":null,
  "id":"http://thomism.wordpress.com/?p=26157",
  "link":"https://thomism.wordpress.com/2022/11/06/liberal-punishment-the-contradiction/",
  "content":"\n\n\n<p>The classically liberal view of punishment is that it’s main goal is to bring about a better tomorrow. Because of this, it wants punishments to reform criminals and/or it wants the punishment to be sufficiently terrible to deter future crime. Even after one gives up on this idea of deterrence, we still want to deter future crime by the punishment keeping us safe from predatory monsters. This appeal to punishment as a tool for public safety is particularly pronounced during election cycles. </p>\n\n\n\n<p>Though the goals that that both wings of the liberal theory strive to attain are admirable, <em>as accounts of punishment</em> both are unjust.      Justice is simply meting out pain or loss for violations of justice and so seeks to give the offender something bad, while reform seeks to give someone something good. The desire for deterrence seeks to give a criminal a pain or loss not proportionate to what he has done, but to all the things he could do. We punish the person not by an objective evaluation of the badness of what he did, but we rather think about defending ourselves from all the crimes he could do if we let him run around in society. </p>\n\n\n\n<p>The clearest example of the inherent contradictions in these views of punishment is the “war on drugs” or the various “get tough on crime” suggestions that we periodically get stirred up into supporting. Obviously, in calling it a “war on drugs” we are looking forward to a better tomorrow where no one uses drugs, and the whole point of “getting tough on crime” is to bring about better tomorrows by finally showing those nasty criminals who’s in charge. But of course, we want to bring about this better tomorrow <em>through punishments</em>. We’ll make the punishment for drug importation life in prison, for example. This is, of course, simply revolutionary terror – let’s show those powerful barrons and recalcitrant peasants we mean business! The supermax prison, high profile trial, and jokes about prison rape are all just the guillotine in the public square, with all the bawdiness and bloodlust of the mob. Nevertheless, the whole point of all this is to stop people from importing or taking drugs and build a better tomorrow, so what do we do when we’ve done as much terror as we’re willing to inflict, and the desired utopia hasn’t yet arrived? Well, then we complain that “the laws aren’t working” or that the war on drugs has failed. The instrument we chose to bring about a better tomorrow <em>by its nature </em>brings about disproportionate and hence unjust punishments, and at some point the guilt of all this catches up to us. So what is the answer? Legalize! The war on drugs isn’t working! The prison system isn’t working! Given our theory of punishment, all we are left able to do is give criminals good things. We will provide them opportunities for instruction, repentance, correction, etc or perhaps we’ll just let them go in a spirit of repentance for the revolutionary terror we inflicted on them. In lived experience, the justice system ends up as a grotesque melange of both horns of this dilemma, with the mob in front of the guillotine demanding both blood and repentance, insisting we simultaneously cut off the condemned’s head and crown him king. </p>\n\n\n\n<p>The better theory of punishment is to forget about the future and seek to give pain in response to injustice, with a recognition that our inability to change hearts needs to be taken into account when the society decides whether some crime merits a permanent banishment (now called “life in prison”) or even an execution. </p>\n\n\n\n<p></p>\n"
}