{
  "title":"Substance dualism",
  "date":"2022-11-13T15:38:16.000000Z",
  "author":null,
  "id":"http://thomism.wordpress.com/?p=26171",
  "link":"https://thomism.wordpress.com/2022/11/13/substance-dualism/",
  "content":"<p>Taken literally, substance dualism is a man riding a horse or hunting with dogs; or perhaps an action rising to the level of naturally occurring symbiosis or parasitism. Lo, two substances interacting and giving rise to a common activity!</p>\n<p>This could never be more than a metaphor for the union of soul and body. The when a man uses a dog to hunt he is using a physical thing, of course, and souls in some sense use bodies to do things, but living things make use of the physical by being one substance with it. This is clearest in the opposition between living things and machines: living things convert energy sources into parts of themselves, and so have the equivalent of an engineer within themselves; machines not only are engineered from without but have interfaces and on-off switches manifesting their order to a controlling substance. While both the living thing and the machine are physical, the machine has extrinsic substances engineering and using it while the living thing has these as intrinsically constitutive of its one substance, e.g. the living dog, plant, insect, etc. Since the living thing is equally as physical as the machine, moreover, we have to distinguish physicality as a complete substance and only potentially alive from the higher-order living substance that actualizes what is only potential at a lower order.</p>\n<p>One can, of course, consider only what living things and machines have in common – and one could probably tell the whole story of biology in the last 70 years as the story of those who were interested in looking at it in that way. If all you want to know about is how, for example, living things use energy sources to accomplish tasks you don’t need to care about how they are essentially different from machines, and there are enough interesting things to discover here to sustain a very broad and long-lasting research program. When one tries to talk about “soul” or “life” from the standpoint of this research program, however, it will either be a completely superfluous term (since one is assuming life <em>just is </em>a function common with machines) or an alien substance dualistically interacting with a complete substance as opposed to actualizing potencies-for-substance in a lower order.</p>\n"
}