{
  "title":"Trinitarianism and simplicity (2)",
  "date":"2022-10-30T14:36:12.000000Z",
  "author":null,
  "id":"http://thomism.wordpress.com/?p=26136",
  "link":"https://thomism.wordpress.com/2022/10/30/trinity-and-simplicity-2/",
  "content":"\n<p>Take the standard trinitarian aporias: </p>\n\n\n\n<ul>\n<li>God is triune</li>\n\n\n\n<li>The Father is not triune</li>\n\n\n\n<li>The Father is God. </li>\n</ul>\n\n\n\n<p>Or, with <em>part </em>meaning <em>what added to something distinct from it to make a whole </em></p>\n\n\n\n<ul>\n<li>Divine simplicity states God has no parts</li>\n\n\n\n<li>The Father is a part of the trinity</li>\n\n\n\n<li>The Father is God</li>\n</ul>\n\n\n\n<p>The first has parallels for other divine attributes*</p>\n\n\n\n<ul>\n<li>God is the divine omnipotence</li>\n\n\n\n<li>The divine mercy is not the divine omnipotence.</li>\n\n\n\n<li>The divine mercy is not God.</li>\n</ul>\n\n\n\n<p>The second conflates different ways something can be added to another. Your complete idea of an apple adds your knowledge of its color to your knowledge of its taste, but this is a multiplicity generated by the limitation of different modes of knowing and not a real division arising <em>ex parte </em>the object.</p>\n\n\n\n<p><em>Objection: </em>But the division of the trinitarian persons is by real relations, and so requires real division before the act of a limited intellect.</p>\n\n\n\n<p><em>Response: </em>All the premises of the objection are true, but God in himself transcends the real division of relative terms as much as he transcends all non-relative or absolute terms like wisdom, omnipotence, mercy, etc.</p>\n\n\n\n<p><em>Objection: </em>You are affirming contradictories of the same subject! This is no different from affirming the impossibility of that subject!</p>\n\n\n\n<p><em>Response: </em>No. Transcendence simply is the unity in a higher order subject of what is diverse in lower-order subjects. Note also that the first principle of our thought is the principle of contradiction because we understand being only in its opposition to non-being, nevertheless, we can use that same principle to see how a subject that it supremely transcendent can only be known by us as subtending the opposition between the relative and the non-relative or absolute.</p>\n\n\n\n<p>*”attribute” is a transliteration of the Latin. The sense is anything attributed to God, i.e. anything true about his substance.</p>\n"
}