{
  "title":"A Kingdom Divided",
  "date":"2022-10-18T21:36:40.000000Z",
  "author":null,
  "id":"https://postliberalorder.substack.com/p/a-kingdom-divided",
  "link":"https://postliberalorder.substack.com/p/a-kingdom-divided",
  "content":"<p>Just as conservatives generally have been divided in our fraught postliberal crack-up, so have Catholic conservatives been divided over the pope, the Church and how we should think about the relationship between the Church’s spiritual power in relation to the temporal state. Catholicism has always envisioned a hierarchy of orders in which the spiritual lies above the temporal power, yet with these powers united or correlated as parts of an integral whole. This vision inspires everything from the Church’s universal concern for the poor—everywhere—to its attention to the common good in jurisprudence and the economy, to its participation in global institutions, to its sacramental life.</p><p>The liberal vision is predicated upon the inversion of this ordering principle, reducing the scope of the temporal while essentially spiritualizing the Church and making it dependent on and subject to the favors of princes, who are the sole agents of all coercive and convening power. The liberal inversion of the relationship between two distinct orders had the effect of an unhappy separation which has led to great political suffering and spiritual decline.</p><p>That’s how we view the matter, but not everyone agrees. <a href=\"https://www.youtube.com/watch?v=Rm8FGGq7838\">In his inaugural lecture</a> for the Catholic University of America’s Institute for Human Ecology, the distinguished scholar of Catholic social teaching, Russell Hittinger, asserts in conclusory fashion that “separation” is the operative Catholic principle and best term for understanding the Church’s relationship to civil governments. To claim the “separationism” that we would consider a first-order principle of liberalism is actually the first-order principle of Catholicism is indeed bold. But is it true?</p><p>Hittinger roots his argument principally in Christ’s words that his kingdom is not of this world, and he claims the authority of St. Augustine, St. Thomas Aquinas and Pope Leo XIII. But we think he fails to demonstrate that any of these authorities support his thesis.</p><p>Hittinger is wrong because he has integralism exactly backwards. Integralism does not fuse the Church and the state. The Church affirms that there are two powers, not one. We therefore conclude that his argument has not been made—that his thesis is fundamentally misguided, out of touch with Catholic theology, jurisprudence, and the realities of being the leaven that pervades the world.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link is-viewable-img image2\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fde439dce-3608-4884-87bd-0303b52dc727_1013x570.jpeg\"><div class=\"image2-inset\"><div class=\"image-link-expand\"></div></div></a></figure></div><h2><strong>I. Pope Leo XIII, Separationist?</strong></h2><p><a href=\"https://youtu.be/Rm8FGGq7838?t=892\">Professor Hittinger states</a>, as his main claim, that, “The proper term for the relationship between the kingdom here below and the temporal state is <em>separate</em> or <em>separated</em>.” By separate or separated here, Hittinger means to evoke not U.S. constitutional discussions but the sense of the holy or sacred—that what is sacred has been set apart to a particular use, in this case a divine use. So far, so eschatological: our Lord asked, “Think you that I came to give peace on the earth? No, I tell you, but separation” (Luke 12:51).</p><p class=\"button-wrapper\"><a class=\"button primary\" href=\"https://postliberalorder.substack.com/subscribe?\"><span>Subscribe now</span></a></p><p>Hittinger’s argument relies, to a surprising degree, on the connotations of the words <em>separate/separated </em>and, to a lesser extent, <em>integral</em>. “If we start with the notion of integral as a first premise,” he says, “we’re almost bound to make mistakes.” (We will return to this point later.) Admittedly, from a rhetorical standpoint it does seem strange to us to pick the very word which liberal writers have often (though not exclusively) used to describe the relationship between church and state. Likewise, it is an unusual move to triangulate the discussion first around the words rather than first around the underlying realities—the Church and temporal power—that they describe.</p><p>Be that as it may, Hittinger leans in on this point and describes himself as a “separationist,” which he describes not as a slogan but “a principle learned from St. Thomas and St. Augustine, who learned it by studying the New Testament.” In the second part of this essay we will assess whether “separationism” can be said to be a first-order principle in St. Augustine’s treatment of the Church’s relation to temporal power in his <em>City of God</em>, as Hittinger claims. But we must first treat what Hittinger treats first, and at greatest length: Pope Leo XIII. </p><p>Founding his thesis on an extended reflection on Leo XIII’s <em><a href=\"https://www.vatican.va/content/leo-xiii/en/encyclicals/documents/hf_l-xiii_enc_10011890_sapientiae-christianae.html\">Sapientiae christianae</a> </em>(1890), Hittinger begins by calling to mind the fluctuation of political things that was evident throughout the nineteenth century and certainly in the tumultuous years overseen by Pope Leo.</p><p>In this context, Hittinger introduces an overall thesis:</p><blockquote><p>For his part, Leo XIII insisted, “It cannot be doubted under safeguard of the faith that the governance of souls [<em>regimen animorum</em>] was committed to the Church alone, in such wise that powers of the political order have no share whatsoever in it.” To have no share whatever is precisely what I mean by separation. In making sense of Church and the world, including the political powers, separation is a first-order term because it describes what’s essential to the kingdom. Being set apart, having a supernatural end, as well as supernatural capacities for achieving that end.</p></blockquote><p>Hittinger here quotes <em>Sapientiae christianae</em> sec. 27 to articulate what Hittinger calls separation: the <em>regimen animorum </em>belongs exclusively to the Church, which has “supernatural capacities” through which it can lead men to this end. With this argument, Hittinger claims that we can neatly place the temporal power, with its need for coercion and punishment, on one side, and we can place the Church, with its baptized members, on the other.</p><p>Yet a key element of Leonine thought appears to have slipped by Hittinger. In the same encyclical, Pope Leo does not limit the Church’s care of souls to those of the baptized; the Church has the <em>regimen animorum </em>as such. The members of the ecclesia are, as the word indicates, “called forth” from the world—but the body to which they are called invites them to baptism because of its universal concern for all souls. Because the <em>regimen animorum </em>belongs exclusively to the Church, Leo makes clear that <em>its power is intended to suffuse public life</em>. The Church uniquely guides the life of the soul. Even if it primarily chooses to exercise coercive power over its baptized members, its care of the soul includes all spiritual matters—e.g., any matrimonial claims that come before its courts. As the Code of Canon Law states: “It belongs to the Church . . . to render judgment concerning any human affairs insofar as . . . the salvation of souls requires it” (747.2).</p><div class=\"pullquote\"><p>Pope Leo does not limit the Church’s care of souls to those of the baptized; the Church has the <em>regimen animorum </em>as such.</p></div><p>Observe how Leo’s own argument, immediately following the text quoted by Hittinger, <em>diverges</em> from Hittinger’s. The separateness of the Church, as it were, does not hold it back from the temporal world but is the very basis on which it “pervades” public life.</p><blockquote><p>The Church alike and the State, doubtless, both possess individual sovereignty (<em>suum habet utraque principatum</em>); hence, in the carrying out of public affairs, neither obeys the other within the limits to which each is restricted by its constitution. It does not hence follow, however, that Church and State are in any manner severed (<em>nulla ratione disiunctas esse sequitur</em>), and still less antagonistic. . . . From God has the duty been assigned to the Church not only to interpose resistance, if at any time the State rule should run counter to religion, but, further, to make a strong endeavor that the power of the Gospel may pervade the law and institutions of the nations (<em>studioseque conari, ut in leges et instituta populorum virtus pervadat Evangelii</em>).</p></blockquote><p>Pervading “the law and institutions of the nations” does not sound like “separationism.” Indeed, in a 2007 contribution to a work on Catholic social teaching, Hittinger himself called Pope Leo an “antiseparationist.”¹ It is certainly true that the Church is a kingdom which has <em>principatus</em> or sovereignty over itself; due to its supernatural capacities, it has a certain proper function <em>separated</em>, because sacred, from temporal oversight. Leo acknowledges this when he affirms the sovereignty of the Church and the civil commonwealth, but Leo rejects any inference that they are to be <em>disjunctae</em> or disjointed.</p><p>The immediate context of <em>Sapientiae christianae </em>confirms this view. Leo’s <em>Immortale Dei </em>of 1885 lays out his precise understanding of the Church’s universal scope and jurisdiction. Here too, instead of quoting Leo’s words that God “who is the author of these two powers, has marked out the course of each in right correlation to the other” (sec. 13), Hittinger makes Leo’s exclusive concern appear to be laissez-faire.</p><p>If Hittinger follows Leo XIII as closely as he claims, then we would expect him to, at a minimum, take the Church’s supernatural “separated” nature to entail not “separationism” but a holy obligation, on the basis of its care of all souls, to pervade civil institutions with the power of the Gospel. This is, indeed, what Hittinger has argued for in the past—and we are puzzled as to why he has shifted from “antiseparationism” to “separationism” at this late stage of his career. But we believe that while he is wrong now, he was correct in 2007: the Leonine “concord,” on the basis of mutual, ordered relations between two distinct powers, each with sovereignty, is what we mean by integralism. Perhaps it is possible for Hittinger to be a separationist and an antiseparationist at the same time, and in the same way. But we think he owes us an explanation for what looks like a dramatic reversal in his interpretation of Leonine teaching, moving away from the obvious to the more obscure, spiritualized, and detached interpretation.</p><div class=\"pullquote\"><p>Pervading “the law and institutions of the nations” does not sound like “separationism.” In a 2007 essay, Hittinger himself called Pope Leo an “antiseparationist.”</p></div><p>This more obvious interpretation of Leo’s thought is not held only by integralists. In a 1953 article for <em>Theological Studies </em>entitled “<a href=\"https://journals.sagepub.com/doi/epdf/10.1177/004056395301400201\">Leo XIII: Separation of Church and State</a>,” even John Courtney Murray, SJ, admitted that Leo envisioned close cooperation of Church and state, on the basis of the Church’s competencies as well as the natural virtue of religion. “If sheer repetition of the word means anything,” wrote Murray, “one must say that Leo XIII’s overwhelming emphasis was on <em>concordia</em>—harmony between the two powers, harmony between the two societies. The word strikes literally the keynote of his pontificate” (p. 209). For Pope Leo, and the tradition he safeguards, <em>concordia</em> is the first-order principle for relating the two powers. Perhaps <em>concordia </em>would have been a better prompt for Hittinger, as well—who previously cited this same 1953 article of Murray’s in his own work.²</p><div class=\"captioned-image-container\"><figure><a class=\"image-link is-viewable-img image2\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fae8fa849-4b11-4ab5-8fdb-4273a6061a35_1080x704.jpeg\"><div class=\"image2-inset\"><div class=\"image-link-expand\"></div></div></a></figure></div><h3><strong>From “Separate” to “Contrary”</strong></h3><p>If Hittinger is to explain that the Church is separate unto itself in its mission, he must explain its nature. What character and institutions does the Church have to ensure its separateness in a way which has the proximity to heal and elevate souls, families, nations? Instead, at this juncture, Hittinger takes a fateful turn. “Separate,” he explains, “can mean <em>contradictory</em> or it can mean <em>contrary</em>.” Insofar as this world exhibits a “reign of sin and death,” it is, as Hittinger argues, contradictory to the nature of the Church. It is certainly true that the Church, while full of sinners, stands contrary to sin—“a sign which shall be contradicted” (Luke 2:34)—and so opposed to the Pauline sense of “the world” and “the way of all flesh.” Unfortunately, Hittinger means something more than St. Paul did. He means that the Church stands as a contradiction to political life itself, arguing that “political life,” even when not “sinful or death-dealing,” is “contrary to, other than the kingdom.” For Hittinger, Church and political life have no common point of reference or field of view.</p><p>Here we have a grave problem. For while the tradition, which Leo continued, held direct ecclesiastical involvement in partisan squabbles or capital punishment to be <em>contradictory </em>to the Church’s nature, it is written into the very language of the tradition that terms like <em>society</em>, <em>polity</em>, <em>government</em>, <em>rule</em> and <em>power </em>apply analogically to Church and state precisely because “two there are” (<em>Duo sunt</em>). Indeed, the very Leonine lines on which Hittinger bases his argument testify to this: the Church is said to have the <em>regimen animorum </em>or rule over <em>all</em> souls; both Church and state are said to have <em>principatus</em> or principate/sovereignty in themselves. (For more on the problems with Hittinger’s analysis of the <em>contrary </em>and <em>contradictory </em>elements of political and ecclesiastical life, see Urban Hannon’s <a href=\"https://thelampmagazine.com/2022/10/10/correlation-not-contrariety-a-response-to-russell-hittinger/\">outstanding discussion at the </a><em><a href=\"https://thelampmagazine.com/2022/10/10/correlation-not-contrariety-a-response-to-russell-hittinger/\">Lamp</a></em>.)</p><p>While Leo accepts that the Church has a <em>regimen animorum </em>separate unto itself (if we are to grant Hittinger’s term narrowly), it is precisely the nature of this <em>regimen </em>that forbids Leo—or the tradition—from ever claiming that “political life” is “contrary to, other than the kingdom.” If the Church does not have a <em>regimen</em>, if it lacks the ability to govern itself, then it can hardly claim juridical independence from the state. But the essence of the Church’s being a perfect society is that it is juridically perfect, as well, because it is united to Christ the King, who is the very principle of perfection itself.</p><div class=\"pullquote\"><p>It is written into the very language of the tradition that terms like <em>society</em>, <em>polity</em>, <em>government</em>, <em>rule</em> and <em>power </em>apply analogically to Church and state precisely because “two there are.”</p></div><p>For Pope Leo, and the whole tradition he safeguards, the temporal and spiritual powers are polities that, with particular ends, reflect the order of creation. To point out only the most obvious respect, both have legal codes ordering the public life of Church and state toward their respective, related ends. Hittinger ambiguously evades this question by stating that “the kingdom [i.e., the Church] . . . is not an association that’s sociologically familiar in the usual sense.” But he fails to say whether the Church, in spite of being a unique body, has features similar to other kingdoms—such as public structure, rule, law and coercion. The Church does not cease being human for having been divinely instituted.</p><p>The more Hittinger attempts to draw the contrast, the more the nature of each power becomes confused and vague. “Politics,” he says, “has its foundational principles in morals under natural law, custom, and various species of human law.” Are these morals encouraged by law, or are they presupposed by law? We do not learn. “In sharp distinction,” he adds, “no person can direct another to the kingdom without presupposing grace.” Can temporal things be arranged in such a way as to facilitate the life of grace, and can the Church use human means to foster the life of grace? Again, we are not told—but we are led to believe that the answer is “No.”</p><p>Hittinger only describes the Church as having “supernatural capacities” for achieving its “supernatural end.” But the Church’s supernatural capacities are not constrained—the supernatural graces flow in many directions, and the sacraments through which those graces flow also require order and jurisdiction. By conjuring a kind of ultraseparationism, we believe that Hittinger sadly loses his ability to account for the Church’s actions in the world. The Church becomes a kind of narrow club for the baptized, careful neither to speak to mankind as a whole nor to govern itself in any recognizable way.</p><div class=\"subscription-widget-wrap\"><div class=\"subscription-widget show-subscribe\"><div class=\"preamble\"><p class=\"cta-caption\"><em>Postliberal Order</em> is a reader-supported publication. Consider becoming paid subscriber.</p></div><form class=\"subscription-widget-subscribe\"><input type=\"submit\" class=\"button primary\" value=\"Subscribe\"><div class=\"fake-input-wrapper\"><div class=\"fake-input\"></div><div class=\"fake-button\"></div></div></form></div></div><p>Notably, Hittinger’s doctrine of separation offers little help for clarifying the political situations in which the Church has often found itself. In an unguarded moment, Hittinger knocks “nearly fifteen hundred years” of Church history for exhibiting what he calls a “comedy of jurisdictions”—“overlapping interests of civil and ecclesial powers” that produced constant tensions. Declaring himself in favor of “separationism,” however, does nothing to solve classic questions such as whether the state can tax clergy, whether clergy can appeal to the pope against civil sovereigns, or even whether the Church can juridically intervene on behalf of the weak and unfortunate, as St. Augustine did nearly every day of his episcopal career. Indeed, the Church cannot even settle these questions with the temporal power if it is not also understood as an actual, identifiable power on earth as it is in heaven. Finally, the Church’s constant view was also that its temporal sovereignty, however limited, provided a bulwark against its succumbing to the pressures of other powers—or to the pressures of the age. All these questions receive elision or glib dismissal by Hittinger.</p><h2><strong>II. St. Augustine on What Integrates Orders</strong></h2><p>Having treated Hittinger’s counterintuitive interpretation of his Leonine authority, we must now turn to his two other stated authorities, namely Augustine and Aquinas. Hittinger asserts: “I’m a separationist. It’s not a slogan. It’s a principle learned from St. Thomas and St. Augustine.” Hittinger advances these authorities, but demonstrates nothing of their thought in support of his specious claim that they, too, are now to be considered separationists.</p><p>One of the first signs that Hittinger is tilting at windmills is his phrase “pagan integralism.” It is certainly true, as Fustel de Coulanges shows in his work <em>The Ancient City</em>, that pagan, polytheistic religion pervaded ancient society and political life. But no Christian could ever call the mere pervasiveness of religion “integralism.” The problem with paganism is the grave sin of idolatry; the problem with paganism is that it does not integrate, but is actually <em>disintegrative</em> of the good of souls and cities. One could say that<strong>, </strong>as with all false religion, the problem with paganism is that it separates us from God precisely because it fails to unite. After all, gnosticism separates body and soul, Arianism separates humanity and divinity, and liberalism separates human means and divine ends. The problem with paganism is not that it pervades, but that it cannot unite us to our final end. </p><div class=\"pullquote\"><p>The problem with paganism is that it does not integrate, but is actually <em>disintegrative</em> of the good of souls and cities.</p></div><p>This is precisely Augustine’s argument in his famous masterpiece <em>The City of God</em>, where he presents his vision of “two cities” running through history—one which is “fugitive,” fleeing from God, and one which is “pilgrim,” an obedient city united to God by the medicinal and elevating graces of Christ. It is the burden of the entire first half of Augustine’s <em>City of God</em> not to demonstrate that Christianity offers “separationism” to the world, but rather that the Church offers the world the “sanctuary” of true religion. </p><p>Nevertheless, Hittinger claims that his “separationism” is based on a sermon Augustine preached after the sack of Rome, reworked as the first book of <em>The City of God</em>. By beginning with the faulty premise that “integralism” is pagan, Hittinger sets himself up for a misreading of Augustine. Hittinger states:</p><blockquote><p>Just when Christians had some political grip on imperial power, Rome itself was shattered. Augustine understood almost right away that this complaint suggests that at least some of his flock had not understood the difference between Christianity and pagan integralism.</p></blockquote><p>Here we see the faulty premise about “pagan integralism” at work, misleading us about Augustine’s argument. The prompt about “separationism” requires him to interpret Augustine’s aim in writing <em>The</em> <em>City of God</em> as a work of pulling “converts” away from pagan ideas about the pervasiveness of religion, and correcting their pagan expectation that Christianity would somehow magically make polities happy. But this is a badly distortive and anachronistic lens.</p><p>Augustine opens his famous work by acknowledging that he is writing at the request of a Roman proconsul in North Africa named Marcellinus. This in itself is significant for relating the Church to temporal power since we see here the regular kind of converse and concord between the spiritual authority of a bishop in North Africa, and his temporal counterpart. The very occasion for writing <em>The City of God</em> can be seen as an instance of the temporal power asking the spiritual power for counsel. Hittinger seems to think Augustine is writing to separate Christianity and Rome, but Augustine’s pastoral and apologetic concern is principally with those graces which would really help Rome face suffering, and rightly order them to the eternal happiness and glory of the one true God.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link is-viewable-img image2\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F45869571-24f9-4529-b80a-5c75c56e8066_1558x710.jpeg\"><div class=\"image2-inset\"><div class=\"image-link-expand\"></div></div></a></figure></div><p>Hittinger highlights especially Augustine’s reflections on how the Visigoths spared the Catholic Church, which was unheard-of in the custom of war (pagan victors always destroyed the civic shrines to demonstrate total dominance). Professor Hittinger neglects to say that “those basilicas and shrines” were built by Emperor Constantine in the heart of Rome, just as he neglects to say that Augustine later praises the temporal power for building these basilicas, praising Constantine specifically for not worshipping demons, but “only the true God” (5.25). Hittinger roots his separationism, bizarrely, in the very fact that the Catholic Church is at the heart of Rome. One would think this alone would incline him more toward his 2007 commitment to antiseparationism than to his apparent reversal in 2022.</p><p>Augustine raises up a vision of the Church providing not only eternal and spiritual benefits, but material and temporal benefits for all souls, “both Christian and pagan” (1.1). From the high altar, where the graces flow from the side of Christ who was once pierced by a Roman spear, Augustine marvels that Romans were now being saved from the cruel savagery of their enemies. Christ sets the Church apart, not for the purpose of separation, but for the salvation of many souls.</p><p>Instead of separation, Augustine is most interested in how Romans suffer: “What matters is the nature of the sufferer, not the nature of the sufferings” (1.8). If Hittinger would have pressed a little further into book 1, he would have found a powerful correction to his faulty premise since Augustine goes on to treat three paragons of Roman virtue in order to show how Roman virtue apart from true religion holds up in the face of suffering. The three he treats—Lucretia, Marcus Regulus and Cato—are a mixed bag of heroes. Each faced tremendous suffering, and each was praised for their fortitude as heroes who faced suffering with honor. Two died by their own hand (Lucretia and Cato) and Augustine asks, What sort of virtue ends in suicide? But one of these figures is actually an example of the very problem with Hittinger’s premise regarding “pagan integralism.” </p><p>Marcus Regulus was a general who had become famous for his victories over the Carthaginians in the first Punic War. He was a Roman hero. In a subsequent war he was captured and was made to swear an oath to his god that he would return to Carthage if he failed to secure a favorable peace treaty with Rome. Regulus swore an oath to his god, went to Rome, advised the Senate to reject the treaty, and then returned to Carthage to honor his oath and face his death. Perhaps surprisingly, Augustine praises Marcus Regulus as Rome’s best man, yet he also shows why Rome “best man” is bested by Christian martyrs who know “the excellence of humility.” </p><p>Regulus was a Roman hero because he united morality and religion. When Augustine praises him, he is really just praising the natural law, acknowledging that religion and morality go together as part of justice. He even praises Regulus’s worship as “genuine” because he regards this as the virtue of natural religion. But if Hittinger had drawn us further in his chosen text, he would have found that the one thing Augustine does not do is think that pagan religion “integrates” or rightly orders or unites the Roman soul to God.</p><p>Augustine concludes, as any integralist would, that the problem with Roman virtues is not that they are natural, but that they are united to a false religion, and so the virtues are neither integrated into a whole which can face temporal suffering, nor do they unite us to the highest good, our final end and the cause of our eternal happiness. Contra Hittinger, Augustine favors “Catholic integralism” and opposes “pagan disintegralism.” He insists not on separation, but on the right kind of unity for the soul and the city—<em>concordia</em>—since only true religion unites us to God, and this brings temporal and eternal benefits at every level, for the soul, the family, the polity, in union with the city of God, i.e. the Catholic Church, on pilgrimage in this present life.</p><div class=\"pullquote\"><p>Augustine concludes, as any integralist would, that the problem with Roman virtues is not that they are natural, but that they are united to a false religion.</p></div><p>We must conclude that Hittinger’s claim to Augustine’s authority, even constrained to his treatment of the first book of <em>The City of God</em>, utterly fails. His view that “separationism” has been learned from St Augustine is nowhere demonstrated, and we have shown in some detail how the very text he cites stands firmly against his faulty premises and assertions. There is more to say about Augustine’s first-order principles, but it’s a matter of certainty that “separationism” is not one of them.</p><p>St. Augustine concludes book one this way: “While the City of God is on pilgrimage in this world, she has in her midst some who are united with her in her participation in the sacraments, but who will not join with her in the eternal destiny of the saints” (1.35). While there will be an eschatological separation at the end of time, Augustine envisions not “separationism” but the Church as a pervasive presence ordered, structurally and in every way, to the salvation of souls.</p><h2><strong>III. Grace Elevates and Perfects</strong></h2><p>Having excluded the possibility that separationism could be Leonine or Augustinian, we are left with the question of whether it is fundamentally Thomistic, or fundamentally something else.</p><p>Hittinger rests his claim to authority on the Angelic Doctor’s gloss on John 18 (“My kingdom is not of this world”) namely that the kingdom “does not have its origin in earthly causes and human choice.” This is undoubtedly true: the Church is a divine gift, born from above. But once again, Hittinger claims something more than he demonstrates. He claims that Aquinas’s embrace of “My kingdom is not of this world” is of “supreme importance” for his thesis about separationism. </p><p>There is a reason why we associate Aquinas not with separations but with distinctions that help us to see reality. Aquinas sees reality as a whole because it is all caused by God, and he arrives at a true understanding of the whole precisely through making the correct distinctions. Nothing that exists can be “contrary” to God, but everything must be understood in relation to him. </p><p>Aquinas recognizes “the real distinction” between Creator and creation, but even this is understood as the relationship between the uncreated cause and the created effects. His understanding of the human person, similarly, is that we are created in God’s “image and likeness.” The human person is a “microcosm” which unites heaven and earth in the hylomorphic union of body and soul, and it’s our very nature as rational and political animals that we “image” in creation God’s government of the universe—we are analogical creatures. Against Hittinger’s principle of separationism, Aquinas gives us the principle of analogy (<em>analogia entis</em>) at every level of his thought, from a consideration of how we can know God from the things which have been made (Romans 1:20) to how grace does not destroy nature but perfects it (<em>gratia non tollit naturam, sed perficit</em>) to how the Church is like a household or a city. Indeed, the analogical nature of Aquinas’s thought is so profoundly Catholic that in his own opposition to Catholicism, the Protestant theologian Karl Barth would call the Thomistic “principle of analogy” an invention of the Antichrist, indeed the very “paganization” of Christianity which Hittinger charges against integralists. </p><p>Like many classical Christian thinkers, Aquinas thought analogically about the natural and supernatural orders, and also about temporal and spiritual jurisdictions within the earthly city. If we consider Aquinas’s glosses on the New Testament, we could point out comments on Ephesians 2:19—“now then you are not strangers and foreigners: but you are citizens of the saints, and the domesticals of God”—which analogizes between the Church, the common good of the family, and the political common good. Indeed, Aquinas writes not only that there is an analogy, but that the Church “contains within it something of the city and something of the home.”³ There is no hint of separationism, only the principle that grace perfects and elevates nature. For the same reason, Aquinas says that God is always the foundation of every spiritual edifice, but that the Church “is instrumentally constructed” through men.⁴</p><div class=\"pullquote\"><p>Against Hittinger’s principle of separationism, Aquinas gives us the principle of analogy at every level of his thought, from a consideration of how we can God from the things which have been made, to how the Church is like a household or a city.</p></div><p>Aquinas consistently echoes the parallel between ecclesiastical and civil structures that was commonplace in the tradition in a similar way. “A congregation of men is twofold,” he writes in his <em>Sentences</em> commentary, “namely economic, as those who are of one family; and political, as those who are of people; the Church is similar to a political congregation, because that people is called the Church.”⁵ Elsewhere, in his commentary on Psalm 45, Aquinas spoke of the city of God as realizing the perfections of the polity (its unity or liberty, for example) on a higher level.⁶</p><p>These are but a few examples that show why separationism is actually foreign to St. Thomas. There is a deeper, metaphysical reason for this—a reason which liberalism denies. Like Augustine, Aquinas affirmed a metaphysical hierarchy of goods that reached upwards from the primacy of God as uncaused cause to God as final end. The human person was a “microcosm,” God’s chosen crown of creation, made to rule creation in the divine image and likeness, intrinsically ordered to the common good—in the family and the polity, all the way up through the Church, to God. This is right order, and the integrative key to the whole is right worship. </p><p>For Aquinas, as for Augustine, nothing that exists can be contrary to God. There is no principle of separation in uniting humanity to divinity in creation, nor still in the hypostatic union. What we find in Aquinas is hierarchy and order, reality understood not principally through contraries but distinctions that discern the true unity and order of reality as such. Far from a “separationism,” Thomas teaches that the sovereign who orders human laws must contemplate natural law as a determination of God’s eternal law, and that it is most fitting that the sovereign contemplate the divine law, which is to say the law of divine revelation, in ruling for the common good of the whole. Consider St. Thomas’s counsel to the king of Cyprus in <em>De regno</em> as a fitting summary: </p><blockquote><p>It pertains to the king’s office to promote the good life of the multitude in such a way as to make it suitable for the attainment of heavenly happiness. . . . He should command those things which lead to the happiness of Heaven and, as far as possible, forbid the contrary.</p></blockquote><p>Presumably Professor Hittinger considers such counsel to be “historically contingent,” but at some point, he will have to deal with the consistent way in which the Church thinks in terms of <em>concordia</em> more than <em>contrariness</em>. Hittinger has done so in the past, in his work on natural law, on subsidiarity and on the three necessary societies. But now he has been prompted to move in what looks like a new direction, one which at times seems to suggest that politics is something utterly separated from the rest of reality—sometimes it’s the thing which “outlasts,” but usually the implication of his view of politics shares more in common with the protestant view that the state is a consequence of the Fall, that it has a purely negative, coercive function. </p><p>Aquinas’s own Aristotelian habit of recognizing that we are political by nature, and that politics as such is not a result of the fall, as some of our separated brethren believe, but instead corresponds to God’s governance of creation seems absent from Hittinger’s present trajectory. We think Hittinger’s forgetfulness of the entire tradition of Catholic teaching in the relation of spiritual and temporal authority here may be explained by the fact that his fundamental principle of “separationism” is not Catholic at all. </p><h2><strong>Conclusion</strong></h2><p>Concluding that separationism is not a Catholic principle at all leaves us in a quandary. Whence does separationism come? We do not think that Professor Hittinger is a committed Barthian. So where can we turn?</p><div class=\"pullquote\"><p>We think Hittinger’s forgetfulness of the entire tradition of Catholic teaching in the relation of spiritual and temporal authority here may be explained by the fact that his fundamental principle of “separationism” is not Catholic at all.</p></div><p>There is one possible, quite contested source. We recall Lord Acton’s famous claim that Aquinas can be considered “the first Whig,” which is to say the first liberal, and liberalism absolutely follows a principle of separationism. Indeed, to the untutored ear, the very term “separationism” sounds so much more strikingly similar to Jeffersonian principles of separation of church and state than it does to Catholicism that it’s amazing that anyone would find the claim plausible. While we appreciate that Professor Hittinger thinks Americanism is a “phantom heresy,” it certainly rhymes with the principle he defends. After all, what does Hittinger think the temporal order can learn from the Church? How to get to heaven? How to rule with humility before God? How to crush the foul altars and worship the one true God? No, Hittinger has a very modest lesson which the temporal power hasn’t even learned from the GOP in its sixty years of repeating it: “limited government.” If the principle of separationism results in counsel as thin as this, who can be blamed for considering the Church to be no seat of wisdom at all?</p><div class=\"pullquote\"><p>Hittinger has a very modest lesson which the temporal power hasn’t even learned from the GOP in its sixty years of repeating it: “limited government.”</p></div><p>In conclusion, we must say No to Professor Hittinger. The works of the Church in this world are many. It invites all mankind to accept the truths of the Gospel and to join Christ’s body. It supplies them with everything they need to reach the spiritual destiny to which the Lord has called them. Outside its walls, it speaks with the voice of justice and acts with the hand of mercy; its members succor the poor and the weak, and it strives to speak for those, like the unborn, who cannot speak for themselves. The Lord also left it with a structure of governance, hierarchy and order suited to this task. And he left the Church fully equipped, on this basis, to deal with the secular powers—retreating in defense or stepping forward in confident cooperation, as the times and circumstances proposed it. For all these reasons, the Church has always spoken of concord and harmony as its goals—preserving and extending the people of God that the Lord has called forth from the world. Whatever words we use to describe this complex reality, let us make sure that we do not deny any parts of it, nor “separate” it so far from the world it has been called to serve and to guide.</p><p><strong>Notes</strong></p><ol><li><p>Russell Hittinger, “Pope Leo XIII (1810–1903),” in John Witte and Frank Alexander, eds., The Teachings of Modern Roman Catholicism on Law, Politics,* and Human Nature (New York: Columbia University Press, 2007), 62.</p></li><li><p>Hittinger, “Pope Leo XIII,” 44.</p></li><li><p><em>Super Epistolam B. Pauli ad Ephesos lectura </em>2.6.</p></li><li><p>Ibid.</p></li><li><p><em>Scriptum super Sententiis </em>IV 20.1.4.1. <em>in corp.</em></p></li><li><p><em>In psalmos Davidis expositio </em>45:7.</p></li></ol>"
}