{
  "title":"The Sacrament That Restores Nations",
  "date":"2022-11-07T11:00:40.000000Z",
  "author":null,
  "id":"https://postliberalorder.substack.com/p/the-sacrament-that-restores-nations",
  "link":"https://postliberalorder.substack.com/p/the-sacrament-that-restores-nations",
  "content":"<p><em>One of the theological highlights of the recent “Restoring a Nation” at Franciscan University was the following address by Professor Scott Hahn. He argued that at the heart of our liberal disorder is a Pelagian lie about marriage which has been disintegrative of the common good, and has left us socially and politically bankrupt. Since society is a family of families, then, we need to establish the conditions for the possibility of a society built upon sacramental marriage. We certainly agree, and we’re very pleased to publish Professor Hahn’s full argument here at </em>Postliberal Order. </p><div class=\"captioned-image-container\"><figure><a class=\"image-link is-viewable-img image2\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fff30b5cd-a6b2-4105-85c3-10509bf17251_640x352.jpeg\"><div class=\"image2-inset image2-full-screen\"><div class=\"image-link-expand\"></div></div></a></figure></div><p>There could hardly be a less controversial statement in the setting of our conference than this: <em>the family is the cornerstone of a flourishing society</em>. What we mean by “family” matters, of course. A society takes its form from the families that make it up, like a fundamental element takes its properties from its distinctive atoms. Our solidarity-starved civilization, for instance, takes its form from families that have been too often fractured beyond recognition.</p><p>A healthy and enduring society, on the other hand, takes its form from a particular kind of family culture—one where men and women make and keep lifelong covenants which create not just thriving nuclear households, but complex networks of extended families across place and time. If the microscopic structure of our current society is mostly isolated atoms scarcely bonded to others, the structure of a Christian culture, a sacramental society, is a matrix of atoms—a family of families—whose intricate interdependency gives society strength and resilience.</p><p>Thus there is no relationship on which society depends more than the bond between husband and wife. This is the first bond, primordial covenant—the first society—without which all others <em>disintegrate</em>.</p><div class=\"subscription-widget-wrap\"><div class=\"subscription-widget show-subscribe\"><div class=\"preamble\"><p class=\"cta-caption\"><em><strong>Postliberal Order</strong></em> is a reader-supported publication. To continue reading this essay, support our work by becoming a paid subscriber to enjoy a whole year of visionary essays which show that <em><strong>another world is possible.</strong></em> </p></div><form class=\"subscription-widget-subscribe\"><input type=\"submit\" class=\"button primary\" value=\"Subscribe\"><div class=\"fake-input-wrapper\"><div class=\"fake-input\"></div><div class=\"fake-button\"></div></div></form></div></div>\n      <p>\n          <a href=\"https://postliberalorder.substack.com/p/the-sacrament-that-restores-nations\">\n              Read more\n          </a>\n      </p>\n   "
}