{
  "title":"Return to Normalcy",
  "date":"2022-10-27T12:18:28.000000Z",
  "author":null,
  "id":"https://postliberalorder.substack.com/p/return-to-normalcy",
  "link":"https://postliberalorder.substack.com/p/return-to-normalcy",
  "content":"<p>A common objection to postliberals is that they hope for something equivalent to an unlikely revolution: <em>Turn America into a postliberal state? Yeah, right!</em> When we answer that the goals of good government are abundance, peace and justice—to be found in good family policy and common good jurisprudence—a subsequent reply is sometimes heard: <em>That’s it? That seems so normal?</em></p><p>The expectation created by postliberalism’s critics is that, by seeking policies from outside liberalism, postliberals must be secretly committed to some kind of dark, neo-medieval revival. With their mundane policy suggestions, are postliberals indicating that their real goals are unattainable? Far from it. The reality is that normal governance is seemingly so far removed from Western politics that we have forgotten how normal and familiar it should be.</p><p>So let’s consider the latest form of this observation, <a href=\"https://www.nytimes.com/2022/10/21/opinion/condition-of-liberalism.html\">from Ross Douthat at the </a><em><a href=\"https://www.nytimes.com/2022/10/21/opinion/condition-of-liberalism.html\">New York Times</a></em>:</p><blockquote><p>The most thoughtful forms of postliberalism, meanwhile, tend to offer sweeping <em>philosophical</em> critiques that cash out in <em>policies</em> that are actually relatively familiar—the recent postliberal conference at the Franciscan University of Steubenville, for instance, was dismissed by Jonah Goldberg as a gathering of “pro-life New Dealers,” and the organizer, Sohrab Ahmari, then quite reasonably embraced the label. Could such a politics overthrow <em>neo</em>liberalism or defeat <em>secular</em> liberalism?</p></blockquote><p>Douthat seems to think that “familiar” policies can float free in the world—that a good policy can fly without too much worry about its surroundings. Everyone knows this is false. Midcentury feminists, for example, critiqued traditional society in order to bring about a world radically free from classical expectations around marriage and family—a world now all too familiar to us in its pedestrian forms of hookup culture and divorce. Unlike them, postliberals use philosophical critique of liberalism in order to restore the context necessary for good policies to thrive—and for politics to return to normalcy.</p><p>Adopting policies <em>for the right reasons and on the right grounds</em> matters just as much as the raw “content” of the policies. Law is a teacher, and the justification for the policy is often what does the teaching. From the preludes presented in Plato’s <em>Laws</em>, to the Preamble to the U.S. Constitution, to the “whereas” clauses prefacing U.S. legislation, the moral or intellectual infrastructure of policy situates it within a larger whole. Joining theory and practice for the common good is precisely what’s needed to create the best conditions for having a normal political life.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link is-viewable-img image2\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fd117dad7-072e-429b-b6ff-1872293d563d_1142x642.jpeg\"><div class=\"image2-inset\"><div class=\"image-link-expand\"></div></div></a></figure></div><p>Ross’s comment drew a <a href=\"https://twitter.com/SohrabAhmari/status/1583490353612496897\">reply from Sohrab Ahmari</a>, who organized the conference in question:</p><blockquote><p>@DouthatNYT makes a point I’ve heard going back to the early French debates—that our [the post-liberals’] philosophical or theological claims are dramatic, but that (at its best) the movement cashes out as a reasonable and sometimes-familiar policy mix, e.g., pro-union, etc.</p><p>But it’s telling that that eminently reasonable policy mix—pro-family, pro-labor—is so familiar, yet so hard to attain under liberalism, especially in its neoliberal iteration. That fact itself necessitates the more fundamental philosophical critique, @DouthatNYT.</p></blockquote><p>Like the body itself, the body politic has a proper and normal way of functioning. When healthy, a polity is able to live as it ought—oriented toward the common good, marked by friendship, confidence and happiness, at least as much as is possible in this world. When sick, the body politic requires a diagnosis and a prescription: Why is it that the political body is riven by strife and faction? What should its rulers do to put it back on the right course?</p><p>The classical tradition approached politics in just this manner. </p>\n      <p>\n          <a href=\"https://postliberalorder.substack.com/p/return-to-normalcy\">\n              Read more\n          </a>\n      </p>\n   "
}