{
  "title":"Separation and Agency",
  "date":"2022-11-05T11:25:00.000000Z",
  "author":null,
  "id":"https://postliberalorder.substack.com/p/separation-and-agency",
  "link":"https://postliberalorder.substack.com/p/separation-and-agency",
  "content":"<p><em>This post contains two complementary reflections on the theme of separation and juridical agency, the first by Adrian Vermeule from the standpoint of a civil lawyer, the second by Gladden Pappin from the standpoint of political theory and Catholic jurisprudence.</em></p><p>Rather late in the day, at least given the speed with which online debates unfold, I offer here a few thoughts on the recent controversy about “separation” and political theology inspired by my colleagues <a href=\"https://postliberalorder.substack.com/p/a-kingdom-divided\">Gladden Pappin and Chad Pecknold (as a team)</a>, and by Urban Hannon (<a href=\"https://thelampmagazine.com/2022/10/10/correlation-not-contrariety-a-response-to-russell-hittinger/\">here</a>, and <a href=\"https://www.thepublicdiscourse.com/2022/10/85396/\">here</a>), in their respective responses to Russell Hittinger’s recent defense of “separationism.”</p><p>My contribution, if such it may be, is to suggest that these debates might profit from a civil lawyer’s perspective on agency and juridical structures. Such a perspective may seem alien to the theologian. But on the assumptions that (1) law has real structure, reflecting the real and divinely created order of things rather than being merely an arbitrary human creation, and (2) agency in all its forms is part of that structure; then (3) it seems not implausible that the juridical order established by God to regulate the relationships among Himself, the temporal power, and the spiritual power may also embody principles of agency. At a minimum, I hope that the lawyer’s perspective may clear up the distinctions between and among different models of agency that have been implicitly invoked in these debates, as I will shortly explain, and as Gladden Pappin further explains in his contribution here as well.</p><div class=\"captioned-image-container\"><figure><a class=\"image-link is-viewable-img image2\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F5f665603-102d-457d-9a14-ef936edfb490_709x399.jpeg\"><div class=\"image2-inset\"><div class=\"image-link-expand\"></div></div></a><figcaption class=\"image-caption\"><em>The church of Saint-Germain-l’Auxerrois pictured, on the right, adjacent to the district town hall of Paris’s first arrondissement.</em></figcaption></figure></div>\n      <p>\n          <a href=\"https://postliberalorder.substack.com/p/separation-and-agency\">\n              Read more\n          </a>\n      </p>\n   "
}