{
  "title":"YC Jobs Series: Women Eng in Startups",
  "date":"2021-08-26T10:24:01.000000-07:00",
  "author":null,
  "id":"https://blog.ycombinator.com/?p=1104901",
  "link":"https://blog.ycombinator.com/yc-jobs-series-women-eng-in-startups/",
  "content":"<p>This fall, YC and <a href=\"https://elpha.com/\">Elpha (S19)</a> will bring together a cohort of women engineers who are interested in finding roles at fast growing startups.</p>\n<p>YC will host a month-long series where participants will meet once a week for two-hour sessions. During sessions, you will hear from women who joined startups as early engineers, meet YC alumni and alumni company engineering managers, and build a community of peers. The program will culminate in at least two interviews for each participant.</p>\n<p>Topics discussed will include:</p>\n<ul>\n<li>Why join a startup? What are the pros and cons? </li>\n<li>How do you determine where you should work and what should you look for in a startup and founding team?</li>\n<li>How to prepare for the interview process and interview practice</li>\n</ul>\n<p>Each session, we will also host small breakout sessions with founders, engineers and managers across a range of YC startups — from early stage to growth — including:</p>\n<ul>\n<li><a href=\"https://www.workatastartup.com/events/yc-women-eng-in-startups-2021\">Christina Caccioppo, Cofounder &amp; CEO of Vanta</a></li>\n<li><a href=\"https://www.workatastartup.com/events/yc-women-eng-in-startups-2021\">Cadran Cowansage, Cofounder &amp; CEO of Elpha</a></li>\n<li><a href=\"https://www.workatastartup.com/events/yc-women-eng-in-startups-2021\">Diana Hu, Cofounder &amp; CTO of Escher Reality and YC Visiting Partner</a></li>\n<li><a href=\"https://www.workatastartup.com/events/yc-women-eng-in-startups-2021\">Lucia Huang, Cofounder &amp; CEO of Osmind</a></li>\n<li><a href=\"https://www.workatastartup.com/events/yc-women-eng-in-startups-2021\">Reshma Khilnani, Cofounder &amp; CTO of MedXT and YC Visiting Partner</a></li>\n</ul>\n<p>If you are currently an engineer working at a tech company and you’re looking for your next role and might want to transition to a startup, this series is for you.</p>\n<p>To apply for the program, visit <a href=\"https://www.workatastartup.com/events/yc-women-eng-in-startups-2021\">YC’s Work at a Startup</a> and create a profile by September 13th. (Note that profiles are visible to YC founders and hiring managers at YC startups. If you’re not ready to share your profile or look for a job, please specify so on the application.)</p>\n<p><b><a href=\"https://www.workatastartup.com/events/yc-women-eng-in-startups-2021\">https://www.workatastartup.com/events/yc-women-eng-in-startups-2021</a></b></p>\n<p><i>At YC, we use an inclusive definition of “women” and welcome trans women as well as genderqueer and non-binary people who identify as women or femme in any way.</i></p>\n"
}