{
  "title":"Gusto: The People Platform for SMBs",
  "date":"2021-08-30T10:00:01.000000-07:00",
  "author":null,
  "id":"https://blog.ycombinator.com/?p=1104906",
  "link":"https://blog.ycombinator.com/gusto-the-people-platform-for-smbs/",
  "content":"<p>Historically, there has been an undeniable gap in business services in the US. There are nearly six million small and medium businesses (SMBs) in the country, employing 43 million people.<sup id=\"footnoteid1\"><a href=\"#footnote1\">1</a></sup> But unlike their larger counterparts, SMBs have been ignored by service providers, who have deemed the cost of reaching and serving them too high to warrant the effort. As a result, SMBs have been forced to cobble together off-the-shelf products, spreadsheets, and manual work to run their operations.</p>\n<p>This gap is most visible in the payroll and benefits sectors. Even though companies like ADP and Paychex have existed for more than 50 years, about 30% of SMBs still manage payroll without the help of a third-party service.<sup id=\"footnoteid2\"><a href=\"#footnote2\">2</a></sup></p>\n<p>There are three reasons why existing providers haven’t cracked small business payroll and benefits. First, SMBs are fragmented and hard to reach. Relative to the value they bring in, the cost of reaching and serving them has traditionally been too high to warrant the effort unless you can sell multiple products to them. Second, there is significant signup friction for benefits and payroll products. Lastly, benefits products can be costly for SMBs to offer to employees, which results in many just forgoing benefits altogether. The lack of access to simple payroll and benefits tools has had a significant impact on the operational efficiency of SMBs and the well-being of their employees. But where there is a gap, there is an opportunity.</p>\n<p>Gusto launched in 2012 to tackle this opportunity, and more. Josh Reeves, Tomer London, and Eddie Kim saw an opportunity to build a people-centered software platform for SMBs that would do three things: (1) bring peace of mind to the employer and employee around complex actions like payroll, benefits, setting up software, and more; (2) help build better places to work by focusing more on the employer-employee partnership; and (3) create personal prosperity for employees by helping supercharge the paycheck and providing access to better benefits. Gusto initially focused on building payroll because it was the most acute pain point, and it was a natural system of record for employee data and transactions. Payroll was the foundation for Gusto to achieve its vision of being a comprehensive “people platform.” Far beyond just paying employees and maintaining compliance, <strong>Gusto’s goal is to help employers build great places to work and run successful teams.</strong> And for employees, <strong>Gusto’s goal is to help put the individual in the driver’s seat of their financial health and their career.</strong> The name “Gusto” embodies the company’s mission to create a world where work empowers a better life—where work can be done “with Gusto.”</p>\n<p>The emergence of SaaS business models has further set the stage for companies like Gusto to transform SMB operations. With cloud-based software and automation, customers are cheaper to serve and simpler to onboard. In the long run, software platforms have the potential to be much larger than traditional incumbents. For customers, this will likely mean a significant bend in the cost curve for products and services. For SMBs specifically, this will lead to a meaningful boost financially and emotionally, and perhaps even higher degrees of company output. In this post, we will walk through Gusto’s journey from digital payroll provider to integrated people platform.</p>\n<h1>Act 1: Payroll: The Perfect Starting Point</h1>\n<p>When Gusto founders Josh, Tomer, and Eddie came together in 2011, they saw an unmet need in small business payroll. Despite the major players in the payroll space, 46% of SMBs in the US were spending more than three hours per month managing payroll logistics.<sup id=\"footnoteid3\"><a href=\"#footnote3\">3</a></sup> On top of that, 40% were paying a penalty each year for incorrect payroll filings.<sup id=\"footnoteid4\"><a href=\"#footnote4\">4</a></sup></p>\n<p>This was both an emotional and logistical pain point for SMB owners, with many becoming visibly upset as they talked to Josh, Tomer, and Eddie about it. Upon digging deeper, the founders realized that incumbent providers were overly complex, and more manual than necessary. For example, to become a customer of ADP or Paychex, SMBs had to go through a lengthy process of filling out paper forms and talking with sales reps. Once using the product, they had to rely on the provider’s human specialists to input information and manage the payroll process rather than doing it independently. For SMBs that had neither the hours nor resources to initiate these processes, this approach was untenable. In addition, the employee experience was an afterthought. Incumbent providers treated payroll as a transactional activity, often forcing people to log in using ID numbers and providing limited functionality once they did log in. This made for an impersonal experience for employers and employees alike, and created even more manual work and overhead for employers.</p>\n<p>Gusto saw an opportunity to upend the way payroll was done. First, by making payroll about people, not simply a transaction. And second, by bringing the strengths of modern software to this problem, using cloud, paperless, and mobile, to create a dramatically easier-to-use product. If the enrollment process were digitized and companies could access all aspects of payroll on their own time, barriers to getting set up and using the product would be removed. So Gusto began building a cloud-based engine that would allow SMBs to manage payroll with the click of a few buttons, and also make the employee an equally important user of the product instead of an afterthought.</p>\n<p>Building payroll architecture is complicated. It involves managing multiple systems (taxes, withholdings, filings, payments) in a reliable and compliant way. To run payroll correctly, a business must identify which taxes are applicable to which employee (there are thousands of options, usually determined by where an employee lives and works). The business must calculate and withhold the right tax amount, at the local, state, and federal levels. Then the business must determine how the taxes get paid, which is an equally complicated process. Some states want checks, others ACH debit/credit, and states and counties often require different payment timing. And then there are filings. Every destination for tax requires a separate filing—some printed, some faxed, some electronic. There are thousands of these filings, and the forms are each very different. Finally, the business needs to send the payment to the employee via ACH typically 1–2 days after running payroll, or write them a check by hand.</p>\n<p><img src=\"https://blog.ycombinator.com/wp-content/uploads/2021/08/1-Gusto-Overview.png\" alt=\"Gusto Payroll Overview\" width=\"1950\" height=\"1070\" class=\"aligncenter size-full wp-image-1104909\"></p>\n<p>Gusto knew that payroll was a product which had to work, because people depended on it. So some of the normal Silicon Valley approaches to building quickly, and fixing later, wouldn’t work. Gusto’s product needed to provide reliable, timely, and precise tax calculations, filings, and payments to earn the trust of customers. The team initially focused on a narrow segment: businesses in California (1) that did not offer benefits or other deductions, (2) whose employees did not mind getting paid four business days after the company ran payroll and, (3) only had salaried employees. The goal was to solve the basics of payroll first and then to expand to more segments. This focus proved to be very beneficial, since it helped the company build a more solid foundation, and validate that its product was indeed much easier to use, and loved by customers.</p>\n<p>The founders were their own first customers, only paying themselves after they were able to run their paychecks seamlessly through their software. It took a year to get to a public beta. One year after public launch, Gusto reached 1,500 customers. Today, Gusto is available nationwide and customers can onboard employees and run payroll in a matter of minutes. The company serves over 200,000 businesses, and they’ve made payroll much more efficient: 72% of customers spend five minutes or less to run payroll.</p>\n<p><img src=\"https://blog.ycombinator.com/wp-content/uploads/2021/08/2-gusto-img-payroll-portal.png\" alt=\"Gusto's Payroll Portal\" width=\"2199\" height=\"1558\" class=\"aligncenter size-full wp-image-1104910\"></p>\n<p>With its software up and running, Gusto needed to figure out its go-to-market strategy. SMBs had historically been hard to reach. Incumbents relied primarily on sales teams, which Gusto suspected actually limited their reach among SMBs. Cloud software had the potential to transform this process. For the first time, businesses could reach and serve customers with an entirely online strategy. And on top of that, the Gusto team knew that time was precious for SMB owners. What they needed was a product that worked, which was accurate, powerful, and also simple and easy to use. Gusto believed this is what modern software should be all about: a product that made life easier for its users, not more stressful. Gusto leaned into an online referral and brand-based go-to-market strategy rather than building out a direct outbound sales force. If the product was truly great, the company believed customer love and word-of-mouth would power growth. In fact, it would need to: Given the lower annual contract values of SMBs, they needed a strong inbound engine to make the economics work. This was a risky bet, but it worked. Within the first three years of launching, Gusto was serving more than 20,000 SMBs, with growth largely coming from referrals and word-of-mouth. Customers loved the product and wanted to tell other business owners about it.</p>\n<h1>Act 2: All-in-one People Platform</h1>\n<p>Starting with payroll made sense for two reasons. First, every business needs it. Second, building payroll architecture requires collecting and structuring a lot of data (where employees live, name, email, start date, dependents, salary, etc.). Once in place, this structured data positioned Gusto for its second act: to leverage the payroll core, keep investing in it, but also expand around it a “people platform” that would help SMBs build great places to work.</p>\n<p>One of the main drivers of this thinking was a desire to bring to SMBs all of the benefits, resources, tools, and advantages big companies have historically had. Large companies have whole departments helping with HR, IT, benefits, and more, plus a wide variety of technologies and tools at their disposal. SMBs have historically been on their own. Gusto wanted to change that. And today, Gusto has expanded to provide a wide swath of functionality: (1) employee onboarding that helps manage identity across the different tools used by the business, (2) more accessible benefits, (3) access to tax credits, (4) financial optimization tools for employees, and more. With Gusto, SMB owners are able to spend more time running their businesses and less time on back-office work, while actually making their employees happier.</p>\n<p><img src=\"https://blog.ycombinator.com/wp-content/uploads/2021/08/3-gusto-blog-img-2.png\" alt=\"Gusto - The People Platform\" width=\"2050\" height=\"1070\" class=\"aligncenter size-full wp-image-1104911\"></p>\n<h3>People software for SMBs</h3>\n<p>Gusto began by making its product the central source of truth for hiring, onboarding, and employee communication. With Gusto, SMBs can create offer letters, complete onboarding checklists, and set-up software for new hires—traditionally manual and time-consuming processes. When a new employee signs on, Gusto tracks progress of offer signing, distributes forms and plans, and makes sure the employee has access to the software they need. After onboarding, Gusto enables time tracking, employee surveys, and distribution of the employee’s documents.</p>\n<p>Beyond massively reducing process inefficiency, Gusto has focused on customer delight permeating all aspects of its product. When a candidate receives an offer, the experience feels akin to a wedding invitation, versus the typical “check-the-box” paperwork. When a new hire joins, employees can post welcome messages on Gusto’s internal message board. On payday, employees receive a celebratory email, which the employer can add a personal message to. All of this transforms what was once a purely transactional experience to one that is more people centric, in which employees are treated as valued members of the company.</p>\n<p><img src=\"https://blog.ycombinator.com/wp-content/uploads/2021/08/4-gusto-img-payday-email-e1630292881349.png\" alt=\"Gusto Payday Email\" width=\"750\" height=\"1074\" class=\"aligncenter size-full wp-image-1104912\"></p>\n<p>On the employer side, customer delight manifests in saved time and helpful guidance. When it is time to run payroll, Gusto sends managers a reminder to sign forms, approve expenses, and initiate payroll. Each quarter, Gusto sends an email to employers summarizing employee changes and all the background tasks that have been completed automatically by Gusto, with no action needed from the employer. Gusto also integrates with expense and accounting tools, eliminating the manual work of recording payroll entries and approving expenses. And employers are able to use Gusto as a system of record for their employees, which means employees are easily able to access benefits and other employment-related information on their own even after leaving their company, all through the Gusto mobile app. All of this results in massive time savings for employers, allowing them to focus on actually running their business.</p>\n<p>Whereas incumbents designed their products to be reactive to customer needs, the Gusto product experience more closely resembles a human HR advisor, something SMBs typically do not have. This support system creates a relationship built on trust, where Gusto is valued as an opinionated partner rather than just another payroll tool. SMBs want a partner they can trust, that also provides great service and great technology; Gusto has strived to be great at both.</p>\n<h3>Improving access to health benefits</h3>\n<p>Providing health benefits to employees is costly, complicated, and time-consuming for SMBs. Traditionally, SMBs work with benefits brokers in a largely offline process. First, they have to find a broker. Then, they have to go through the tedium of gathering the business and employee information the broker needs. The broker then shares benefit options based on their specific carrier relationships, which are often limited and result in suboptimal and expensive options for SMBs. Once a plan is chosen, employers and brokers put together an enrollment program to drive adoption within the organization. There is then continuing overhead as employers work with brokers to manage renewals, new hires, and plan changes, often in a very manual fashion. Because of this complex process, basic benefits like health insurance are often too much for a small business to manage. Data suggest that only 56% of companies with fewer than 100 employees offer health benefits (versus 90% for 500+ employee businesses).<sup id=\"footnoteid5\"><a href=\"#footnote5\">5</a></sup></p>\n<p>Gusto reduces all this friction. As a licensed broker with payroll data already, Gusto makes it possible for a business to buy health insurance in a few clicks, rather than having to resubmit the information over and over again. And if the customer wants to speak with someone, Gusto has licensed benefits advisors on staff. Gusto also lowers the cost of benefits. Traditionally, pricing varies significantly because different providers have different loss ratios. Gusto applies algorithms to thousands of health plans to help customers choose the most cost-effective and appropriate plans for their situation. And for employers who cannot afford small group insurance, Gusto offers QSEHRA, a health reimbursement account built into payroll that employers can contribute pre-tax dollars to every month. Long-term, we believe Gusto may even be able to use its scale to reduce insurance costs by creating its own health plans in partnership with insurance carriers, further lowering costs for SMBs.</p>\n<p>Gusto also enables customers to access government programs and benefits as they arise in real time. The best example of this happened during the COVID-19 lockdown. While small businesses were struggling, Gusto created a <a href=\"https://covidresources.gusto.com/\">COVID-19 resources</a> tool for its customers to take advantage of programs like the Payroll Protection Program (PPP). Gusto simplified complex forms and enabled customers to easily apply for PPP loans through their partners. With this program, Gusto helped generate billions of dollars in assistance for its customers.</p>\n<p><img src=\"https://blog.ycombinator.com/wp-content/uploads/2021/08/5-gusto-img-benefits-experience.png\" alt=\"Gusto's Benefits Experience\" width=\"1832\" height=\"1954\" class=\"aligncenter size-full wp-image-1104913\"></p>\n<h3>Helping employees optimize their finances</h3>\n<p>Gusto has endeavored to treat the employee as an equal stakeholder from day one. And in the past few years, the company has been making meaningful investments to help employees with their personal finances. Payroll is the inception of one’s income. Gusto had the simple insight that, if they could make personal finance choices (like saving) much simpler and easier, then people would make these choices more often. Gusto first launched <a href=\"https://gusto.com/product/cashout\">Cashout</a>, a product to help employees avoid payday loans and high-interest credit card debt by giving them early access to paychecks at no cost. In a tight labor market, companies have turned to this type of benefit to attract and retain employees, and the number of businesses with employees enrolled in Cashout has more than doubled since January 2021. Cashout has helped 73% of users prevent bank overdrafts, and 52% of employees say having access to Cashout would impact whether they accept a job or not.</p>\n<p>But Gusto’s broader goal is for employees to not need Cashout in the first place. If an individual had savings in place, then during an emergency, they would have the funds they need already. To help employees with savings, banking, and more, Gusto introduced <a href=\"https://gusto.com/wallet\">Gusto Wallet</a> in 2020, a free banking app that lets employees put their paycheck, banking, savings, and emergency funds in one place. Employees are able to put aside part of their paycheck into savings, creating a rainy day fund for emergencies. Plus, they’re able to connect payroll &amp; banking in one holistic experience. Looking ahead, Gusto is well-positioned to continue launching new employee services with seamless integration processes. These products are a win-win-win: Employers get value with free benefits for employees, employees have access to powerful spending and savings tools, and Gusto further differentiates its product.</p>\n<p><img src=\"https://blog.ycombinator.com/wp-content/uploads/2021/08/6-gusto-img-wallet-e1630292853481.png\" alt=\"Gusto Wallet\" width=\"750\" height=\"1074\" class=\"aligncenter size-full wp-image-1104914\"></p>\n<h3>A people platform powered by people</h3>\n<p>Gusto’s approach to customer service and product has led to levels of customer love previously unheard of in the SMB software space. In the decade since its launch, Gusto has become a beloved nationwide brand, helping 200,000+ SMBs across the US (over 3% market share<sup id=\"footnoteid6\"><a href=\"#footnote6\">6</a></sup>) process hundreds of billion dollars of payroll, all while maintaining an NPS that is typically only seen among popular consumer companies. Its significant market share and growth trajectory signal to us that Gusto is already filling a long-standing gap in the SMB landscape. We believe that Gusto will continue to grow and compound for decades to come, as the platform expands and gains a wider reputation as a better and more cost-effective alternative to incumbents.</p>\n<h1>Act 3: New Ways to Empower Teams</h1>\n<p>Looking ahead, we believe Gusto has two major opportunities to build on top of the solid foundation they’ve created.</p>\n<p>The first is to simply build more products for businesses and their employees. Because Gusto sits at the intersection of employees and employers, it is in a prime position to launch new products for both parties. Gusto can keep making their lives easier, help employers run better businesses, and help employees accomplish their work goals. On the employee side, Gusto could become a primary bank account, seamlessly setting up direct deposits. In time, Gusto could layer on investment products and even peer-to-peer payment tools. On the employer side, Gusto is positioned to help solve many other pain points, including further streamlining government compliance and reporting, making healthcare even more accessible, making business financials easier, and more.</p>\n<p>In 2021, Gusto expanded into new services through acquisitions. Gusto recently acquired <a href=\"https://gusto.com/company-news/welcoming-ardius-to-gusto\">Ardius</a>, an AI-powered tax credit solution, to help SMBs access valuable R&amp;D tax credits that historically have been too cumbersome to apply for. Because Gusto already manages its customers’ payroll documentation, it’s now infinitely easier for SMBs to access these credits and improve their cash flow. Gusto also acquired <a href=\"https://gusto.com/company-news/welcoming-symmetry-to-gusto\">Symmetry</a>, an infrastructure company that builds APIs for payroll tax calculations. Together, Symmetry and Gusto will be able to make advances that benefit the entire payroll industry. For example, they could develop an early alert system for tax code changes, notifying business owners when state or local minimum wage requirements change, and ensuring employees complete the required withholding forms.</p>\n<p>The second major opportunity we see is in embedded services. Gusto recently launched <a href=\"https://gusto.com/company-news/introducing-gusto-embedded-payroll\">Gusto Embedded Payroll</a> to allow business-to-business (B2B) software companies to offer payroll capabilities to their own customers via APIs. For example, Squire (YC S16), a company that builds software and tools for barbershops, will offer payroll features in its own app using Gusto’s functionality. This provides a better experience for barbershops, generates more revenue for Squire, and extends Gusto’s payroll platform beyond their direct customers. Embedded services not only unlocks new opportunities to serve SMBs within vertical SaaS, fintech, and business operations, but it also exposes millions of new businesses to modern payroll. And as we’ve seen, payroll is just the beginning. Gusto is working to provide developers with APIs to embed its suite of people products into their own platforms, as a full-fledged Infrastructure-as-a-Service (IaaS) solution.</p>\n<h1>Conclusion</h1>\n<p><em>“Software is better at following rules but people make the experience incredible.”</em></p>\n<p>This quote from Josh Reeves embodies the ethos of Gusto. The company’s powerful software has modernized the way SMBs run and empowered employees to be in the driver’s seat of their finances, but the real key to its success has been the insight that people are the foundation of any business. People are what make SMBs special. With Gusto, SMBs in the US and the people that work in them are positioned better than ever to succeed.</p>\n<p><em>Thank you to Mia Mabanta and Chloe Gordon for reading multiple drafts of this essay, and to Zain Ali for designing and editing the graphics.</em></p>\n<hr></hr>\n<p><sup><b id=\"footnote1\">1</b></sup> US Census: Firms and Establishments by State, Industry (2018; released May 2021) <a href=\"#footnoteid1\"><img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/21a9.png\" alt=\"↩\" class=\"wp-smiley\"></a><br>\n<sup><b id=\"footnote2\">2</b></sup> 2018 Small Business Taxation Survey <a href=\"#footnoteid2\"><img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/21a9.png\" alt=\"↩\" class=\"wp-smiley\"></a><br>\n<sup><b id=\"footnote3\">3</b></sup> 2018 Small Business Taxation Survey <a href=\"#footnoteid3\"><img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/21a9.png\" alt=\"↩\" class=\"wp-smiley\"></a><br>\n<sup><b id=\"footnote4\">4</b></sup> 2018 Internal Revenue Services estimates <a href=\"#footnoteid4\"><img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/21a9.png\" alt=\"↩\" class=\"wp-smiley\"></a><br>\n<sup><b id=\"footnote5\">5</b></sup> Bureau of Labor Statistics: Employee Benefits in the United States (March 2020). <a href=\"#footnoteid5\"><img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/21a9.png\" alt=\"↩\" class=\"wp-smiley\"></a><br>\n<sup><b id=\"footnote6\">6</b></sup> There are approximately 6 million employers in the US. <a href=\"#footnoteid6\"><img src=\"https://s.w.org/images/core/emoji/13.1.0/72x72/21a9.png\" alt=\"↩\" class=\"wp-smiley\"></a></p>\n"
}