{
  "title":"Inside YC: The Admissions Team",
  "date":"2021-08-19T09:00:13.000000-07:00",
  "author":null,
  "id":"https://blog.ycombinator.com/?p=1104891",
  "link":"https://blog.ycombinator.com/inside-yc-the-admissions-team/",
  "content":"<p>Twice a year, YC accepts <a href=\"http://ycombinator.com/apply\">applications</a> from startups around the world. The Admissions Team is responsible for designing that process and reviewing the tens of thousands of applications we receive each year.</p>\n<p>How do we review that many applications? Mostly, it’s lots of people reading lots of applications! There’s no secret machine learning model that can find companies with great potential. Instead, we build lots of custom software to help our team work efficiently. Our app reading software allows us to quickly read applications, send messages to founders if we have any questions, and decide which teams we want to interview.</p>\n<h2>History of the Admissions Team</h2>\n<p>When YC first started, the admissions process was pretty manual. YC’s 4 founders printed out the applications, wrote comments in the margin, and passed them around the room. As the batches started to grow, Paul Graham wrote the first software to accept and process applications (it was originally part of the same code that powered <a href=\"http://news.ycombinator.com\">Hacker News</a>!). By 2014, YC was receiving 3,000 applications per batch, PG retired, and we moved to our current application software. Then in 2016, the Admissions Team was created and began to hire more people to review applications, analyze data, and update the application. Today, a team of 5 runs the admissions process.</p>\n<h2>What’s unique about the Admissions Team?</h2>\n<p>The Admissions Team is powered by human judgement, but it couldn’t work at YC’s scale without software. Sometimes, our problems can be solved by software (like automatic parsing of a founder’s responses), but sometimes it’s a human problem (how should we evaluate teams that haven’t launched yet?). This interaction between humans and software is always changing. Each admissions cycle brings more applications than the previous one and our system is always being pushed to the limit in unexpected ways.</p>\n<h2>What are some projects we’ve recently worked on?</h2>\n<ul>\n<li>Rewriting our software to video interview teams (instead of flying<br>\nteams to California).</li>\n<li>Building new internal tools to allow us to do interviews more often<br>\n(like the <a href=\"https://blog.ycombinator.com/early-deadline-for-yc-winter-2022/\">early interviews</a> we’ve been running this year).</li>\n<li>Reviewing applications we didn’t fund but that raised money from<br>\nother investors, to learn how to improve our application reading and<br>\ninterview process.</li>\n<li>Analyzing YC application data — for example, we looked at whether<br>\nrepeat applications hurt a team’s chances of being funded. (It turns<br>\nout they don’t! Teams that re-apply and have made progress since<br>\ntheir first app are much more likely to get into YC.)</li>\n<li>Working with the Outreach and <a href=\"https://www.startupschool.org/\">Startup School</a> teams to get more teams<br>\napplying to YC.</li>\n</ul>\n<p>The thing I love about the Admissions Team is that we have a lot of autonomy to experiment and change our process. It’s also incredibly exciting to read all of these ideas which may someday change the world. If you’re interested in joining our team, we’re hiring <a href=\"https://www.ycombinator.com/careers?ashby_jid=ef00c8d1-76e7-4cc3-82fe-7cc3e4679652\">Software Engineers</a> to improve our software and <a href=\"https://www.ycombinator.com/careers?ashby_jid=c8a4c1c8-9410-479f-86e7-cb2c1ca35e32\">Admissions Associates</a> to read applications.</p>\n"
}