{
  "title":"Ingredients of Happiness",
  "date":"2021-08-10T14:58:29.000000-07:00",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/ingredients-of-happiness.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/ingredients-of-happiness.html",
  "content":"<p><span>What makes for happiness?</span></p>\r\n<p><span>Acceptance is a good part of it: acceptance of self, of one's ineluctable  limitations, of others and their limitations, of one's lot in life, of one's place in the natural hierarchy of prowess and intellect and spiritual capacity, acceptance of the inevitable in the world at large.  </span></p>\r\n<p><span>Gratitude is another ingredient in happiness: one cultivates gratitude for and appreciation of what one has here and now without comparisons to an idealized past, a feared future, or to the lots of others.  No regret, resentment, worry, or comparison.  Comparison breeds envy, one of the seven deadly sins. Be your incomparable self. If you are not yet incomparable, take up self-individuation as a life project. Realize yourself. Your life is more a task than a given, a task of transmuting givens into accomplishments.  It is the task of becoming actually the unique person you are potentially. But no hankering for what is out of reach. No false ideals. No consorting with the utopian.  No Lennon-esque imagining of the impossible. No dreaming impossible dreams. </span></p>\r\n<p><span>You were born somewhere in the natural hierarchy of physical endowment, moral and affective and aesthetic sensitivity, mental power, spiritual capacity, and strength of will. But your place in the hierarchy allows for development. Know your place but press against its upper limits.</span></p>\r\n<p><span>But of course happiness is not just a matter of attitude and exertion but also rests on contingency and luck.  We need, but cannot command, the world's cooperation. Happenstance holds happiness hostage.  You were dealt a bad hand? Suck it up and play it the best you can for as long as you can.</span></p>\r\n<p><span>Conservatives emphasize attitude and exertion, leftists happenstance. Both have a point.  &quot;The harder I work, the luckier I become&quot; is a conservative exaggeration, but a life-enhancing one.  It is however the foolish conservative who thinks he is self-made and not the beneficiary of a myriad of forces and factors far beyond his control.  There is truth in Phil Ochs' lament, &quot;<a href=\"https://www.youtube.com/watch?v=S4BYOJ1tc-k\">There but for fortune</a> go you or I,&quot; but not such truth as to trump the conservative's exaggeration.  Weathering &quot;the slings and arrows of outrageous fortune,&quot; (<a href=\"https://poets.org/poem/hamlet-act-iii-scene-i-be-or-not-be\">Hamlet</a>, Act III, Scene I) he will slog on, <em>per aspera ad astra</em>.</span></p>\r\n<p><span> <a class=\"asset-img-link\" href=\"https://maverickphilosopher.typepad.com/.a/6a010535ce1cf6970c026bdee75b13200c-pi\"><img alt=\"Per aspera ad astra\" border=\"0\" class=\"asset  asset-image at-xid-6a010535ce1cf6970c026bdee75b13200c image-full img-responsive\" src=\"https://maverickphilosopher.typepad.com/.a/6a010535ce1cf6970c026bdee75b13200c-800wi\" title=\"Per aspera ad astra\"></a><br></span></p>\r\n<p> </p>"
}