{
  "title":"Philosophers as Bad Drivers?",
  "date":"2021-08-12T08:50:54.000000-07:00",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/philosophers-as-bad-drivers.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/philosophers-as-bad-drivers.html",
  "content":"<p><span>Reader Riccardo writes, </span></p>\r\n<blockquote>\r\n<div><span>I remember reading on your blog some time ago an hilarious post with an anecdote on Richard Swinburne. It was about the importance for philosophers of developing practical skills in addition to intellectual ones. In the same post you recounted how you and Swinburne were driving together to a conference and he was driving really really slow.</span></div>\r\n<div> </div>\r\n<div><span>I tried many times and in many ways, but i can't find that post anymore. Have you deleted it? If you haven't, could you help me find it?</span></div>\r\n</blockquote>\r\n<p><span>That entry, filed under <a href=\"https://maverickphilosopher.typepad.com/maverick_philosopher/automotive/\">Automotive</a>, was published on 19 November 2016. Here it is again in a larger font, with Comments enabled. But it wasn't me and Swinburne who were driving together; had we been travelling together I would have insisted on driving.  I would have listened to him discourse on the body and the immortal soul while I did my damndest to keep them connected.</span></p>\r\n<p><span>...............................................</span></p>\r\n<p><span>Just over the transom:</span></p>\r\n<blockquote>\r\n<p><span>C.J. F. Williams told me a [Richard] Swinburne story. Swinburne offered to give him a lift to some philosophy conference, but warned him ‘I only drive at 30 miles an hour’. Christopher thought he meant that he strictly abided by the urban 30 mph speed limit, and accepted the lift.</span></p>\r\n<p><span>It turned out that Swinburne <em>never ever</em> drove more than 30 mph, even on the freeway, where in the UK the limit is 70 mph. It took a while to get to there.</span></p>\r\n</blockquote>\r\n<p><span>Slow is not safe on freeways.  Swinburne is lucky to have lived long enough to be <a href=\"https://maverickphilosopher.typepad.com/maverick_philosopher/2016/09/the-swinburne-dust-up-at-the-society-for-christian-philosophers.html\">insulted</a> by the Society of Christian Philosophers.</span></p>\r\n<p><span>I have heard rumors to the effect that David Lewis was 'automotively challenged.'</span></p>\r\n<p><span>My old friend Quentin Smith didn't drive at all.  </span></p>\r\n<p><span>One of the reasons that philosophers from <a href=\"https://gypsyscholarship.blogspot.com/2007/12/curious-thalesian-tale.html\">Thales</a> on have been the laughingstock of Thracian maids and other members of <em>hoi polloi</em> is that many of them are incompetent in practical matters.  </span></p>\r\n<p><span>Quentin was just hopeless in mundane matters. The tales I could tell, the telling of which loyalty forbids. </span></p>\r\n<p><span>Me?  I'm an excellent driver, a good cook, a pretty good shot, competent in elementary plumbing, electrical, and automotive change-outs and repairs, and well-versed in personal finance.  </span></p>\r\n<p><span>A life well-lived is a balanced life.  You should strive to develop all sides of your personality: intellectual, spiritual, artistic, emotional, and physical. </span></p>\r\n<p><span><strong>Addenda</strong></span></p>\r\n<p><span><a href=\"https://www.independent.co.uk/news/people/obituary-professor-c-j-f-williams-1275651.html\">Here</a> is an obituary of C. J. F. Williams by Richard Swinburne.</span></p>\r\n<p><span>It came as news to me that Williams spent most of his life in a wheelchair.  It testifies to the possibilities of the human spirit that great adversity for some is no impediment to achievement.  I think also of Stephen Hawking, Charles Krauthammer, and FDR.</span></p>\r\n<p><span>So stop whining and be grateful for what you have. You could be in a bloody wheelchair!</span></p>\r\n<p><span>Related: <a href=\"https://maverickphilosopher.typepad.com/maverick_philosopher/2011/07/c-j-f-williams-analysis-of-i-might-not-have-existed.html\">C. J. F. Williams' Analysis of 'I Might Not Have Existed'</a></span></p>\r\n<p><span><em>UPDATE</em> (11/21/2016).</span></p>\r\n<p><span>J. H. writes,</span></p>\r\n<blockquote>\r\n<p><span>Your blog post &quot;Philosophers as Bad Drivers?&quot; brought back to memory a philosophy professor that I had as an undergrad and a story he told us about himself.</span><br><br><span><a href=\"https://philpapers.org/s/Kenneth%20G.%20Ferguson\">Dr. Ken Ferguson</a> told us a story one day about his time in one of the branches of the military.  While serving, an officer instructed him to move a jeep.  Ferguson says he objected and explained to the officer that he simply could not drive.  The officer wasn't sympathetic to his excuse and doubled down on his request.  Ferguson said that he attempted to follow the orders and ended up wrecking the jeep and some other equipment.  He was not asked to drive again.</span><br><br><span>Ferguson said that he simply does not drive.  Multiple times I remember seeing him walking down one of the main streets leading to campus in what I suspect was a distance of at least over two miles in the morning, and while always wearing a full suit at that!</span></p>\r\n</blockquote>\r\n<p><span>Thanks for the story!  Ferguson is a counterexample to the famous <a href=\"https://www.stirlingmoss.com/\">Stirling Moss</a> quotation:  “There are two things no man will admit he cannot do well: drive and make love.”</span></p>\r\n<p><span>One of the reasons philosophy and philosophers get such bad press among the general public  is because of the high number of oddballs and incompetents in philosophy. Your former professor might have had a number of good reasons for never learning how to drive.  But I would argue that there are certain things every man ought to know how to do and they include knowing how to drive cars and trucks of various sizes and operate a stick shift. Like it or not, we are material beings in a material world and knowing how to negotiate this world  is important for us and those with whom we come into contact.</span></p>\r\n<p><span>We should develop ourselves as fully and many-sidedly as possible so as to be worthy acolytes of our noble mistress, fair Philosophia. We represent her to the public.</span></p>"
}