{
  "title":"Almost Mugged in the Big Easy",
  "date":"2021-08-17T14:55:54.000000-07:00",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/almost-mugged-in-the-big-easy.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/almost-mugged-in-the-big-easy.html",
  "content":"<p><span>I came close to being mugged in New Orleans' French Quarter in '90 or '91. I was there to read  a paper at an American Philosophical Association meeting.  Early one morning I left the hotel to sample the <a href=\"http://www.dictionary.com/browse/local-color\">local color</a> and grab some breakfast. Striding along Bourbon street, I noticed a couple of black dudes on the other side of the street.  I was wearing a beret, which may have suggested to the loiterers that I was a foreigner and an easy mark. One dude approached and commented on my shoes in an obvious attempt to distract me and throw me off my guard. My situational awareness saved me. That, together with my stern mien, height, leather jacket and purposeful stride.  I gave the punk a hard look, increased my pace, and blew him off.</span></p>\r\n<p><span>Profiling is part of situational awareness. Profiling is just common sense, which is why 'progressive' fools oppose it. A couple of black youths loitering in a touristy area are probably up to no good. It is a well-known fact that blacks as a group and more criminally prone than whites as a group. There is nothing racist about pointing that out because a fact about race is not a racist fact.  It cannot be racist to speak the truth in situations where it is important that the truth be spoken. But if common sense and truth-telling make me a racist, then we should all be racists, including decent black folk. </span></p>\r\n<p><span> <a class=\"asset-img-link\" href=\"https://maverickphilosopher.typepad.com/.a/6a010535ce1cf6970c026bdee9627e200c-pi\"><img alt=\"Bourbon Street Nawlins\" border=\"0\" class=\"asset  asset-image at-xid-6a010535ce1cf6970c026bdee9627e200c image-full img-responsive\" src=\"https://maverickphilosopher.typepad.com/.a/6a010535ce1cf6970c026bdee9627e200c-800wi\" title=\"Bourbon Street Nawlins\"></a><br></span></p>"
}