{
  "title":"Political Observations",
  "date":"2021-08-13T14:10:07.000000-07:00",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/political-observations.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/political-observations.html",
  "content":"<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\r\n<div dir=\"auto\"><span>The short statements below are from my Facebook page.  It is important to explain to the open-minded and politically uncommitted, in a pithy and non-polemical way, what American conservatives stand for.  The American conservative, as I use the term, is neither a throne-and-altar neo-reactionary, nor is he an alt-Right tribalist. His conservatism takes on board the best of classical liberalism. You could call him a paleo-liberal. And of course he is far from the yap-and-scribble, do-nothing 'cruise ship' pseudo-conservatives who are willing to accept political dhimmitude so long as their perquisites and privileges and invitations to the tonier Beltway salons remain intact.  </span></div>\r\n<div dir=\"auto\"> </div>\r\n<div dir=\"auto\"><span>My 'voice' over at Facebook is usually polemical, unlike the shorts below. I tread the razor's edge between saying what needs to be said about incendiary topics and getting de-platformed.  Polemical discourse, including invective, mockery, and the rest are justified by the fact we are engaged in a war with the destructive Left over the soul of America.  You are welcome to join me, but just be sure to read the pinned post at the top of the page.</span></div>\r\n<div dir=\"auto\"> </div>\r\n<div dir=\"auto\"><span>THE FIRST OBLIGATION OF GOVERNMENT</span></div>\r\n</div>\r\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\r\n<div dir=\"auto\"> </div>\r\n<div dir=\"auto\"><span>The main obligation of a government is to protect and serve the citizens of the country of which it is the government. It is a further question whether it has obligations to protect and benefit the citizens of other countries. That is debatable. But if it does, those obligations are trumped by the main obligation just mentioned. I should think that a great nation such as the USA does well to engage in purely humanitarian efforts such as famine relief. Such efforts are arguably supererogatory and not obligatory.</span></div>\r\n<div dir=\"auto\"> </div>\r\n<div dir=\"auto\">\r\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\r\n<div dir=\"auto\"><span>NATIONALISM AND 'FAMILIALISM'</span></div>\r\n</div>\r\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\r\n<div dir=\"auto\"> </div>\r\n<div dir=\"auto\"><span>America First is as sound an idea as that each family has the right to prefer its interests over the interests of other families. If my wife becomes ill, then my obligation is to care for her and expend such financial resources as are necessary to see to her welfare. If this means reducing my charitable contributions to the local food bank, then so be it. Whatever obligations I have to help others 'ripple out' from myself as center, losing claim to my attention the farther out they go, much like the amplitude of waves caused by a rock's falling into a pond diminishes the farther from the point of impact. Spouse and/or children first, then other family members, then old friends, then new friends, then neighbors, and so on.</span></div>\r\n<div dir=\"auto\"> </div>\r\n</div>\r\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\r\n<div dir=\"auto\"><span>The details are reasonably disputable, but not the general principle. The general principle is that we are justified in looking to our own first.</span></div>\r\n<div dir=\"auto\"> </div>\r\n<div dir=\"auto\">\r\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\r\n<div dir=\"auto\"><span>ENLIGHTENED NATIONALISM</span></div>\r\n</div>\r\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\r\n<div dir=\"auto\"> </div>\r\n<div dir=\"auto\"><span>AMERICA FIRST does not mean that that the USA ought to be first over other countries, dominating them. It means that every country has the right to prefer itself and its own interests over the interests of other countries. We say 'America first' because we are Americans; the Czechs say or ought to say 'Czech Republic first.' The general principle is that every country has a right to grant preference to itself and its interests over the interests of other countries while respecting their interests and right to self-determination. America First is but an instance of the general principle. The principle, then, is Country First.</span></div>\r\n<div dir=\"auto\"> </div>\r\n<div dir=\"auto\">\r\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\r\n<div dir=\"auto\"><span>ENLIGHTENED NATIONALISM AND CHAUVINISM</span></div>\r\n</div>\r\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\r\n<div dir=\"auto\"> </div>\r\n<div dir=\"auto\"><span>America First has nothing to do with chauvinism which could be characterized as a blind and intemperate patriotism, a belligerent and unjustified belief in the superiority of one's own country. America First expresses an enlightened nationalism which is obviously compatible with a sober recognition of national failings. Germany has a rather sordid history; but Germany First is compatible with a recognition of the wrong turn that great nation took during a well-known twelve-year period (1933-1945) in her history.</span></div>\r\n<div dir=\"auto\"> </div>\r\n<div dir=\"auto\">\r\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\r\n<div dir=\"auto\"> </div>\r\n<div dir=\"auto\"><span>NATIONALISM, NATIVISM, ISOLATIONISM</span></div>\r\n</div>\r\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\r\n<div dir=\"auto\"> </div>\r\n<div dir=\"auto\"><span>An enlightened nationalism is distinct from nativism inasmuch as the former does not rule out immigration. By definition, an immigrant is not a native; but an enlightened American nationalism accepts immigrants who accept American values, which of course are not the values of the Left or of political Islam.</span></div>\r\n<div dir=\"auto\"> </div>\r\n</div>\r\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\r\n<div dir=\"auto\"><span>An enlightened nationalism is not isolationist. What it eschews is a fruitless meddling and over-eager interventionism. It does not rule out certain necessary interventions when they are in our interests and in the interests of our allies.</span></div>\r\n<div dir=\"auto\"> </div>\r\n</div>\r\n<div class=\"o9v6fnle cxmmr5t8 oygrvhab hcukyx3x c1et5uql ii04i59q\">\r\n<div dir=\"auto\"><span>So America First is not to be confused with chauvinism or nativism or isolationism.</span></div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>\r\n</div>"
}