{
  "title":"The Characteristic Attitude of the Pyrrhonists",
  "date":"2021-08-07T14:11:18.000000-07:00",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/the-characteristic-attitude-of-the-pyrrhonists.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/the-characteristic-attitude-of-the-pyrrhonists.html",
  "content":"<p><span>Benson Mates, <strong>The Skeptic Way</strong>, Oxford UP, 1996, p. 5: &quot;. . . the characteristic attitude of the Pyrrhonists is one of <em>aporia</em>, of being at a a loss, puzzled, stumped, stymied.&quot;  <em>Aporia</em> is not doubt.  Doubt implies understanding, but <em>aporia</em> is a lack of understanding.  The modern skeptic may doubt, but not the ancient skeptic.</span></p>\r\n<p><span>Connected with this is a distinction between <strong>epoché </strong>as the withholding of assent to the meaningfulness of a claim and suspension of judgment as to the truth or falsity of a claim.  (Meaningfulness is a necessary condition of a claims's being either true or false.) One can withhold assent from an assertion without granting that it makes sense; but if one suspends judgment then one has a clear propositional sense before one's mind which one neither affirms nor denies.  See Mates, p. 32.  A good distinction!  Add it to the list.</span></p>\r\n<p><span> <a class=\"asset-img-link\" href=\"https://maverickphilosopher.typepad.com/.a/6a010535ce1cf6970c026bdee67c91200c-pi\"><img alt=\"Trinity diagram\" class=\"asset  asset-image at-xid-6a010535ce1cf6970c026bdee67c91200c img-responsive\" src=\"https://maverickphilosopher.typepad.com/.a/6a010535ce1cf6970c026bdee67c91200c-320wi\" title=\"Trinity diagram\"></a>Consider, for example, this statement of the doctrine of the Trinity: &quot;There is one God in three divine persons.&quot; The epochist, to give him a name, takes no stand on the question whether the doctrinal formulation makes sense.  He neither affirms nor denies that there is a proposition that the formula expresses.  Propositions are the vehicles of  the truth-values; so by practicing <strong>epoché </strong>our epochist takes no stand on the question whether the doctrinal sentence expresses anything that is either true or false.  The suspender of judgment, by contrast, grants that the sentence expresses a proposition but takes no stand on its truth or falsity.</span></p>\r\n<p><span>So, strictly speaking, <em>aporia</em> is not doubt and <strong>epoché</strong> is not suspension of judgment.  Close but not the same.  One in the psychological state of <em>aporia</em> may or may not go on to practice <strong>epoché. </strong>Suppose I am stumped by what you say. I might just leave it at that and not take the further step of performing <strong>epoché.</strong></span></p>\r\n<p><span>The <em>aporia</em> Mates describes is an attitude. But there is another  sense of the term, a non-attitudinal sense, and I use it in this other propositional sense: an <em>aporia</em> is a propositional polyad, a set of two or more propositions that are individually plausible but jointly inconsistent. </span></p>\r\n<p><span>I also distinguish broad and narrow sub-senses of <em>aporia</em> in the second, the propositional, sense.  What I just described is a propositional <em>aporia</em> in the broad sense. In the narrow, balls-to-the-wall sense, an <em>aporia</em> is an absolutely insoluble problem set forth as a set of collectively inconsistent propositions each of which makes such a strong claim on our acceptance that it cannot be given up.</span></p>\r\n<p><span><em>Alles klar?</em> No way!</span></p>"
}