{
  "title":"Logical Form, Equivocation, and Propositions",
  "date":"2021-08-16T05:34:23.000000-07:00",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/logical-from-equivocation-and-propositions.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/logical-from-equivocation-and-propositions.html",
  "content":"<p><span>A re-post with minor edits and additions from 4 September 2017.</span></p>\r\n<p><span>......................................</span></p>\r\n<p><span>Ed Buckner wants to re-fight old battles. I'm game. The following <a href=\"http://trinities.org/blog/what-is-logical-form-the-form-of/\">post of his</a>, reproduced verbatim, just appeared at Dale Tuggy's site:</span></p>\r\n<blockquote>\r\n<p><span>The concept of logical form is essential to any discussion of identity, and hence to any discussion of the Trinity. Here is a puzzle I have been discussing with the famous <a href=\"https://maverickphilosopher.typepad.com/maverick_philosopher/\">Bill Vallicella</a> for many years.</span></p>\r\n<p><span>(Argument 1) ‘Cicero is a Roman, therefore Cicero is a Roman’</span></p>\r\n<p><span>(Argument 2) ‘Cicero is a Roman, therefore Tully is a Roman’</span></p>\r\n<p><span>My puzzle [is] that the first argument is clearly not valid if the first ‘Cicero’ means the Roman, the second the American town, yet the argument seems to instantiate a valid form. Bill objects that if there is equivocation, then the argument <em>really</em> has the form ‘a is F, therefore b is F’, which fails to instantiate a valid form.</span></p>\r\n<p><span>I then ask what is the form <em>of</em>. Clearly not of the sentences, since the sentences do not include the meaning or the proposition. Is it the form of the proposition expressed by the sentences? But then we have the problem of the second argument, where both ‘Cicero’ and ‘Tully’ mean the same man. Then the man is contained in both propositions, and if the form is of the proposition, the argument has the true form ‘a is F, so a is F’, which is valid. But I think no one would agree that the second argument is valid.</span></p>\r\n<p><span>So logical form does not belong to the sentences, nor to the propositions expressed by them. So what is it the form <em>of</em>?</span></p>\r\n</blockquote>\r\n<p><span> <a class=\"asset-img-link\" href=\"https://maverickphilosopher.typepad.com/.a/6a010535ce1cf6970c026bdee8f470200c-pi\"><img alt=\"Tully's\" class=\"asset  asset-image at-xid-6a010535ce1cf6970c026bdee8f470200c img-responsive\" src=\"https://maverickphilosopher.typepad.com/.a/6a010535ce1cf6970c026bdee8f470200c-320wi\" title=\"Tully's\"></a>My answer is that the logical form of the argument is the form of the <em>Fregean</em> propositions expressed by the sentences that make up the argument. Let me explain.</span></p>\r\n<p><span>I agree with Ed that logical form is not the form of an array of sentence-tokens. It is rather the form of an array of propositions expressed by the sentences. (To be painfully precise: it is the form of an array of propositions expressed by the assertive utterance, and thus the tokening, of a series of sentence-types by a speaker or thinker on a given occasion. A sentence-token buried in a book does not express anything by itself!)</span></p>\r\n<p><span>To solve Ed's puzzle we need to distinguish three views of propositions: the Aristotelian, the Fregean, and the Russellian. This would be a good topic for an extended post. Here I will be brief.  Brevity is the soul of blog.</span></p>\r\n<p><span>An <strong>Aristotelian proposition</strong> is an assertively uttered meaningful sentence in the indicative mood that expresses a complete thought.  What makes such a proposition 'Aristotelian' as opposed to 'Platonic' is that the meaning of the sentence is not something that can subsist on its own apart from the assertive tokening of the sentence.  The meaning of the sentence depends on its being expressed, whether in overt speech or in thought, by someone. And this expression must be thoughtfully done and not mindlessly like a parrot or a voice synthesizer. If there were no minds there would be no Aristotelian propositions. And if there were no languages there would be no Aristotelian propositions. In this sense, Aristotelian propositions are linguistic entities.</span></p>\r\n<p><span>In brief: An Aristotelian proposition is just a declarative sentence in use together with its dependent sense or meaning. Suppose I write a declarative sentence on a piece of paper. The Aristotelian proposition is not the string of physical marks on the paper, nor it is the producing of the marks; it is the marks as produced by a minded organism on a particular occasion together with the meaning those marks embody where meaning is first in the mind and only then embodied in the marks.</span></p>\r\n<p><span>A <strong>Fregean</strong> <strong>proposition</strong> is a <em>nonlinguistic</em> entity that subsists independently of minds and language. It is the sense (<em>Sinn</em>) of a declarative sentence (<em>Satz</em>) from which indexical elements have been extruded. For example, 'I am blogging'  does not express a Fregean proposition because of the indexical 'I' and because of the present tense of the verb phrase.  But 'BV blogs at 10:50 AM PST on 4 September 2017' expresses a Fregean proposition.</span></p>\r\n<p><span>Fregean senses are extralinguistic and extramental 'abstract' or 'Platonic' items. They are not in time or space even when the objects they are about are in time and space. This is what makes Fregean propositions 'Platonic' rather than 'Aristotelian.' Fregean propositions are the primary truth-bearers; the sentences that express them are derivatively true or false.  Likewise with the judgments whose content they are.</span></p>\r\n<p><span>A <strong>Russellian</strong> <strong>proposition</strong> is a blurry, hybrid entity that combines some of the features of a Fregean truth-<em>bearer</em> and some of the features of a truth-<em>maker</em>. A Russellian proposition does not reside at the level of sense (<em>Sinn</em>) but at the level of reference (<em>Bedeutung</em>).  It is out there in the (natural) world. It is what some of us call a fact or 'concrete fact' (as in my existence book) and others, e.g. D. M. Armstrong,  a state of affairs.  </span></p>\r\n<p><span>Now consider a singular sentence such as 'Ed is happy.'  For present purposes, the crucial difference between a Fregean proposition and a Russellian proposition is that, on the Fregean view, the subject constituent of <em>Ed is happy</em> is not Ed himself with skin and hair, but an abstract surrogate that represents him in the Fregean proposition, whereas in the Russellian proposition Ed himself is a constituent of the proposition!  </span></p>\r\n<p><span>We needn't consider why so many distinguished philosophers have opted for this (monstrous) view.  But this is the view that seems to have Ed in its grip and that powers his puzzle above.</span></p>\r\n<p><span>If we take the relatively saner (but nonetheless problematic) view that propositions are Fregean in nature, then the puzzle is easily solved.</span></p>\r\n<p><span>Ed asks: What is the logical form the form of?  He maintains, rightly, that it cannot be the form of an array of sentences. So it must be the form of an array of propositions. Right again. But then he falls into puzzlement: </span></p>\r\n<blockquote>\r\n<p><span>. . . ‘Cicero’ and ‘Tully’ mean the same man. Then the man is contained in both propositions, and if the form is of the proposition, the argument has the true form ‘a is F, so a is F’, which is valid.</span></p>\r\n</blockquote>\r\n<p><span>The puzzlement disappears if we reject the Russsellian theory of propositions. A man cannot be contained in a proposition, and so it cannot be the same man in both propositions.</span></p>\r\n<p><span>‘Cicero is a Roman, therefore Tully is a Roman’ is plainly invalid. Its form is: <em>Rc, ergo Rt</em>, which is an invalid form. If we adopt  either an Aristotelian or a Fregean view of propositions we will not be tempted to think otherwise.</span></p>\r\n<p><span>‘Cicero is a Roman, therefore Cicero is a Roman’ is plainly valid. ‘Cicero is a Roman, therefore Tully is a Roman’ is plainly invalid. The logical forms are different! If, on a Russellian theory of propositions, the forms are the same, then so much the worse for a Russellian theory of propositions!</span></p>"
}