{
  "title":"Is the US Becoming the SU?",
  "date":"2021-08-09T15:30:18.000000-07:00",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/is-the-us-becoming-the-su.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/is-the-us-becoming-the-su.html",
  "content":"<p><span>I've been warning of this for years. Ed West, <a href=\"https://unherd.com/2021/08/america-is-turning-into-the-soviet-union/\">America has become its own worst enemy.</a> Excerpt:</span></p>\r\n<blockquote>\r\n<p><span>Communists saw their political beliefs as so all-encompassing that even science was political: if science contradicted the goals of communism, it wasn’t science. In today’s United States the slow death of liberalism has resulted in the<a href=\"https://unherd.com/2020/12/the-perils-of-politicising-science/\" rel=\"noopener\"> blatant politicisation of science</a>, to the extent that as in Russia, <a href=\"https://bariweiss.substack.com/p/med-schools-are-now-denying-biological\" rel=\"noopener\">scientists teach things which are obviously untrue</a> because it supports the prevailing ideology. Then there is the media, much of which parrots<a href=\"https://twitter.com/LHatesYouALot/status/1419797358158745600\"> the party line</a> with almost embarrassing, “Comrade Stalin has driven pig iron to record production” levels of conformity. Once again, if you want to hear the truth, go to the BBC (until the young people who run the website take over).</span></p>\r\n<div class=\"ref-ar\">\r\n<div class=\"content\"><span>America, once the most trusting of societies, <a href=\"https://www.pewresearch.org/fact-tank/2019/07/22/key-findings-about-americans-declining-trust-in-government-and-each-other/\" rel=\"noopener\">is heading in the direction of Russia</a>, one of the least trusting. Most disturbing of all is that, formerly the most demographically vibrant of western countries, today the United States has suffered a <a href=\"https://www.forbes.com/sites/ebauer/2019/11/30/another-record-low-will-the-us-fertility-rates-collapse-ever-end/?sh=663c6ff95e45\" rel=\"noopener\">spectacular collapse in fertility.</a> This is mostly down to stagnant wages among the middle class, who can no longer afford a family with one breadwinner, and a rapid decline of religious faith. But maybe people have also lost belief in themselves, and the ideals of their country.</span></div>\r\n</div>\r\n<p><span>The Soviet Union broke into 15 different pieces, and the transition was, as CNN might put it, mostly peaceful — although Gorbachev’s old dacha is now in Russia once again after some local unpleasantness.</span></p>\r\n<p><span>Today it is the United States where people talk of<a href=\"https://thehill.com/changing-america/enrichment/arts-culture/563221-shocking-poll-finds-many-americans-now-want-to.\" rel=\"noopener\"> secession,</a> escaping a crumbling superpower ruled by geriatrics. This seems very unlikely to happen, more clickbait than reality, because why would you leave what has been for more than two centuries the richest, most impressive state on earth? But then a generation ago few would have foreseen the Soviet Union crumbling in a haze of alcoholic despair.</span></p>\r\n</blockquote>\r\n<p><span>Commentary by Rod Dreher <a href=\"https://www.theamericanconservative.com/dreher/tucker-to-hungary-nixon-to-china/\">here</a>.</span></p>"
}