{
  "title":"Mark Sainsbury on Intentional Relations",
  "date":"2021-08-24T19:52:59.000000-07:00",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/mark-sainsbury-on-intentional-relations.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/mark-sainsbury-on-intentional-relations.html",
  "content":"<p><span>Following A. N. Prior, Sainsbury sets up the problem of intentionality as follows:</span></p>\r\n<blockquote>\r\n<p><span>We are faced with a paradox: some intentional states are relational and some are not. But all intentional states are the same kind of thing, and things of the same kind are either all relational or all non-relational.  (<a href=\"https://www.marksainsbury.net/uploads/9/7/2/9/97295048/9-argumenta-22-mark-sainsbury-intentional-relations.pdf\">Intentional Relations</a>, 327)</span></p>\r\n</blockquote>\r\n<p><span>Cast in the mold of an aporetic triad:</span></p>\r\n<blockquote>\r\n<p><span>1) Some intentional states are relational and some are not.</span></p>\r\n<p><span>2) All intentional states are the same kind of thing.</span></p>\r\n<p><span>3) Things of the same kind are either all relational or all non-relational.</span></p>\r\n</blockquote>\r\n<p><span>These propositions are individually plausible but jointly inconsistent. Sainsbury solves the problem by rejecting (1).  He maintains that all intentional states are relational.  Whether I am thinking about Obama, who exists, or about Pegasus, who does not exist, a relation is involved.  In both cases, the relation connects the subject or his mental state to a representation. The representation, in turn, either represents something that exists 'in the world' or it does not.  In the first case, there is me, my intentional or object-directed mental state, the concept OBAMA, and the man himself in the external world.  In the second case, there is me, my intentional or object-directed mental state, the concept PEGASUS, and that's it: there is nothing in reality that the Pegasus representation represents.  </span></p>\r\n<p><span>Sainsbury is <em>not</em> saying that when I think about Obama, I am thinking about a representation. Plainly, I am thinking about a man, and a man is not a representation in a mind.  While Sainsbury advocates a representationalist theory of mind (RTM), he essays to steer clear of &quot;. . . a disastrous turn that a representationalist view may take: instead of saying that the intentional states are about what their representations are about, the fatal temptation for British Empiricist thinkers (and others) is to regard the intentional states as about the representations (“ideas”) themselves.&quot; (330)  On Sainsbury's RTM,</span></p>\r\n<blockquote>\r\n<p><span>For representationalists, all intentional states, including perceptual states, are relational, but the representations are not the “objects” of the states in the sense of what the states are about. Rather, the representations are what bring represented objects “before the mind”. Analogously, we see by using our eyes, but we do not see our eyes. Using our eyes does not make our vision indirect. (330)</span></p>\r\n</blockquote>\r\n<p><span>This implies that representations are not representatives or stand-ins or epistemic deputies or cognitive intermediaries interposed between mind and world. They are not like pictures. A picture of Obama is an object of vision just as Obama himself is.  But Sainsburian representations &quot;neither react appropriately with light nor emit odiferous molecules.&quot; (330)  Pictures of Obama and Obama in the flesh do both. Representations are in the mind but not before the mind. They are &quot;exercised&quot; in intentional states without being the objects of such states:</span></p>\r\n<blockquote>\r\n<p><span>Intentional states are not normally about the representations they exercise. The representation is not the state’s “object”, as that is often used. Rather, the state’s object is whatever, if anything, the representation refers to, or is about. The notion of “aboutness” needed to make this true is itself intensional: a representation may be about Pegasus, and a thought about Pegasus involves a representation about him. (338)</span></p>\r\n</blockquote>\r\n<p><span>Sainsbury's solution to the problem codified in the above inconsistent triad involves two steps. The first is to reject (1) and hold that all intentional states are relational.  They are genuine relations, not merely relation-like. The second step is to import relationality into the mind: every intentional state is a relational state that connects two intramental existing items, one being the intentional state itself, the other being the representation, whether it be a truth-evaluable representation, which S. calls a thought, or a non-truth-evaluable representation, which S. calls a concept.  </span></p>\r\n<p><span>It is easy to see that one could take the first step without taking the second. One could hold that all intentional states are relations but that these relations tie intentional states to mind-transcendent items, whether existent, like Obama, or nonexistent, like Pegasus. But this is the way of Meinong or quasi-Meinong, not the way of Sainsbury. He argues in the paper in question against Meinong for reasons I will not go into here.</span></p>\r\n<p><span>In sum, intentional states are relations, but they are neither relations to mental objects nor are they relations to extramental objects.  They are relations to representations which are neither.  A mental object is (or can be) both in the mind and before the mind.  And extramental object is (or can be) before the mind but not in the mind. A Sainsburian representation is in the mind but not before the mind (except in cases of reflection as when I reflect on the concept OBAMA as opposed to thinking about him directly).</span></p>\r\n<p><span>The article ends as follows:</span></p>\r\n<blockquote>\r\n<p><span>Metaphysical relationality is the fundamental feature of intentional states, the nature they all share. In the original puzzle, it was claimed that Raoul’s thinking about Pegasus is not relational, since there is no such thing as Pegasus, whereas his thinking about Obama is relational, since there is such a thing as Obama. But in both cases the claims are made true by Raoul being in a two-place relational state, involving a Pegasus-representation in one case and an Obama representation in the other. The metaphysical underpinning of thinking about Pegasus is just as relational as his thinking about Obama. For the Pegasus case, that is not because there really is such a nonexistent object as Pegasus, but because the truth-making state is a relational one, holding between Raoul and, in the typical case, the concept PEGASUS. For the Obama case, the state is relational in the relevant way not because there is such an object as Obama, but because the truth-making state is a relational one, holding between Raoul and, in the typical case, the concept OBAMA.<br><br></span></p>\r\n</blockquote>\r\n<p><span>CRITIQUE</span></p>\r\n<p><span>Does this solve our problem? I don't see that it does.  First of all, we are left with the problem of the intentionality of representations. What makes an Obama representation about Obama?  Sainsbury's solution to the Prior puzzle is to reject the first limb of the aporetic triad by maintaining that ALL intentional states are relational.  But since these relations are all intramental we are left with the problem of external reference.  We are left with no account of the of-ness or aboutness of representations.  We need an account not only of noetic intentionality but of noematic intentionality as well, to press some Husserlian jargon into service.</span></p>\r\n<p><span>Second, it is not clear from this article what exactly representations are. We are told that &quot;representations are what bring represented objects 'before the mind'.&quot; How exactly?  Talk of the &quot;exercise&quot; of representations suggests that they are dispositions.  Is the concept OBAMA in Raoul his being disposed to identify exactly one thing as Obama?  But how could an occurrent episode of thinking-of be accounted for dispositionally? Besides, the concept OBAMA would have to be a haecceity-concept and I have more than once pointed out the difficulties with such a posit.</span></p>\r\n<p> </p>"
}