{
  "title":"On Death: Objective and Subjective Views",
  "date":"2021-08-11T05:33:39.000000-07:00",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/on-death-objective-and-subjective-views.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/on-death-objective-and-subjective-views.html",
  "content":"<p><span>Death viewed objectively seems normal, natural, and 'acceptable.' And not evil. Is it evil that the leaves of deciduous trees fall off and die in the autumn? There are more where they came from. It is nature's way.  Everything in nature goes the way of the leaves of autumn. If this is not evil, why is it evil when we fall from the <em>Arbor Vitae</em>?  Are we not just bits of nature's fauna? Very special bits, no doubt, but wholly natural nonetheless.</span></p>\r\n<p><span>Viewed subjectively, however, the matter looks decidedly different. Gaze at someone you love at a moment when your 'reasons' for loving the person are most in evidence. Then give unblinkered thought to the proposition that the dearly beloved child or spouse will die and become nothing, that the marvellous depth of interiority that has revealed  itself as unique to your love will be annihilated, utterly blotted out forever, and soon. </span></p>\r\n<p><span>Now turn your thought back on yourself  and try to confront in all honesty and without evasion your upcoming annihilation as a <em>subject</em> of experience and not as just another object among objects. Focus on yourself as a subject<em> for whom there is a world</em>, and not as an object <em>in the world</em>.  Entertain with existential clarity the thought that you will not play the transcendental spectator at your demise and cremation.</span></p>\r\n<p><span>The horror of nonexistence from which Epicurus wanted to free us comes into view only when we view death subjectively:  <strong>I</strong> as subject, not <strong>me</strong> as object, or as 'one.'  No doubt <em>one</em> dies. But it is not possible that <em>one</em> die unless it is is possible that I die or you die, where 'you' is singular.  Viewing myself objectively, I am at a distance from myself and thus in evasion of the fact I as subject  will become nothing. </span></p>\r\n<p><span>That the self as subject should be annihilated ought to strike one as the exact opposite of normal, natural, and acceptable. It should strike one as a calamity beyond compare. For there are no more where the dearly beloved came from.  The dearly beloved, whether self or other, is unique, and not just in the 0ne-of-kind sense. For there is no kind whose instantiation is the dearly beloved.  </span></p>\r\n<p><span>Which view is true? Can either be dismissed? Can they be 'mediated' by some dialectical hocus-pocus?  These are further questions. </span></p>\r\n<p><span>But now it is time for a hard ride as Sol peeps his ancient head over the Superstition ridge line.</span></p>\r\n<p><span> <a class=\"asset-img-link\" href=\"https://maverickphilosopher.typepad.com/.a/6a010535ce1cf6970c026bdee785f9200c-pi\"><img alt=\"Wittgenstein on Death Bed\" border=\"0\" class=\"asset  asset-image at-xid-6a010535ce1cf6970c026bdee785f9200c img-responsive\" src=\"https://maverickphilosopher.typepad.com/.a/6a010535ce1cf6970c026bdee785f9200c-800wi\" title=\"Wittgenstein on Death Bed\"></a><br></span></p>"
}