{
  "title":"Soul Food",
  "date":"2021-08-24T04:19:37.000000-07:00",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/soul-food.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/soul-food.html",
  "content":"<p><span>People are generally aware of the importance of good nutrition, physical exercise and all things health-related. They understand that what they put into their bodies affects their physical health.  Underappreciated is a truth just as if not more important: that what one puts into one's mind affects one's mental and spiritual health. The soul has its foods and its poisons just as the body does. This   simple truth, known for centuries, goes unheeded while liberals fall all over each other climbing aboard the various environmental and health bandwagons. </span></p>\r\n<p><span>Second-hand smoke the danger of which is negligible much exercises our leftist pals while the soul-destroying toxicity of the mass 'entertainment' media concerns them not at all.</span><br><br><span>Why are those so concerned with physical toxins so tolerant of cultural toxins? This is another example of what I call misplaced moral enthusiasm. You worry about global warming and side stream smoke when you give no thought to the soul, its foods, and its poisons?</span></p>\r\n<p><span><span>............................</span></span></p>\r\n<p><span><span>Dave Bagwill comments:</span></span></p>\r\n<blockquote>\r\n<div class=\"yiv2943207323gmail_default\"><span>I'm sure you're acquainted with Lewis' take:</span></div>\r\n<div class=\"yiv2943207323gmail_default\"> </div>\r\n<div class=\"yiv2943207323gmail_default\"><span>&quot;C. S. Lewis sets the scene in <em>Mere Christianity</em>: The theater lights dim, the band begins to play softly and sensuously as a man enters from stage left carrying a silver tray which is covered by a white cloth. He walks to the middle of the stage and begins dancing lewdly before setting the tray with the white cloth on a table. He whirls his hands over his head and then moves slowly and deliberately as he slides the cover off the silver tray. In the middle of the tray is a pork chop. </span></div>\r\n<div class=\"yiv2943207323gmail_default\">\r\n<p><span>“Would not you think that something has gone wrong in that culture about food?” He asked.</span></p>\r\n<p><span>Of course, his seventy-year-old vision has come true in America today. From the Food Channel to “Chopped,” we are strangely twisted and out of control with our love for food.&quot;</span></p>\r\n<span><a href=\"https://www.crosswalk.com/church/pastors-or-leadership/ask-roger/7-reasons-we-struggle-with-gluttony.html\" rel=\"nofollow noopener noreferrer\">https://www.crosswalk.com/church/pastors-or-leadership/ask-roger/7-reasons-we-struggle-with-gluttony.html</a></span></div>\r\n</blockquote>"
}