{
  "title":"Why I Reject Individual Concepts",
  "date":"2021-08-29T05:39:17.000000-07:00",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/why-i-reject-individual-concepts.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2021/08/why-i-reject-individual-concepts.html",
  "content":"<p><span>This entry was first posted on 24 July 2011. Time for a repost with minor modifications. I find that I still reject individual concepts. Surprise!</span></p>\r\n<p><span>..................................</span></p>\r\n<p><span>Consider the sentences 'Caissa is a cat' and 'Every cat is an animal.'  Edward the Nominalist made two  claims in <a href=\"https://maverickphilosopher.typepad.com/maverick_philosopher/2011/07/nota-notae-est-nota-rei-ipsius-and-the-ontological-argument.html#comments\">an earlier comment thread </a>that stuck in my Fregean craw:</span></p>\r\n<blockquote>\r\n<p><span>1) The relation between 'Caissa' and 'cat' is the same as the relation between 'cat' and 'animal'.</span></p>\r\n<p><span>2) The relation between *Caissa* and *cat* is the same as the relation between *cat* and *animal.*</span></p>\r\n</blockquote>\r\n<p><span>Single quotes are being used in the usual way to draw attention to the expression enclosed within them.  Asterisks are being used to draw attention to the concept expressed by the linguistic item enclosed within them.  I take it that we agree that concepts are mental in nature in the sense that, were there no minds, there would be no concepts. </span></p>\r\n<p><span>Affirming (2), Edward commits himself to individual or singular concepts.  I deny that there are individual concepts and so I reject (2).  Rejecting (2), I take the side of the Fregeans against the traditional formal logicians (TFL-ers) who think that singular propositions can be analyzed as general.  Thus 'Caissa is a cat' gets analyzed by the TFL-ers  as 'Every Caissa is a cat.'</span></p>\r\n<p><span>To discuss this profitably we need to agree on the following definition of 'individual concept':</span></p>\r\n<blockquote>\r\n<p><span><strong>D1. C is an individual concept of x =<sub>df</sub> x is an instance of C, and it is not possible that there be a y distinct from x such that y is an instance of C.</strong></span></p>\r\n</blockquote>\r\n<p><span>So if there is an individual concept of my cat Caissa, then Caissa instantiates this concept and nothing distinct from Caissa does <em>or could</em> instantiate it. We can therefore say that individual concepts, if there are any, 'capture' or  'grasp' or 'make present to the mind' the very haecceity (non-qualitative thisness) of the individuals of which they are the individual concepts.</span></p>\r\n<p><span>We can also speak of individual concepts as singular concepts and contrast them with general concepts.  *Cat* is a general concept.  What makes it general is not that it has many instances, although it dos have many instances, but that it <em>can have</em> many (two or more) instances.  General concepts are thus multiply instantiable. </span></p>\r\n<p><span>The concept C1 expressed by 'the fattest cat that ever lived and ever will live' is also general.  For, supposing that Oscar instantiates this concept, it is possible that some other feline instantiate it.  Thus C1 does not capture the haecceity of Oscar or of any cat.   C1 is general, not singular.  C1 is multiply instantiable in the sense that it can have two or more instances, though not in the same possible world or at the same time. </span></p>\r\n<p><span>And so from the fact that a concept applies to exactly one thing if it applies to anything, one cannot validly infer that it is an individual or singular concept.  Such a concept must capture the very identity or non-qualitative thisness of the thing of which it is a concept.  This is an important point.  To push further I introduce a definition and a lemma.</span></p>\r\n<blockquote>\r\n<p><span><strong>D2. C is a <em>pure</em> concept =<sub>df</sub> C involves no specific individual and can be grasped without reference to any specific individual.</strong></span></p>\r\n</blockquote>\r\n<p><span>Thus 'green,' 'green door,' 'bigger than a barn,' 'self-identical,'  and 'married to someone' all express pure concepts.  'Taller than the Washington Monument,' 'married to Heidegger,' and 'identical to Heidegger' express impure concepts, if they express concepts at all. </span></p>\r\n<blockquote>\r\n<p><span><strong>Lemma 1: No individual concept is a pure concept.</strong></span></p>\r\n</blockquote>\r\n<p><span><em>Proof</em>.  By (D1), if C is an individual concept of x, then it is not possible that there be a y distinct from x such that y instantiates C.  But every pure concept, no matter how specific, even unto maximal specificity, is possibly such as to have two or more instances.  Therefore, no individual concept is a pure concept.  </span></p>\r\n<p><span>Consider the famous Max Black example of two iron spheres alike in all monadic and relational respects.  A pure concept of either, no matter how specific, would also be a pure concept of the other.  And so the non-qualitative haecceity of neither would be captured by that pure concept.</span></p>\r\n<blockquote>\r\n<p><span><strong>Lemma 2.  No individual concept is an impure concept.</strong></span></p>\r\n</blockquote>\r\n<p><span><em>Proof</em>.  An individual  concept is either pure or impure.  If C is impure, then by (D2) it must involve an individual.  And if C is an individual concept it must involve the very individual of which it is the individual concept. But <em>individuum ineffabile est</em>: no individual can be grasped precisely <em>as an individual. </em> But that is precisely what one would have to be able to do to have an impure concept of an individual.  Therefore, no individual concept is an impure concept.</span></p>\r\n<p><span>Putting the lemmata together, it follows that an individual concept cannot be either pure or impure.  But it must be one or the other.  So there are no individual concepts. Q. E. D.!</span></p>\r\n<p><span> <a class=\"asset-img-link\" href=\"https://maverickphilosopher.typepad.com/.a/6a010535ce1cf6970c0282e11cd074200b-pi\"><img alt=\"Indiscernible\" border=\"0\" class=\"asset  asset-image at-xid-6a010535ce1cf6970c0282e11cd074200b image-full img-responsive\" src=\"https://maverickphilosopher.typepad.com/.a/6a010535ce1cf6970c0282e11cd074200b-800wi\" title=\"Indiscernible\"></a><br></span></p>"
}