{
  "title":"David Benatar on Epistemic Injustice",
  "date":"2022-11-05T20:52:51.000000Z",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/david-benatar-on-epistemic-injustice.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/david-benatar-on-epistemic-injustice.html",
  "content":"<p><span>An excerpt from <a href=\"https://journalofcontroversialideas.org/article/2/2/207\">The Uphill Battle of Unpopular Ideas</a>:</span></p>\r\n<blockquote>\r\n<div class=\"html-p\"><span>Regarding epistemic matters, many of those who identify themselves as progressives speak about “epistemic injustice” – the injustice that occurs when certain people, typically women and darker skinned people, are accorded less standing or authority as knowers or transmitters of knowledge. This is a profound and important concept.</span></div>\r\n<div class=\"html-p\"> </div>\r\n<div class=\"html-p\"><span>The problem is that progressives have missed a key, but obvious, dimension to epistemic injustice. The more somebody is actually the victim of epistemic injustice, the less likely and less widely they are to be recognized as such. Indeed, the absence of that recognition is precisely what feeds the epistemic injustice. Not only are you not taken as seriously as you should be, but it is not widely recognized that this is the case.</span></div>\r\n<div class=\"html-p\"> </div>\r\n<div class=\"html-p\"><span>The corollary is that the more widespread the recognition of a particular manifestation of epistemic injustice is, the less likely it is that the purported victim actually is a victim. This is not a logical point but rather a psychological one. It is logically possible for X, Y, and Z to recognize that W is the victim of epistemic injustice while continuing to take W less seriously than W should be taken. Psychologically, however, those who regard W as a victim of epistemic injustice are more likely not to inflict that injustice themselves, either because they are sensitive to the potential problem or because they compensate (and not infrequently <span class=\"html-italic\">over</span>compensate) for it.</span></div>\r\n<div class=\"html-p\"> </div>\r\n<div class=\"html-p\"><span>One upshot of this is that while those espousing orthodox views are likely to be given more credence, even when the orthodox views are flawed, those expressing unpopular but well-founded views are likely to be given less credence than they should be given. That is a stark form of epistemic injustice – and one typically not recognized by those who are concerned about epistemic injustice.</span></div>\r\n<div class=\"html-p\"> </div>\r\n<div class=\"html-p\"><span>Even mentioning this comes at a risk. This is because there are orthodox views about who the victims of epistemic injustice are – and they do not include those who hold unorthodox views (for example, about epistemic injustice). Everybody can agree that it is unseemly to claim epistemic injustice when it does not exist. However, the difference between orthodox and unorthodox views about when this applies is that the orthodox views are, by definition, dominant. The point of this observation is not to elicit sympathy, but to articulate the ironies and paradoxes.</span></div>\r\n</blockquote>"
}