{
  "title":"Animal Awareness: Aristotle, Galileo, Kant",
  "date":"2022-10-23T00:09:43.000000Z",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/10/the-ontological-role-of-animal-awareness-aristotle-galileo-kant.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/10/the-ontological-role-of-animal-awareness-aristotle-galileo-kant.html",
  "content":"<p class=\"yiv9669569525MsoNormal\"><span>This just over the trans0m from Edward Buckner. I have added my comments in blue.</span></p>\r\n<blockquote>\r\n<p class=\"yiv9669569525MsoNormal\"><span>Aristotle: Even if all animals were eliminated and thereby all perceptions (since only animals perceive), “there will still be something perceptible—a body, for example, or something warm, or sweet, or bitter, or anything else perceptible.”</span></p>\r\n</blockquote>\r\n<p class=\"yiv9669569525MsoNormal\"><span>BV: Evaluation of the above requires that we get clear about the sense of 'perceptible.' There are at least the following three senses:</span></p>\r\n<p class=\"yiv9669569525MsoNormal\"><span>1) X is perceptible<sub>1</sub> =<sub>df</sub> it is logically possible that x be perceived.</span></p>\r\n<p class=\"yiv9669569525MsoNormal\"><span>2) X is perceptible<sub>2 </sub>=<sub>df</sub> it is nomologically possible that x be perceived.</span></p>\r\n<p class=\"yiv9669569525MsoNormal\"><span>3) X is perceptible<sub>3</sub> =<sub>df</sub> x is able to be perceived by some sentient being.</span></p>\r\n<p class=\"yiv9669569525MsoNormal\"><span>I suggest that (3) is what we normally mean by 'perceptible.'  What (3) says is that for a thing to be perceptible, there must be at least one existing perceiver with the ability to perceive the thing.  On (3), then, Aristotle is mistaken. So on a charitable interpretation, he probably means something like (2): many if not most natural things are such that, if there were an able-facultied perceiver on the scene, one or more natural things would be perceived, and would be perceived as having <em>in themselves</em> such qualities as being warm, bitter, or sweet. Aristotle is a realist about what we now call secondary qualities.</span></p>\r\n<blockquote>\r\n<p class=\"yiv9669569525MsoNormal\"><span>Galileo: “tastes, odors, colors, and so on are no more than mere names so far as the object in which we place them is concerned, and that they reside only in the consciousness. Hence <em>if the living creature were removed</em>, all these qualities would be wiped away and annihilated.”</span></p>\r\n</blockquote>\r\n<p class=\"yiv9669569525MsoNormal\"><span>BV: Galileo Galilei (1564-1642) belongs to the modern period which he helped inaugurate, along with Rene Descartes (1596-1650).   The main point to note for present purposes is that Galileo reduces the sensory qualities that Aristotle viewed as properties of things themselves to perceiver-relative 'secondary qualities.' So if &quot;living creatures were removed,&quot; then at least the secondary qualities would be &quot;removed&quot; along with them. That's quite the contrast with Aristotle.  The Stagirite is a realist about warmth, etc,; the Italian is an idealist about warmth, etc.</span></p>\r\n<blockquote>\r\n<p class=\"yiv9669569525MsoNormal\"><span>What would Kant’s view be? Does he think that if all perceiving beings ceased to exist, then appearances would cease to exist? But appearances, according to him, are things like trees and rocks. Does he then think that if all perceiving beings ceased to exist, trees and rocks, and all other non-sentient things, would cease to exist? We should be told.</span></p>\r\n</blockquote>\r\n<p class=\"yiv9669569525MsoNormal\"><span>BV:  Underlying Ed's questions is the question: Who or what is the knowing subject for Kant?  For Aristotle, the knowing subject is the concrete man embedded in nature, a hylomorphic composite in which <em>anima forma corporis</em>. For Kant, however, the concrete man, the man of flesh and blood embedded in nature, with both animal body and animal soul, is <em>blosse Erscheinung</em>, a mere appearance or phenomenon, and thus an object of knowledge, but not the subject of knowledge, i.e., not the knowing subject.  For Kant, the knowing subject is transcendental.  This is Kant's view whatever you think of it. It is undoubtedly fraught with difficulties, but my sketch is accurate albeit superficial. </span></p>\r\n<p class=\"yiv9669569525MsoNormal\"><span>And so the answer to both of Ed's questions is in the negative.</span></p>"
}