{
  "title":"Philosophically Salient Senses of 'See'",
  "date":"2022-11-12T23:20:13.000000Z",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/philosophically-salient-senses-of-see.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/philosophically-salient-senses-of-see.html",
  "content":"<p><span>This entry is relevant to my ongoing discussion with Dr. Buckner.</span></p>\r\n<p><span>It is plain that 'sees' has many senses in English.  Of these many senses, some are philosophically salient.  Of the philosophical salient senses, two are paramount.  Call the one 'existence-entailing.'  (EE) Call the other 'existence-neutral.' (EN)  On the one, 'sees' is a so-called verb of success.  On the other, it isn't, which not to say that it is a 'verb of failure.'  </span></p>\r\n<blockquote>\r\n<p><span>EE:  Necessarily, if subject S sees x, then x exists.</span></p>\r\n<p><span>EN:  Possibly, subject S sees x, but it is not the case that x exists.</span></p>\r\n</blockquote>\r\n<p><span>Now one question is whether both senses of 'see' can be found in ordinary English.  The answer is yes.  &quot;I know that feral cat still exists; I just now saw him&quot; illustrates the first.  &quot;You look like you've just seen a ghost&quot;  illustrates the second.  If I know that the feral cat exists on the basis of seeing him, then 'sees' (or a cognate thereof) is being used in the (EE) sense as a 'verb of success.'  If ghosts do not exist, as I am assuming, then one who sees a ghost literally sees something that does not exist.  We call this second sense of 'sees' the phenomenological sense.  </span></p>\r\n<p><span>So far, I don't think I've said anything controversial.  I have simply pointed out two different senses and thus two different uses of 'sees' in ordinary, non-philosophical English.</span></p>\r\n<p><span>We advance to a philosophical question, and embroil ourselves in controversy, when we ask whether, corresponding to the existence-neutral sense of 'sees,' there is a type of seeing, a type of seeing that does not entail the existence of the object seen.  One might grant that there is a legitimate use of 'sees' (or a cognate thereof) in English according to which what is seen does not exist without granting that in reality there is a type of seeing that is the seeing of the nonexistent.</span></p>\r\n<p><span>One might insist that all seeing is the seeing of what exists, and that one cannot literally see what does not exist.  So, assuming that there are no ghosts, one cannot see a ghost.  As Joe Biden might say, &quot;Come on man, you can't see what ain't there!&quot;</span></p>\r\n<p><span>But suppose a sincere, frightened person reports that she has seen a ghost of such-and-such a ghastly description.  Because of the behavioral evidence, you cannot reasonably deny that the person has had an  experience, and indeed an object-directed (intentional) experience.  You cannot deny, given her fear-indicating behavior, verbal and non-verbal, that she had a visual experience as of  something ghastly. You cannot reasonably say, &quot;Because there are no ghosts, your experience had no object.&quot;  For it did have an object, indeed a material (albeit nonexistent) object having various ghastly properties. After all, she saw something, not nothing. Not only that, she saw something quite definite with definite properties.  She didn't see Casper the Friendly Ghost but a ghastly ghost.</span></p>\r\n<p><span>You might object, &quot;No, she merely thought she saw something.&quot; But there was no thinking or doubting or considering going on; she <em>saw</em> something and it scared the crap out of her.</span></p>\r\n<p><span>This example suggests that we sometimes literally see what does not exist, and that seeing therefore does not entail the existence of that which is seen.  If this is right, then the epistemologically primary sense of 'see' is given by (EN) supra.  If so, then problems arise for realism about the external world. For example, how do I know that the tree I see in good light (etc.) exists in itself whether or not I or anyone see it? </span></p>\r\n<p><span><a href=\"http://afteraristotle.net/2014/01/19/a-first-reply-to-the-maverick-philosophers-replies-to-my-seeing-and-the-existence-of-the-seen/\">Henessey's response</a>:  &quot;I grant the reality of her experience, with the reservation that it was not an experience based in vision, but one with a basis in imagination, imagination as distinguished from vision.&quot;  The point, I take it, is that what we have in my example of a person claiming to see a ghost is not a genuine case of seeing, of visual perception, but a case of imagining.  The terrified person imagined a ghost; she did not see one.</span></p>\r\n<p><span>I think Hennessey's response gets the phenomenology wrong.  Imagination and perception are phenomenologically different.  For one thing, what we imagine is up to us: we are free to imagine almost anything we want; what we perceive, however, is not up to us.  When <a href=\"https://www.youtube.com/watch?v=qh_fUMgFomk\">Ebeneezer Scrooge saw the ghost of Marley</a>, he tried to dismiss the apparition as &quot;a bit of bad beef, a blot of mustard, a fragment of an underdone potato,&quot; but he found he could not.  Marley: &quot;Do you believe in me or not?&quot;  Scrooge: &quot;I do, I must!&quot;  This exchange brings out nicely what C. S. Peirce called the compulsive character of perception.  Imagination is not like this at all.  Whether or not Scrooge saw Marley, he did not imagine him for the reason that the object of his experience was not under the control of his will.</span></p>\r\n<p><span>The fact that what one imagines does not exist is not a good reason to to assimilate perception of what may or may not exist to imagination.</span></p>\r\n<p><span>Second, if a subject imagines x, then it follows that x does not exist.  Everything imagined is nonexistent.  But it is not the case that if a subject perceives x, then x does not exist.  Perception either entails the existence of the object perceived, or is consistent with both the existence and the nonexistence of the object perceived.</span></p>\r\n<p><span>Third,  one knows the identity of an object of imagination simply by willing the object in question.  The subject creates the identity so that there can be no question of re-identifying or re-cognizing an object of imagination.  But perception is not like this at all.  In perception there is re-identification and recognition. Scrooge did not imagine Marley's ghost for the reason that he was able to identify and re-identify the ghost as it changed positions in Scrooge's chamber.  So even if you balk at admitting that Scrooge saw Marley's ghost, you ought to admit that he wasn't imaging him.</span></p>\r\n<p><span>I conclude that Hennessey has not refuted my example. To see a ghost is not to imagine a ghost, even if there aren't any.  Besides, one can imagine a ghost without having the experience that one reports when one sincerely states that one has seen a ghost.  Whether or not this experience is perception, it surely is not imagination.</span></p>\r\n<p><span>But I admit that this is a very murky topic! </span></p>"
}