{
  "title":"Another Useful Idiot Crosses My Path",
  "date":"2022-11-14T22:56:32.000000Z",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/another-useful-idiot-crosses-my-path.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/another-useful-idiot-crosses-my-path.html",
  "content":"<p><span>I'm the chess guy hereabouts. A year ago I got a call from an 86-year-old retired chemist with an interest in the game. A meeting was arranged, a game was played, and then the talk turned to politics. The old man told us that he had voted for Biden out of revulsion at Trump. He said he had been a Republican all his life but lately became a Democrat. Brian and I were gentle with him, drawing him out to see how deep he'd dig his hole. It was deep enough for us to write him off as an utterly clueless old man living in the past.</span></p>\r\n<p><span>Part of the problem with such people is that they live by a code of civility that will get you killed in the present-day political world should you dare to enter it.  They don't understand that the Left is at war with us, and leftists no longer hide the fact. Their stealth ideologues of, say, 10-15 years ago are now out in the open and brazen in their plans and proclamations. Leftists see politics as  war, and if we don't, we lose.  </span></p>\r\n<p><span>Brian and I are a couple of patzers, which is not to say that we won't clean your clock at the local coffee house. We are 'B' players (1600-1800) in the USCF hierarchy. The game with the old man turned into a training session. He acquitted himself so poorly we never heard from him again despite our welcoming manner. </span></p>\r\n<p><span>That is another fault of old men. Their outsized egos make them impermeable to instruction. They cannot stand to lose. But life is hierarchical and you will lose again and again and again. Wokesters with their promotion of 'equity' (equality of outcome) and their assault on merit rail against life's natural hierarchy, but to no ultimate avail. In the end, reality wins. With apologies to Ron DeSantis, reality is where 'woke' goes to die.</span></p>"
}