{
  "title":"Notes on Idealism, Realism, Frege, and Prichard ",
  "date":"2022-11-11T19:12:12.000000Z",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/notes-on-realism-frege-and-prichard-.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/notes-on-realism-frege-and-prichard-.html",
  "content":"<p><span>Ed Buckner sent me a <a href=\"file:///C:/Users/Owner/Downloads/Travis%20&amp;%20Kalderon%20Oxford_Realism.pdf\">pdf</a> the first couple pages of which I reproduce below. Bibliographical data <a href=\"https://academic.oup.com/edited-volume/28176/chapter-abstract/213053035?redirectedFrom=fulltext\">here</a>. Emphases added. My commentary is <span>in blue</span>. </span></p>\r\n<p><span>...........................................</span></p>\r\n<p><strong><span>T</span><span>wentieth Century Oxford Realism</span></strong></p>\r\n<p><span>Mark Eli Kalderon and Charles Travis</span></p>\r\n<p><span>1 Introduction</span></p>\r\n<p><span>This is a story of roughly a century of Oxford philosophy told by two outsiders.</span><br><span>Neither of us has ever either studied or taught there. Nor are we specially privy to</span><br><span>some oral tradition. Our story is based on texts. It is, moreover, a very brief, and</span><br><span>very highly selective, story. We mean to trace the unfolding, across roughly the</span><br><span>last century, of one particular line of thought—a sort of anti-idealism, and also a</span><br><span>sort of anti-empiricism. By focussing in this way we will, inevitably, omit, or give</span><br><span>short shrift to, more than one more than worthwhile Oxford philosopher. We will</span><br><span>mention a few counter-currents to the main flow of 20th century Oxford thought.</span><br><span>But much must be omitted entirely.</span></p>\r\n<p><br><span>Our story begins with a turn away from idealism. Frege’s case against idealism, so far as it exists in print, was made, for the most part, between 1893 (in the </span><span>preface to Grundgesetze volume 1) and 1918-1919 (in “Der Gedanke”). Within that </span><span>same time span, at Oxford, John Cook Wilson, and his student, H.A. Prichard, </span><span>developed, independently, their own case against idealism (and for what might</span><br><span>plausibly be called—and they themselves regarded as—a form of “realism”). Because of the way in which Cook Wilson left a written legacy it is difficult at best to </span><span>give exact dates for the various components of this view. But the main ideas were </span><span>probably in place by 1904, certainly before 1909, which marked the publication of </span><span>Prichard’s beautiful study, “Kant’s Theory of Knowledge”. It is also quite probably seriously misleading to suggest that either Cook Wilson or Prichard produced </span><span>a uniform corpus from the whole of their career—uniform either in content or in </span><span>quality. But if we select the brightest spots, we find a view which overlaps with </span><span>Frege’s at most key points, and which continued to be unfolded in the main lines </span><span>of thought at Oxford for the rest of the century.</span></p>\r\n<p><span><strong>Frege’s main brief against idealism</strong> could be put this way: <strong>It placed the scope </strong></span><span><strong>of experience (or awareness) outside of the scope of judgement.</strong> In doing that, it </span><span>left us nothing to judge about. A central question about perception is: How can it </span><span>make the world bear on what one is to think—how can it give me what are then </span><span>my reasons for thinking things one way or another? The idealist answer to that, </span><span>Frege showed, would have to be, “It cannot”.</span></p>\r\n<p><span>BV: This is not at all clear. An example would be nice. Let me supply one. I see a tree. The seeing is a perceiving and this perceiving is a mental state of  me, the perceiver.  I see that the tree is green.  Seeing that the tree is green I come  to think that the tree is &quot;one way or another,&quot; e.g., green as opposed to not green.  The authors seem to be asking the following question: How can perceiving something -- a tree in my example -- make the world give me the perceiver a reason for thinking the tree to be &quot;one way or another,&quot; green for example?</span></p>\r\n<p><span>This is a very strange question, one that has no clear sense.  Or at least I don't know what the authors are asking. If the question has no clear sense, then the supposedly idealist answer has no clear sense either. The authors are presumably defending some sort of realism about the objects of sense perception. If so, then it is not my perceiving that makes the world do anything. Their question ought to be: how do physical things in the external world, things that exist and have (most of) the properties they have independently of my or anyone's perceivings, make our perceivings of these things have the content that they in fact have? How does the green tree over there bring it about that I am now having an experience <em>as of</em> a green tree? Or is this perhaps the very question the authors are trying to ask their convoluted way?</span></p>\r\n<p><span>But let's read on.</span></p>\r\n<p><span>What, in Frege’s terms, “belongs </span><span>to the contents of my consciousness”—what, for its presence needs someone to </span><span>be aware of it, where, further, that someone must be me—cannot, just in being as </span><span>it is, be what might be held, truly, to be thus and so. (This is one point Prichard </span><span>retained throughout his career, and which, later on, he directed against others who </span><span>he termed “sense-datum theorists”. It is also a point Cook Wilson directed, around </span><span>1904, against Stout (see section 4).</span></p>\r\n<p><span>BV:  There is a solid point here, but it needs to be put clearly. The tree is in space and is green. No content of consciousness is in space or is green. Therefore, the tree is not a content of consciousness. This syllogism refutes a form of subjective or psychological idealism. But who holds it? Certainly not Kant. But let's leave Kant out of the  discussion for now. More important than Koenigsbergian exegesis is the deep and fascinating question of idealism versus realism.</span></p>\r\n<p><span>What I said in the preceding paragraph needs a bit of refining. If I see a tree, then I am aware of something. That awareness-of or consciousness-of is an episode in my conscious, mental life.  So it is appropriately referred to as a 'content of consciousness.' Now consider that awareness-of just as such.  (Of course, you cannot consider <em>my</em> awareness, but you can consider your own similar but numerically different awareness.) Is it green? No. It is colorless. The awareness-of, as such, is not the sort of 'thing' that could have a color.  </span></p>\r\n<p><span>The awareness of green is not a green awareness.  If it were green it would have to be extended in space. No color without extension. But the awareness-of, though it is in time, is not in space.  So here we have a content of consciousness that is neither colored nor in space. </span></p>\r\n<p><span>We should all will agree, then,  that a perceiving <em>as of</em> a green tree is not a green perceiving. This is so even if the perceiving is not merely <em>as of</em> the tree, but <em>of</em> it in the sense that implies that there exists a tree that is being perceived. Again, all colors are extended in space. But no mental act is extended in space. Ergo, no mental act is colored. <em>A fortiori</em> if mental a</span><span>cts  are as G. E. Moore once said, &quot;diaphanous.&quot;  </span></p>\r\n<p><span>What about the content of a mental act? It too is a 'content of consciousness.' Macbeth had an hallucinatory visual experience as of a dagger. The dagger-appearance is what I am now calling the content. It is clearly distinct (though not separable) from the hallucinatory experiencing.  The hallucinatory act/experiencing is not spatially extended.  What about the dagger-appearance?  Did it not seem extended to Macbeth? Don't pink rats look to be extended in space by that drunks who hallucinate them? Yes they do.  What we can say here is that while the dagger-appearance is phenomenologically extended, it is not extended in objective space. </span></p>\r\n<p><span>But there is a deeper reason for opposing subjective idealism. This I believe to be the solid point that Prichard makes.</span></p>\r\n<p><span>If I judge a tree to be green, I judge it to <em>be</em> green whether or not I or anyone so judge it.  So if the tree <em>is</em> green, it is green in itself whether or not there are any perceivers.  The point is quite general: to judge of anything x that it is F is to judge that it is F in itself whether or not there are any judgers. It doesn't matter whether the judgment is true or false: a judgment that x is F <em>purports</em> to lay bare the way things are independently of judgers, whether or not in fact things are as the judgment states. </span></p>\r\n<p><span>So if I say that the perceiving is green, I thereby commit myself to saying that the perceiving is green in itself whether or not there are any perceivers.  But it is contradictory to maintain that something that can exist only as a content of consciousness, and thus cannot exist in itself, can also exist in itself apart from any consciousness.</span></p>\r\n<p><span>What I am calling 'the solid point 'puts paid to any form of idealism that identifies physical objects with contents of consciousness if those contents exist only in contingent minded organisms such as human animals.   If there exists a tree that I perceive, it is as little in my consciousness as it is inside my head. But please note that the point just made presupposes the reality of the external world and thus begs the question against those forms of idealism that avoid the mistakes that subjective/psychological idealists make.</span></p>\r\n<p><span> So, in particular, it was crucial to Frege that a </span><span>thought could not be an idea (“Vorstellung”), in the sense of “idea” in which to be </span><span>one is to belong to someone’s consciousness. The positive sides of these coins are: </span><span>all there is for us to judge about—all there is which, in being as it is might be a way </span><span>we could judge it to be—is that environment we all jointly inhabit; to be a thought </span><span>is, intrinsically, to be sharable and communicable. All these are central points in </span><span>Cook Wilson’s, and Prichard’s, Oxford realism. So, as they both held (early in </span><span>the century), perception must afford awareness of, and relate us to, objects in our </span><span>cohabited environment.</span></p>\r\n<p><span>BV: The authors seem to be saying that it is not about ideas, <em>Vorstellungen</em>, contents of consciousness, etc. that we make judgments, but about the common physical environment in which we human animals live.  This remains vague, however, if we aren't told what &quot;the environment&quot; is.  Do they mean particular things in the physical world, or are they referring to the physical world as a whole? And while it is true that thoughts (either Frege's <em>Gedanken</em> or something very much like them) are communicable and thus sharable -- unlike contents of consciousness that are numerically different for numerically different people -- what does this have to do with &quot;the environment&quot;? Fregean and Frege-like thoughts are abstract objects; hence, not to be found in the physical &quot;environment.&quot;  Of course, for Frege, thoughts/propositions are not contents of consciousness; it does not follow, however, they are in the &quot;environment.&quot;  There are in Frege's third realm, that of abstracta. (I promise to avoid tasteless jokes about the supposedly anti-Semitic Fege and the Third Reich.) </span></p>\r\n<p><span>There is another point which Prichard, at least, shared with Frege. As Prichard</span><br><span>put it:</span></p>\r\n<blockquote>\r\n<p><span>There seems to be no way of distinguishing perception and conception</span><br><span>as the apprehension of different realities except as the apprehension</span><br><span>of the individual and the universal respectively. Distinguished in this</span><br><span>way, the faculty of perception is that in virtue of which we apprehend</span><br><span>the individual, and the faculty of conception is that power of reflection</span><br><span>in virtue of which a universal is made the explicit object of thought.</span><br><span>(Prichard, 1909, 44)</span></p>\r\n</blockquote>\r\n<p><span>Compare Frege:</span></p>\r\n<blockquote>\r\n<p><br><span>A thought always contains something which reaches out beyond the</span><br><span>particular case, by means of which it presents this to consciousness as</span><br><span>falling under some given generality. (1882: Kernsatz 4) </span><span>But don’t we see that the sun has set? And don’t we also thereby see </span><span>that this is true? That the sun has set is no object which emits rays </span><span>which arrive in our eyes, is no visible thing like the sun itself. That </span><span>the sun has set is recognized as true on the basis of sensory input. </span><span>(1918: 64)</span></p>\r\n</blockquote>\r\n<p><span>For the sun to have set is a way for things to be; that it has set is the way things are </span><span>according to a certain thought. A way for things to be is a generality, instanced</span><br><span>by things being as they are (where the sun has just set). Recognizing its instancing</span><br><span>is recognizing the truth of a certain thought; an exercise of a faculty of thought.</span><br><br><span>By contrast, what instances a way for things to be, what makes for that thought’s</span><br><span>truth, does not itself have that generality Frege points to in a thought—any more</span><br><span>than, on a different level, which Frege calls “Bedeutung”, what falls under a (first-level) concept might be the sort of thing things fall under. What perception affords </span><span>is awareness of the sort of thing that instances a way for things to be. Perception’s </span><span>role is thus, for Frege, as for Prichard, to bring the particular, or individual, in </span><span>view—so as, in a favorable case, to make recognizable its instancing (some of) the </span><span>ways for things to be it does. The distinction Prichard points to here is as fundamental both to him and to Frege as is, for Frege, the distinction between objects </span><span>and concepts.</span></p>\r\n<p><span>BV: Now things are now getting interestingly 'aporetic.' How do I know that the sun has set? I see the sun, and I see the horizon, but I don't literally see (with my eyes) <em>that the sun has set</em>. If the italicized words pick out an entity, it is an invisible one. As Frege says, &quot;That the sun has set is no object that emits rays . . . .&quot;</span></p>\r\n<p><span>How do I know that the tree is green? I see the tree, and I see green at the tree, but I don't see <em>that the tree is green</em>. Why not? Well, 'That tree is green' is logically equivalent to 'That green tree exists.' So if I can see that the tree is green, then I can see that the green tree exists. But existence is not empirically detectable. I can sense green, but I cannot sense existence. So I cannot see that the green tree exists.  Therefore, I cannot see that the tree <em>is</em> green.  Existence and property-possession are invisible. More generally, they are insensible, and not because of our sensory limitations, but because existence and property-possession are not empirically detectable by any manner of critter or by any device. </span></p>\r\n<p><span>And yet I know that the tree is green and I know that the sun has set. But how? Frege's answer, &quot;on the basis of sensory input&quot; is lame.  Sure, there has to be sensory input for me  to know what I know in these cases, but how does it work? Such input is necessary, but it cannot be sufficient.  Here is what Frege says in <em>Der Gedanke</em>:</span></p>\r\n<blockquote>\r\n<p><span>Das Haben von Sinneseindruecken ist zwar noetig zum Sehen der Dinge, aber nicht hinreichend. Was noch hinzukommen muss, ist nichts Sinnliches. (<em>Logische Untersuchungen</em>, 51)</span></p>\r\n<p><span>To be sure, the having of sensory impressions is necessary for seeing things, but not sufficient. What yet must be added is nothing sensory.</span></p>\r\n</blockquote>\r\n<p><span>Necessary, because seeing (with the eyes) is a sensory function that cannot occur without sensory data, which is to say, sensory givenness, sensory input. Not sufficient, because what I need to know to know that that the tree <em>is</em> green, is that the physical individual/object does in reality instantiate the concept/property. The problem is that I cannot see the copulative linkage in the green tree any more than I can see the existence of the green tree. For again, to see either the linkage or the existence I would have to be able to sense them when there is no sensory awareness of either.  </span></p>\r\n<p><span>What Frege adds that is not sensory is the thought/proposition. But this item is off by itself in a platonic <em>topos ouranios</em>. How on Earth or in Plato's Heaven can Fregean thoughts avail anything for the solution of our problem? To know that the tree is green in reality I need to know the sublunary unity of thing and property here below. How is that knowledge aided by the positing of a 'ouranic' item, the thought/proposition, whose subject constituent is an abstract item as abstract as the thought itself? The Fregean thought brings together a subject-constituent, a sense, with a predicate-constituent, also a sense.  It does not bring together the concrete tree and its properties.</span></p>\r\n<p><span>What the authors say above on behalf of Frege and Prichard is thus no answer at all. We are told, &quot;<span>Perception’s </span><span>role is thus, for Frege, as for Prichard, to bring the particular, or individual, in </span><span>view—so as, in a favorable case, to make recognizable its instancing (some of) the </span><span>ways for things to be it does.&quot;  <span>Are they joking?</span>  </span>This glides right past the problem.  What I need to know to know that the tree <em>is</em> green is the linkage or togetherness of individual and property in the thing in the external world. The thing is a this-such or a something-which. You cannot split the <em>this</em> from the <em>such. </em> You cannot split perception from conception assigning to the first the job of supplying bare individuals and assigning to the second the job of providing universals.  For the problem, again, is 'methectical,' a problem of <em>methexis</em>: how do sensory individual and  intelligible universal meet to form the sublunary this-such?</span></p>\r\n<p><span>Kant has an answer (whatever you think of it): the synthesis of individual and property/concept is achieved by the transcendental unity of apperception! </span></p>\r\n<p><span>I will have more to say about this in a later post. </span></p>"
}