{
  "title":"Losertarian Update",
  "date":"2022-11-01T22:06:48.000000Z",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/losertarian-update.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/losertarian-update.html",
  "content":"<p><span>A tip of the hat to Dmitri Dain for sending us <a href=\"https://thehill.com/homenews/campaign/3713966-arizonas-libertarian-senate-candidate-dropping-out-of-race-endorsing-masters/\">here</a> where we read:</span></p>\r\n<blockquote>\r\n<p><span>Libertarian Marc Victor dropped out of Arizona’s closely watched Senate race on Tuesday, encouraging voters to cast their ballots for Republican <span class=\"person-popover\"><a class=\"person-popover__link\" href=\"https://thehill.com/people/blake-masters/\">Blake Masters </a></span>in his challenge to Sen. <span class=\"person-popover\"><a class=\"person-popover__link\" href=\"https://thehill.com/people/mark-kelly/\">Mark Kelly </a></span>(D).</span></p>\r\n<p><span>Polls had shown Victor garnering support in the low single digits, but his small bloc of supporters could provide a critical boost to Masters, as surveys show the Republican only trailing Kelly by a few percentage points.</span></p>\r\n<p><span>“Don’t vote for Marc Victor for Senate, vote for Blake Masters,” Victor said on Tuesday. “Blake’s in a very tight race here with Mark Kelly, and I want to see him win.”</span></p>\r\n<p><span>Victor met virtually with Masters prior to dropping out of the race and <a href=\"https://www.youtube.com/watch?v=ismjOQNzsIA\">posted a video of their roughly 20-minute conversation</a>.</span></p>\r\n</blockquote>\r\n<p><span>Hats off to Marc Victor for his good sense. To vote for him would have been utter folly since it is (a) certain that he would not have been elected and (b) certain that he would have siphoned off votes needed by the impressive Blake Masters to defeat the disgusting Mark Kelly.</span></p>\r\n<p><span>Once more: politics is a practical game. Without the power to implement your policies, they are nothing but hot air and paper. Don't throw away your vote on unelectables. Don't confuse a political party with a discussion society. </span></p>\r\n<p><span>Marc  Victor is a local gun guy. <a href=\"https://www.youtube.com/watch?v=GenVQQoAu6k\">Here</a> is one of his videos. <a href=\"https://www.youtube.com/watch?v=XucT-fBZnXE\">Here</a> is another. He talks sense! </span></p>"
}