{
  "title":"Three Axes of Conflict",
  "date":"2022-10-26T20:34:25.000000Z",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/10/three-axes-of-conflict.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/10/three-axes-of-conflict.html",
  "content":"<p><span>Antony Beevor in <em>The Spanish Civil War</em> (Orbis 1982, Penguin 2001, p. 279) writes that in the aftermath of the war both sides engaged in gross simplifications for propaganda purposes:</span></p>\r\n<blockquote>\r\n<p><span>As a result, the three axes of conflict (left-right, centralist-regionalist, and authoritarian-libertarian) have often been crudely amalgamated, leaving the ferocity of the war partly unexplained.</span></p>\r\n</blockquote>\r\n<p><span>Philosophers do well to study history to offset their penchant for the bird's-eye view.  They need to come to ground from time to time if only to fuel themselves for further flight. Feasting on the carrion of fact, however, is not particularly nutritious. So what caught this philosopher's eye was the three-axes schema. Philosophers love <em>schemata</em>.  They love the synoptic and panoptic survey. 'Spectators of all time and existence . . . .&quot;</span></p>\r\n<p><span>The three-axes schema strikes me as relevant to the current political war in the USA as we teeter on the brink of World War Three thanks to the stupidity and criminality of the Democrat Party and the useful idiots who support it.</span></p>\r\n<p><span>1) <em>Left-Right.</em> It might be useful to distinguish between the Old Left, the New Left, and the 'Woke' Left. (Having sneered, I now drop the sneer quotes, at least for the space of this paragraph.) What distinguishes the Woke Left is corporate capitalism, the globalist capitalism of mega-corporations with the economic, and in consequence thereof political, clout to bend both government and the Fourth Estate to their collective will, thereby destroying the independence of both of the latter and eliminating checks on their unbalanced power.</span></p>\r\n<p><span>2) <em>Centralism-Regionalism.</em> Liberty versus tyranny defines the battle for the soul of America.  Tyranny emanates from the central government which, while endlessly mouthing 'democracy' and 'rule of law' respects neither. Liberty, if it can survive, will be defended locally and regionally by citizens with the civil courage to speak out and face 'cancellation' and worse. (I am thinking, among other things, of ordinary citizens who attend school board meetings and protest being labelled 'domestic terrorists' for rejecting the indoctrination of their children in Critical Race Theory, in 1619-type historical revisionism, in transgender ideology, and in anti-Caucasian ethno-masochism.) Regionalism is or is closely related to <a href=\"https://maverickphilosopher.typepad.com/maverick_philosopher/2010/07/can-federalism-save-us.html\">federalism</a>. (The overturning of Roe v. Wade scored a point for the latter; the Left's febrile outrage clearly demonstrates its anti-federalism and anti-democratic spirit. )</span></p>\r\n<p><span>3) <em>Authoritarian-Libertarian</em>. American conservatism is not authoritarian but classically liberal. But while <em>classically</em> liberal, and thus opposed to throne-and-altar paleo-conservatism, it also opposes the anti-religionism and anti-traditionalism of the Left, especially that of the 'woke' Left, which is a particularly virulent and lethal strain of leftism. It thus treads the <em>via media</em> avoiding both the Road to Serfdom (you get the allusion, of course) and the road to anarchy as lately instantiated by Atifa black shirts and BLM Marxist thugs.</span></p>"
}