{
  "title":"Against H. A. Prichard and the 'Standard Picture' of Kant ",
  "date":"2022-11-05T23:58:42.000000Z",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/against-h-a-prichard-and-the-standard-picture-of-kant-.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/against-h-a-prichard-and-the-standard-picture-of-kant-.html",
  "content":"<p><span> In an <a href=\"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/06/the-standard-picture-of-kants-idealism.html\">earlier post</a>, drawing on the work of Henry E. Allison, I wrote:</span></p>\r\n<blockquote>\r\n<p><span>The standard picture opens Kant to the devastating objection that by limiting knowledge to appearances construed as mental contents he makes knowledge impossible when his stated aim is to justify the objective knowledge of nature and oppose Humean skepticism. Allison reports that Prichard &quot;construes Kant's distinction between appearances and things in themselves in terms of the classic example of perceptual illusion: the straight stick that appears bent to an observer when it is immersed in water.&quot; (p. 6)  But then knowledge is rendered impossible, and Kant is reduced to absurdity.</span></p>\r\n<p><span>Anyone who studies Kant in depth and in context and with an open mind should be able to see that his transcendental idealism is not intended as a subjective idealism. A related mistake is to think that subjective idealism is the only kind of idealism. The &quot;standard picture&quot; is fundamentally mistaken. Appearances (<em>Erscheinungen</em>) for Kant are <em>not</em> the private data of particular minds, and thus <em>not</em> ideas in the Cartesian-Lockean sense, or any other sort of content of a particular mind. Kant distinguishes crucially between <em>Erscheinung</em> and <em>Schein/Apparenz</em> between appearance and illusion/semblance. Because of this distinction, appearances [in the specifically Kantian sense] cannot be assimilated to perceptual illusions in the way Prichard and the &quot;standard picture&quot; try to assimilate them. </span></p>\r\n</blockquote>\r\n<p><span>In this entry I will expand upon the above by taking a close look at the stretch of text in H.A. Prichard's <em>Kant's Theory of Knowledge</em> (1909) in which he discusses the straight stick that appears bent when immersed in water.  This is a classical example of perceptual illusion.  It illustrates how an appearance (in one sense of the term) may distort reality (in one sense of the term).  Call the first the A1 sense and the second the R1 sense. My claim, of course, is that this empirical A1-R1 distinction is not the same as Kant's distinction between phenomena and things in themselves, and that anyone who, like Prichard, thinks otherwise has simply failed to understand what Kant is maintaining.  Kant's distinction between phenomena and things in themselves is the distinction between empirically real, intersubjectively accessible, public, causally interacting things in space and time, on the one hand, and those same things considered apart from the <em>a priori</em> conditions of our sensibility.  The Earth and its one natural satellite, the Moon, are examples of phenomena in Kant's sense.  Neither is a private, mental item in a particular mind as a modification of such a mind or an item internal to it. The Earth and the Moon are not mental phenomena in any Cartesian, Humean, or Brentanian sense, but empirically real, <em>physical</em> things. But though they are empirically real, they are transcendentally ideal when considered independently of the conditions of our sensibility.</span></p>\r\n<p><span>In sum, there are two distinctions. The first is the distinction between private mental contents of particular minds and real things external to such minds. For example, Ed is enjoying a visual experience of his by-now-famous desk.  Neither the desk as a whole nor any part of it is literally in Ed's mind, let alone in his head. The desk, like his head and the rest of his body, is in the publicly accessible external world.  Now let 'A1' denote Ed's experience/experiencing whereby his desk appears to him, and let 'R1' denote the desk itself which is external to Ed's mind/consciousness. Prichard's mistake is to conflate this A1-R1 distinction with Kant's distinction between phenomena and things in themselves. The R1 of the first distinction is the A2 of Kant's distinction which, again, is the distinction between intersubjectively accessible objects in space and time and those same objects viewed independently of the conditions of our sensibility.</span></p>\r\n<p><span>I now turn to Chapter IV of Prichard's book. The chapter is entitled &quot;Phenomena and Things in Themselves.&quot;  Prichard takes Kant to be saying that spatial and temporal relations are &quot;relations which belong to things only as perceived.&quot; (p. 79.)  Prichard goes on to say, &quot;The thought of a property or a relation that belongs to things as perceived involves a contradiction.&quot;  He brings up the submerged stick which is in reality straight, but appears to a perceiver as bent. Prichard then makes the unexceptionable point that </span></p>\r\n<blockquote>\r\n<p><span>. . . the assertion that something is so and so implies that it is so and so in itself, whether it be perceived or not, and therefore the assertion that something is so and so to us as perceiving, though not in itself, is a contradiction in terms. </span></p>\r\n</blockquote>\r\n<p><span>This is certainly true. After I explain why it is true, I will explain why it has nothing to do with Kant.  One cannot assert of anything x that it is F without thereby asserting that x is F <em>in reality</em>.  What one asserts to be the case one asserts to be the case whether or not anyone asserts it.  (Of course, it doesn't follow that what one asserts to be the case <em>is</em> the case. All that follows is that what one asserts to be the case <em>purports</em> to be the case independently of anyone's act of assertion.  Saying this I am merely unpacking the concept of assertion.) So if I assert of x that it is bent, then I assert that x is bent in itself or in reality whether or not there are any assertors or perceivers.  To assert that x is bent is to assert that a mind-independent item is bent. (Of course, it does not follow that there <em>is</em> a mind-independent item that is bent; all that follows is that <em>if</em> some item is bent or straight or has any property, then it is mind-independent.) Therefore, if I assert of an illusory appearance that it is bent, then I fall into contradiction. For what I am then asserting  is that something that is mind-dependent -- because it is illusory -- is not mind-dependent but exists in reality. </span></p>\r\n<p><span>This is what I take Prichard to be maintaining in the passage quoted. Thus charitably interpreted, what he is saying is (by my lights) true.  But what does this have to do with Kant? Kant is not not talking about private mental items internal to particular minds such as an illusory appearance as of a bent stick. He is not saying of such an appearance (Apparenz) or semblance (Schein) that it is the subject of spatial and temporal relations.  If he were, then he would stand refuted by Prichard's unexceptionable point. But it strains credulity to think that a great philosopher could blunder so badly. </span></p>\r\n<p><span>Note also that to read Kant as if his phenomena (<em>Erscheinungen</em>) in space and time are private mental phenomena is to impute to him the sophomoric absurdity that mental data which are unextended are extended as they must be if they stand in physical relations. Such an imputation would be exegetically uncharitable <em>in excelsis</em>.</span></p>\r\n<p><span>Finally, if space and time and everything in it is mental in Prichard's sense, and internal to particular minds like ours, then the upshot would be an utterly absurd form of subjective idealism. </span></p>\r\n<p><span>...........................................</span></p>\r\n<p><span>Further tangential ruminations.</span></p>\r\n<p><span>How do I know that the visual datum is an illusory appearance? If I know that what appears to me -- the immersed-stick visual datum -- is illusory, then I know that what appears to me cannot be bent or straight or have any spatial property. For what is illusory does not exist, and what does not exist cannot have properties. But how do I know that the visual datum does not exist?</span></p>\r\n<p><span>That is precisely what I don't know in the cases of perceptual illusion in which I am really fooled -- unlike the classic stick case above that fools no adult. No adult is 'taken in' by acquatic refraction phenomena. &quot;Damn that boatman! He gave me a bent oar!&quot;  Here is a real-life example.</span></p>\r\n<p><span> <a class=\"asset-img-link\" href=\"https://maverickphilosopher.typepad.com/.a/6a010535ce1cf6970c02af14a4c7e8200b-pi\"><img alt=\"Crotalus atrox\" class=\"asset  asset-image at-xid-6a010535ce1cf6970c02af14a4c7e8200b img-responsive\" src=\"https://maverickphilosopher.typepad.com/.a/6a010535ce1cf6970c02af14a4c7e8200b-320wi\" title=\"Crotalus atrox\"></a>Hiking in twilight, I experience a visual datum <em>as of</em> a rattlesnake. I jump back and say to my partner, &quot;There's a rattler on the trail.&quot;  I assert the visual datum to be a rattler, which of course implies that in reality there is a rattler.  (And that I jumped back shows that my assertion was sincere.) A closer look, however, shows that I mistook a tree root for a snake. What I initially saw (in the phenomenological sense of 'see') was only an illusory appearance. If I then say that the illusory appearance is a rattler or is venomous, etc. then I fall into contradiction. </span><span>The point is that illusory appearances do not exist and therefore cannot have properties: they cannot be bent or straight or venomous or of the species <em>crotalus atrox</em>, etc.</span></p>\r\n<p> </p>"
}