{
  "title":"Fetterman Unfettered: Against Ableism",
  "date":"2022-11-02T21:21:25.000000Z",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/ableism.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/ableism.html",
  "content":"<p><span>In the Commonwealth of Pennsylvania, John Fetterman is currently competing with Dr. Mehmet Oz for a seat in the U. S. Senate. Any objective person who observes both men in action can see that Fetterman is mentally, morally, and politically unfit for office.  (I won't comment on the 'hoodie,' the ugly forearm tattoos, the neck bulge, the man's lack of a career outside of politics, or his 'anti-gravitas': the man's overall thuggish appearance.) </span></p>\r\n<p><span>Mentally, he has trouble formulating clear sentences.  A recent stroke has left him impaired. Morally, he is a brazen liar: he recently stated in a debate with Dr. Oz that he supports fracking when it is obvious from his previous assertions and his overall position that he does not. Politically, he supports destructive hard-Left positions with respect to drugs and crime and everything else.</span></p>\r\n<p><span>But let's say you believe in 'equity' as wokesters use the word. You believe in equality of outcome and proportional representation regardless of merit and qualifications.  If 'equity' is your concern why shouldn't a stroke-impaired man be a U. S. senator? After all, if dementia is no bar to high office, why should stroke-impairment be?  Fetterman's fit with the Biden bunch couldn't be tighter. To demand qualifications for high office or for any job at all is to discriminate against the unqualified, and we now know that discrimination is among the worst of sins. We are all equal and the supposed accomplishments and talents of Dr. Oz the heart surgeon really ought to count for nothing in an equitable society. We have made progress in the 'progressive' sense of the term. And we are better people for it. </span></p>\r\n<p><span>The disabled are just as qualified as the rest of us. For they are not really disabled at all; they are <em>differently abled</em>.  I myself was born with only one functioning ear. But this birth defect gives me the ability to block out sound in bed by putting my good ear down on the pillow. Clearly, this wonderful ability of mine compensates for all of the drawbacks of monaural hearing such as the inability to tell from which direction a sound is coming. The point generalizes: <em>all</em> disabilities are really abilities in disguise. No one should ever be evaluated in any way on the basis of supposed 'talents' or 'qualifications' or 'abilities' or 'accomplishments.' What I said in my first paragraph convicts me of the thought crime of 'ableism.'  I ought to check myself into the nearest 'progressive' re-education camp.</span></p>"
}