{
  "title":"Guest Post: Buckner on Prichard on Kant",
  "date":"2022-11-03T20:36:05.000000Z",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/guest-post-buckner-on-prichard-on-kant.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/guest-post-buckner-on-prichard-on-kant.html",
  "content":"<p><span>PRICHARD ON KANT: IN DEFENCE OF THE ANGLOSPHERE</span></p>\r\n<p><span>D.E. Buckner</span></p>\r\n<p><span>Bill Vallicella discusses <a href=\"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/06/the-standard-picture-of-kants-idealism.html\">here</a> the ‘standard picture’ of Kant ’s transcendental idealism as a theory that affirms the unknowability of the ‘real’ (things in themselves) and relegates knowledge to the purely subjective realm of representations (appearances), adding that “P. F. Strawson and H. A. Prichard are exponents of this reading along with many others in the Anglosphere”. He argues that “Appearances (<em>Erscheinungen</em>) for Kant are <em>not</em> the private data of particular minds, and thus <em>not</em> ideas in the Cartesian-Lockean sense, or any other sort of content of a particular mind. Kant distinguishes crucially between <em>Erscheinung</em> and <em>Schein/Apparenz</em>: between appearance and illusion/semblance.” He develops this theme in another post <a href=\"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/06/berkeleyan-and-kantian-idealism-how-do-they-differ.html\">here</a>, in the context of Kant’s ‘rainbow argument’ (A45/B63).</span></p>\r\n<p> </p>\r\n<p><span>Bill does not explain the Anglospheric reading. In this post, I shall outline Prichard’s objection to the rainbow argument, as set out in <em>Kant’s Theory of Knowledge</em> (Oxford: Clarendon Press, 1909, pp. 94 ff). He objects, in effect, that the rainbow argument is an argument by analogy. Just as a rainbow is to the raindrops which create the illusion of a rainbow during a sunny shower, i.e. as appearance stands in relation to reality, so the raindrops are to the ‘things in themselves’. “Not only are the raindrops <em>mere appearances</em>, but even their circular form, nay, even the space in which they fall, are nothing <em>in themselves</em> but mere modifications or fundamental dispositions of our sensuous perception; the transcendental object [i.e. the thing in itself], however, remains unknown to us” (B62-3).&quot; My emphasis.</span></p>\r\n<p> </p>\r\n<p><span>But the analogy is a poor one. Prichard says (p.97) that we can only distinguish something as the <em>thing in itself</em> from an <em>appearance</em>, “so long as we mean by the thing in itself what Kant normally means by it, viz. something which exists independently of perception and is not an appearance at all.” I.e., the relation between rainbow and raindrops is not analogous to that between raindrops and things in themselves, because ‘thing in itself’ signifies something absolute and not relative, namely what the scholastics called a <em>per se being</em>, a thing that exists independently of any other thing, and particularly of any sentient thing. If a raindrop really is a <em>per se</em> being, then it exists independently of any other such being, so cannot be an appearance <em>of</em> something. If on the other hand it is not a <em>per se</em> being, then the analogy collapses: we cannot say that <em>just as</em> a rainbow stands to raindrops, <em>so</em> raindrops stand to raindrops-in-themselves.</span></p>\r\n<p> </p>\r\n<p><span>Kant’s argument thus depends on a sleight of hand. “He reaches it by a transition which at first sight seems harmless … while he states the problem in the form ‘Are things in themselves spatial or are they only spatial as appearing to us?’ he usually states the conclusion in the form ‘Space is the form of phenomena’, i. e. phenomena are spatial. A transition is thereby implied from ‘things as appearing’ to ‘appearances’” (pp. 73-4).</span></p>\r\n<p> </p>\r\n<p><span>Underlying the mistake, says Prichard, is the identification of <em>perception</em> with <em>judgement</em>. Our apprehension of what things are is essentially a matter of thought or judgement, and not of perception. “We do not <em>perceive</em> but <em>think</em> a thing as it is”. For example, the proposition “the portion of the great circle joining two points on the surface of a sphere is the shortest way between them via the surface” expresses a judgment that is valid for everyone.</span></p>\r\n<p> </p>\r\n<blockquote>\r\n<p><span> Kant, however, treats the judgement as a <em>perception</em>; for if we apply his general assertion to this instance, we find him saying that what we judge the portion of the great circle to be essentially belongs to the <em>perception</em> of it, and is valid for the <em>sensuous</em> faculty of every  human being, and that thereby it can be distinguished from what belongs to the same perception of a great circle accidentally, e. g. its apparent colour, which is valid only for a particular organization of this or that sense. In this way he correlates what the great circle really is, as well as what it looks, with perception, and so is able to speak of what it is for perception. But, in fact, what the great circle is, is correlated with thought, and not with perception; and if we raise Kant’s transcendental problem in reference not to perception but to thought, it cannot be solved in Kant’s agnostic manner. For it is a presupposition of thinking that things are <em>in themselves</em> [my emphasis] what we think them to be; and from the nature of the case a presupposition of thinking not only cannot be rightly questioned, but cannot be questioned at all.</span></p>\r\n</blockquote>\r\n<p> </p>\r\n<p><span>Simply put, a proposition is true or false depending on whether it agrees with reality or not.</span></p>\r\n<p> </p>\r\n<p><span>As I shall argue elsewhere, this ‘Anglospheric’ point by Prichard marks a turning point in the philosophy of perception, indeed in philosophy itself. For nearly 300 years, beginning with the discovery of Descartes and others that the process of vision begins with the retinal image, the focus of philosophy was on perception, i.e. images, and not on language. Indeed, it is hard to find any informed linguistic analysis in the writing of Descartes, Locke, Berkeley, Kant and other. Church regarded Hegel’s <em>Logic</em> as marking the very lowest point of the history of logic. In the twentieth century Anglosphere, by contrast, the philosophy of perception is marked by a ‘linguistic turn’ to focus on language and philosophical logic. But that is a separate issue, as is the question of why philosophy on the Continent, much or all of it in the tradition that originates with Brentano and Husserl, took such a different turn.</span></p>\r\n<p> </p>"
}