{
  "title":"The Militant Defends Trump and Our Civil Liberties",
  "date":"2022-11-16T17:05:36.000000Z",
  "author":null,
  "id":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/the-militant-defends-trump-and-our-civil-liberties.html",
  "link":"https://maverickphilosopher.typepad.com/maverick_philosopher/2022/11/the-militant-defends-trump-and-our-civil-liberties.html",
  "content":"<p><span>I never thought I'd be quoting from <em>The Militant</em>! A tip of the hat to <a href=\"https://anthonygflood.com/\">Tony Flood</a> who writes,</span></p>\r\n<blockquote>\r\n<div><span>I could consider making a tactical alliance with one who signs off with &quot;The fight to defend constitutional liberties is at the center of the class struggle today.&quot; </span><span>This is classic Marxism, not Antifa terrorism.<br clear=\"all\"></span></div>\r\n</blockquote>\r\n<div><span>Populist democracy makes for strange bedfellows. This is true democracy, not Orwellian 'democracy' which is the wokester's name for <em>oligarchy</em>. Why then am I not a socialist? Two reasons. First, socialism does not work economically. Second, because socialism runs counter to human nature and will not be freely adopted, socialism must be enforced. En<em>force</em>ment  requires a massive state apparatus inimical to individual liberty. It would be interesting to do a comparison between totalitarian state socialism and 'woke' capitalism. Both are totalitarian, anti-populist, and suppressive of individual freedoms such as freedom of speech and thought. (See fourth quotation below.) How then do they differ? <a href=\"https://themilitant.com/2022/11/12/democrats-attacks-on-rights-at-heart-of-us-class-struggle/\">Excerpts</a>:</span></div>\r\n<div>\r\n<blockquote>\r\n<p><span>Throughout the final days of the 2022 campaign, Democrats centered their fire on former President Donald Trump. They claim “democracy itself” is threatened if he ever holds office again. Before Trump was even elected in 2016, Democrats unleashed the FBI against him — and against constitutional freedoms working people have won in blood and sorely need. They’ve used congressional witch hunts and launched a cascade of legal cases against him, his family members and political allies.</span></p>\r\n<p><span>Speeches by prominent Democrats make abundantly clear they will continue on this course whoever wins control of Congress. The real culprits responsible for Trump, they insist, are the millions of working people President Joseph Biden calls “semi-fascists” and believes can’t be trusted to make political decisions.</span></p>\r\n<p><span>The entirety of Biden’s prime-time Nov. 2 speech — his main address prior to the election — was to attack so-called MAGA Republicans as a “threat to democracy.”</span></p>\r\n<p><span>[. . .]</span></p>\r\n<p><span>Then in the Nov. 2 speech, Biden said Trump supporters threaten the rule of law, not because of what they do, but because of what they <em>think and say.</em> This is an attack on freedom of speech itself.</span></p>\r\n<p><span>[. . .]</span></p>\r\n<p><span>The only other issue Democrats campaigned around is abortion, built on false claims that the U.S. Supreme Court’s Dobbs ruling this summer outlawed it. But that isn’t true. It held abortion had no basis in the Constitution and returned the debate over the issue to the people and their elected representatives.</span></p>\r\n<p><span>[. . .]</span></p>\r\n<h3><span>Smear opponents as ‘foreign agents’</span></h3>\r\n<p><span>From the beginning, one key theme of the Democrats’ assault on Trump and his administration was the utterly disproven charge that they were hooked up with Russian President Vladimir Putin. They got the FBI to put forward the Steele Dossier, a collection of gossip and smears paid for by the Hillary Clinton campaign, to try and impeach Trump.</span></p>\r\n</blockquote>\r\n</div>"
}