{
  "title":"Why the President Should Not Be Called a Coward",
  "date":"2021-08-26T23:00:00.000000-07:00",
  "author":null,
  "id":"1166 at https://www.undergroundthomist.org",
  "link":"https://www.undergroundthomist.org/why-the-president-should-not-be-called-a-coward",
  "content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"> <p><img alt=\"\" class=\"media-image\" height=\"306\" width=\"480\" src=\"https://undergroundthomist.org/sites/default/files/styles/large/public/Martin-panel-from-Judgment-triptych.jpg?itok=NqNaFmMx\"></p>\r\n<p> </p>\r\n<p>As the shame and terror in Afghanistan unfold, every day worse than the last -- as we watch the president of the United States crumbling before our eyes -- the reasons for calling him a coward seem compelling.  For three reasons, I resist joining this cry.</p>\r\n<p>The first concerns Mr. Biden personally.  A coward flees from danger.  Mr. Biden is safe and at ease.  Though he is abandoning thousands who are in peril of their lives, he is not at risk.  He does not rise to the level of cowardice.  He sinks some degrees beneath it.</p>\r\n<p>The second concerns our political classes.  To pin the accusation of cowardice on Mr. Biden alone is to deny the perfidy of his partners, enablers, and predecessors.  A great many experienced persons in responsible positions, both in the military and in the political branches of the government -- persons who ought to have resigned and gone loudly public rather than be complicit in this bloody farce -- have instead chosen to give him cover.  Although the epicenter of the hurricane of spin lies in his own party, we have seen time and time again that the other party is not much better, in this and in other matters.  The horror in Afghanistan illuminates the fact that our political classes have horribly failed.</p>\r\n<p>The third concerns us all.  We retain at least the trappings of a republic, and we empowered these people.  Though we watch with shame not only the abandonment of our friends abroad but the unravelling of our social order at home, we cannot bring ourselves to pay attention to anything for long.  Reality impresses itself upon us with scarcely more force than reality television.  We watch social and international conflicts the way we would watch pro wrestling.</p>\r\n<p>The scythe arcs down with such terrible swiftness.  I used to wonder whether my grandchildren would escape the final destruction; then whether my children would; now I wonder whether my contemporaries will.</p>\r\n<p>It is not entertaining when a writer repeats himself, but what we are experiencing is judgment.  If we will not grasp that, we will grasp nothing.  We are being judged not so much for the imaginary evils for which violent, deranged thugs despise the country, but for the real evils we have cuddled to our bosoms.   We are just beginning to have the government we deserve.</p>\r\n<p>Politics matters, make no mistake.  But what we need is not just a different president, not just a political reform, but sorrow, soul-searching, and conversion.  The rest -- let us hope -- will follow.</p>\r\n<p> </p>\r\n </div></div></div>"
}