{
  "title":"So Long as the Despots Are Our Despots, Is Everything Fine?",
  "date":"2021-08-22T23:00:00.000000-07:00",
  "author":null,
  "id":"1164 at https://www.undergroundthomist.org",
  "link":"https://www.undergroundthomist.org/so-long-as-the-despots-are-our-despots-is-everything-fine",
  "content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"> <p><img alt=\"\" class=\"media-image\" height=\"320\" width=\"480\" src=\"https://undergroundthomist.org/sites/default/files/styles/large/public/Napoleon-bonaparte.jpg?itok=sgsrOASm\"></p>\r\n<p> </p>\r\n<p>Many conservatives have come to believe that the domination of our political system by the executive and judiciary would be fine, if only the executive and judiciary did the right things.  Thus is it argued that since there is now a conservative majority on the Supreme Court, judicial restraint has had its day, and all we need is a conservative chief executive who will toss out mandates the way Roman nobles flung coins to the crowd – that is, the way Progressive chief executives do.</p>\r\n<p>I find the part about conservatives in the judiciary difficult to fathom.  You don’t find that (somewhat) conservative majority on the Supreme Court revoking the constitutionally fraudulent doctrine of a private right to lethal violence against babies, do you?  And if Mr. Trump is still the best standard-bearer the (supposedly) conservative party can come up with, the trouble on the Right is very deep indeed.</p>\r\n<p>But suppose the premise were correct.  The conclusion would still be wrong.</p>\r\n<p>Yes, of course, the Progressive nostrums foisted upon the enfeebled republic by courts and administrators are abominations.  But we have two problems, not one:  Not only what is decided, but how it is decided.  So long as we still aspire to a republic, prudential judgments for the common good should be made primarily by legislatures, not by the executive and judiciary.  Making them is the <em>meaning</em> of legislation.  Only those judgments should be left to judges and administrators that further specific legislative intentions in ways that the law allow.</p>\r\n<p>I willingly concede that no one, in any branch, should be compelled to carry out a legislative enactment that violates the natural law.  Even so, it is one thing for judges to refuse to give force to such an enactment, or for administrators to resign rather than to do so -- and another for them to set their own judgments in place of it.</p>\r\n<p>The thing to do with a corrupt legislature is reform it, not wipe it out.  True, we hardly function as a republic any more.  But we have not yet reached the point – at least I don’t think we have reached the point -- where we should abandon all hope of working our way back to one.</p>\r\n<p> </p>\r\n </div></div></div>"
}