{
  "title":"How to Think About “Institutional” Racism",
  "date":"2021-08-15T23:00:00.000000-07:00",
  "author":null,
  "id":"1159 at https://www.undergroundthomist.org",
  "link":"https://www.undergroundthomist.org/how-to-think-about-%E2%80%9Cinstitutional%E2%80%9D-racism",
  "content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"> <p><img alt=\"\" class=\"media-image\" height=\"317\" width=\"480\" src=\"https://undergroundthomist.org/sites/default/files/styles/large/public/Government-building.jpg?itok=z3HH8xLD\"></p>\r\n<p> </p>\r\n<p>Not everyone who uses the term “institutional racism” is a fan of Critical Race Theory.  But almost everyone who uses the term is careless.  The term is highly effective for invective and for virtue signaling, but not very useful for analysis.</p>\r\n<p>What’s “institutional” about institutional racism?  How is it different from ordinary racism?  One way people use the term makes sense; some make some sense; most are misleading.  We can discuss racism, but let us be more precise.</p>\r\n<p><strong><em>Meaning one.</em></strong>  Our institutions are racist because a lot of people in them are racist.</p>\r\n<p>Certainly a lot of people are racist; certainly a lot of people aren’t.  Even if they all were, this way of speaking would commit the fallacy of composition, which is failing to distinguish individual from collective properties.  It’s like saying that the floor is square because a lot of its tiles are square, and so it still doesn’t answer our question:  What’s institutional about institutional racism?</p>\r\n<p><strong><em>Meaning two.</em></strong>  Some institutions are racist because they are <em>all about </em>the mistreatment of certain races.  For example, there might be an institution of enslaving or segregating black people.</p>\r\n<p>Yes, this sort of thing can properly be called institutional racism.  But we no longer have slavery or Jim Crow, and it is difficult to come up with contemporary examples of such institutions.</p>\r\n<p><strong><em>Meaning three</em></strong><em>.</em>  Some institutions are racist because even though they are <em>not</em> all about the mistreatment of certain races, at a given point in time they pursue policies and practices that might be described in that way.  For example, the worst teachers may be routinely assigned to the schools where black people live, or police may routinely stop and search black people just because they are black.</p>\r\n<p>Certainly such policies and practices exist in some places.  However, it’s misleading to say in such cases that the institutions themselves are racist; the problem lies with the policies and practices.  After all, the cure for racism in teaching assignments isn’t to abolish the institution of schooling, but to abolish the practice of sending the worst teachers to disfavored neighborhoods.  And the cure for racism in stops and searches isn’t to abolish the institution of police, but to train police to stop and search only for cause.</p>\r\n<p><strong><em>Meaning four.</em></strong>  Some institutions are racist because they pursue policies and practices that have a different effect on different races even though they <em>don’t </em>target any of them deliberately.</p>\r\n<p>As before, if there is a problem here it lies with the policies and practices, not with the institutions <em>per se.  </em>But <em>is </em>there a problem here?  That depends on what is meant by having a different effect.  Consider two cases.  Although I wouldn’t call a policy that for purely actuarial reasons denied health insurance coverage for sickle cell anemia, it would certainly be racially calloused, and ought to be reformed because it would defeat the social purpose of health insurance.  On the other hand, although black youths are statistically more likely to commit certain kinds of crimes, in this case the problem lies with behavior.  We don’t need to stop arresting people who commit crimes, although we ought to use the same standards for every race.</p>\r\n<p><strong><em>Meaning five.</em></strong>  Our institutions as a whole are racist just because the races are differently represented in the various social classes. </p>\r\n<p>Surely people are not to blame for being born poor, but it doesn’t follow that someone else is to blame for it.  The sheer fact of racial and class differences is not racist in itself.  The question is whether those with higher status use their advantages to <em>prevent </em>others from improving their lot, for example not paying poor black people (or for that matter poor white people) their just wages – and people should not be punished just because they have the same color of skin as certain other people who did bad things long ago.  The underlying principle is giving to each what is due to him, which is the definition of justice.  But shouldn’t we try to help people?  Sure.  Practicing a constant will to the true good of others, which is the definition of charity or love, is another underlying principle.  But make sure you don’t help in ways that really hurt, and make sure you don’t use “helping” as an excuse for injustice.</p>\r\n<h3><strong>See also last Monday’s post:  </strong><a href=\"https://undergroundthomist.org/why-everything-is-racist-now\"><strong>Why Everything Is Racist Now</strong></a></h3>\r\n<p> </p>\r\n </div></div></div>"
}