{
  "title":"RubyMine 2022.3 EAP5: Improved Navigation, New Project Wizard, and Vue Support",
  "date":"2022-10-28T13:43:13.000000Z",
  "author":null,
  "id":"https://blog.jetbrains.com/?post_type=ruby&p=292165",
  "link":"https://blog.jetbrains.com/ruby/2022/10/rubymine-2022-3-eap5/",
  "content":"<p>RubyMine 2022.3 EAP5 is out! </p>\n\n\n\n<p>In this post, you’ll find details about the most notable improvements available in this build. We invite you to <a href=\"https://www.jetbrains.com/ruby/nextversion/?_gl=1*swa5s6*_ga*MTkyMjY3OTIxMy4xNjY0ODc1NjA2*_ga_9J976DJZ68*MTY2NjcyNjI3My4xMTMuMS4xNjY2NzI2NTE3LjUzLjAuMA..&amp;_ga=2.84863961.1982119256.1666557307-1922679213.1664875606&amp;_gac=1.23469384.1665925393.Cj0KCQjw166aBhDEARIsAMEyZh7433tM-8yQ2sF8hAndlDTnIPXEEq3LUt6SCWWIQcz1zziT-3Ka_I0aAt4fEALw_wcB\">download</a> it and share your feedback in our <a href=\"https://youtrack.jetbrains.com/issues/ruby\">issue tracker</a> or in the comments below. </p>\n\n\n\n<h2>Gutter icons for navigating from a model to schema create_table calls</h2>\n\n\n\n<p>We’ve added new <a href=\"https://www.jetbrains.com/help/ruby/settings-gutter-icons.html\">gutter icons</a> for navigating from models to the corresponding <code>create_table</code> calls in the schema.Gutter icons are located on the left-hand side of the editor. </p>\n\n\n\n<figure class=\"wp-container-2 wp-block-gallery-1 wp-block-gallery has-nested-images columns-default is-cropped\">\n<figure class=\"wp-block-image size-large\"><img width=\"1280\" height=\"720\" src=\"https://blog.jetbrains.com/wp-content/uploads/2022/10/2022-10-27_18-39-15-1.gif\" alt=\"\" class=\"wp-image-292283\"></figure>\n</figure>\n\n\n\n<p>To customize which gutter icons are displayed, tick the checkboxes of the desired options on the Gutter Icons page in:</p>\n\n\n\n<ul><li><em>Settings | Editor | General | Gutter Icons</em> for Windows and Linux</li><li><em>RubyMine | Preferences | Editor | General | Gutter Icons</em> for macOS</li></ul>\n\n\n\n<h2>Improved New Project wizard</h2>\n\n\n\n<p>In this new build, we’ve improved the interface for choosing a JavaScript framework in the Rails New Project wizard. In the JavaScript framework field, we replaced the “default” value with the explicit name of the framework that is used by default. We’ve implemented this update both in RubyMine and in the Ruby plugin for IntelliJ IDEA. </p>\n\n\n\n<figure class=\"wp-block-image size-full is-resized\"><img src=\"https://blog.jetbrains.com/wp-content/uploads/2022/10/JS-framework.png\" alt=\"\" class=\"wp-image-292320\" width=\"602\" height=\"499\"></figure>\n\n\n\n<p>In one of the previous builds, we also removed the Skip option and added a checkbox that allows you to enable or disable the selection of a JavaScript framework. To skip the framework selection (meaning that no framework at all is used) you need to uncheck the box next to the JavaScript framework tickbox. </p>\n\n\n\n<h2>Prop destructure syntax support in Vue</h2>\n\n\n\n<p>In the EAP 5 build, RubyMine’s intelligence is applied to prop destructure syntax in Vue.This means the IDE will now provide prop suggestions, type checking, and missing prop detection. For example, props with a value assigned in destructuring now report missing required attributes. RubyMine also makes sure you don’t reference props that are not destructured in template expressions without a <strong>rest.qualifier</strong>, and that default values with both a runtime declaration and type declaration are recognized.</p>\n\n\n\n<figure class=\"wp-block-image size-full is-resized\"><img src=\"https://blog.jetbrains.com/wp-content/uploads/2022/10/Vue.png\" alt=\"\" class=\"wp-image-292332\" width=\"718\" height=\"359\"></figure>\n\n\n\n<h2>Option to bookmark open editor tabs</h2>\n\n\n\n<p>You can now quickly bookmark files from editor tabs. You can bookmark individual files or all files in all open tabs. To bookmark files one by one, you just need to right-click the tab with the file that you want to bookmark and select <em>Bookmarks | Add Bookmark (F11).</em> You can choose to add an anonymous bookmark or use <em>Add Mnemonic Bookmark</em> (<em>Ctrl+F11</em>) to add a bookmark with an identifier. Then press <em>Enter </em>or click the selected letter or number once again to save the bookmark.</p>\n\n\n\n<figure class=\"wp-container-4 wp-block-gallery-3 wp-block-gallery has-nested-images columns-default is-cropped\">\n<figure class=\"wp-block-image size-large\"><img width=\"1280\" height=\"720\" src=\"https://blog.jetbrains.com/wp-content/uploads/2022/10/Bookmarks.gif\" alt=\"\" class=\"wp-image-292350\"></figure>\n</figure>\n\n\n\n<p>If you want to bookmark all open files and add these bookmarks to a new list, just right-click any editor tab and select <em>Bookmarks | Bookmark Open Tabs</em>. The IDE will put all open tabs into a new list of bookmarks, which you can name as you please.</p>\n\n\n\n<h2>Other improvements</h2>\n\n\n\n<h3>Installers for Windows ARM64</h3>\n\n\n\n<p>We’re working to add support for Windows ARM64, and we’re now running tests to make sure RubyMine works smoothly on Windows machines with ARM64 processors. Meanwhile, with the RubyMine 2022.3 EAP 5, we’ve started distributing installers for Windows ARM64.</p>\n\n\n\n<h2>Join the Early Access Program</h2>\n\n\n\n<p>You can download the latest EAP build <a href=\"https://www.jetbrains.com/ruby/nextversion/\">from our website</a> or via the <a href=\"https://www.jetbrains.com/toolbox-app/\">Toolbox app</a>. The full list of improvements in this EAP build is available in the <a href=\"https://youtrack.jetbrains.com/articles/RUBY-A-220364993\">release notes</a>.</p>\n\n\n\n<p>To learn about the newest features as they come out, follow <a href=\"https://twitter.com/rubymine\">RubyMine on Twitter</a>. We post product news and tips several times a week.</p>\n\n\n\n<p>We encourage you to share your thoughts in the comments below and to create and vote for new features in the <a href=\"https://youtrack.jetbrains.com/issues/ruby\">issue tracker</a>.</p>\n\n\n\n<p><em>Happy developing!</em></p>\n\n\n\n<p>The RubyMine team</p>"
}