{
  "title":"Meet RubyMine 2022.3 EAP4, with the New UI and Settings Sync Solution",
  "date":"2022-10-21T06:28:40.000000Z",
  "author":null,
  "id":"https://blog.jetbrains.com/?post_type=ruby&p=289042",
  "link":"https://blog.jetbrains.com/ruby/2022/10/rubymine-2022-3-eap4/",
  "content":"<p>RubyMine 2022.3 EAP4 is here!</p>\n\n\n\n<p>Below, you can see the most notable new functionality. Please <a href=\"https://www.jetbrains.com/ruby/nextversion/\">try it out</a> and share your feedback in the comments or by using our <a href=\"https://youtrack.jetbrains.com/issues/ruby\" rel=\"noreferrer noopener\">issue tracker</a>.</p>\n\n\n\n<h2>New UI available via settings</h2>\n\n\n\n<p>Last year, we announced a <a href=\"https://blog.jetbrains.com/idea/2022/05/take-part-in-the-new-ui-preview-for-your-jetbrains-ide/\">closed preview program</a> for the new UI for JetBrains IDEs. We aimed to introduce the reworked look and feel of IntelliJ-based products to a limited number of users. The preview program helped us accumulate and process a lot of insightful feedback, and now we’re ready to invite everyone to try out the new RubyMine UI.</p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"1918\" height=\"622\" src=\"https://blog.jetbrains.com/wp-content/uploads/2022/10/new-UI_1-2.png\" alt=\"\" class=\"wp-image-289178\"></figure>\n\n\n\n<p>Our goals were to reduce visual complexity, provide easy access to essential features, and progressively disclose complex functionality as needed, resulting in a look-and-feel that we believe is clean, modern, and powerful.</p>\n\n\n\n<p>We invite you to switch to the new UI in <em>Settings</em> | <em>Appearance &amp; Behavior</em> | <em>New UI (Beta)</em>, give it a test drive, and share your thoughts about this huge change with us.</p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"1229\" height=\"711\" src=\"https://blog.jetbrains.com/wp-content/uploads/2022/10/new-UI_2-1.png\" alt=\"\" class=\"wp-image-289189\"></figure>\n\n\n\n<h2>New Settings Sync solution</h2>\n\n\n\n<p>In this EAP build, we’ve presented a completely reworked solution for custom IDE settings synchronization.</p>\n\n\n\n<p>For a long time, two solutions have existed in parallel and featured intersecting functionality – <a href=\"https://www.jetbrains.com/help/ruby/sharing-your-ide-settings.html#IDE_settings_sync\">IDE Settings Sync</a> and <a href=\"https://www.jetbrains.com/help/ruby/settings-tools-settings-repository.html\">Settings Repository</a>, which were bundled with RubyMine as plugins. To avoid the confusion caused by having two similar bundled plugins, we’ve merged their feature sets into a single solution – the new Settings Sync plugin. It covers all of the basic prerequisites for settings synchronization and is now available in RubyMine and other IntelliJ-based IDEs.</p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img width=\"1226\" height=\"695\" src=\"https://blog.jetbrains.com/wp-content/uploads/2022/10/Settings-sync-3.png\" alt=\"\" class=\"wp-image-289200\"></figure>\n\n\n\n<p>Settings synchronization is essential if you use your IntelliJ-based IDEs on multiple computers. After changing a color scheme or a keymap on one machine, you’ll want to have the same setup on your other machines. If you have only one machine, <em>Settings Sync</em> can still be useful as a backup solution, as it will allow you to automatically restore all of your settings when setting up a new machine from scratch.</p>\n\n\n\n<p>The new <em>Settings Sync</em> plugin can sync all shareable IDE settings, bundled plugins, and third-party plugins. By default, the plugins themselves will be synced and installed silently. As for third-party plugin settings, not all of them will be transferred seamlessly, as this depends on the vendors. We are currently discussing the required actions with plugin developers.</p>\n\n\n\n<h3>How does the new Settings Sync plugin work?</h3>\n\n\n\n<p>The settings are stored in the cloud attached to your JetBrains Account. If you use different IntelliJ-based IDEs with the same JetBrains Account, your settings will automatically sync.</p>\n\n\n\n<p>In cases where a conflict arises due to the simultaneous modification of settings on two different computers, the settings will be merged using the most recent configuration.</p>\n\n\n\n<h3>How to enable the new Settings Sync plugin</h3>\n\n\n\n<p>Depending on your current approach to settings synchronization, you may need to enable the new plugin manually:</p>\n\n\n\n<ul><li>You won’t need to take any action, if you are using <em>IDE Settings Sync</em>. Your data will be automatically migrated to the new plugin.</li><li>If you are a <a href=\"https://www.jetbrains.com/help/ruby/settings-tools-settings-repository.html\"><em>Settings Repository</em></a> user, we advise you to continue using your current setup. The migration to a new setting sync solution is still a work in progress. You’ll get an in-IDE notification when the functionality is ready.</li><li>If you weren’t previously using a settings synchronization solution but want to try the new one, you can enable it via <em>Settings | Settings Sync | Enable Settings Sync</em>.</li></ul>\n\n\n\n<h2>Join the Early Access Program</h2>\n\n\n\n<p>You can download the latest EAP build <a href=\"https://www.jetbrains.com/ruby/nextversion/\">from our website</a> or via the <a href=\"https://www.jetbrains.com/toolbox-app/\" rel=\"noreferrer noopener\">Toolbox app</a>. The full list of closed tickets in this EAP build is available in the <a href=\"https://youtrack.jetbrains.com/articles/RUBY-A-220365005/RubyMine-20223-EAP-4-22371262-build-Release-Notes\" rel=\"noreferrer noopener\">release notes</a>.</p>\n\n\n\n<p>To learn about the newest features as they come out, please follow <a href=\"https://twitter.com/rubymine\" rel=\"noreferrer noopener\">RubyMine on Twitter</a>. We post product news and tips several times a week.</p>\n\n\n\n<p>We encourage you to share your thoughts in the comments below and to create and vote for new features in the <a href=\"https://youtrack.jetbrains.com/issues/ruby\" rel=\"noreferrer noopener\">issue tracker</a>.</p>\n\n\n\n<p><em>Happy developing!</em></p>\n\n\n\n<p>The RubyMine team</p>"
}