{
  "title":"Decker 1.0",
  "date":"2022-10-30T17:48:52.000000Z",
  "author":"John Gruber",
  "id":"tag:daringfireball.net,2022:/linked//6.39445",
  "link":"https://beyondloom.com/decker/index.html",
  "content":"\n<p>John Earnest:</p>\n\n<blockquote>\n  <p>Decker builds on the legacy of <a href=\"https://en.wikipedia.org/wiki/HyperCard\">HyperCard</a> and the visual\naesthetic of classic MacOS. It retains the simplicity and ease of\nlearning that HyperCard provided, while adding many subtle and\novert quality-of-life improvements, like deep undo history,\nsupport for scroll wheels and touchscreens, more modern keyboard\nnavigation, and bulk editing operations.</p>\n\n<p>Anyone can use Decker to create E-Zines, organize their notes,\ngive presentations, build adventure games, or even just doodle\nsome 1-bit pixel art. The holistic “ditherpunk” aesthetic is cozy,\na bit nostalgic, and provides fun and distinctive creative\nconstraints. As a prototyping tool, Decker encourages embracing a\nsketchy, imperfect approach. Finished decks can be saved as\nstandalone .html documents which self-execute in a web browser and\ncan be shared anywhere you can host or embed a web page. Decker\nalso runs natively on MacOS, Windows, and Linux.</p>\n</blockquote>\n\n<p>Decker is astonishing. At first glance you might mistake it as shallow, a fun nostalgic gimmick. How serious could something that looks so retro be? But it’s in fact quite deep: Earnest created his own custom scripting language, <a href=\"https://beyondloom.com/decker/lil.html\">Lil</a>, which is very approachable but  includes things like an SQL-like query syntax for tabular data. The whole thing is beautiful and fun and useful and so engaging that I literally had a dream about using it last night. I don’t know what I’m going to make with Decker but I’ll be damned if I’m not going to make <em>something</em>. It’s that inspiring.</p>\n\n<p>Even the names are perfect. “Decks” are to Decker what stacks were to HyperCard. Decks contain cards and cards contain widgets. The <a href=\"https://beyondloom.com/decker/format.html\">file format is plain text</a> and very much human-readable. A deck shared on the web contains the whole runtime to present and run it in a browser, so all you need to do is publish a .html file. <a href=\"https://beyondloom.com/decker/tour.html\">Decker’s Guided Tour</a> is a fine example — both for trying Decker out and for viewing the source. (You’ll want to try it in a desktop browser, or maybe an iPad with a keyboard and trackpad — it’s not meant for phones.)</p>\n\n<p>The native Mac app is just 4 MB. It’s free of charge and open source, but Earnest is accepting voluntary payments on the downloads page. Be generous! And if you make any cool decks let me know.</p>\n\n<div>\n<a title=\"Permanent link to ‘Decker 1.0’\" href=\"https://daringfireball.net/linked/2022/10/30/decker\"> ★ </a>\n</div>\n\n\t"
}