{
  "title":"The Verge Reviews the $140 Amazon Fire TV Cube",
  "date":"2022-10-31T23:13:15.000000Z",
  "author":"John Gruber",
  "id":"tag:daringfireball.net,2022:/linked//6.39452",
  "link":"https://www.theverge.com/23429259/amazon-fire-tv-cube-2022-review",
  "content":"\n<p>Chris Welch writing for The Verge, “A Streaming Box With No Equal”:</p>\n\n<blockquote>\n  <p>Advertising across Fire TV OS remains way more in your face than\nI’d like. When the Cube is left idle and goes into screensaver\nmode, you’ll see promoted movies and TV shows, sure, but there are\nalso ads for Lexus cars. At the top of the homescreen over the\nlast few days, there’s been a banner ad for <em>Call of Duty: Modern\nWarfare II</em>, which doesn’t even seem relevant to the platform\noutside of Twitch streams. And ads are now taking up room in the\nlive channel guide, which is <a href=\"https://www.reddit.com/r/fireTV/comments/yeqqn5/ads_now_inserted_in_ota_recast_and_presumably_all/\">frustrating some Fire TV\nowners</a>. When you’re perusing through the carousels of\ncontent on the homescreen, Amazon’s own selections still get the\nlion’s share of promotion. The latter shouldn’t come as a surprise\non the company’s own hardware, but the dial really needs to be\nturned down on the rest. It cheapens the whole user experience and\nfeels unwarranted on a $140 product. Ads are inevitable on $40\nstreaming sticks; that’s how they’re so affordable in the first\nplace. But Amazon should be able to detect when customers have\npaid a premium for the Fire TV Cube and pull it back.</p>\n</blockquote>\n\n<p>No equal indeed. The Apple TV streaming boxes don’t have any ads at all. They’re way behind. (Maybe I shouldn’t give Apple <a href=\"https://daringfireball.net/2022/10/app_store_ads_gone_wild\">any ideas</a> about putting annoying ads in tvOS.)</p>\n\n<div>\n<a title=\"Permanent link to ‘The Verge Reviews the $140 Amazon Fire TV Cube’\" href=\"https://daringfireball.net/linked/2022/10/31/verge-amazon-fire-tv-cube\"> ★ </a>\n</div>\n\n\t"
}