{
  "title":"Eli Lilly Stock Dipped After a Verified Twitter Imposter Claimed Insulin Would Now Be Free",
  "date":"2022-11-14T20:16:59.000000Z",
  "author":"John Gruber",
  "id":"tag:daringfireball.net,2022:/linked//6.39472",
  "link":"https://www.huffpost.com/entry/eli-lilly-stock-takes-a-dip-after-verified-twitter-imposter-says-insulin-is-free_n_636ebe25e4b02901364207cb",
  "content":"\n<p>Sara Boboltz, reporting for HuffPost:</p>\n\n<blockquote>\n  <p>Eli Lilly’s stock dipped Friday morning after someone paid $8 to verify a Twitter handle resembling that of the pharmaceutical giant and posted: “We are excited to announce insulin is free now.”</p>\n\n<p>Insulin, of course, is not free. In the U.S., one study released this summer found that the high price of the lifesaving drug puts an extreme financial burden on about 14% of the 7 million Americans who need it regularly. […]</p>\n\n<p>The Eli Lilly imposter verified the handle @EliLillyandCo, taking advantage of Twitter’s new rules governing who gets to have a verified account. The company’s real handle is @LillyPad.</p>\n</blockquote>\n\n<p>There are, like, a thousand interesting stories about Twitter under Elon Musk’s ownership, and this is just one. But there are several interesting angles to just this one story:</p>\n\n<ul>\n<li><p>The verified-but-parodic account, “@EliLillyandCo”, had a more serious-looking username than Eli Lilly’s actual account, “@LillyPad”.</p></li>\n<li><p>This prank has done more to bring attention to the shameful state of insulin pricing in the U.S. than anything in decades.</p></li>\n<li><p>The question I think most worth asking about Musk’s thus-far very tumultuous leadership of Twitter is this: What exactly has he been surprised by? Obviously quite a few of his changes, thus far, have angered/upset/offended people. But I don’t think most of that has surprised him. I think one thing that <em>has</em> surprised him is the lowercase-c conservative nature of advertisers. Elon Musk is, quite obviously, a polymath. There aren’t many similarities between PayPal, Tesla, and Space X, other than the fundamental truth that everything in the world (including payments, cars, and rockets) is getting computerized. Either turned into computers or turned into software running on computers somewhere. But none of Musk’s previous endeavors have involved serving advertisers. Reputable high-quality advertisers not only want to avoid controversy and polarization and especially <em>uncertainty</em>, they will flee from it. It doesn’t matter if Twitter today is more popular/used than it was three weeks ago — it is less desirable as a place to spend advertising budgets because it is more uncertain. Twitter (as it stands today and for the foreseeable future) needs advertisers; advertisers do not need Twitter. I don’t think Musk understood that until now.</p></li>\n</ul>\n\n<p>(I’m curious what else you think has surprised Musk about Twitter thus far. Not what you think Musk is wrong about, per se, but what he is already surprised about.)</p>\n\n<div>\n<a title=\"Permanent link to ‘Eli Lilly Stock Dipped After a Verified Twitter Imposter Claimed Insulin Would Now Be Free’\" href=\"https://daringfireball.net/linked/2022/11/14/eli-lilly-twitter\"> ★ </a>\n</div>\n\n\t"
}