{
  "title":"A Bigger iPad Would Just Be a Bigger iPad",
  "date":"2022-10-31T23:43:16.000000Z",
  "author":"John Gruber",
  "id":"tag:daringfireball.net,2022:/linked//6.39441",
  "link":"https://www.theinformation.com/articles/apple-is-working-on-a-16-inch-ipad-further-blurring-line-with-laptops",
  "content":"\n<p>Wayne Ma, reporting for The Information:</p>\n\n<blockquote>\n  <p>Apple is developing its largest iPad yet, a model with a 16-inch\nscreen that it hopes to release in the fourth quarter of next\nyear, according to a person familiar with the project. The device\nwould further blur the line between the iPad and MacBook, bringing\nthe tablet’s screen size in line with that of Apple’s largest\nlaptop, which also features a 16-inch display. Apple’s biggest\niPad currently sports a 12.9-inch screen. [...]</p>\n\n<p>The move would again raise speculation about whether Apple will\none day merge the iPad and MacBook into a single product line or\nmerge the two operating systems given their overlapping features.\nApple executives have said they consider the MacBook and iPad\ndifferent products. MacBooks are designed to work best with\nexternal inputs like keyboards and trackpads, while the iPad works\nbest with touch.</p>\n</blockquote>\n\n<p>A 16-inch iPad Pro would just be a 16-inch iPad Pro. It would neither mean nor suggest anything other than that some iPad users would enjoy and make good use of a larger display. This obsession with “merging” iPads and Macs is nonsense. “Apple executives have said they consider the MacBook and iPad different products” is the dumbest sentence I’ve read in weeks. They <em>are</em> different products. Even adding touchscreen displays to MacBooks — which I doubt will happen more than ever — would not imply a platform “merger” is in the works.</p>\n\n<p>Only someone who has no understanding of one or both of the two platforms could even think a “merger” is possible. Any scenario where Apple unifies both platforms into one OS would be pointlessly destructive — utterly ruining one or the other platform (and most likely ruining both).</p>\n\n<div>\n<a title=\"Permanent link to ‘A Bigger iPad Would Just Be a Bigger iPad’\" href=\"https://daringfireball.net/linked/2022/10/27/sometimes-a-bigger-ipad-is-just-a-cigar\"> ★ </a>\n</div>\n\n\t"
}