{
  "title":"Nilay Patel on Twitter, Content Moderation, and Elon Musk",
  "date":"2022-10-29T16:35:12.000000Z",
  "author":"John Gruber",
  "id":"tag:daringfireball.net,2022:/linked//6.39442",
  "link":"https://www.theverge.com/2022/10/28/23428132/elon-musk-twitter-acquisition-problems-speech-moderation",
  "content":"\n<p>Nilay Patel, “Welcome to Hell, Elon”:</p>\n\n<blockquote>\n  <p>The essential truth of every social network is that the product is content moderation, and everyone hates the people who decide how content moderation works. Content moderation is what Twitter <em>makes</em> — it is the thing that defines the user experience. It’s what YouTube makes, it’s what Instagram makes, it’s what TikTok makes. They all try to incentivize good stuff, disincentivize bad stuff, and delete the really bad stuff. Do you know why YouTube videos are <a href=\"https://www.theverge.com/2019/7/26/8888003/youtube-video-length-contrapoints-lindsay-ellis-shelby-church-ad-revenue\">all eight to 10 minutes long</a>? Because that’s how long a video has to be to <a href=\"https://www.tubefilter.com/2020/07/07/youtube-lowering-minimum-video-length-mid-roll-ads/\">qualify for a second ad slot</a> in the middle. That’s content moderation, baby — YouTube wants a certain kind of video, and it created incentives to get it. That’s the business you’re in now. The longer you fight it or pretend that you can sell something else, the more Twitter will drag you into the deepest possible muck of defending <a href=\"https://www.theverge.com/2022/10/9/23395490/twitter-lock-kanye-west-out-account-following-anti-semitic-post\">indefensible speech</a>. And if you turn on a dime and accept that growth requires aggressive content moderation and pushing back against government speech regulations around the country and world, well, we’ll see how your fans react to that.</p>\n</blockquote>\n\n<p>I don’t disagree with a word of Patel’s column. It’s good and smart and informed (with links) about the various content moderation problems Twitter faces and will continue to face around the world. And again, I can see this acquisition going badly — for Twitter as an institution, for Musk personally, or both. It’s high risk. That’s what makes it captivating. This is a $44 billion personal wager.</p>\n\n<p>But I’m not sure any of us outside Musk’s circle know what he really wants to do content-moderation-wise. Musk personifies the axiom that you should judge someone by their actions, not their words. Musk says he envisions Twitter as a “free speech” haven that would allow even for speech most of us would consider hateful. A lot of people predicting doom for Twitter under Musk’s ownership take him at his word on that. <em>Here come the Nazis</em>, more or less.</p>\n\n<p>But maybe — maybe! — there’s an “<a href=\"https://en.wiktionary.org/wiki/only_Nixon_could_go_to_China\">Only Nixon could go to China</a>” element at play here. To wit: that Twitter can continue moderating content to block genuinely hateful and threatening posts but maintain broad credibility on the right side of the political spectrum because so many people on that side of the fence implicitly trust Musk.</p>\n\n<div>\n<a title=\"Permanent link to ‘Nilay Patel on Twitter, Content Moderation, and Elon Musk’\" href=\"https://daringfireball.net/linked/2022/10/29/nilay-patel-musk-twitter-hell\"> ★ </a>\n</div>\n\n\t"
}