{
  "title":"iOS 16.2 Includes Settings to Make the iPhone 14 Pro Always-on Display Not So ‘On’",
  "date":"2022-11-17T01:16:25.000000Z",
  "author":"John Gruber",
  "id":"tag:daringfireball.net,2022:/linked//6.39476",
  "link":"https://www.inverse.com/gear/how-to-turn-off-iphone-14-pro-always-on-display-wallpaper-notifications",
  "content":"\n<p>Raymond Wong, writing at Inverse:</p>\n\n<blockquote>\n  <p>Apple released the latest iOS 16.2 beta 3 earlier this week, and\nas usual, testers quickly picked it apart. Notably, there are two\nnew toggles within Settings → Display &amp; Brightness → Always On\nDisplay, one for showing your wallpaper, and one for\nnotifications.</p>\n\n<p>Toggle both to not show, and your iPhone 14 Pro’s lock screen will\nturn black instead of dimming your wallpaper; only the date and\ntime will be visible when the always-on display setting is on.\nThis makes the iPhone 14 Pro’s always-on display work just like it\ndoes on pretty much every Android phone’s always-on display. And\nbecause the always-on display will be black when both settings are\nturned off, it should reduce the amount of battery draw because\neach black pixel in the OLED display is technically not turned on.</p>\n</blockquote>\n\n<p>From my iPhone 14 Pro review back in September:</p>\n\n<blockquote>\n  <p>The second super interesting thing about the iPhones 14 Pro is the\nalways-on display. <em>It is really weird.</em> Not weird because it’s a\nbad idea, but weird because battery life has always been, and\nremains, a precious resource to be conserved on smartphones. And,\nuntil now, one of the surest ways to run down your battery has\nbeen to leave your phone in an unattended state while the display\nremains on. When you look over to your side at your desk, where\nyour iPhone rests face up, and the screen is <em>on</em> despite your\nknowing that you haven’t touched it in a while, it feels wrong.\nLike there’s a bug in iOS that’s preventing the screen from going\nto sleep or something. Over and over and over this past week, I’ve\nglanced at this iPhone 14 Pro in the always-on state, and I\nexperienced a micro jolt of panic: <em>Whoa, why is the screen on?\nOh, yeah, always-on...</em>.</p>\n</blockquote>\n\n<p>Two months later and the always-on display <em>still</em> feels weird to me. My day-to-day battery life has been as good or better than with the iPhone 13 Pro, so I don’t think that’s a reason to turn it off. But for me, feeling weird is a reason.</p>\n\n<div>\n<a title=\"Permanent link to ‘iOS 16.2 Includes Settings to Make the iPhone 14 Pro Always-on Display Not So ‘On’’\" href=\"https://daringfireball.net/linked/2022/11/16/wong-always-on-display\"> ★ </a>\n</div>\n\n\t"
}