{
  "title":"Film Composer Carter Burwell, Known as ‘the Third Coen Brother’",
  "date":"2022-11-12T22:59:40.000000Z",
  "author":"John Gruber",
  "id":"tag:daringfireball.net,2022:/linked//6.39470",
  "link":"https://www.newyorker.com/magazine/2022/11/14/the-polymath-film-composer-known-as-the-third-coen-brother",
  "content":"\n<p>Fascinating profile by David Owen of composer Carter Burwell, a name I feel I should have known better beforehand. (I am an enormous fan of his collaborations with the Coen Brothers.)</p>\n\n<blockquote>\n  <p>In a lecture at the Scottish Academy of Music and Drama, in Glasgow, in 2001, Burwell said that he usually urges directors to use as little music as possible, because movies, like life, are most interesting “when you don’t know what’s going on, and you’re uncomfortable about it.” Ron Sadoff, the director and founder of the screen-scoring program at N.Y.U., told me, “Carter doesn’t do what’s called Mickey Mousing, where you try to touch every little element of the film with music. His approach is much more conceptual.” In the score for <em>Fargo</em>, the Coens’ sixth film, Burwell used a Hardanger fiddle, a Norwegian instrument that has two sets of strings, one of which isn’t bowed but resonates with the other. (That choice was inspired by the Scandinavian names of some of the characters.) His goal was to help make a darkly improbable comedy seem as straightforward as a news bulletin, an effect established with the title sequence, in which a car is being towed across a white-out winter landscape, accompanied by a fiddle-and-percussion passage that swells into something like a funeral march. Ethan Coen told me, “People don’t realize how much of what they’re getting from a movie is from the score, delivered by the composer. It’s powerful, but, for the life of you, you can’t say what it means.”</p>\n</blockquote>\n\n<p>“To help make a darkly improbable comedy seem as straightforward as a news bulletin” — what a wonderful description of <em>Fargo</em>, but what a seemingly impossible task to pull off.</p>\n\n<div>\n<a title=\"Permanent link to ‘Film Composer Carter Burwell, Known as ‘the Third Coen Brother’’\" href=\"https://daringfireball.net/linked/2022/11/12/carter-burwell\"> ★ </a>\n</div>\n\n\t"
}