{
  "title":"Uber Tests Push Notification Ads",
  "date":"2022-11-01T18:59:09.000000Z",
  "author":"John Gruber",
  "id":"tag:daringfireball.net,2022:/linked//6.39454",
  "link":"https://techcrunch.com/2022/10/31/uber-tests-push-notifications-a-feature-literally-no-one-wants/",
  "content":"\n<p>Rebecca Bellan, reporting for TechCrunch:</p>\n\n<blockquote>\n  <p>Uber recently launched its <a href=\"https://techcrunch.com/2022/10/19/dont-worry-uber-will-find-a-way-to-advertise-to-you/\">new advertising division</a> and\nin-app ads. Apparently, those ads aren’t staying within the app.</p>\n\n<p>Instead, ads from other companies are being sent out as push\nnotifications, much to the chagrin of some Uber users. Over the\nweekend, people turned to Twitter to complain about the\nnotifications, sharing <a href=\"https://twitter.com/matsonj/status/1586857522950209536\">screenshots of ads</a>, including one\nparticularly popular one from <a href=\"https://twitter.com/MGTalksRetail/status/1586424119154728961\">Peloton</a> that Uber had sent\nout. One of the primary complaints: notifications are being sent\nout when users aren’t engaging with the app.</p>\n</blockquote>\n\n<p><a href=\"https://daringfireball.net/thetalkshow/2022/09/20/ep-357\">A few weeks ago on my podcast</a>, Nilay Patel and I speculated about Uber putting ads in the Dynamic Island after you’ve hailed a ride. This isn’t that, but it exemplifies why we singled out Uber as a potential abuser.</p>\n\n<p>I wish I had more confidence that Apple will enforce the clear <a href=\"https://developer.apple.com/app-store/review/guidelines/\">App Store guidelines that forbid this</a>:</p>\n\n<blockquote>\n  <p>4.5.4 — Push Notifications must not be required for the app to\n    function, and should not be used to send sensitive personal or\n    confidential information. Push Notifications should not be\n    used for promotions or direct marketing purposes unless\n    customers have explicitly opted in to receive them via consent\n    language displayed in your app’s UI, and you provide a method\n    in your app for a user to opt out from receiving such\n    messages. Abuse of these services may result in revocation of\n    your privileges.</p>\n</blockquote>\n\n<div>\n<a title=\"Permanent link to ‘Uber Tests Push Notification Ads’\" href=\"https://daringfireball.net/linked/2022/11/01/uber-push-notification-ads\"> ★ </a>\n</div>\n\n\t"
}