{
  "title":"★ Everything",
  "date":"2022-10-18T01:16:36.000000Z",
  "author":"John Gruber",
  "id":"tag:daringfireball.net,2022://1.39387",
  "link":"https://daringfireball.net/2022/10/everything",
  "content":"\n<p><a href=\"https://twitter.com/elonmusk/status/1577428272056389633\">Elon Musk, in a tweet</a> (of course):</p>\n\n<blockquote>\n  <p>Buying Twitter is an accelerant to creating X, the everything app.</p>\n</blockquote>\n\n<p><a href=\"https://twitter.com/karaswisher/status/1577497268118519809\">Kara Swisher explains</a>:</p>\n\n<blockquote>\n  <p>He is essentially talking about a “super app,” which is common in\nChina but not the U.S. and might include payments, subscriptions,\nentertainment etc. It’s the right idea but hard to pull off. Also,\nX is the name of his first significant company back in the day.</p>\n</blockquote>\n\n<p>I don’t think I’d say the <em>idea</em> is common in China — just WeChat, specifically. And while I agree it’s “hard to pull off”, I vehemently disagree that it’s “the right idea”.</p>\n\n<p><a href=\"https://stratechery.com/company/tencent/wechat/\">Ben Thompson has written extensively</a> about WeChat’s impossible-to-overstate dominant role in China. In China, WeChat is <em>the</em> way to chat, <em>the</em> way to share photos, <em>the</em> way to pay for things with your phone, and a lot more. Back in 2015, Connie Chan of Andreessen Horowitz wrote a great piece explaining WeChat’s expansive domain, and if anything, WeChat’s dominance inside China has only grown since then. Her headline says it all: “<a href=\"https://a16z.com/2015/08/06/wechat-china-mobile-first/\">When One App Rules Them All: The Case of WeChat and Mobile in China</a>”.</p>\n\n<p>It’s no coincidence at all that WeChat is the only “everything app” anyone can cite, and it comes from China, an authoritarian regime. In practice, the concept really only makes sense there. It doesn’t benefit users that WeChat dominates all aspects of digital life — it benefits the authoritarian Chinese Communist Party. (And investors in Tencent, WeChat’s Chinese-government-controlled parent company.)</p>\n\n<p>If you’re just spitballing wild ideas, it’s easy to get enthralled by such an idea. But give it any serious thought whatsoever and it starts falling apart. What you’re talking about is putting an entire OS inside an app. Not a computer science operating system but a user-facing <em>system</em> for “everything”. That’s certainly possible — WeChat proves it — but history shows that sprawling monolithic apps are never a good experience in practice. It is really hard to present a coherent, consistent, intuitive, explorable user interface for features as disparate as chat, news, entertainment, and payments. But we have such interfaces: OSes.</p>\n\n<p>And as much as we all have pet peeves about the design cohesiveness of our current OSes, who looks at <em>Twitter</em> of all things and says “<em>I’d like to see</em> this <em>expand in scope such that a lot more, if not all, of my digital life can be here</em>”? Twitter, today, is already more confusing and less cohesive than the iOS or Android systems themselves. Both iOS and Android are actually both <em>really</em> good at offering interfaces for, well, everything. What Twitter needs is to do <em>less</em>, certainly not <em>more</em>. Would you buy a phone that only ran Twitter, even if Twitter added a lot more features? That’s the sort of vague thinking that led to <a href=\"https://www.cnet.com/tech/mobile/heres-why-the-facebook-phone-flopped/\">Facebook</a> and <a href=\"https://www.theverge.com/2014/7/22/5923697/amazon-fire-phone-review\">Amazon</a> creating their own phones in the early years of the mobile revolution. Facebook and Amazon are both very effective, technically capable companies, and they failed, badly, at this a decade ago. Twitter is ineffective and <a href=\"https://daringfireball.net/linked/2022/08/24/twitter-mudge\">technically suspect</a>.</p>\n\n<p>I hope we’re not done creating major new software platforms for consumer devices. But as time marches on, it grows ever more unlikely we’ll ever see a new rival to MacOS and Windows for desktops, or to iOS and Android for phones. The next frontiers, the next opportunities for a new OS, will almost certainly come with new hardware paradigms. Windows’s monopoly over all of computing was broken up not by an upstart PC operating system, but by an upstart hardware concept: the mobile phone as personal computer.</p>\n\n<p>I genuinely wonder, though, whether we’re not still in the very early years — the early decades, perhaps — of phones as the dominant, if not only, computing devices in our lives. <a href=\"https://www.huffpost.com/entry/radio-shack-ad_b_4612973\">There’s a wonderful piece Steve Cichon wrote for the Huffington Post back in 2014</a>, after paging through some old newspapers from 1991:</p>\n\n<blockquote>\n  <p>The back page of the front section on Saturday, February 16, 1991\nwas four-fifths covered with a Radio Shack ad. There are 15\nelectronic gizmo type items on this page, being sold from\nAmerica’s Technology Store. 13 of the 15 you now always have in\nyour pocket.</p>\n</blockquote>\n\n<p>Smartphones replaced everything Radio Shack sold 30 years ago: still cameras, video cameras, music players, radios, alarm clocks, calculators, tape recorders, and, yes, cellular dumbphones. (One of the advertised items Cichon cites as <em>not</em> being replaced by a 2014 smartphone was a radar detector — but today’s major mapping apps for turn-by-turn directions all warn about speed traps now.)</p>\n\n<p>What we need isn’t an everything app. It’s an everything <em>device</em>, with small focused apps for features. You want to do more? Download — or better yet, create — a new app. And you’ve already got one in your pocket — or in your hand, as you read this very sentence on it — right now.</p>\n\n\n\n    "
}