{
  "title":"★ The 2022 iPad (and a Wee Note About the 2022 iPad Pros)",
  "date":"2022-10-26T19:09:35.000000Z",
  "author":"John Gruber",
  "id":"tag:daringfireball.net,2022://1.39438",
  "link":"https://daringfireball.net/2022/10/the_2022_ipad",
  "content":"\n<p>If you’ve used an iPad Air from the last two years — either the <a href=\"https://daringfireball.net/2020/10/the_2020_ipad_air\">4th-gen Air</a> from October 2020 or the <a href=\"https://daringfireball.net/2022/03/the_2022_ipad_air\">5th-gen model</a> introduced earlier this year — the new 10th-generation iPad (no adjective) is remarkably familiar. Same size (well, <em>almost</em> — see below), and the same basic design: no home button, round display corners, all-screen, no Face ID, and Touch ID on the side button.</p>\n\n<p>They’re even offered in the same two storage tiers: 64 and 256 GB. I’ll throw in the brand-new 11-inch iPad Pro and the 9th-gen iPad to boot for a price comparison of all the 11-ish-inch iPads in the lineup today:</p>\n\n\n\n<table>\n<thead>\n<tr>\n  <th align=\"center\">Storage</th>\n  <th align=\"center\">2021 iPad<br>(9th-gen)</th>\n  <th align=\"center\">2022 iPad<br>(10th-gen)</th>\n  <th align=\"center\">2022<br>iPad Air</th>\n  <th align=\"center\">2022<br>iPad Pro 11″</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n  <td align=\"center\">64 GB</td>\n  <td align=\"center\">$330</td>\n  <td align=\"center\">$450</td>\n  <td align=\"center\">$600</td>\n  <td align=\"center\">—</td>\n</tr>\n<tr>\n  <td align=\"center\">128 GB</td>\n  <td align=\"center\">—</td>\n  <td align=\"center\">—</td>\n  <td align=\"center\">—</td>\n  <td align=\"center\">$800</td>\n</tr>\n<tr>\n  <td align=\"center\">256 GB</td>\n  <td align=\"center\">$480</td>\n  <td align=\"center\">$600</td>\n  <td align=\"center\">$750</td>\n  <td align=\"center\">$900</td>\n</tr>\n<tr>\n  <td align=\"center\">512 GB</td>\n  <td align=\"center\">—</td>\n  <td align=\"center\">—</td>\n  <td align=\"center\">—</td>\n  <td align=\"center\">$1100</td>\n</tr>\n<tr>\n  <td align=\"center\">1 TB</td>\n  <td align=\"center\">—</td>\n  <td align=\"center\">—</td>\n  <td align=\"center\">—</td>\n  <td align=\"center\">$1500</td>\n</tr>\n<tr>\n  <td align=\"center\">2 TB</td>\n  <td align=\"center\">—</td>\n  <td align=\"center\">—</td>\n  <td align=\"center\">—</td>\n  <td align=\"center\">$1900</td>\n</tr>\n<tr>\n  <td align=\"center\"><em>Cellular</em></td>\n  <td align=\"center\"><em>+130</em></td>\n  <td align=\"center\"><em>+150</em></td>\n  <td align=\"center\"><em>+150</em></td>\n  <td align=\"center\"><em>+200</em></td>\n</tr>\n</tbody>\n</table>\n\n<p>A lot of people are now complaining that the iPad lineup is “confusing”. I disagree. There are specific <em>aspects</em> of the iPads in the lineup that are confusing, or at least disappointing. These aspects are mostly related to peripherals — which Pencils and which keyboard covers work with which iPads — and <a href=\"https://daringfireball.net/2022/10/the_ipad_lineup_is_like_growing_out_its_bangs_or_something\">I wrote about these issues last week</a>. But in terms of the fundamental question facing would-be buyers — “Which iPad should I get?” — I don’t think this lineup is confusing. I’d argue, in fact, that it’s less confusing, because the lineup is more complete. Prior to last week, there was a significant gap between the 9th-generation iPad (which remains in the lineup, unchanged in price) and the iPad Air. The 10th-gen iPad fills that gap.</p>\n\n<p>With the exception of the $120 difference between the 9th- and 10th-gen iPads, there’s now a $150 difference in price between each 11-inch-ish iPad model. So what are the differences between the 10th-gen iPad and the 2022 iPad Air? Here’s what stands out to me <a href=\"https://www.apple.com/ipad/compare/?modelList=ipad-10th-gen,ipad-air-5th-gen,ipad-9th-gen\">looking at the differences using Apple’s handy Compare tool</a>:</p>\n\n<ul>\n<li><p>The Air’s display is fully-laminated and has an anti-reflective coating, and offers a P3 wide color gamut. The iPad 10 display is not laminated and only covers the sRGB color gamut. The iPad 10’s display looks good, but side-by-side, the iPad Air’s looks better. (Lamination puts the actual display closer to the surface of the glass — more like pixels <em>on</em> glass than pixels <em>under</em> glass.)</p></li>\n<li><p>The iPad Air has the M1 chip with 8 GB of RAM; the iPad 10 uses the A14 chip that debuted with the iPhones 12 in 2020 and has only 4 GB of RAM. One reason to prefer the Air’s M1 chip: the iPad Air supports Stage Manager in iPadOS 16; the iPad 10 does not. There are all sorts of other silicon advantages to the M1, of course, including a “Media Engine” for hardware accelerated video encoding and decoding. But anyone who is concerned about hardware-accelerated video encoding and decoding is not shopping for the consumer-priced iPad 10. Stage Manager, to me, is the difference that might matter most to non-pro iPad users on the fence regarding which model to buy.</p></li>\n<li><p>The iPad Air uses the superior Apple Pencil 2; the iPad 10 — seemingly inexplicably, but in fact for understandable but esoteric reasons (<a href=\"#pencils\">see below</a>) — pairs only with the Pencil 1, for which it requires a new $9 USB-C-to-Lightning adapter.</p></li>\n<li><p>Apple makes one keyboard cover for the new iPad 10: the new $250 two-piece kickstand-propped Magic Keyboard Folio. Apple makes two keyboard covers for the iPad Air (and the same two keyboards also work with the iPad Pro): the $300 turn-your-iPad-into-a-laptop Magic Keyboard, and the no-trackpad <a href=\"https://daringfireball.net/linked/2022/10/22/in-praise-of-smart-keyboard-folio\">thinner and lighter</a> $180 Smart Keyboard Folio. The new Magic Keyboard Folio only works with the new iPad 10, and the Magic Keyboard and Smart Keyboard Folio only work with the iPads Air and Pro.</p></li>\n</ul>\n\n<p>There are other subtle differences — the Air supports more Wi-Fi 6 bands, but the iPad 10 supports Bluetooth 5.2 while the Air only 5.0. But the above list is really it for practical differences. Do you think any of those bullet points are worth an extra $150? Then buy the iPad Air. If not, congrats, you can save $150 (and perhaps put it toward the pricey Magic Keyboard Folio).</p>\n\n<h2>Pencil It In <span id=\"pencils\"></span></h2>\n\n<p>I’ve been testing the iPad 10 since the end of last week.<sup id=\"fnr1-2022-10-26\"><a href=\"#fn1-2022-10-26\">1</a></sup> <sup id=\"fnr2-2022-10-26\"><a href=\"#fn2-2022-10-26\">2</a></sup> It occurred to me soon after setting it up that I haven’t used a Pencil 1 in years. Putting aside the issue of the USB-C-to-Lightning adapter, it’s striking how much less I like the original Pencil compared to the Pencil 2. When the Pencil 2 debuted in 2018 alongside that year’s iPad Pros, <a href=\"https://daringfireball.net/2018/11/the_2018_ipad_pros#pencil-2\">I wrote</a>:</p>\n\n<blockquote>\n  <p>The new Apple Pencil is one of the best “2.0” products I’ve ever\nseen. The original Apple Pencil is a terrific product, but the new\none nears perfection for the concept. New and improved:</p>\n\n<ul>\n<li><p>Matte finish. I never really thought to complain about the\nglossy texture of the original Pencil, but the moment I laid\nhands on the new one I realized matte is better for this\nproduct.</p></li>\n<li><p>Magnetic charging and pairing. When rumors surfaced that the new\niPad Pros were moving from Lightning to USB-C, there was a lot\nof speculation that Apple would need to make a new Pencil with\nUSB-C. This is so much better. As a nice touch, when you first\nconnect the Pencil to your iPad, iOS <a href=\"https://daringfireball.net/misc/2018/11/apple-pencil.jpeg\">shows you a Pencil on\nscreen and it’s the <em>exact</em> size of the actual\nPencil</a>. It’s adorable. With the original Pencil,\nApple didn’t provide a good answer for where you were supposed\nto keep it when it wasn’t in your hand. The magnetic connection\nanswers that. It’s strong enough that I wouldn’t hesitate to\nkeep the Pencil connected magnetically when putting the iPad in\na backpack.</p></li>\n<li><p>No cap, no dongle. It took me almost two years, but last month I\nfinally lost the cap to my original Pencil on a train. The new\nPencil has no pieces to lose.</p></li>\n<li><p>Flat side. The old Pencil was weighted to keep it from rolling,\nbut a flat side works better. There’s a reason why most pens and\npencil either have clips or at least one flat side.</p></li>\n<li><p>Optional engraving. I wonder how much of this is a “<em>Why not?</em>”\nthing and how much is fueled by the real-world scenario of\ncoworkers or family members losing track of whose Pencil is\nwhose.</p></li>\n<li><p>Double-tap. Seems like a such a small thing, but it really does\nmake accessing the eraser easier.</p></li>\n</ul>\n\n<p>The new Apple Pencil is so good I have no complaints and can only\nthink of one suggestion for the future: it’d be nice if there were\nhaptic feedback when you double-tap.</p>\n</blockquote>\n\n<p>Four years later, that entire passage holds up. Now, though, I like the Pencil 1 <em>even less</em>. I don’t like the glossy/slippery surface material, I don’t like how it rolls around on a tabletop, and I find the cap downright silly. If the original Pencil had to have an integrated Lightning plug, it should have been retractible instead of permanently protruding and thus requiring a cap. Also, I’d forgotten that double-tapping (which, by default, switches between pen and eraser while drawing) was a new feature for Pencil 2. I spent a few minutes thinking the Pencil 1 Apple provided me with the iPad for testing was broken because double-tapping didn’t work.</p>\n\n<p>As for the new adapter, once you’ve used it to pair a Pencil with your iPad 10, you can set it aside for occasionally charging the Pencil when needed. And if you misplace it, or leave it at home and find yourself needing to charge the Pencil 1 without it, you can in fact <em>charge</em> a Pencil 1 by plugging it into any iPhone. It of course doesn’t work as a stylus with an iPhone, and doesn’t even trigger an “Accessory Not Supported” alert (which is what you get if you try pairing a Pencil 1 with an iPad Pro or iPad Air using the USB-C adapter), but it does charge. If I owned an iPad 10 and Pencil 1, I’d probably just throw the Pencil’s cap away and keep the adapter attached to the Pencil. It even keeps the Pencil from rolling while attached.</p>\n\n<p>If I didn’t already own a Pencil 1, though, I’d buy a <a href=\"https://www.apple.com/shop/product/HQ6Q2VC/A/logitech-crayon-for-ipad\">Logitech Crayon</a> instead. Objective advantages of the Crayon:</p>\n\n<ul>\n<li>Price ($70 vs. $100).</li>\n<li>Logitech’s new 2nd-gen Crayon charges by USB-C. It’s a female port, so you can simply charge it with any USB-C cable.</li>\n<li>No pairing. I’m not sure how it works, but with Logitech’s Crayons, there’s no need to pair them with individual iPads. There’s a simple on/off switch on the barrel, and when on, it just works with any iPad from 2018 onward.</li>\n<li>No cap or dongle to lose.</li>\n</ul>\n\n<p>Objective disadvantage of the Crayon:</p>\n\n<ul>\n<li>Unlike Apple’s Pencils, Logitech’s Crayon is not pressure sensitive. It does detect the angle of the stroke, but not pressure. If you’re an illustrator, that’s probably a dealbreaker. If — like me — you just use a stylus on your iPad to jot notes, make highlights, and make artistically challenged napkin sketches, you might not even notice or care about the lack of pressure sensitivity.</li>\n</ul>\n\n<p>Subjective differences between the Crayon and Pencil 1:</p>\n\n<ul>\n<li>Feel. Logitech’s Crayons are flat, like a carpenter’s pencil. I don’t mind that at all. They also have a matte finish that I much prefer to the slick glossy finish of the Pencil 1.</li>\n<li>Because the Crayons don’t pair with your iPad, you can’t track the battery life of the Crayon in iPadOS. With an Apple Pencil, the Pencil’s battery life shows up in Settings → Apple Pencil and in the Battery widget. But the Crayon has three LEDs right on its barrel that show its battery life, which I consider as good or better than observing battery life through iPadOS for Apple Pencils.</li>\n<li>The Crayons have an on/off switch. Apple Pencils manage their power state automatically. This is not a big deal to me at all — and leaving the Crayon switched on, but unused, for an extended period doesn’t seem to drain the battery quickly.</li>\n</ul>\n\n<p>Unless you need pressure sensitivity or dislike the feel of a carpenter’s pencil in your hand, Logitech’s new 2nd-gen Crayon is a clear winner compared to Apple’s Pencil 1. Even Logitech’s old 1st-gen Crayon is a better option — if I have to charge via Lightning, I’d rather my stylus have a simple female port and not require an adapter.</p>\n\n<h2>Magic Keyboard Folio</h2>\n\n<p>Let’s just get this out of the way: I’m not a kickstand guy. I much prefer the cantilevered hinge of the Magic Keyboard, with its laptop-style footprint and the ability to just pick up the iPad while attached to the keyboard and not have the keyboard half flop around. The two-piece design makes for twice as much work to attach and detach.</p>\n\n<p>But I can see why some people dig a keyboard design like this. Attached to the kickstand back but detached from the keyboard, you have a nice stand for watching movies or just reading. While both pieces are attached, if you fold the keyboard behind the iPad, it somehow detects this and ignores key presses. That’s really clever. You can also attach the keyboard half “backwards” and key presses will always be ignored. </p>\n\n<p>One disappointment is that the keyboard is not backlit. Apple’s Magic Keyboard has backlighting. So too does <a href=\"https://www.logitech.com/en-us/products/ipad-keyboards/combo-touch.html\">Logitech’s $160 Combo Touch</a>, which is a fundamentally similar design. The key difference between the Combo Touch and Magic Keyboard Folio is how the kickstand back attaches — with the Combo Touch, it’s a case you snap the iPad into; the Magic Keyboard Folio back attaches magnetically. In addition to my general dislike for kickstands, I dislike that aspect of the Combo Touch — it’s clearly designed with the idea that you’ll keep your iPad in the case even while not attached to the keyboard. When I detach an iPad from a keyboard, I just want to hold it naked. (The iPad, that is.)</p>\n\n<p>The keyboard itself feels great — with keys that feel identical or nearly so to those of the Magic Keyboard, and the same goes for the trackpad. My biggest gripe is that the key layout mimics a baffling design decision from the 11-inch Magic Keyboard and Smart Keyboard Folio: the left bracket key is full-width, but the right bracket key is half-width.</p>\n\n<p><a href=\"https://daringfireball.net/misc/2022/10/ipad-magic-keyboard-folio-keys.jpeg class=\">\n  <img src=\"https://daringfireball.net/misc/2022/10/ipad-magic-keyboard-folio-keys.jpeg\" alt=\"A close up of the right side of the Magic Keyboard Folio, centered on the bracket keys.\"></a></p>\n\n<p>These keyboards are much narrower than MacBook keyboards or the almost-MacBook-width 12.9-inch Magic Keyboard. Widths, by my ruler:</p>\n\n<ul>\n<li>MacBooks: 273 mm</li>\n<li>12.9″ Magic Keyboard: 268 mm</li>\n<li>11″ Magic Keyboard and Magic Keyboard Folio: 236 mm</li>\n</ul>\n\n<p>32 mm is about 1.25 inches. That’s quite a bit of width to reduce. All the keys are smaller than on a standard-sized keyboard. Measuring from the left edge of the A key to the right edge of the semicolon key (the home row):</p>\n\n<ul>\n<li>MacBooks and 12.9″ Magic Keyboard: 187 mm</li>\n<li>11″ Magic Keyboard and Magic Keyboard Folio: 177 mm</li>\n</ul>\n\n<p>Even with smaller standard keys, though, these keyboards need to make additional concessions, with some punctuation and modifier keys reduced to partial widths. Apple made good decisions on these key cap widths, with the glaring exception of the bracket keys. Clearly these two keys are siblings or peers, and ought to be the same width. That there is not room to make both of them full-width is fine. But rather than make one full-width and the other half, clearly they should both be three-quarters width, like the Tab key or right Option key. Or just make them both half-width. Anything so long as they’re the same size. It makes no more sense for the left and right bracket keys to be different sizes than it would for the left and right arrow keys. Why Apple chose to do this with the 11-inch Magic Keyboard layout back in 2020 is beyond me; why they’re sticking with it is even more baffling.<sup id=\"fnr3-2022-10-26\"><a href=\"#fn3-2022-10-26\">3</a></sup></p>\n\n<p>All of Apple’s iPad keyboard covers are somewhat expensive. The Smart Keyboard Folio for the iPad Air and 11-inch iPad Pro costs $180; the Magic Keyboard for the same two iPads costs $300. But given that the $250 Magic Keyboard Folio pairs only with the lower-priced iPad 10, it feels particularly expensive. It’s more than half the price of the $450 64 GB iPad 10, and paired with the $600 256 GB iPad 10, the combo costs a not-so-low-priced $850. And for $250 it feels wrong that it doesn’t offer backlighting. I can see omitting backlighting if it were, say, $150. But $250 is undeniably a premium price for a keyboard and trackpad.</p>\n\n<p>Weight-wise, the new Magic Keyboard Folio is effectively a wash compared with the Magic Keyboard for the iPad Pro and Air. The Magic Keyboard Folio weighs 589 grams; the Magic Keyboard 598 grams. (Roughly 1.3 pounds.)</p>\n\n<p>It’s a bit disappointing that the Magic Keyboard Folio is only available in white. I’d think Apple would at least offer white and black, like it does with the Magic Keyboard. (But the Smart Keyboard Folio is only available in one color, black.)</p>\n\n<p>As for why the new Magic Keyboard Folio <em>only</em> pairs with the iPad 10, and why the iPad 10 doesn’t pair with either the Magic Keyboard or Smart Keyboard Folio, if you look at the <a href=\"https://www.apple.com/ipad/compare/?modelList=ipad-10th-gen,ipad-air-5th-gen,ipad-9th-gen\">specs</a>, you’ll notice that the iPad 10 is <em>not</em> the same size as the iPad Air. It’s exactly 1 mm larger in all three dimensions: height, width, and most noticeably, depth. 1 mm is not a lot, but it’s enough to spoil any chance at case/cover compatibility, at least for a precision-fit-minded company like Apple.</p>\n\n<h2>Miscellaneous</h2>\n\n<ul>\n<li><p>You can’t use a Pencil while charging it. This is true whether the Pencil is charging from the iPad itself or from a wall charger. For me this is merely a curiosity — it only takes 10-20 minutes to fully charge a fully depleted Pencil, and it only takes a few seconds to give it a charge to last 15 minutes. But it’s also just a curiosity to me that Apple’s Magic Mouse is designed to be unusable while charging, and people complain about that endlessly.</p></li>\n<li><p>The very best new design element of the iPad 10 is the placement of the front-facing camera along the long “landscape” side, which puts it top center when propped laptop-style with a keyboard. I’m so used to my iPad Pro’s down-and-to-left camera placement in landscape that using this iPad with the camera in the “correct” location takes some getting used to. But this is clearly where all future iPad front-facing cameras should go (with the possible exception of the Mini).</p></li>\n<li><p>Speaking of that camera placement, last week <a href=\"https://daringfireball.net/2022/10/the_ipad_lineup_is_like_growing_out_its_bangs_or_something#fn1-2022-10-21\">I speculated in a footnote</a> that it might be difficult for Apple to move the front camera to the landscape side for the iPads Pro and iPad Air:</p>\n\n<blockquote>\n  <p>Here’s a spitball: Maybe my front-facing-camera-placement and all-iPads-should-support-Pencil-2 gripes are in conflict. The long side where the new iPad has the front-facing camera is the same long side where the iPad Pros, iPad Air, and iPad Mini have the magnetic attachment point for the Pencil 2. Maybe they both can’t fit in the middle of the same side?</p>\n</blockquote>\n\n<p>A little birdie confirmed to me that this is in fact exactly the case. The internal mechanism for magnetically attaching, charging, and pairing Pencil 2 is both expensive and somewhat large. And cameras are surprisingly large internally once you count the flex connectors and everything else. You can actually see this for yourself by looking at <a href=\"https://www.ifixit.com/Teardown/iPad+Air+4+Teardown/141032\">a teardown of a Pencil-2-compatible iPad</a>. It’s going to require significant new engineering to make future iPads that support Pencil 2 with the front camera on the landscape side. My guess — and this is truly a guess, with zero hints from any sources — is that Apple will swap the positions of the Pencil 2 connector and the front camera. But on current iPads Pro and Air, only the 12.9-inch Pro has room for a Pencil 2 on that side. On the 11-inch Pro and the Air, the side button gets in the way. Also: attaching a Pencil on that side, with the current iPad Pro and Air designs, might obstruct the speakers. Fun time to be an iPad hardware designer.</p></li>\n<li><p>The Apple Pencil 1 has always shipped with <a href=\"https://www.idownloadblog.com/2015/11/20/apple-pencil-extra-tip-usb-charging-adapter/\">a small adapter with female Lightning ports on both sides</a>, to allow you to charge the Pencil by connecting it to a Lightning cable. If you use that adapter and a USB-C Lighting cable to connect the Pencil to the iPad 10, it charges, but it doesn’t pair. The <em>only</em> way to pair a Pencil with the iPad 10 is using the new USB-C adapter.</p></li>\n</ul>\n\n<h2>Conclusion</h2>\n\n<p>The new 10th-generation iPad is a solid and welcome addition. It looks good, feels good, comes in a selection of fun colors (Apple sent me yellow), and brings the just-plain-no-adjective iPad to the modern all-screen era. It’s a shame it only supports the new Magic Keyboard Folio and not also the Magic Keyboard and Smart Keyboard Folio, and a bit frustrating that it pairs only with the first-gen Apple Pencil. But it’s an outstanding iPad for anyone looking to spend less than the price of an iPad Air or Pro, and feels designed for the future.</p>\n\n<div class=\"footnotes\">\n<hr>\n<ol>\n\n<li id=\"fn1-2022-10-26\">\n<p>Apple sent me a new 12.9-inch iPad Pro to test too, but my review of that model fits in this footnote: the M2 chip is about 15 percent faster than the previous version’s M1, and the new exclusive-to-the-2022-iPads-Pro hover effect for Apple Pencil is fun and cool and I think will prove indispensable to artists who draw on iPads.</p>\n<p>Why are the new iPad Pros mere speed bump updates, rather than more significant ones? Perhaps this was the plan all along — all-new hardware designs take years to develop and produce. But these new 2022 M2 iPad Pros are based on a hardware design from 2018, so the physical dimensions are unchanged in four years. So I sort of suspect that this might be a downwind effect of COVID — work from home, greatly reduced travel between California and China, and the global supply chain congestion. I.e. that if not for COVID and all the chaos that ensued, we’d have been due for a new iPad Pro design in 2022, but instead, it’s been postponed. But Apple very much wants to keep the iPad Pros up to date with M-series chips, so, this year, it’s just a speed bump. That’s just purely conjecture on my part though. <a href=\"#fnr1-2022-10-26\" class=\"footnoteBackLink\" title=\"Jump back to footnote 1 in the text.\">↩︎</a></p>\n</li>\n\n<li id=\"fn2-2022-10-26\">\n<p>As is my wont, I wrote the entirety of the first draft of this review on the iPad itself, using the Magic Keyboard Folio. And as I always find, writing on an iPad is a great way to focus my attention on just one piece of long-form writing. It’s obvious why so many authors <a href=\"https://www.instagram.com/p/Cj_tRjzLvA4/\">swear by them</a>. But — for me, with my Mac-ingrained habits and expertise — it’s a lousy, unproductive way to do everything else I typically do on a workday: writing shorter Linked List posts, reading and dealing with dozens of Safari tabs, looking at Twitter, reading and sending email and iMessages, etc. Going back to my Mac to catch up on everything else <em>other</em> than writing this article feels as liberating as taking off a pair of mittens while attempting to assemble a Lego kit. And even for the writing of this article, I’ve seldom gone more than a few minutes between missing some sort of utility or custom tool/script I rely upon on MacOS and which can’t be replicated on iPadOS. Using any iPad for my work feels like riding a bicycle uphill; using a Mac feels like riding one downhill. The best it gets for me on iPad is feeling like the slope isn’t too steep, but it <em>always</em> feels like pedaling uphill to some degree. Your mileage, of course, may vary — it’s folly to ignore the fact that some people find themselves <em>more</em> productive, or perhaps just more comfortable, on an iPad than a Mac or Windows PC. But not me. <a href=\"#fnr2-2022-10-26\" class=\"footnoteBackLink\" title=\"Jump back to footnote 2 in the text.\">↩︎︎</a></p>\n</li>\n\n<li id=\"fn3-2022-10-26\">\n<p><a href=\"https://daringfireball.net/2020/04/the_ipad_magic_keyboard\">My review of the Magic Keyboard from April 2020</a> stands up very well, but I wish I’d complained about these mismatched bracket keys then. This mismatched key cap layout is so obviously wrong I just assumed it wouldn’t happen again. <a href=\"#fnr3-2022-10-26\" class=\"footnoteBackLink\" title=\"Jump back to footnote 3 in the text.\">↩︎︎</a></p>\n</li>\n\n</ol>\n</div>\n\n\n\n    "
}