{
  "title":"[Sponsor] Kolide — Endpoint Security for Teams That Slack",
  "date":"2022-11-08T23:50:39.000000Z",
  "author":"Daring Fireball Department of Commerce",
  "id":"tag:daringfireball.net,2022:/feeds/sponsors//11.39468",
  "link":"https://l.kolide.co/3yL3FcB",
  "content":"\n<p>In 2021, our company went through the SOC 2 Type 1 audit, and we <a href=\"https://l.kolide.co/3OR7Ucr\">found out just how challenging it can be</a> to prove compliance to a third-party auditor. We also learned firsthand something our customers had been telling us for a while: that we couldn’t have gotten our SOC certification without using our own product.</p>\n\n<p>That product is Kolide, an endpoint security solution for Mac, Windows, and Linux devices. Kolide gives IT admins a single dashboard, through which you can prove that your fleet has the security measures that auditors care about.</p>\n\n<p>With Kolide, you can instantly see whether:</p>\n\n<ul>\n<li>Firewalls and screen lock are enabled</li>\n<li>Operating systems are up-to-date</li>\n<li>Password managers are installed</li>\n</ul>\n\n<p>Kolide also provides visibility into nuanced issues that MDMs can’t address, like whether developers have unencrypted SSH keys or plaintext 2FA backup codes.</p>\n\n<p>Moreover, Kolide balances this visibility with respect for user privacy and autonomy. Users can visit the Privacy Center to see what device data is being collected and why. And when Kolide detects a vulnerability on a user’s device, it reaches out via Slack to notify them of the problem and provides step-by-step instructions on how to solve it. </p>\n\n<p>At Kolide, <a href=\"https://l.kolide.co/3yL3FcB\">we’ve helped hundreds of customers achieve compliance</a> — for SOC 2, ISO27001, or their own internal security goals. And we’ve done so in ways that go beyond “checking the boxes” and actually increase transparency and collaboration between IT and end users.</p>\n\n<p>If you want to know how you can get compliant without compromising your values, then we want to talk to you.</p>\n\n<p><a href=\"https://l.kolide.co/3yL3FcB\">Try Kolide for 14 days free; no credit card required</a>.</p>\n\n<div>\n<a title=\"Permanent link to ‘Kolide — Endpoint Security for Teams That Slack’\" href=\"https://daringfireball.net/feeds/sponsors/2022/11/kolide_endpoint_security_for_t_3\"> ★ </a>\n</div>\n\n\t"
}