{
  "title":"Elon Musk Posts Open Letter to Twitter Advertisers on the Cusp of Completing His Acquisition",
  "date":"2022-10-27T18:24:18.000000Z",
  "author":"John Gruber",
  "id":"tag:daringfireball.net,2022:/linked//6.39439",
  "link":"https://twitter.com/elonmusk/status/1585619322239561728/",
  "content":"\n<p>Elon Musk:</p>\n\n<blockquote>\n  <p>And I do so with humility, recognizing that failure in pursuing\nthis goal, despite our best efforts, is a very real possibility.</p>\n\n<p>That said, Twitter obviously cannot become a free-for-all\nhellscape, where anything can be said with no consequences! In\naddition to adhering to the laws of the land, our platform must be\nwarm and welcoming to all, where you can choose your desired\nexperience according to your preferences, just as you can choose,\nfor example, to see movies or play video games ranging from all\nages to mature.</p>\n</blockquote>\n\n<p>I’m more optimistic about Twitter’s future than I have been in years. Don’t get me wrong, I think there’s a very real chance that under Musk’s leadership, Twitter might break apart and fade into irrelevance. But Musk himself notes the same thing! Keeping Twitter open to a wide range of content, but making it easy to control what content <em>you</em> see, as user, is a worthy ideal. Pulling it off, that’s the trick. But as a privately-held company Musk is free to make changes that move Twitter away from being optimized for <em>engagement</em> and towards being optimized for <em>enjoyment</em>.</p>\n\n<p>The risk of <a href=\"https://www.reuters.com/technology/exclusive-where-did-tweeters-go-twitter-is-losing-its-most-active-users-internal-2022-10-25/\">fading into irrelevance</a> is far greater, if not nearly certain, under Twitter’s current leadership. I think Twitter is worth saving. I think Twitter requires massive changes in order to be saved — both outward-facing as a service and platform, and internally as a company. I would not have picked Elon Musk as the person to lead the company through those changes. But you dance with the one who bought the company and took it private.</p>\n\n<blockquote>\n  <p>I also very much believe that advertising, when done right, can\ndelight, entertain and inform you; it can show you a service or\nproduct or medical treatment that you never knew existed, but is\nright for you. For this to be true, it is essential to show\nTwitter users advertising that is as relevant as possible to their\nneeds. Low relevancy ads are spam, but highly relevant ads are\nactually content! Fundamentally, Twitter aspires to be the most\nrespected advertising platform in the world that strengthens your\nbrand and grows your enterprise.</p>\n</blockquote>\n\n<p>That’s a good North Star. Ads as desirable content has been my mantra at Daring Fireball ever since I <a href=\"https://daringfireball.net/2003/07/independent_days\">turned on the revenue spigot</a>.</p>\n\n<div>\n<a title=\"Permanent link to ‘Elon Musk Posts Open Letter to Twitter Advertisers on the Cusp of Completing His Acquisition’\" href=\"https://daringfireball.net/linked/2022/10/27/musk-twitter-open-letter\"> ★ </a>\n</div>\n\n\t"
}