{
  "title":"Twitter Might Merge Twitter Blue and Verification, and Thus Charge for Being Verified",
  "date":"2022-10-31T23:28:44.000000Z",
  "author":"John Gruber",
  "id":"tag:daringfireball.net,2022:/linked//6.39447",
  "link":"https://www.theverge.com/2022/10/30/23431931/twitter-paid-verification-elon-musk-blue-monthly-subscription",
  "content":"\n<p>The Verge’s Alex Heath had the scoop over the weekend:</p>\n\n<blockquote>\n  <p>The directive is to change Twitter Blue, the company’s <a href=\"https://www.theverge.com/2022/7/28/23283166/twitter-blue-subscription-price-hike-4-99\">optional,\n$4.99 a month subscription that unlocks additional features</a>,\ninto a more expensive subscription that also verifies users,\naccording to people familiar with the matter and internal\ncorrespondence seen by The Verge. Twitter is currently planning to\ncharge $19.99 for the new Twitter Blue subscription. Under the\ncurrent plan, verified users would have 90 days to subscribe or\nlose their blue checkmark. Employees working on the project were\ntold on Sunday that they need to meet a deadline of November 7th\nto launch the feature or they will be fired.</p>\n</blockquote>\n\n<p>I can verify that a team has been tasked with this, but I heard the deadline was this Friday (November 4), not Monday (the 7th). But my real quibble is reporting anything going on at Twitter right now as a definitive plan. It’s a fact that Musk tasked a team at Twitter with building this and gave them “a week” to build it; it’s not a fact that it’s ever going to see the light of day.</p>\n\n<p>As for the idea of charging verified users to remain verified (or, perhaps better put, requiring verified users to sign up for Twitter Blue), it strikes me as an idea that’s contrary to the reason verification exists. <a href=\"https://twitter.com/NateSilver538/status/1587094505202892800\">Nate Silver</a>:</p>\n\n<blockquote>\n  <p>I’m probably the perfect target for this, use Twitter a ton, can\nafford $20/mo, not particularly anti-Elon, but my reaction is that\nI’ve generated a ton of valuable free content for Twitter over the\nyears and they can go fuck themselves.</p>\n</blockquote>\n\n<p><a href=\"https://twitter.com/StephenKing/status/1587042605627490304\">Stephen King</a>:</p>\n\n<blockquote>\n  <p>$20 a month to keep my blue check? Fuck that, they should pay me.\nIf that gets instituted, I’m gone like Enron.</p>\n</blockquote>\n\n<p>There’s a weirdly but unsurprisingly deeply insecure faction on the right that considers verified Twitter users to be one of their many enemy factions. They call them “bluechecks”. And while I’m sure there are some verified Twitter users who really do see it as some sort of prestige status thing, as Silver and King point out, in practical terms it’s for <em>Twitter’s</em> benefit, not for the verified users. It’s Twitter that benefits from millions of users being able to feel certain that the “Stephen King” with 7 million followers on Twitter is really <em>the</em> Stephen King. It’s Twitter that benefits from Nate Silver engaging with users and tweeting analysis. Popular tweeters aren’t getting paid to tweet. And now Elon Musk thinks they should pay <em>to</em> tweet?</p>\n\n<p>Count me as skeptical that this is going to happen as currently discussed.</p>\n\n<div>\n<a title=\"Permanent link to ‘Twitter Might Merge Twitter Blue and Verification, and Thus Charge for Being Verified’\" href=\"https://daringfireball.net/linked/2022/10/31/twitter-verified-charge\"> ★ </a>\n</div>\n\n\t"
}