{
  "title":"Renaissance Science – XVI",
  "date":"2021-08-11T03:06:53.000000-07:00",
  "author":null,
  "id":"http://thonyc.wordpress.com/?p=7546",
  "link":"https://thonyc.wordpress.com/2021/08/11/renaissance-science-xvi/",
  "content":"\n<p>In terms of the books rediscovered from antiquity during the Renaissance one of those that had the biggest impact was Ptolemaeus’ <em>Geōgraphikḕ Hyphḗgēsis</em>, which became known in Latin as either the <em>Geographia</em> or <em>Cosmographia</em>. Claudius Ptolemaeus or (Klaúdios Ptolemaîos in Greek) is a scholar, who had a major impart on the development of the mathematical sciences in the second century CE and then again when his writings were rediscovered in the High Middle Ages during the twelfth century translation movement. He wrote important texts on astronomy, astrology, cosmology, harmony (music), and optics, amongst others. However, we know next to nothing about the man himself, neither his date of birth nor his date of death, nor very much else. He lived and worked in the city of Alexandria and people in the Middle Ages made the mistake of thinking he was a member of the Ptolemaic dynasty that ruled Egypt from 323–30 BCE. There is a possibility that he acquired the name because he came from the town of Ptolemaîos Hermaiou in Upper Egypt.</p>\n\n\n\n<p>Three of his books the <em>Mathēmatikē Syntaxis</em> (better known in English as the <em>Almagest</em>) on astronomy, the <em>Tetrabiblos</em> or <em>Apotelesmatiká</em> on astrology and the <em>Geōgraphikḕ Hyphḗgēsis</em> on geography form a sort of trilogy. He says in the introduction of the <em>Tetrabiblos</em> that the study of the science of the stars is divided into two parts. The first, his <em>Mathēmatikē Syntaxis</em>, describes where to find the celestial objects and the second, his <em>Tetrabiblos</em>, explains their influence. The <em>Geōgraphikḕ Hyphḗgēsis</em> is in different ways directly related to both books. It is related to the <em>Mathēmatikē Syntaxis</em> in that both works use a latitude/longitude coordinate system to map their respective realms, the sphere of the earth and the sphere of the heavens. This interconnectedness in reflected in the fact that in Early Modern Europe a cosmographer was somebody, who mapped both the celestial and terrestrial spheres. The <em>Geōgraphikḕ Hyphḗgēsis</em> is in three parts, a theoretical introduction on mapping, a gazetteer of the coordinates of a long list of places and, geographical features, and a collection of maps. Like the <em>Mathēmatikē Syntaxis</em>, the <em>Geōgraphikḕ Hyphḗgēsis</em> built on earlier works in the disciple, most notably that of Marinus of Tyre (c. 70–130 CE). To cast a horoscope in Greek astrology, one needs the coordinates of the place for which the horoscope in being cast, the <em>Geōgraphikḕ Hyphḗgēsis</em>delivered those coordinates. In antiquity the last known reference to the <em>Geōgraphikḕ Hyphḗgēsis</em> was in the work of Cassiodorus (c. 485–c. 585). </p>\n\n\n\n<p>All three of these books by Ptolemaeus were translated into Arabic by the ninth century. Both the <em>Mathēmatikē Syntaxis</em>and the <em>Tetrabiblos</em> had a major impact in Islamic culture, although both were criticised, changed, improved on in wide ranging commentaries by Islamic scholars. It was here that the <em>Mathēmatikē Syntaxis</em> acquired the name <em>Almagest</em>meaning the greatest to distinguish it from a shorter, less important astronomical text from Ptolemaeus. <em>Geōgraphikḕ Hyphḗgēsis</em>, however had very little impact on Islamic map making being used almost exclusively in an astrological context.</p>\n\n\n\n<p>The <em>Mathēmatikē Syntaxis</em> was translated into Latin three times in the twelfth century. Twice from Arabic once by Abd al-Masīḥ of Winchester and once by Gerard of Cremona (1114–1187) and once directly from Greek in Sicily by an unknown translator. These translations establish Ptolemaic astronomy as the de facto medieval European astronomy. In the twelfth century the <em>Tetrabiblos </em>was also translated from Arabic into Latin by Plato of Trivoli in 1138 and directly from Greek into Latin by William of Moerbeke (c. 1220–c. 1286). Integrated into Christian theology by Albertus Magnus and Thomas Aquinas it dominated European astrology right up to the end of the seventeenth century. </p>\n\n\n\n<p>Unlike the <em>Mathēmatikē Syntaxis</em> and the <em>Tetrabiblos</em> the <em>Geōgraphikḕ Hyphḗgēsis</em> was apparently not translated either from Arabic or Greek during the twelfth century. Giacomo or Jacopo d’Angelo of Scarperia better known in Latin as Jacobus Angelus obtained a Greek manuscript, found in Constantinople that he translated, into Latin in about 1406. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/la_cosmographie_de_claude_ptolemee_0009.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/la_cosmographie_de_claude_ptolemee_0009.jpg?w=713\" alt=\"\" class=\"wp-image-7548\"></a><figcaption>Jacobus Angelus’ Latin translation of Ptolemaeus’ Geographia Early 15th century <a href=\"http://bmn-renaissance.nancy.fr/items/show/1236\">Source</a> via Wikimedia Commons</figcaption></figure>\n\n\n\n<p></p>\n\n\n\n<p>Here it obtained the title of <em>Geographia</em> or <em>Cosmographia</em>. There is some discussion or even doubt about how genuine the book is, as the oldest known Greek manuscript only dates back to the thirteenth century.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/2880px-ptolemy-world_vat_urb_82.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/2880px-ptolemy-world_vat_urb_82.jpg?w=1024\" alt=\"\" class=\"wp-image-7550\"></a><figcaption>A Byzantine Greek world map according to Ptolemy’s first (conic) projection. From Codex Vaticanus Urbinas Graecus 82, Constantinople c. 1300. Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Despite criticism of the quality of Jacobus Angelus’ translation it proved very popular, and the first printed edition appeared in Venice in 1475. However, it contained no maps. A second edition was printed in Rome in 1478, which contained maps printed from copper engravings. The engravings were begun by Konrad Sweynheym (who together with Arnold Pannartz set up the first printing press in Italy) and were completed by Arnold Buckinck after Sweynheym’s death in 1476. The first edition of <em>Geographia</em> with maps printed using woodcuts was published in Ulm in 1482. Three major printed editions in les than a decade indicate the popularity of the book. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/page7-783px-cosmographia_1482.djvu_.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/page7-783px-cosmographia_1482.djvu_.jpg?w=669\" alt=\"\" class=\"wp-image-7552\"></a><figcaption>First page of the 1482 Ulm edition go Gepgraphis Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>The quality, or rather supposed lack of it, of Jacobus Angelus’ translation led to a series of new translations from the Greek. The Nürnberger mathematicus Johannes Werner (1468–1522) </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/300px-johannes_werner.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/300px-johannes_werner.jpg?w=300\" alt=\"\" class=\"wp-image-7554\"></a><figcaption>Artist unknown Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>published a new translation of the theoretical first section, his <em>In Hoc Opere Haec Continentur Nova Translatio Primi Libri Geographicae Cl Ptolomaei</em>, in Nürnberg in 1514. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/in_hoc_opere_haec_continentur_...ptolemee_claude_btv1b55011084f.jpeg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/in_hoc_opere_haec_continentur_...ptolemee_claude_btv1b55011084f.jpeg?w=507\" alt=\"\" class=\"wp-image-7556\"></a><figcaption><a href=\"https://www.europeana.eu/en/item/362/item_IHEMYXJOZ2CO6OBXUPFFWV64PZ3XYDSM\">Source: </a></figcaption></figure>\n\n\n\n<p>This in turn was heavily criticised by Willibald Pirckheimer (1470–1530) Nürnberger politician, soldier, humanist scholar and friend and patron of Albrecht Dürer. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/1920px-portret_van_willibald_pirckheimer_rp-p-ob-1280.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/1920px-portret_van_willibald_pirckheimer_rp-p-ob-1280.jpg?w=642\" alt=\"\" class=\"wp-image-7558\"></a><figcaption>Willibald Pirckheimer portrait by Dürer Souce: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Pirckheimer, an excellent classist, published his own translation of the entire text in Nürnberg in 1525. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/main-image.jpeg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/main-image.jpeg?w=1024\" alt=\"\" class=\"wp-image-7560\"></a><figcaption>Claudius Ptolemaeus (Greek, Alexandria (?) A.D. 100?–?170 Alexandria (?)) In Claudii Ptolemaei Geographiacae Enarrationis Libri octo., March 30, 1525 German,  Willibald Pirckheimer The Metropolitan Museum of Art, New York, Rogers Fund, 1920 (20.83-) <a href=\"https://www.metmuseum.org/art/collection/search/355761\">Source</a></figcaption></figure>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/main-image-2.jpeg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/main-image-2.jpeg?w=1024\" alt=\"\" class=\"wp-image-7562\"></a><figcaption>Claudius Ptolemaeus (Greek, Alexandria (?) A.D. 100?–?170 Alexandria (?)) In Claudii Ptolemaei Geographiacae Enarrationis Libri octo., March 30, 1525 German,  Willibald Pirckheimer The Metropolitan Museum of Art, New York, Rogers Fund, 1920 (20.83-) <a href=\"https://www.metmuseum.org/art/collection/search/355761\">Source</a></figcaption></figure>\n\n\n\n<p>Pirckheimer’s edition formed the basis for the revised and edited edition published by the cosmographer, Sebastian Münster (1488–1552), in 1540 in Basel. Münster published an updated edition with extra illustrations in 1550. Münster’s <em>Geographia</em> was generally regarded as the standard Latin reference text of the work.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/30282829182_2.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/30282829182_2.jpg?w=682\" alt=\"\" class=\"wp-image-7564\"></a><figcaption>Geographiae Claudii Ptolemaei Alexandrini, Philosophi ac Mathematici praestantissimi, Libri VIII, partim à Bilbaldo Pirckheymero . MÜNSTER, Sebastian (1488-1552), ed. Edité par Basel: Heinrich Petri, March 1552 [colophon], 1552</figcaption></figure>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/30282829182_3-1.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/30282829182_3-1.jpg?w=1024\" alt=\"\" class=\"wp-image-7567\"></a><figcaption>Geographiae Claudii Ptolemaei Alexandrini, Philosophi ac Mathematici praestantissimi, Libri VIII, partim à Bilbaldo Pirckheymero . MÜNSTER, Sebastian (1488-1552), ed. Edité par Basel: Heinrich Petri, March 1552 [colophon], 1552</figcaption></figure>\n\n\n\n<p>The Portuguese mathematicus Pedro Nunes (1502–1578), noted for his contributions to the history of navigation, who was appointed Royal Cosmographer in 1529 and Chief Royal Cosmographer in 1547 by King Joāo III o Piedoso, </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/pedro_nunes.png\"><img src=\"https://thonyc.files.wordpress.com/2021/08/pedro_nunes.png?w=479\" alt=\"\" class=\"wp-image-7569\"></a><figcaption>Image of Portuguese mathematician Pedro Nunes in Panorama magazine (1843); Lisbon, Portugal. Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>published his <em>Tratado da sphera com a Theorica do Sol e da Lua</em> in Lisbon in 1537. This was a based on a collection of texts and included the first, theoretical, section of Ptolemaeus’ <em>Geographia</em>. To make it more accessible Nunes published it in Latin, Spanish and Portuguese.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/tratadodaspherac00sacr_0007.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/tratadodaspherac00sacr_0007.jpg?w=727\" alt=\"\" class=\"wp-image-7571\"></a></figure>\n\n\n\n<p>There were, naturally, also other vernacular translations of the work published in the sixteenth century, as for example this description of an Italian translation (borrowed from amateur astronomer and book collector, David Kolb, on Facebook):</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Here is another one of the gems from my collection. I proudly present Claudius Ptolemy’s “La Geografia di Claudio Tolomeo Alessandrino” that was published in 1574. This volume is an expanded edition of his treatise on geography. Claudius Ptolemy lived in Alexandria during the 2nd century and is better known by astronomers for his astronomical treatise “The Almagest”. This is the third edition of the Italian translation by Girolamo Ruscelli, which was first printed by Vincenzo Valgrisi in Venice, in 1561. This edition is revised and corrected by Giovanni Malombra. The engraved maps, which are enlarged copies of Giacomo Gastaldi’s maps in his Italian edition of Venice, 1548, are generally the same in the Venice 1561, 1562 (Latin), and 1564 editions printed in Venice. Sixty-three of the maps are printed from the same plates as the 1561 edition. The exceptions are the Ptolemaic world map, “Tavola prima universale antica, di tutta la terra conosciura fin’ a’ tempi di Tolomeo,” which is on a revised conical projection, and the additional map “Territorio di Roma duodecima tavola nuova d’Europa” which is new to this edition. The atlas contains 27 Ptolemaic maps and 38 new maps.</p></blockquote>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/236472672_6666340873391706_6523953453672040029_n.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/236472672_6666340873391706_6523953453672040029_n.jpg?w=600\" alt=\"\" class=\"wp-image-7575\"></a></figure>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/236004296_6666343196724807_8604674758036158737_n.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/236004296_6666343196724807_8604674758036158737_n.jpg?w=1024\" alt=\"\" class=\"wp-image-7573\"></a></figure>\n\n\n\n<p>The cosmographer Gerard Mercator (1512–1594), famous for introducing the name atlas for a collection of maps, initially intended to publish a large multi-volume work, which he never completed before he died. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/1920px-gerardus_mercator_3.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/1920px-gerardus_mercator_3.jpg?w=808\" alt=\"\" class=\"wp-image-7577\"></a><figcaption> Mercator the Frans Hogenberg portrait of 1574 Source: Wikimedia Commons </figcaption></figure>\n\n\n\n<p>The first volume was intended to be his <em>Geographia</em>. In 1578 he published his <em>Tabulae geographicae Cl. Ptolemaei ad mentem auctoris restitutis ac emendatis.</em> (Geographic maps according to Claudius Ptolemy, drawn in the spirit of the author and expanded by Gerard Mercator). This was followed by a second edition in 1584 his <em>Geographiae Libri Octo</em>:<em> recogniti iam et diligenter emendati</em>, containing his revised version of Ptolemaeus’ text.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/url.json_.jpeg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/url.json_.jpeg?w=400\" alt=\"\" class=\"wp-image-7579\"></a><figcaption>Geographiae Libri Octo :recogniti iam et diligenter emendati cum tabulis geographicis ad mentem auctoris restitutis ac emendatis ; Cum gratia &amp; Priuilegio Sac Caes. Maiestat. <a href=\"https://www.europeana.eu/en/item/358/item_7YNT7WE4LEPDIP5ADULTMMHEBQG4I27O\">Source:</a></figcaption></figure>\n\n\n\n<p> I hope I have made clear just how important the rediscovery of the <em>Geōgraphikḕ Hyphḗgēsis</em> was in the fifteenth and sixteenth centuries given the number of editions, of which I have only named a few, and the status of the authors, who produced those editions. In the next episode we will examine its impact on the map making in Europe during this period. </p>\n"
}