{
  "title":"Martin who?",
  "date":"2021-08-17T23:35:27.000000-07:00",
  "author":null,
  "id":"http://thonyc.wordpress.com/?p=7582",
  "link":"https://thonyc.wordpress.com/2021/08/18/martin-who/",
  "content":"\n<p></p>\n\n\n\n<p>Anna Marie Roos is one of those scholars, who make this historian of Early Modern science feel totally inadequate. Her depth and breadth of knowledge are awe inspiring and her attention to detail lets the reader know that what she is saying is with a probability bordering on certainty accurate and correct. Over the years she has churned out an imposing series of books covering a wide spectrum of the history of science in Britain during the Early Modern Period, each of them an impressive monument to her scholarship. Her latest addition to this series is a biography of Martin Folkes. I can already hear a significant number of readers of this blog muttering Martin who? Hence the title of this review. The fog lifts somewhat if one reads the full title of the volume, <em>Martin Folkes (1690–1754)</em>: <em>Newtonian, Antiquary, Connoisseur</em>.<a href=\"//7FA9106E-8BAC-435C-9AA9-0F338642996B#_ftn1\"><sup><em><sup><strong>[1]</strong></sup></em></sup></a></p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/folkes20210816_09225283_0001.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/folkes20210816_09225283_0001.jpg?w=676\" alt=\"\" class=\"wp-image-7584\"></a></figure>\n\n\n\n<p>Folkes is in fact a victim of a strange little hiccup in the popular history of science and also of the big names, big events approach to the discipline. The hiccup is the fact that the spotlight is shone very bright on the sixteenth and seventeenth centuries, the so-called scientific revolution, and on the nineteenth century, oft called the second scientific revolution, but the eighteenth century gets passed over with hardly a mention. Pass along folks nothing of interest to see here. This is, of course, not true a lot of important science was created in the eighteenth century, and this is one of the themes that Roos deals with, in her account of Folkes life, which encompassed the first half of the eighteenth century. </p>\n\n\n\n<p>On the problem of the big names, big events approach to the history of science, Folkes falls through the net because there are no theories, major discoveries or inventions that can be attributed to him. However, science does not just progress through the big events in fact most scientific progress comes from those, who, so to speak, dot the ‘I’s and cross the ‘T’s. What Thomas Kuhn in one of his most useful contributions called ‘normal science’. </p>\n\n\n\n<p>Martin Folkes was a mathematician, a Newtonian physicist, an antiquarian, a metrologist, a science administrator, an organiser, a science communicator, a science promotor, and a patron, and in all of these roles he made significant contributions to the progress of science not just in Britain but in the whole of Europe during the first half of the eighteenth century. Roos’ biography of this man with many hats brings all of these aspects of his personality and his activities vividly to light.</p>\n\n\n\n<p>How did Martin Folkes become so significant and influential? One could say with more than somewhat justification that he was born with the proverbial silver spoon in his mouth. His family were wealthy, well connected, influential, landowning members of the London high society at the end of the seventeenth and beginning of the eighteenth centuries. He received an excellent private education receiving tuition in Latin, Greek, Hebrew and conversational French from the Huguenot refugee, James Cappel (1639–1722), and, perhaps more significantly, mathematics from another <a href=\"https://thonyc.wordpress.com/2018/10/24/a-newtonian-refuge/\">Huguenot refugee Abraham De Moivre (1667–1754)</a>, who was one of the leading mathematicians of the age and a member of the Newtonian inner circle. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/folkes20210816_15162976_0002.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/folkes20210816_15162976_0002.jpg?w=1024\" alt=\"\" class=\"wp-image-7586\"></a></figure>\n\n\n\n<p>Folkes’ contact with De Moivre serves as an early introduction to what was probably Folkes’ greatest strength, he was, in modern parlance, a master networker. This aspect of Folkes’ life and personality is described in great detail throughout Roos’ narrative. Through De Moivre Folkes came into contact with De Moirve’s other private students a significant cross-section of the early eighteenth century scientific and social elite. Through De Moivre he also gained access to Newton and the Newtonians, becoming a life-long highly active Newtonian himself.</p>\n\n\n\n<p>Through Newton, Folkes was elected to the Royal Society, the start of a career that would see him become president of that august organisation, as well as president of the equally august Society of Antiquities; he was the only man ever to hold both presidencies. Here we meet another aspect of Folkes personality that certainly played an important role in his networking activities, he was immensely clubbable. For those, who don’t know this somewhat archaic, wonderful English word, it means somebody that others like to have as members of their social clubs and groupings. It seems that if someone set up a new club or society for the intellectual and/or social elite in the first half of the eighteenth century then Folkes was member, oft a founding member, organiser, and driving force. </p>\n\n\n\n<p>Roos’ detailed description of the clubs, societies, and groups of which Folkes became an always-active member means that her biography is a historical guide to the social and cultural life of the social and intellectual upper echelons during Folkes lifetime. This not only includes the Royal Society and the Society of Antiquities, but also the then newly emerging English Freemasonry movement, in which Folkes played a leading role, the short lived but influential Egyptian Society, as well as various drinking and dinner clubs, in which members of the academic societies met more informally following sessions of those societies. Roos’ volume is also a guide to the eating and drinking habits of the well-heeled gentlemen of the period. </p>\n\n\n\n<p>Although very much a member of the English establishment, Folkes was anything but a Little Englander. He maintained active contact with natural philosophers, mathematicians, and other propagators of the new sciences throughout Europe. He encouraged foreigners to come to Britain, also to buy British scientific instruments, and to publish the results of their researchers in British journals. He also patronised and supported foreign scholars he thought worthy of promotion. </p>\n\n\n\n<p>Folkes extensive connections with the European mainland were also strengthened by his almost religious adherence to Newtonianism. Anybody who casts even a brief look at a modern English translation of Newton’s <em>Principia</em> quickly realises that it is not a work for the faint hearted or the ill prepared. The situation was not any different in the first half of the eighteenth century and Newton took no interest in popularising his work or making it available to the masses. Added to this was the fact that large parts of those in the know in Europe initially rejected much of Newton’s work on scientific and philosophical grounds, but also, with particular respect to his work in optics, because of their failure to reproduce many of his experiments. Various of Newton’s disciples jumped into the breach, left by the master’s silence, and presented popularisations of his major works, as books, lecture tours and demonstrations. Most notable, here, are another Huguenot refugee, John Theophilus Desaguliers (1683–1744) and the Dutchman, Willem ’s Gravesand (1688–1742). </p>\n\n\n\n<p>Folkes was also an eager missionary in the cause of Newtonianism. Folkes went on a grand tour of Europe between 1732 and 1735 preaching the gospel of Newton to learned societies and individual savants, in particular demonstrating those of Newton’s optical experiments that others had had difficulty replicating. During this tour Folkes made many friendships within the European intellectual milieu; friendships that he maintained through extensive correspondence when he returned to England.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/folkes20210816_15240533_0003.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/folkes20210816_15240533_0003.jpg?w=779\" alt=\"\" class=\"wp-image-7587\"></a></figure>\n\n\n\n<p>One aspect of Roos’ biography that I found particularly interesting was her descriptions of Folkes’ activities as a metrologist. For those that don’t know this is not a typo for meteorologist, as my Word correction programme seemed to think, until I added metrologist to its dictionary. Metrology is the scientific study of measurement or as another dictionary defines it, the science of weights and measures; the study of units of measurements. Folkes interests was antiquarian, and he spent significant time and effort, on his grand tour, in trying to determine the correct length of a Roman foot. Why should I be interested in what seems, superficially at least, to be an arcane hobby on Folkes’ part? </p>\n\n\n\n<p>In reality there was nothing arcane about Folkes’ interest in metrology. The turn to quantitative, empirical, experimental science and the resultant mathematisation that we call the scientific revolution led to a widespread discussion within the scientific community on systems and units of measurement towards unification, standardisation, and accuracy in the seventeenth and eighteenth century. Historical investigations searching for supposed natural units of measurement were an integral part of that discussion. All of this peaked in the introduction of the metric system in France in 1799 and the Imperial system of measurement in the UK and British Empire in 1826. This important episode tends to get ignored in the mainstream history of science, so it was good that it gets handled here by Roos.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/folkes20210816_15255085_0004.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/folkes20210816_15255085_0004.jpg?w=800\" alt=\"\" class=\"wp-image-7589\"></a></figure>\n\n\n\n<p>Oxford University Press have done Anna Marie Roos and Martin Folkes proud in the presentation of this biography. The front cover has a full colour portrait of the books subject and the book itself is extensively illustrated with grayscale and colour photos. The book is printed on bright white paper with an attractive typeface. Roos maintains her usual high scholarly standards, the book bursts at the seams with extensive, highly informative footnotes, which in turn reference a very extensive bibliography. All is rounded out by an equally extensive index.</p>\n\n\n\n<p>All of the above is a mere sketch of all the context that Roos has packed into this model example of a biography of an eighteenth-century polymath, who definitely earns the attention that Roos has given to his life, work, and influence. This is an all-round, first-class piece of scholarship that not only introduces the reader to the little known but important figure of Martin Folkes, but because of the extensive contextual embedding provides a solid introduction to the social and cultural context in which science was practiced not only in England but throughout Europe in the first half of the eighteenth century. Highly recommended and not just for historians of science </p>\n\n\n\n<hr class=\"wp-block-separator\"></hr>\n\n\n\n<p><a href=\"//7FA9106E-8BAC-435C-9AA9-0F338642996B#_ftnref1\"><sup>[1]</sup></a> Anna Marie Roos, <em>Martin Folkes (1690–1754)</em>: <em>Newtonian, Antiquary, Connoisseur</em>, OUP, Oxford, 2021</p>\n"
}