{
  "title":"Renaissance Science – XVII",
  "date":"2021-08-26T01:08:57.000000-07:00",
  "author":null,
  "id":"http://thonyc.wordpress.com/?p=7594",
  "link":"https://thonyc.wordpress.com/2021/08/26/renaissance-science-xvii/",
  "content":"\n<p>As we saw in the last episode, Ptolemaeus’ <em>Geographia</em> enjoyed a strong popularity following its rediscovery and translation into Latin from Greek at the beginning of fifteenth century, going through at least five printed editions before the end of the century. The following century saw several important new translation and revised editions both in Latin and in the vernacular. This initial popularity can at least be partially explained by the fact that Ptolemaeus’ <em>Mathēmatikē Syntaxis</em> and his <em>Tetrabiblos</em>, whilst not without rivals, were the dominant books in medieval astronomy and astrology respectively. But the <em>Geographia</em>, although, as explained in the previous episode, in some senses related to the other two books, was a book about mapmaking. So how did affect European mapmaking in the centuries after its re-emergence? To answer this question, we first need to look at medieval European, terrestrial mapmaking.</p>\n\n\n\n<p>Mapmaking was relatively low level during the medieval period before the fifteenth century and although there were certainly more, only a very small number of maps have survived. These can be divided into three largely distinct categories, regional and local maps, Mappa Mundi, and portolan charts. There are very few surviving regional or local maps from the medieval period and of those the majority are from 1350 or later, mapmaking was obviously not very widespread in the early part of the Middle Ages. There are almost no maps of entire countries, the exceptions being maps of Palestine, </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/burchard_map_of_palestine_from_the_biblioteca_medicea_laurenziana.png\"><img src=\"https://thonyc.files.wordpress.com/2021/08/burchard_map_of_palestine_from_the_biblioteca_medicea_laurenziana.png?w=1024\" alt=\"\" class=\"wp-image-7596\"></a><figcaption>Map of Palestine according to Burchard of Mount Sion Manuscript c. 1300 entitled: “De more vivendi diversarum gentium, secundum Hieronymum in libro II contra Iovinianum, quae illis cibariis vesci solent, quibus abundant” Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>the Matthew Paris and Gough maps of Britain, </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/britannienkarte_des_matthew_paris.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/britannienkarte_des_matthew_paris.jpg?w=764\" alt=\"\" class=\"wp-image-7598\"></a><figcaption>The most developed of Matthew Paris’s four maps of Britain 13th century (Cotton MS Claudius D VI, fol. 12v). The work is organised around a central north-south itinerary from Dover to Newcastle. The crenellations of both the Antonine Wall and Hadrian’s Wall can be seen in the upper half of the drawing. British Library, London. via Wikimedia Commons</figcaption></figure>\n\n\n\n<p>and Nicolas of Cusa’s maps of Germany and central Europe. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/alteste_deutschlandkarte.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/alteste_deutschlandkarte.jpg?w=1024\" alt=\"\" class=\"wp-image-7600\"></a><figcaption>Nicolas of Cusa map of central Europe printed edition 1491 Germanisches Nationalmuseum Nürnberg via Wikimedia Commons</figcaption></figure>\n\n\n\n<p>The Mappa Mundi are the medieval maps of the known world. These range from very simple schematic diagrams to the full-blown presentations of the <em>oikoumenikos</em>, the entire world as known to European antiquity, consisting of the three continents of Asia, Europe, and Africa. The sketch maps are mostly of two different types, the zonal maps, and the T-O maps. </p>\n\n\n\n<p>The zonal maps show just the eastern hemisphere divided by lines into the five climata or climate zones, as defined by Aristotle. These are the northern frigid zone, the northern temperate zone, the equatorial tropical zone, the southern temperate zone, and the southern frigid zone, of which the Greek believed only the two temperate zones were habitable. In the medieval period, zonal maps are mostly found in copies of Macrobius’ <em>Commentarii in Somnium Scipionis</em> (<em>Commentary on Cicero’s Dream of Scipio</em>).</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/1a-zonal-world-map.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/1a-zonal-world-map.jpg?w=983\" alt=\"\" class=\"wp-image-7603\"></a><figcaption>Macrobius zonal world map c. 1050 Source: British Library</figcaption></figure>\n\n\n\n<p>T-O sketch maps show a diagrammatic presentation of the three know continents, Asia, Europe, and Africa enclosed within a double circle representing the ocean surrounding <em>oikoumenikos</em>. The <em>oikoumenikos</em> is orientated, that is with east at the top and is divided into three parts by a T consisting of the Mediterranean, the Nile, and the Danube, with the top half consisting of Asia and the bottom half with Europe on the left and Africa on the right. T-O maps have their origin in the works of Isidore, his <em>De Natura Rerum</em> and <em>Etymologiae</em>. He writes in <em>De Natura Rerum</em>: </p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>So the earth may be divided into three sides (trifarie), of which one part is Europe, another Asia, and the third is called Africa. Europe is divided from Africa by a sea from the end of the ocean and the Pillars of Hercules. And Asia is divided from Libya with Egypt by the Nile… Moreover, Asia – as the most blessed Augustine said – runs from the southeast to the north … Thus we see the earth is divided into two to comprise, on the one hand, Europe and Africa, and on the other only Asia</p></blockquote>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/t_and_o_map_guntherus_ziner_1472.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/t_and_o_map_guntherus_ziner_1472.jpg?w=864\" alt=\"\" class=\"wp-image-7604\"></a><figcaption>This T and O map, from the first printed version of Isidore’s <em>Etymologiae</em>, identifies the three known continents as populated by descendants of Sem, Iafeth and Cham. Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>For most people the term Mappa Mundi evokes the large circular, highly coloured maps of the <em>oikoumenikos</em>, packed with symbols and text such as the Hereford and Ebstorf maps, rather that the small schematic ones. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/2560px-hereford-karte.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/2560px-hereford-karte.jpg?w=881\" alt=\"\" class=\"wp-image-7606\"></a><figcaption>The <em>Hereford Mappa Mundi</em>, about 1300, Hereford Cathedral, England Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>These are basically T-O maps but appear to be geographically very inaccurate. This is because although they give an approximate map of the <em>oikoumenikos</em>, they are not intended to be geographical maps, as we understand them today. So, what are they? The clue can be found in the comparatively large number of regional maps of Palestine, the High Middle Ages is a period where the Catholic Church and Christianity dominated Europe and the Mappa Mundi are philosophical maps depicting the world of Christianity. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/ebstorfer-stich2.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/ebstorfer-stich2.jpg?w=1024\" alt=\"\" class=\"wp-image-7608\"></a><figcaption>Recreation of the Ebstorf Map of about 1235; the original was destroyed by wartime bombing Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>These maps are literally orientated, that is East at the top and have Jerusalem, the hub of the Christian world, at their centre. The Hereford map has the Garden of Eden at the top in the east, whereas the Ebstrof map, has Christ’s head at the top in the east, his hands on the sides north and south and his feet at the bottom in the south, so that he is literally holding the world. The much smaller Psalter map has Christ above the map in the east blessing the world. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/psalter_world_map_c.1265.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/psalter_world_map_c.1265.jpg?w=706\" alt=\"\" class=\"wp-image-7610\"></a><figcaption>Psalter world map, ca. 1260 British Library via Wikimedia Commons</figcaption></figure>\n\n\n\n<p>These are not maps of the world but maps of the Christian world. The illustrations and cartouches scattered all over the maps elucidate a motley collection of history, legends and myths that were common in medieval Europe. These Mappa Mundi are repositories of an extensive collection of information, but not the type of geographical knowledge we expect when we hear the word map.</p>\n\n\n\n<p>The third area of medieval mapping is the portolan charts, which pose some problems. These are nautical charts that first appeared in the late thirteenth century in the Mediterranean and then over the centuries were extended to other sea areas. They display a detailed and surprising accurate stretch of coastline and are covered with networks of rhumb lines showing compass bearings. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/mediterranean_chart_fourteenth_century2.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/mediterranean_chart_fourteenth_century2.jpg?w=1024\" alt=\"\" class=\"wp-image-7612\"></a><figcaption>The oldest original cartographic artifact in the Library of Congress: a portolan nautical chart of the Mediterranean. Second quarter of the 14th century. Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Portolan charts have no coordinates. The major problem with portolan charts is their origin. They display an accuracy, at the time, unknown in other forms of mapping but the oldest known charts are fully developed. There is no known development leading to this type of mapping i.e., there are no known antecedent charts. The second problem is the question, are they based on a projection? There is some discussion on this topic, but the generally accepted view is that they are plate carrée or plane chart projection, which means that the mapmakers assumes that the area to be map is flat. This false assumption is OK if the area being mapped is comparatively small but leads to serios problems of distortion, when applied to larger areas.</p>\n\n\n\n<p>Maps, mapping, and map making began to change radically during the Renaissance and one of the principle driving factors of that change was the rediscovery of Ptolemaeus’ <em>Geographia</em>. It is important to note that the <em>Geographia</em> was only one factor and there were several others, also this process of change was gradual and drawn out. </p>\n\n\n\n<p>What did the <em>Geographia</em> bring to medieval mapmaking that was new? It reintroduced the concept of coordinates, longitude and latitude, as well as map projection. As Ptolemaeus points out the Earth is a sphere, and it is mathematically impossible to flatten out the surface of a sphere onto a flat sheet without producing some sort of distortion. Map projections are literally what they say they are, they are ways of projecting the surface of the sphere onto a flat surface. There are thousands of different projections, and the mapmaker has to choose, which one is best suited to the map that he is drawing. As Ptolemaeus points out for a map of the world, it is actually better not the draw it on a flat sheet but instead to draw it on a globe. </p>\n\n\n\n<p>The <em>Geographia </em>contains instructions for drawing a map of the Earth i.e., the <em>oikoumenikos</em>, and for regional maps. For his regional maps Ptolemaeus uses the plate carrée or plane chart projection, the invention of which he attributes to his contemporary Marinus of Tyre. In this projection, the lines of longitude (meridians) and latitude (parallels) are parallel sets of equally spaced lines. For maps of the world, he describes three other projections. The first of these was a simple conic projection in which the surface of the globe is projected onto a cone, tangent to the Earth at the 36<sup>th</sup> parallel. Here the meridians are straight lines that tend to close towards the poles, while the parallels are concentric arcs. The second was a modified cone projection where the parallels are concentric arcs and the meridians curve inward towards the poles.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/maps20210825_15235027_0001.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/maps20210825_15235027_0001.jpg?w=667\" alt=\"\" class=\"wp-image-7614\"></a><figcaption>Ptolemaeus’ projection I above and II below Source: Marjo T Nurminen, “The Mapmakers’ World”, Pool of London Press, 2014</figcaption></figure>\n\n\n\n<p>His third projection, a perspective projection, needn’t interest us here as it was hardly used, however the art historian Samuel Y Edgerton, who died this year, argued that the rediscovery of Ptolemaeus’ third projection at the beginning of the fifteenth century was the impulse that led to Brunelleschi’s invention of linear perspective.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/ptolemyworldmap.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/ptolemyworldmap.jpg?w=1024\" alt=\"\" class=\"wp-image-7618\"></a><figcaption>A mid-15th century Florentine Ptolemaic map of the world Ptolemy’s 1st  projection.</figcaption></figure>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/2880px-claudius_ptolemy-_the_world.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/2880px-claudius_ptolemy-_the_world.jpg?w=1024\" alt=\"\" class=\"wp-image-7616\"></a><figcaption>A printed Ptolemaic world map using his 2nd projection Johannes Schnitzer (1482). Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>From very early on Renaissance cosmographers began to devise and introduce new map projections, at the beginning based on Ptolemaeus’ projections. For example, in his <em>In Hoc Opere Haec Continentur Nova Translatio Primi Libri Geographicae Cl Ptolomaei</em>, from 1514, Johannes Werner (1468–1522) introduced the heart shaped or cordiform projection devised by his friend and colleague Johannes Stabius (1540–1522), now know as the Werner-Stabius projection. This was used by several mapmakers in the sixteenth century, perhaps most famously by Oronce Fine (1494–1555) in 1536.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/map-heart-054.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/map-heart-054.jpg?w=1024\" alt=\"\" class=\"wp-image-7621\"></a><figcaption>Oronce Fine World Map 1536 Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Francesco Rosselli (1455–died before 1513) introduced an oval projection with his world map of 1508</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/rosselli-1508.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/rosselli-1508.jpg?w=730\" alt=\"\" class=\"wp-image-7623\"></a><figcaption>World Map oval by Francesco Rosselli, copper plate engraving on vellum 1508, National Maritime Museum via Wikimedia Commons </figcaption></figure>\n\n\n\n<p>It should be noted that prior to the rediscovery of the <em>Geographia</em>, map projection was not unknown in medieval Europe, as the celestial sphere engraved on the tympans or climata of astrolabes are created using a stereographic projection.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/astrolabe_-_stereographic_projection_on_tympan.gif\"><img src=\"https://thonyc.files.wordpress.com/2021/08/astrolabe_-_stereographic_projection_on_tympan.gif?w=558\" alt=\"\" class=\"wp-image-7625\"></a><figcaption>Animation showing how celestial and geographic coordinates are mapped on an astrolabe’s tympan through a stereographic projection. Hypothetical tympan (40° north latitude) of a 16th-century European planispheric astrolabe. Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>The first wave of Renaissance mapmaking concerned the <em>Geographia</em> itself. As already noted, in the previous episode, the first printed edition with maps appeared in Bologna in 1477. This was closely followed by one produced with copper plate engravings, which appeared in Rome in 1478. An edition with maps printed with woodblocks in Ulm in 1482. Another edition, using the same plates as the 1478 edition appeared in Rome in 1490. Whereas the other fifteenth century edition only contained the twenty-seven maps described by Ptolemaeus in his text, the Ulm edition started a trend, that would continue in later editions, of adding new contemporary maps to the <em>Geographia</em>. These editions of the <em>Geographia</em> represent the advent of the modern atlas, to use an anachronistic term, an, at least nominally, uniform collection of maps with text bound together in book. It would be approximately a century before <a href=\"https://thonyc.wordpress.com/2015/04/23/abraham-ortelius-and-the-16th-century-information-age/\">the first real modern atlas, that of Abraham Ortelius</a>, would be published, but as Elizabeth Eisenstein observed, the European mapmakers first had to catch up with Ptolemaeus. </p>\n\n\n\n<p>These printed edition of the <em>Geographia</em> also illustrate another driving force behind the radical increase in mapmaking during the Renaissance, the invention of the printing press. <a href=\"https://thonyc.wordpress.com/2021/03/24/renaissance-science-vi/\">The invention of the printing press and the development of cooper plate engraving, as well as woodblock printing </a>meant that the multiple reproduction of maps and plans became much easier and also much cheaper. </p>\n\n\n\n<p>Another factor behind the increase in mapmaking was the so-called age of discovery. The Portuguese had been working their way down the coast of Africa throughout the fifteenth century and Bartolomeu Dias (c. 1450–1500) rounded the southern tip of Africa, for the first time in 1488, paving the way for the first trip by a European by an ocean route to India by Vasco da Gama (c. 1460s–1524) in 1497–99. Of course, as every school kid knows “In fourteen hundred and ninety-two, Columbus sailed the ocean blue” or put for formally the Genoese seaman Christopher Columbus (1451–1506) undertook his first voyage to Asia in service of the Spanish Crown in 1492 and accidentally discovered the so-called forth continent, which Martin Waldseemüller (c. 1475–1520) and <a href=\"https://thonyc.wordpress.com/2014/09/05/the-naming-of-america/\">Matthias Ringmann (c. 1482–1511) incorrectly christened America in 1507, in honour of Amerigo Vespucci (1451–1512), whom they falsely believed to be the discoverer of the new, to Europeans, continent. </a></p>\n\n\n\n<p>The initial maps produced by the European discovery expedition carried the portolan chart tradition out from the Mediterranean into the Atlantic Ocean, down the coast of Africa and eventually across the Atlantic to the coasts of the newly discovered Americas. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/616x510.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/616x510.jpg?w=616\" alt=\"\" class=\"wp-image-7628\"></a><figcaption><em>Kunstmann II</em> or <em>Four Finger Map</em>. Dating from the period circa 1502‒6 Source: World Digital Library</figcaption></figure>\n\n\n\n<p>Although not really suitable for maps of large areas the tradition of the portolan charts survived well into the seventeenth century. In 1500, Juan de la Cosa (c. 1450–1510) produced a world portolan chart. This is the earliest known map to include a representation of the New World.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/1500_map_by_juan_de_la_cosa.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/1500_map_by_juan_de_la_cosa.jpg?w=560\" alt=\"\" class=\"wp-image-7630\"></a><figcaption>Juan de la Cosa world map 1500</figcaption></figure>\n\n\n\n<p>The 1508 edition of the <em>Geographia</em> published in Rome was the first edition to include the European voyages of exploration to the New World. The world map drawn by the Flemish mapmaker Johan Ruysch (c. 1460–1533), who had himself sailed to America, includes the north coast of South America and some of the West Indian islands. On the other side it also includes eastern Asia with China indicated by a city marked as Cathaya, however, Japan (Zinpangu) is not included. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/2880px-ruysch_map.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/2880px-ruysch_map.jpg?w=1024\" alt=\"\" class=\"wp-image-7632\"></a><figcaption>Ruysch’s 1507 map of the world. Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Ruysch’s map bears a strong resemblance to the Cantarini-Rosselli world map published in Venice or Florence in 1506. Drawn by Giovanni Matteo Conarini (died 1507) and engraved by Francesco Rosselli (1455–died before 1513), which was the earliest known printed map containing the New World. The Ruysch map and the Cantarini-Rosselli probably shared a common source. </p>\n\n\n\n<p>The most famous map showing the newly discovered fourth continent is, of course, <a href=\"https://thonyc.wordpress.com/2014/09/05/the-naming-of-america/\">the Waldseemüller world map of 1507, which gave America its name. </a></p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/waldseemuller_map_2.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/waldseemuller_map_2.jpg?w=1024\" alt=\"\" class=\"wp-image-7634\"></a><figcaption><em>Universalis Cosmographia</em>, the Waldseemüller wall map dated 1507, depicts America, Africa, Europe, Asia, and the Oceanus Orientalis Indicus separating Asia from the Americas. Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Of interest here is the fact that Waldseemüller apparently also published a small, printed globe of his wall map, which is the earliest known printed globe.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/waldseemuller-globus.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/waldseemuller-globus.jpg?w=1024\" alt=\"\" class=\"wp-image-7636\"></a><figcaption>Waldseemüller globe gores of 1507 Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>The age of the modern terrestrial globe was ushered in by the earliest known, surviving manuscript globe produced by Martin Behaim (1549-1507) in 1493. Because he had supposedly taken part on Portuguese expedition along the African coast, <a href=\"https://thonyc.wordpress.com/2015/08/13/der-erdapfel/\">he was commissioned, by the city council of Nürnberg, during a visit to the city of his birth,  to produce a globe and a large wall map of the world for the council chamber.</a> The map no longer exists. Behaim’s main source for his maps was Ptolemaeus’ <em>Geographia</em>.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/258.jpeg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/258.jpeg?w=506\" alt=\"\" class=\"wp-image-7638\"></a><figcaption>Behaim Globe Germanisches Nationalmuseum Nürnberg</figcaption></figure>\n\n\n\n<p>Waldseemüller’s globe had apparently little impact and only four sets of globe gores still exist but none of the finished globes. The person who really set the production of printed globes in motion was the <a href=\"https://thonyc.wordpress.com/2010/05/15/circumnavigating-the-globe/\">Nürnberger mathematicus Johannes Schöner (1477–1547)</a>, who produced his first printed terrestrial globe in 1515, which did much to cement the name America given to the fourth continent by Waldseemüller and Ringmann. Schöner was the owner of the only surviving copy of the Waldseemüller map. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/schoner_johann_erdglobus_mit_holzgestell_um_1515_holz_pappmache_papier_c2a9_historisches_museum_frankfurt_am_main_fotograf_uwe_dettmar.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/schoner_johann_erdglobus_mit_holzgestell_um_1515_holz_pappmache_papier_c2a9_historisches_museum_frankfurt_am_main_fotograf_uwe_dettmar.jpg?w=810\" alt=\"\" class=\"wp-image-7640\"></a><figcaption>Schöner Terrestrial Globe 1515, Historisches Museum Frankfurt</figcaption></figure>\n\n\n\n<p>Like Behaim and Waldseemüller, Schöner’s main source of information was Ptolemaeus’ <em>Geographia</em>, of which he owned a heavily annotated copy, and which like them he supplemented with information from various other sources. In 1517, he also produced a matching, printed celestial globe, establishing the tradition of matching globe pairs that persisted down to the nineteenth century.</p>\n\n\n\n<p>Schöner was not the only Nürnberger mathematicus, who produced globes. We know that <a href=\"https://thonyc.wordpress.com/2020/11/25/a-master-instrument-maker-from-a-small-town-in-the-frankischen-schweiz/\">Georg Hartmann (1489–1564),</a> who acted as Schöner’s globe salesman in Nürnberg, when Schöner was still living in Kirchehrenbach, also manufactured globes, but none of his have survived. Although they weren’t cheap, it seems that Schöner’s globes sold very well, well enough to motivate others to copy them. Both Waldseemüller, with his map, and Schöner, with his globes, published an accompanying cosmographia, a booklet, consisting of instructions for use as well as further geographical and historical information. An innovative printer/publisher in Louvain reprinted Schöner’s cosmographia, <em>Lucullentissima quaedam terrae totius descriptio</em>, and commissioned <a href=\"https://thonyc.wordpress.com/2012/05/25/mapping-the-history-of-triangulation/\">Gemma Frisius (1508–1555)</a> to make a copy of Schöner’s globe to accompany it. Frisius became a globe maker, as did his one-time student and assistant Gerard Mercator (1512-1594), who went on to become the most successful globe maker in Europe. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/gemma_frisius_terrestrial_globe_8.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/gemma_frisius_terrestrial_globe_8.jpg?w=881\" alt=\"\" class=\"wp-image-7642\"></a><figcaption>Gemma Frisius globe 1536</figcaption></figure>\n\n\n\n<p>Both Willem Janszoon Blaeu (1571–1638) and Jodocus Hondius (1563–1612) emulated Mercator’s work establishing the Netherlands as the major European map and globe making centre in the seventeenth century.</p>\n\n\n\n<p>Another factor that contributed to the spread of map making in the sixteenth century was the Renaissance development of realism in painting. <a href=\"https://thonyc.wordpress.com/2021/04/07/renaissance-science-vii/\">This was a combination of the invention of linear perspective during the fifteenth century on the one hand and on the other, the development of Naturalism beginning in the late fourteenth century in the Netherlands.</a> During the sixteenth century many notable artists were also map makers and several map makers were also artists. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/duerer_weltkarte.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/duerer_weltkarte.jpg?w=1024\" alt=\"\" class=\"wp-image-7644\"></a><figcaption>Dürer-Stabius world map a rare example of Ptolemaeus’ 3rd projection</figcaption></figure>\n\n\n\n<p>It became fashionable during the Renaissance for those in power to sponsor and employ those working in the sciences. This patronage also included map makers. On the one hand this meant employing map makes to make maps as status symbols for potentates to display their magnificence. A good example is the map galleries that <a href=\"https://thonyc.wordpress.com/2018/11/28/cosmographer-to-a-grand-duke-and-a-pope/\">Egnatio Danti (1536–1586)</a> was commissioned to create in the Palazzo Vecchio in Florence for Cosimo I de’ Medici and in the Vatican for Pope Gregory XIII. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/danti003.jpg.webp\"><img src=\"https://thonyc.files.wordpress.com/2021/08/danti003.jpg.webp?w=714\" alt=\"\" class=\"wp-image-7646\"></a><figcaption>Source: Fiorani The Marvel of Maps p. 110 Note that the map is up side down!</figcaption></figure>\n\n\n\n<p>Similarly, <a href=\"https://thonyc.wordpress.com/2018/08/15/the-bees-of-ingolstadt/\">Peter Apian ((1495–1552) </a>was commissioned to produce maps for the Holy Roman Emperor, Charles V  </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/apians-heart-map-c7c16.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/apians-heart-map-c7c16.jpg?w=732\" alt=\"\" class=\"wp-image-7648\"></a><figcaption>Peter Apian cordiform world map 1530 Source: British Library</figcaption></figure>\n\n\n\n<p>His son <a href=\"https://thonyc.wordpress.com/2018/08/15/the-bees-of-ingolstadt/\">Philipp (1531–1589)</a> did the same for Duke Albrecht V of Bavaria. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/wasserzeichen-projekte-php.jpeg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/wasserzeichen-projekte-php.jpeg?w=1000\" alt=\"\" class=\"wp-image-7650\"></a><figcaption>Overview of the 24 woodblock prints of Apian’s map of Bavaria</figcaption></figure>\n\n\n\n<p>Another example is Oronce Fine (1494–1555), who made maps for Francis I. The first English atlas created by <a href=\"https://thonyc.wordpress.com/2018/09/12/saxton-and-speed-two-early-elizabethan-cartographers-and-the-flemish-influence/\">Christopher Saxton (c. 1540–c. 1610) </a>was commissioned by Thomas Seckford, Master of Ordinary on the instructions of William Cecil, 1<sup>st</sup>Baron Burghley (1520–1598), Queen Elizabeth’s chief advisor. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/saxton1-map-england-royal-ms-18-d-lll-no-5.jpg.webp\"><img src=\"https://thonyc.files.wordpress.com/2021/08/saxton1-map-england-royal-ms-18-d-lll-no-5.jpg.webp?w=1000\" alt=\"\" class=\"wp-image-7652\"></a><figcaption>Saxton England and Wales proof map Source: <a href=\"https://www.bl.uk/collection-items/saxton-england-and-wales-proof-maps\">British Library</a></figcaption></figure>\n\n\n\n<p>These maps came more and more to serve as aids to administration. The latter usage also led to European rulers commissioning maps of their new overseas possessions. </p>\n\n\n\n<p>Another area that required map making was the changes in this period in the pursuit of warfare. Larger armies, the increased use of artillery, and a quasi-professionalisation of the infantry led to demand for maps for manoeuvres during military campaigns. </p>\n\n\n\n<p>Starting around 1500 mapping took off in Renaissance Europe driven by the various factors that I’ve sketched above, a full account would be much more complex and require a book rather than a blog post. The amount of mapmaking increased steadily over the decades and with it the skill of the mapmakers reaching a first high point towards the end of the century in the atlases of<a href=\"https://thonyc.wordpress.com/2015/04/23/abraham-ortelius-and-the-16th-century-information-age/\"> Ortelius,</a> <a href=\"https://thonyc.wordpress.com/2020/05/13/a-uniform-collection-of-maps-should-have-been-a-theatre-but-became-an-atlas-instead-but-it-might-have-been-a-mirror/\">De Jode</a>, and <a href=\"https://thonyc.wordpress.com/2012/11/06/the-first-atlas/\">Mercator</a>. The seventeenth century saw the establishment of a major European commercial map and globe making industry dominated by the Dutch map makers, particularly <a href=\"https://thonyc.wordpress.com/2017/08/03/the-house-of-blaeu-vs-the-house-of-hondius-the-battle-of-the-globes-and-atlases/\">the Houses of Blaeu and Hondius.</a></p>\n"
}