{
  "title":"The seventeenth-century Chinese civil servant from Cologne ",
  "date":"2021-08-04T05:05:14.000000-07:00",
  "author":null,
  "id":"http://thonyc.wordpress.com/?p=7523",
  "link":"https://thonyc.wordpress.com/2021/08/04/the-seventeenth-century-chinese-civil-servant-from-cologne/",
  "content":"\n<p>From its very beginnings the Society of Jesus (the Jesuits) was set up as a missionary movement carrying the Catholic Religion to all corners of the world. It also had a very strong educational emphasis in its missions, carrying the knowledge of Europe to foreign lands and cultures and at the same time transmitting the knowledge of those cultures back to Europe. Perhaps the most well-known example of this is the seventeenth-century Jesuit mission to China, which famously in the history of science brought the latest European science to that far away and, for Europeans, exotic land. In fact, the Jesuits used their extensive knowledge of the latest European developments in astronomy to gain access to the, for foreigners, closed Chinese culture.</p>\n\n\n\n<p>It was, initially, <a href=\"https://thonyc.wordpress.com/2009/06/11/a-loser-who-was-really-a-winner/\">Christoph Clavius (1538–1612), who by introducing his mathematics programme into the Jesuits more general education system</a>, ensured that the Jesuits were the best purveyors of mathematics in Europe in the early seventeenth century and it was <a href=\"https://thonyc.wordpress.com/2012/10/06/an-italo-chinese-jesuit/\">Clavius’ student Matteo Ricci (1552–1610)</a>, who first breached the Chinese reserve towards strangers with his knowledge of the mathematical sciences.</p>\n\n\n\n<p>The big question is what did the Chinese need the help of western astronomers for and why. Here we meet an interesting historical contradiction for the Jesuits. Unlike most people in the late sixteenth century and early seventeenth century, the Jesuits did not believe in or practice astrology. One should not forget that both Kepler and Galileo amongst many others were practicing astrologers. The Chinese were, however, very much practitioners of astrology at all levels and it was here that they found the assistance of the Jesuits desirable. The Chines calendar fulfilled important ritual and astrological functions, in particular the prediction of solar and lunar eclipses for which the emperor was personally responsible, and it had to be recalculated at the ascension to the throne of every new emperor. There was even an Imperial Astronomical Institute to carry out this task.</p>\n\n\n\n<p>Although the Chinese had been practicing astronomy longer than the Europeans and, over the millennia, had developed a very sophisticated astronomy, in the centuries before the arrival of the Jesuits that knowledge had fallen somewhat into decay and had by that point not advanced as far as that of the Europeans. Before the arrival of the Jesuits, the Chinese had employed Muslim astronomers to aid them in this work, so the principle of employing foreigners for astronomical work had already been established. Through his work, Ricci had convinced the Chinese of his superior astronomical knowledge and abilities and thus established a bridgehead into the highest levels of Chinese society.</p>\n\n\n\n<p>The man, who, for the Jesuits, made the greatest contribution to calendrical calculation in seventeenth century was the, splendidly named, Johann Adam Schall von Bell (1591–1666). Born, probably in Cologne, into a well-established aristocratic family, who trace their roots back to the twelfth century, Johann Adam was the second son of Heinrich Degenhard Schall von Bell zu Lüftelberg and his fourth wife Maria Scheiffart von Merode zu Weilerswist. He was initially educated at the Jesuit Tricoronatum Gymnasium in Cologne and then in 1607 sent to Rome to the Jesuit run seminary Pontificium Collegium Germanicum et Hungaricum de Urbe, where he concentrated on the study of mathematics and astronomy. It is thought that his parents sent him to Rome to complete his studies because of an outbreak of the plague in Cologne. In 1611 he joined the Jesuits and moved to the Collegio Romano, where he became a student of <a href=\"https://thonyc.wordpress.com/2021/07/07/they-also-serve/\">Christoph Grienberger</a>. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/adam_schall-2.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/adam_schall-2.jpg?w=685\" alt=\"\" class=\"wp-image-7525\"></a><figcaption>A portrait of German Jesuit Johann Adam Schall von Bell (1592–1666), Hand-colored engraving, artist unknown Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>He applied to take part in the Jesuit mission to China and in 1618 set sail for the East from Lisbon. He would almost certainly on his way to Lisbon have spent time at the Jesuit College in Coimbra, where the missionaries heading out to the Far East were prepared for their mission. Here he would probably have received instruction in the grinding of lenses and the construction of telescopes from Giovanni Paolo Lembo (c. 1570–1618), who taught these courses to future missionaries.</p>\n\n\n\n<p>Schall von Bell set sail on 17 April 1618 in a group under the supervision of Dutch Jesuit Nicolas Trigault (1577–1628), Procurator of the Order’s Province of Japan and China. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/portrait_of_nicolas_trigault_by_peter_paul_rubens.png\"><img src=\"https://thonyc.files.wordpress.com/2021/08/portrait_of_nicolas_trigault_by_peter_paul_rubens.png?w=601\" alt=\"\" class=\"wp-image-7527\"></a><figcaption><em>Nicolas Trigault in Chinese costume</em>, by Peter Paul Rubens, the Metropolitan Museum of Art Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/de_christiana_expeditione_apud_sinas_ausburg_1615.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/de_christiana_expeditione_apud_sinas_ausburg_1615.jpg?w=412\" alt=\"\" class=\"wp-image-7529\"></a><figcaption><em>De Christiana expeditione apud Sinas</em>, by Nicolas Trigault and Matteo Ricci, Augsburg, 1615. Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Apart from Schall von Bell the group included the German, polymath Johannes Schreck (1576–1630), friend of Galileo and onetime member of the Accademia dei Lincei, and the Italian Giacomo Rho (1592–1638). They reached the Jesuit station in Goa 4 October 1618 and proceeded from there to Macau where they arrived on 22 July 1619. Here, the group were forced to wait four years, as the Jesuits had just been expelled from China. They spent to time leaning Chinese and literally fighting off an attempt by the Dutch to conquer Macau. </p>\n\n\n\n<p>In 1623 Schall von Bell and the others finally reached Peking. In 1628 Johann Schreck began work on a calendar reform for the Chinese. To aid his efforts Johannes Kepler sent a copy of the Rudolphine Tables to Peking in 1627. From 1627 to 1630 Schall von Bell worked as a pastor but when Schreck died he and Giacomo Rho were called back to Peking to take up the work on the calendar and Schall von Bell began what would become his life’s work.</p>\n\n\n\n<p>He must first translate Latin textbooks into Chinese, establish a school for astronomical calculations and modernise astronomical instruments.  In 1634 he constructed the first Galilean telescope in China, also writing a book in Chinese on the instrument. In 1635 he published his revised and modernised calendar, which still exists. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/explanation_of_the_telescope_wdl11434-2.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/explanation_of_the_telescope_wdl11434-2.jpg?w=1024\" alt=\"\" class=\"wp-image-7533\"></a><figcaption>Text on the utilisation and production of the telescope by Tang Ruowang (Chinese name of Johann Adam Schall von Bell) Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/galileisches_fernrohr.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/galileisches_fernrohr.jpg?w=432\" alt=\"\" class=\"wp-image-7531\"></a><figcaption>Galilean telescope from Schall von Bell’s Chinese book Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Scall von Bell used his influence to gain permission to build Catholic churches and establish Chinese Christian communities. This was actually the real aim of his work. He used his knowledge of mathematics and astronomy to win the trust of the Chinese authorities in order to be able to propagate his Christian mission.</p>\n\n\n\n<p>In 1640 he produced a Chinese translation of <a href=\"https://thonyc.wordpress.com/2019/04/17/renaissance-heavy-metal/\">Agricola’s <em>De re metallica</em>,</a> which he presented to the Imperial Court. He followed this on a practical level by supervising the manufacture of a hundred cannons for the emperor. In 1644, the emperor appointed him President of the Imperial Astronomical Institute following a series of accurate astronomical prognostication. From 1651 to 1661 he was a personal advisor to the young Manchurian Emperor Shunzhi (1638–1661), who promoted Schall von Bell to Mandarin 1<sup>st</sup> class and 1<sup>st</sup> grade, the highest level of civil servant in the Chinese system.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/adam_schall_and_shunzhi_emperor.png\"><img src=\"https://thonyc.files.wordpress.com/2021/08/adam_schall_and_shunzhi_emperor.png?w=1024\" alt=\"\" class=\"wp-image-7535\"></a><figcaption>Johann Adam Schall von Bell and Shunzhi Emperor Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Following the death of Shunzhi, he initially retained his appointments and titles, which caused problems for him in Rome following a visitation in Peking by the Dominicans. The Vatican ruled that Jesuits should not take on mundane appointments. In 1664 Schall von Bell suffered a stroke, which left him vulnerable to attack from his rivals at court. He was accused of having provoked Shunzhi’s  concubine’s death through having falsely calculated the place and time for the funeral of one of Shunzhi’s sons. </p>\n\n\n\n<p>The charges, that included other Jesuits, were high treason, membership of a religious order not compatible with right order and the spread of false astronomical teachings. Schall von Bell was imprisoned over the winter 1665/66 and Jesuits in Peking, who had not been charged were banned to Kanton. He was found guilty on 15 April 1665 and sentenced to be executed by Lingchi, death by a thousand cuts. However, according to legend, there was an earthquake shortly before the execution date and the judge interpreted it as a sign from the gods the Schall von Bell was innocent. On 15 May 1665 Schall von Bell was released from prison on the order of the Emperor Kangxi (1654–1722). He died 15 August 1666 and was rehabilitated by Kangxi, who ensured that he received a prominent gravestone that still exists. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/jesuit_astronomers_with_kangxi_emperor_1690-1705_beauvais.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/jesuit_astronomers_with_kangxi_emperor_1690-1705_beauvais.jpg?w=768\" alt=\"\" class=\"wp-image-7537\"></a><figcaption>Jesuit astronomers with Kangxi Emperor by Philippe Behagle French tapestry weaver, 1641 – 1705 Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Schall von Bell was represented at his trial by Flemish Jesuit Ferdinand Verbiest (1623–1688), who would later take up Schall von Bell’s work on the Chinese calendar but that’s a story for another day. Schall von Bell reached the highest ever level for a foreigner in the Chinese system of government but in the history of science it is his contributions to the modernisation of Chinese astronomy and engineering that are most important. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2021/08/du_halde_-_description_de_la_chine_-_vol_3_feuille_110.jpg\"><img src=\"https://thonyc.files.wordpress.com/2021/08/du_halde_-_description_de_la_chine_-_vol_3_feuille_110.jpg?w=1024\" alt=\"\" class=\"wp-image-7542\"></a><figcaption>Jesuit Mission to China,  left to right Top: Matteo Ricci, Johann Adam Schall von Bell, Ferdinand Verbiest Artist: Jean-Baptiste Du Halde (1674 – 1743) French Jesuit historian Source: Wikimedia Commons</figcaption></figure>\n"
}