{
  "title":"THE MATHEMATICAL IEVVEL",
  "date":"2022-11-09T07:29:19.000000Z",
  "author":null,
  "id":"http://thonyc.wordpress.com/?p=9861",
  "link":"https://thonyc.wordpress.com/2022/11/09/the-mathematical-ievvel/",
  "content":"\n<p></p>\n\n\n\n<p>Due to the impact of Isaac Newton and the mathematicians grouped around him, people often have a false impression of the role that England played in the history of the mathematical sciences during the Early Modern Period. As I have noted in the past, during the late medieval period and on down into the seventeenth century, England in fact lagged seriously behind continental Europe in the development of the mathematical sciences both on an institutional level, principally universities, and in terms of individual mathematical practitioners outside of the universities. Leading mathematical practitioners, working in England in the early sixteenth century, such as Thomas Gemini (1510–1562) and <a href=\"https://thonyc.wordpress.com/2021/06/09/the-deviser-of-the-kings-horologes/\">Nicolas Kratzer (1486/7–1550)</a> were in fact immigrants, from the Netherlands and Germany respectively.</p>\n\n\n\n<p>In the second half of the century the demand for mathematical practitioners in the fields of astrology, astronomy, navigation, cartography, surveying, and matters military was continually growing and England began to produce some home grown talent and take the mathematical disciplines more seriously, although the two universities, Oxford and Cambridge still remained aloof relying on enthusiastic informal teachers, such as <a href=\"https://thonyc.wordpress.com/2022/07/06/mathematician-astrologer-conjurer/\">Thomas Allen (1542–1632) </a>rather than instituting proper chairs for the study and teaching of mathematics.</p>\n\n\n\n<p>Outside of the universities ardent fans of the mathematical disciplines began to establish the so-called English school of mathematics, writing books in English, giving tuition, creating instruments, and carrying out mathematical tasks. Leading this group were the Welsh man, Robert Recorde (c. 1512–1558), who I shall return to in a later post, John Dee (1527–c. 1608), who I have dealt with in several post in the past,<a href=\"https://thonyc.wordpress.com/2013/07/13/john-dee-the-mathematicall-praeface-and-the-english-school-of-mathematics/\"> one of which outlines the English School</a>, other important early members being, Dee’s friend Leonard Digges, and his son Thomas Digges (c. 1446–1595), who both deserve posts of their own, and Thomas Hood (1556–1620) the first officially appointed lecturer for mathematics in England.  I shall return to give all these worthy gentlemen, and others, the attention they deserve but today I shall outline the life and mathematical career of John Blagrave (d. 1611) a member of the landed gentry, who gained a strong reputation as a mathematical practitioner and in particular as a designer of mathematical instruments, the antiquary Anthony à Wood (1632–1695), author of <em>Athenae Oxonienses. An Exact History of All the Writers and Bishops, who Have Had Their Education in the … University of Oxford from the Year 1500 to the End of the Year 1690</em>, described him as “the flower of mathematicians of his age.”</p>\n\n\n\n<p>John Blagrave was the second son of another John Blagrave of Bullmarsh, a district of Reading, and his wife Anne, the daughter of Sir Anthony Hungerford of Down-Ampney, an English soldier, sheriff, and courtier during the reign of Henry VIII, John junior was born into wealth in the town of Reading in Berkshire probably sometime in the 1560s. He was educated at Reading School, an old established grammar school, before going up to St John’s College Oxford, where he apparently acquired his love of mathematics. This raises the question as to whether he was another student, who benefitted from the tutoring skills of Thomas Allen (1542–1632). He left the university without graduating, not unusually for the sons of aristocrats and the gentry. He settled down in Southcot Lodge in Reading, an estate that he had inherited from his father and devoted himself to his mathematical studies and the design of mathematical instruments. He also worked as a surveyor and was amongst the first to draw estate maps to scale.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/008_ms_c17_49_full.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/008_ms_c17_49_full.jpg?w=1024\" alt=\"\" class=\"wp-image-9873\"></a><figcaption class=\"wp-element-caption\">Harpsden  a small parish near Henley-on-Thames Survey by John Blagrave 1589 <a href=\"https://www.oxfordshirehistory.org.uk/public/blog/blog_008.htm\">Source</a></figcaption></figure>\n\n\n\n<p>There are five known surviving works by Blagrave and one map, as opposed to a survey, of which the earliest his, <em>The mathematical ievvel,</em> from1585, which lends its name to the title of this post, is the most famous. The full title of this work is really quite extraordinary:</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p class=\"has-text-align-center\"> THE MATHEMATICAL IEVVEL </p>\n\n\n\n<p>Shewing the making, and most excellent vse of a singuler Instrument So called: in that it performeth with wonderfull dexteritie, whatsoever is to be done, either by Quadrant, Ship, Circle, Cylinder, Ring, Dyall, Horoscope, Astrolabe, Sphere, Globe, or any such like heretofore deuised: yea or by most Tables commonly extant: and that generally to all places from Pole to Pole. </p>\n\n\n\n<p>The vse of which Ievvel, is so aboundant and ample, that it leadeth any man practising thereon, the direct pathway (from the first steppe to the last) through the whole Artes of Astronomy, Cosmography, Geography, Topography, Nauigation, Longitudes of Regions, Dyalling, Sphericall triangles, Setting figures, and briefely of whatsoeuer concerneth the Globe or Sphere: with great and incredible speede, plainenesse, facillitie, and pleasure:</p>\n\n\n\n<p>The most part newly founde out by the Author, Compiled and published for the furtherance, aswell of Gentlemen and others desirous or Speculariue knowledge, and priuate practise: as also for the furnishing of such worthy mindes, Nauigators,and traueylers,that pretend long voyages or new discoueries: By John Blagave of Reading Gentleman and well willer to the Mathematickes; Who hath cut all the prints or pictures of the whole worke with his owne hands. 1585•</p>\n<cite>Dig the spelling!</cite></blockquote>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/009456-2.png\"><img src=\"https://thonyc.files.wordpress.com/2022/11/009456-2.png?w=632\" alt=\"\" class=\"wp-image-9865\"></a><figcaption class=\"wp-element-caption\"><em>Title Page </em><a href=\"https://www.maa.org/press/periodicals/convergence/mathematical-treasure-blagraves-mathematical-jewel\">Source </a><em>Note the title page illustration is an  armillary sphere and not the Mathematical Jewel</em></figcaption></figure>\n\n\n\n<p>Blagrave’s <em>Mathematical Jewel </em>is in fact a universal astrolabe, and by no means the first but probably the most extensively described. The astrolabe is indeed a multifunctional instrument, al-Sufi (903–983) describes over a thousand different uses for it, and Chaucer (c. 1340s–1400) in what is considered to be the first English language description of the astrolabe and its function, a pamphlet written for a child, describes at least forty different functions. However, the normal astrolabe has one drawback, the flat plates, called tympans of climata, that sit in the mater and are engraved with the stereographic projection of a portion of the celestial sphere are limited in their use to a fairly narrow band of latitude, meaning that if one wishes to use it at a different latitude you need a different climata. Most astrolabes have a set of plates each engraved on both side for a different band of latitude. This problem led to the invention of the universal astrolabe.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/0_0.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/0_0.jpg?w=178\" alt=\"\" class=\"wp-image-9886\"></a><figcaption class=\"wp-element-caption\">Full-page figure of the rete of Blagrave’s Jewel (Peterborough A.8.13) <a href=\"https://cudl.lib.cam.ac.uk/search?keyword=John%20Blagrave&amp;page=1\">For more illustration from The Mathematical Jewel go here</a></figcaption></figure>\n\n\n\n<p>The earliest known universal astrolabes are attributed to Abū Isḥāq Ibrāhīm ibn Yaḥyā al-Naqqāsh al-Zarqālī al-Tujibi (1029-1100), known simply as al-Zarqālī and in Latin as Arzachel, an Arabic astronomer, astrologer, and instrument maker from Al-Andalus, and another contemporary Arabic astronomer, instrument maker from Al-Andalus, Alī ibn Khalaf: Abū al‐Ḥasan ibn Aḥmar al‐Ṣaydalānī or simply Alī ibn Khalaf, about whom very little is known. In the<em> Biographical Encyclopedia of Astronomers</em> (Springer Reference, 2007, pp. 34-35) Roser Puig has this to say about the two Andalusian instrument makers: </p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>ʿAlī ibn Khalaf is the author of a treatise on the use of the <em>lámina universal</em> (universal plate) preserved only in a Spanish translation included in the <em>Libros del Saber de Astronomía</em> (III, 11–132), compiled by the Spanish King Alfonso X. To our knowledge, the Arabic original is lost. ʿAlī ibn Khalaf is also credited with the construction of a universal instrument called <em>al‐asṭurlāb al‐maʾmūnī</em> in the year 1071, dedicated to al‐Maʾmūn, ruler of Toledo. </p>\n\n\n\n<p>The universal plate and the <em>ṣafīḥa</em> (the plate) of Zarqalī (devised in 1048) are the first “universal instruments” (<em>i.e.</em>, for all latitudes) developed in Andalus. Both are based on the stereographic meridian projection of each hemisphere, superimposing the projection of a half of the celestial sphere from the vernal point (and turning it) on to the projection of the other half from the autumnal point. However, their specific characteristics make them different instruments.</p>\n</blockquote>\n\n\n\n<p>Al-Zarqālī’s universal astrolabe was known as the Azafea in Arabic and as the Saphaea in Europe.</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><a href=\"https://thonyc.files.wordpress.com/2022/11/torre-calahorra-azafea-0944r.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/torre-calahorra-azafea-0944r.jpg?w=800\" alt=\"\" class=\"wp-image-9867\" width=\"800\" height=\"835\"></a><figcaption class=\"wp-element-caption\">A copy of al-Zarqālī’s astrolabe Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Much closer to Blagrave’s time, Gemma Frisius (1508–1555) wrote about a universal astrolabe, published as the <em>Medici ac Mathematici de astrolabio catholico liber quo latissime patientis instrumenti multiplex usus explicatur</em>, in 1556. Better known than Frisius’ universal instrument was that of his one-time Spanish, student Juan de Rojas y Samiento (fl. 1540-1550) published in his <em>Commentariorum in Astrolabium libri sex</em> in 1551.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/19224455493_4.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/19224455493_4.jpg?w=661\" alt=\"\" class=\"wp-image-9869\"></a></figure>\n\n\n\n<h1> </h1>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/19224455493_3.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/19224455493_3.jpg?w=999\" alt=\"\" class=\"wp-image-9871\"></a></figure>\n\n\n\n<p>Although he never really left his home town of Reading and his work was in English, Blagrave, like the other members of the English School of Mathematics, was well aware of the developments in continental Europe and he quotes the work of leading European mathematical practitioners in his <em>Mathematical Jewel</em>, such as the <a href=\"https://thonyc.wordpress.com/2018/04/25/the-influence-of-a-renaissance-mathematics-teacher/\">Tübingen professor of mathematics, Johannes Stöffler</a> (1452–1531), who wrote a highly influential volume on the construction of astrolabes, his <em>Elucidatio fabricae ususque astrolabii</em> originally published in 1513, which went through 16 editions up to 1620</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/17301759436_2.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/17301759436_2.jpg?w=768\" alt=\"\" class=\"wp-image-9875\"></a></figure>\n\n\n\n<p>or the works of Gemma Frisius, who was possibly the most influential mathematical practitioner of the sixteenth century. Blagrave’s <em>Mathematical Jewel</em> was based on Gemma Frisius <em>astrolabio catholico</em>.</p>\n\n\n\n<p>Blagrave’s <em>Mathematical Jewel</em> was obviously popular because <a href=\"https://thonyc.wordpress.com/2010/10/09/how-i-got-to-know-joseph-moxon-on-asking-the-right-questions/\">Joseph Moxon (1627–1691), England first specialist mathematical publisher</a>, cartographer, instrument, and globe maker republished it under the title:</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>The catholique planisphaer which Mr. Blagrave calleth the mathematical jewel briefly and plainly discribed in five books : the first shewing the making of the instrument, the rest shewing the manifold vse of it, 1. for representing several projections of the sphere, 2. for resolving all problemes of the sphere, astronomical, astrological, and geographical, 4. for making all sorts of dials both without doors and within upon any walls, cielings, or floores, be they never so irregular, where-so-ever the direct or reflected beams of the sun may come : all which are to be done by this instrument with wonderous ease and delight : a treatise very usefull for marriners and for all ingenious men who love the arts mathematical / by John Palmer … ; hereunto is added a brief description of the cros-staf and a catalogue of eclipses observed by the same I.P.</p>\n</blockquote>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/preview_00216603_001.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/preview_00216603_001.jpg?w=326\" alt=\"\" class=\"wp-image-9877\"></a><figcaption class=\"wp-element-caption\">Engraved frontispiece to John Palmer (ed.), ‘The Catholique Planispaer, which Mr Blagrave calleth the Mathematical Jewel’ (London, Joseph Moxon, 1658); woman, wearing necklace, bracelet, jewels in her hair, and a veil, and seated at a table, on which are a design of a mathematical sphere, a compass, and an open book; top left, portrait of John Blagrave, wearing a ruff; top right, portrait of John Palmer; top centre, an angel with trumpets.<br>Engraving David Loggan Source: British Museum</figcaption></figure>\n\n\n\n<p>John Palmer (1612-1679), who was apparently rector of Ecton and archdeacon of Northampton, is variously described as the author or the editor of the volume, which was first published in 1658 and went through sixteen editions up to 1973.</p>\n\n\n\n<p>Following <em>The Mathematical Jewel</em>, Blagrave published four further books on scientific instruments that we know of: </p>\n\n\n\n<p><em>Baculum Familliare, Catholicon sive Generale. A Booke of the making and use of a Staffe, newly invented by the Author, called the Familiar Staffe </em>(London, 1590)</p>\n\n\n\n<p><em>Astrolabium uranicum generale, a necessary and pleasaunt solace and recreation for navigators … compyled by John Blagrave </em>(London, 1596)</p>\n\n\n\n<p><em>An apollogie confirmation explanation and addition to the Vranicall astrolabe </em>(London, 1597)</p>\n\n\n\n<p>None of these survive in large numbers.</p>\n\n\n\n<p> Blagrave also manufactured sundials and his fourth instrument book is about this: </p>\n\n\n\n<p><em>The art of dyalling in two parts</em> (London, 1609)</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/2007_nyr_01820_0042_000015307.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/2007_nyr_01820_0042_000015307.jpg?w=512\" alt=\"\" class=\"wp-image-9880\"></a><figcaption class=\"wp-element-caption\"><a href=\"https://www.christies.com/en/lot/lot-4890142\">Source</a></figcaption></figure>\n\n\n\n<p>Here there are considerably more surviving copies and even a modern reprint by Theatrum Orbis Terrarum Ltd., Da Capo Press, Amsterdam, New York, 1968.</p>\n\n\n\n<p>People who don’t think about it tend to regard books on dialling, that is the mathematics of the construction and installation of sundials, as somehow odd. However, in this day and age, when almost everybody walks around with a mobile phone in their pocket with a highly accurate digital clock, we tend to forget that, for most of human history, time was not so instantly accessible. In the Early Modern period, mechanical clocks were few and far between and mostly unreliable. For time, people relied on sundials, which were common and widespread. From the invention of printing with movable type around 1450 up to about 1700, books on dialling constituted the largest genre of mathematical books printed and published. Designing and constructing sundials was a central part of the profession of mathematical practitioners. </p>\n\n\n\n<p>As well as the books there is one extant map:</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>Noua orbis terrarum descriptio opti[c]e proiecta secundu[m]q[ue] peritissimos Anglie geographos multis ni [sic] locis castigatissima et preceteris ipsiq[ue] globo nauigationi faciliter applcanda [sic] per Ioannem Blagrauum gen[er]osum Readingensem mathesibus beneuolentem Beniamin Wright Anglus Londinensis cµlator anno Domini 1596 </p>\n</blockquote>\n\n\n\n<p>This is described as:</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>Two engraved maps, the first terrestrial, the second celestial (“Astrolabium uranicum generale …”). Evidently intended to illustrate Blagrave’s book “Astrolabium uranicum generale” but are not found in any copy of the latter.<br>The original is in the Bodleian Library.</p>\n</blockquote>\n\n\n\n<p>When he died in 1611, Blagrave was buried in the St Laurence Church in Reading with a suitably mathematical monument. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/john_blagrave_monument_drawing.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/john_blagrave_monument_drawing.jpg?w=640\" alt=\"\" class=\"wp-image-9882\"></a><figcaption class=\"wp-element-caption\">Blagrave is depicted surrounded by allegorical mathematical figures, with five women each holding the five platonic solids and Blagrave (in the center) depicted holding a globe and a quadrant.<br>The monument was the work of the sculptor Gerard Christmas (1576–1634), who later in life was appointed carver to the navy. It is not known who produced the drawing of the monument. </figcaption></figure>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/blagrave_armillary-2.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/blagrave_armillary-2.jpg?w=1024\" alt=\"\" class=\"wp-image-9884\"></a><figcaption class=\"wp-element-caption\">Modern reconstruction of the armillary sphere from the cover of The Mathematical Jewel created by <a href=\"https://www.davidharber.co.uk/sundials/bronze/blagrave.htm\">David Harber</a> a descendent of John Blagrave</figcaption></figure>\n\n\n\n<p>Blagrave was a minor, but not insignificant, participant in the mathematical community in England in the late sixteenth century. His work displays the typical Renaissance active interest in the practical mathematical disciplines, astronomy, navigation, surveying, and dialling. He seems to have enjoyed a good reputation and his <em>Mathematical Jewel</em> appears to have found a wide readership.  </p>\n"
}