{
  "title":"Renaissance science – XLVI",
  "date":"2022-11-02T10:34:59.000000Z",
  "author":null,
  "id":"http://thonyc.wordpress.com/?p=9827",
  "link":"https://thonyc.wordpress.com/2022/11/02/renaissance-science-xlvi/",
  "content":"\n<p>One area that is not usually counted among the sciences is cryptography, lying as it does, in this day and age, between, logic, mathematics, and informatics. In earlier times it is perhaps best viewed as a part of logic. Perhaps surprisingly, cryptography underwent a major development during the Renaissance provoked by an earlier development in the hands of Islamicate scholars.</p>\n\n\n\n<p>Cryptography means literally hidden writing, coming from the Greek <em>kryptos</em> meaning hidden and <em>graphia</em>meaning write, express in written characters, so codes. We have very little evidence of the use of codes by the ancient Egyptians, Babylonians, or Greeks, although it can be assumed that they did so. It is known that the ancient Greeks sent secret messages by shaving the head of a slave, writing, or tattooing the message on their skull, and then waiting until the hair grew back. Not really encryption and anything but high-speed communication.</p>\n\n\n\n<p>The most well-known system of encryption from antiquity is the Caesar cipher, used by Julius Caesar in his correspondence. This is a very simple substitution code in which each letter in the plain text is replaced by the letter so many places before or after it in the alphabet. Up till the Middle Ages, in Europe all codes were some form of simple substitution code.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/caesar_cipher_left_shift_of_3.svg_.png\"><img src=\"https://thonyc.files.wordpress.com/2022/11/caesar_cipher_left_shift_of_3.svg_.png?w=440\" alt=\"\" class=\"wp-image-9829\"></a><figcaption class=\"wp-element-caption\">The action of a Caesar cipher is to replace each plaintext letter with a different one a fixed number of places down the alphabet. The cipher illustrated here uses a left shift of three, so that (for example) each occurrence of E in the plaintext becomes B in the ciphertext: Wikipedia</figcaption></figure>\n\n\n\n<p>The first significant work on cryptography was written the Arabic philologist Abu ‘Abd ar-Raḥmān al-Khalīl ibn Aḥmad ibn ‘Amr ibn Tammām al-Farāhīdī al-Azdī al-Yaḥmadī (718–786 CE) known as Al-Farāhīdī or Al-Khalīl. His book <em>Kitab al-Muamma </em>(<em>Book of Cryptographic</em> <em>Messages</em>), which has been lost, presents the use of permutations and combinations to list all possible Arabic words with and without vowel. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/1920px-d981d8b1d8a7d987d98ad8afd98a-1.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/1920px-d981d8b1d8a7d987d98ad8afd98a-1.jpg?w=694\" alt=\"\" class=\"wp-image-9833\"></a><figcaption class=\"wp-element-caption\">Sculpture of al-Farahidi in Basra Source: Wikimedia Commons<br></figcaption></figure>\n\n\n\n<p>Al-Khalīl’s book influenced the work on cryptography by the Arabic polymath Abū Yūsuf Yaʻqūb ibn ʼIsḥāq aṣ-Ṣabbāḥ al-Kindī (c. 801–873), whose theory of radiations played a significant role in the history of optics. In his book <em>Risāla fī Istikhrāj al-Kutub al-Mu’ammāh</em> (<em>On Extracting Obscured Correspondence</em>), al-Kindī introduced the concept of frequency analysis, which made all simple substitute codes accessible to solution. He wrote: </p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>One way to solve an encrypted message, if we know its language, is to find a different plaintext of the same language long enough to fill one sheet or so, and then we count the occurrences of each letter. We call the most frequently occurring letter the “first”, the next most occurring letter the “second”, the following most occurring letter the “third”, and so on, until we account for all the different letters in the plaintext sample. Then we look at the cipher text we want to solve and we also classify its symbols. We find the most occurring symbol and change it to the form of the “first” letter of the plaintext sample, the next most common symbol is changed to the form of the “second” letter, and the following most common symbol is changed to the form of the “third” letter, and so on, until we account for all symbols of the cryptogram we want to solve.</p>\n</blockquote>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/al-kindi_cryptographic.png\"><img src=\"https://thonyc.files.wordpress.com/2022/11/al-kindi_cryptographic.png?w=327\" alt=\"\" class=\"wp-image-9834\"></a><figcaption class=\"wp-element-caption\">The first page of al-Kindi’s manuscript “On Deciphering Cryptographic Messages”, containing the oldest known description of cryptanalysis by frequency analysis. Source: Wikimedia Commons<br></figcaption></figure>\n\n\n\n<p>Ai-Kindī’s explication of frequency analysis meant that a new more complex approach to encryption was necessary, and this was first delivered by the Renaissance polymath Leon Battista Alberti (1404–1472), whom we have already met in this series in the episodes <a href=\"https://thonyc.wordpress.com/2021/04/07/renaissance-science-vii/\">on linear perspectiv</a>e and <a href=\"https://thonyc.wordpress.com/2021/07/01/renaissance-science-xiii/\">architecture</a>. Alberti is one of those people, who deserves to be much better known than he is. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/cdm_presunto_autoritratto_di_leon_battista_alberti_white_ground.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/cdm_presunto_autoritratto_di_leon_battista_alberti_white_ground.jpg?w=727\" alt=\"\" class=\"wp-image-9836\"></a><figcaption class=\"wp-element-caption\">Leon Battista Alberti Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Alberti published the earliest known description of a polyalphabetic cipher in his <em>De</em> <em>componendis cifris</em> in 1467. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/de_cifris_incipit_1.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/de_cifris_incipit_1.jpg?w=736\" alt=\"\" class=\"wp-image-9838\"></a><figcaption class=\"wp-element-caption\"><em>De</em> <em>componendis cifris</em> frontispiece Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>In a polyalphabetic cipher not one but several substitution alphabets are used for different sections of the text, changing at random intervals, with a signal in the text to indicate for the reader deciphering the code of the alphabetical change. A polyalphabetic cipher is, in theory, not susceptible to frequency analysis; this, of course, is only true if one doesn’t know the method. In order to implement his method Alberti invented his cipher disc, which he explained in a letter was inspired by the recent invention of the movable type printing press. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/alberti_cipher_disk.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/alberti_cipher_disk.jpg?w=980\" alt=\"\" class=\"wp-image-9840\"></a><figcaption class=\"wp-element-caption\">Alberti Cipher disc Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>How the whole thing is supposed to function is described by Alberti in his <em>De</em> <em>componendis cifris</em>: </p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><em>Chapter XIV.</em> <em>I will first describe the movable index. Suppose that we agreed to use the letter k as an index letter in the movable disk.</em> <em>At the moment of writing I will position the two disks of the formula as I wish, for example juxtaposing the index letter to capital B, with all other small letters corresponding to the capital letters above them. When writing to you, I will first write a capital B that corresponds to the index k in the formula. This means that if you want to read my message you must use the identical formula you have with you, turning the movable disk until the letter B corresponds to the index k. Thus all small letters in the ciphertext will receive the meaning and sound of those above them in the stationary disk. When I have written three or four words I will change the position of the index in our formula, turning the disk until, say, the index k is under capital R.</em> <em>Then I will write a capital R in my message and from this point onward the small k will no longer mean B but R, and the letters that follow in the text, will receive new meanings from the capital letters above them in the stationary disk. When you read the message you have received, you will be advised by the capital letter, which you know is only used as a signal, that from this moment the position of the movable disk and of the index has been changed.</em> <em>Hence, you will also place the index under that capital letter, and in this way you will be able to read and understand the text very easily. The four letters in the movable disk facing the four numbered cells of the outer ring will not have, so to speak, any meaning by themselves and may be inserted as nulls within the text.</em> <em>However, if used in groups or repeated, they will be of great advantage, as I will explain later on.</em></p>\n</blockquote>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><em>Chapter XV.</em> <em>We can also choose the index letter among the capital letters and agree between us which of them will be the index.</em> <em>Let us suppose we chose the letter B as an index. The first letter to appear in the message will be a small one at will, say q.</em> <em>Hence, turning the movable disk in the formula you will place this letter under the capital B that serves as an index.</em> <em>It follows that q will take the sound and meaning of B.</em> <em>For the other letters we will continue writing in the manner described earlier for the movable index. When it is necessary to change the set up of the disks in the formula, then I will insert one, and no more, of the numeral letters into the message, that is to say one of the letters of the small disk facing the numbers which corresponds to, let’s say, 3 or 4, etc. Turning the movable disk I will juxtapose this letter to the agreed upon index B and, successively, as required by the logic of writing, I will continue giving the value of the capitals to the small letters.</em> <em>To further confuse the scrutinizers you can also agree with your correspondent that the capital letters intermingled in the message have the function of nulls and must be disregarded, or you may resort to similar conventions, which are not worth recalling.</em> <em>Thus changing the position of the index by rotating the movable disk, one will be able to express the phonetic and semantic value of each capital letter by means of twenty-four different alphabetic characters, whereas each small letter can correspond to any capital letter or to any of the four numbers in the alphabet of the stationary disk.</em> <em>Now I come to the convenient use of the numbers, which is admirable.</em></p>\n</blockquote>\n\n\n\n<p>I leave it to the reader to decipher Alberti’s instructions.</p>\n\n\n\n<p>Alberti was not the only Renaissance scholar to suggest the adoption of a polyalphabetic cipher. The German, Benedictine monk, Johannes Trithemius (1462–1516), born Johann Heidenberg, was Abbot of the Abbey of Sponheim and from 1506 of the St, James’ Abbey in Würzburg. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/trithemiuswhole.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/trithemiuswhole.jpg?w=385\" alt=\"\" class=\"wp-image-9842\"></a><figcaption class=\"wp-element-caption\">Tomb relief of Johannes Trithemius by Tilman Riemenschneider Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Trithemius was a polymath active as a lexicographer, chronicler, cryptographer, but above all he is known as an occultist. As I have noted in an earlier episode in this series <a href=\"https://thonyc.wordpress.com/2021/12/03/renaissance-science-xxiv/\">the occult sciences played a significant part in Renaissance thought</a>. Trithemius is considered to have had a major influence on both Paracelsus (c. 1493–1541) and Heinrich Cornelius Agrippa von Nettesheim (1486–1535).</p>\n\n\n\n<p>Trithemius’ most famous work was his <em>Steganographia</em> (written c. 1499 but first published in 1606), which was initially thought to be about magic and was placed on the <em>Index Librorum Prohibitorum</em> (<em>List of Prohibited Books</em>) by the Catholic Church in 1609. In fact, the book was written in code and already in 1606, the first two volumes were shown to be about steganography (a word that Trithemius coined) and cryptography. Steganography is: </p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>The practice of hiding messages, so that the presence of the message itself is hidden, often by writing them in places where they may not be found until someone finds the secret message in whatever is being used to hide it. (def. Wiktionary). </p>\n</blockquote>\n\n\n\n<p>The third volume was, thought to be really about magic but has comparatively recently also shown to be about cryptography.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/trithemius-johannes-steganographia-johannes-saurius-1608.-digitized-photographic-reproduction-provided-by-the-herzog-august-bibliothek.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/trithemius-johannes-steganographia-johannes-saurius-1608.-digitized-photographic-reproduction-provided-by-the-herzog-august-bibliothek.jpg?w=686\" alt=\"\" class=\"wp-image-9844\"></a><figcaption class=\"wp-element-caption\">Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Trithemius also wrote his <em>Polygraphiae libri sex</em> (<em>Six books of polygraphia</em>), the first printed book on cryptography, a further text on steganography, which was published posthumously in 1518. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/polygraphiae.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/polygraphiae.jpg?w=640\" alt=\"\" class=\"wp-image-9846\"></a><figcaption class=\"wp-element-caption\">Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>This work contains a <em>progressive key</em> polyalphabetic cipher now known as the Trithemius cipher. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/vigenere_square_shading.svg_.png\"><img src=\"https://thonyc.files.wordpress.com/2022/11/vigenere_square_shading.svg_.png?w=1024\" alt=\"\" class=\"wp-image-9848\"></a><figcaption class=\"wp-element-caption\"><em>Unlike Alberti’s cipher, which switched alphabets at random intervals, Trithemius switched alphabets for each letter of the message. He started with a tabula recta, a square with 26 letters in it (although Trithemius, writing in Latin, used 24 letters). Each alphabet was shifted one letter to the left from the one above it, and started again with A after reaching Z (see table).</em> Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Our third Renaissance cryptographer was Blaise de Vigenère (1523–1596) a French, diplomat, cryptographer, translator, and alchemist. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/vigenere.png\"><img src=\"https://thonyc.files.wordpress.com/2022/11/vigenere.png?w=428\" alt=\"\" class=\"wp-image-9851\"></a><figcaption class=\"wp-element-caption\">Blaise de Vigenère Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Although, he created a polyalphabetic cipher, the one that bears his name was actually first described by Giovan Battista Bellaso (1505–?) an Italian cryptographer in his <em>La Cifra del Sig. Giovan Battista Belaso</em> published in 1553. Bellaso went on to publish a second book, <em>Novi et singolari modi di cifrare</em>, in 1555 and a third one <em>Il vero modo di scrivere in cifra,</em> in 1565. Vigenère published his polyalphabetic cipher, first in 1586, in his<em> Traicté des Chiffres ou Secrètes Manières d’Escrire</em>. 1586. Both men’s ciphers were based on a so-called auto key but differed in detail. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/11/bellaso_giovanni_battista_e28093_cifra_1553_e28093_beic_11404213.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/11/bellaso_giovanni_battista_e28093_cifra_1553_e28093_beic_11404213.jpg?w=704\" alt=\"\" class=\"wp-image-9854\"></a><figcaption class=\"wp-element-caption\">Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>An autokey cipher (also known as the autoclave cipher) is a cipher that incorporates the message (the plaintext) into the key. The key is generated from the message in some automated fashion, sometimes by selecting certain letters from the text or, more commonly, by adding a short primer key to the front of the message. (Def. Wikipedia). </p>\n</blockquote>\n\n\n\n<p>The Vigenère cipher was thought to be unbreakable and in fact Charles Lutwidge Dodgson (better known as Lewis Carroll), a very competent logician, said that it was unbreakable in 1868, <a href=\"https://thonyc.wordpress.com/2013/12/26/christmas-trilogy-2013-part-ii-on-her-majestys-secret-service/\">unaware that Charles Babbage had already broken it earlier but had not published his results. </a>The first to publish a general system to solve polyalphabetic ciphers, including the Vigenère cipher, was the German soldier, cryptographer, and archaeologist, Friedrich Wilhelm Kasiski (1805–1881) in his Die Geheimschriften und die Dechiffrir-Kunst (Secret Writing and the Art of Deciphering) in 1863, a publication that, at the time, went largely unnoticed. It was first in the nineteenth century that the art of cryptography evolved past the innovations of the Renaissance cryptographers, Alberti, Trithemius, Vigenère, and Bellaso. </p>\n"
}