{
  "title":"Renaissance science – XLV",
  "date":"2022-10-19T06:18:09.000000Z",
  "author":null,
  "id":"http://thonyc.wordpress.com/?p=9765",
  "link":"https://thonyc.wordpress.com/2022/10/19/renaissance-science-xlv/",
  "content":"\n<p>70.8% of the earth’s surface is covered by the world ocean; we normally divide it up–Atlantic Ocean, Pacific Ocean, Indian Ocean, etc.– but they are all interconnected in one giant water mass. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/oceanus.png\"><img src=\"https://thonyc.files.wordpress.com/2022/10/oceanus.png?w=407\" alt=\"\" class=\"wp-image-9767\"></a><figcaption class=\"wp-element-caption\">The world ocean Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Only 29.2% of the surface is land but, on that land, there are many enclosed seas, lakes, ponds, rivers, and streams so there is even more water. The human body is about 60% water, and humans are sometimes referred to as a water-based life form. The statistics are variable, but a healthy human can exist between one and two months without food but only two to four days without water. Brought to a simple formular, water is life.</p>\n\n\n\n<p>When humans first began to settle, they did so on or near sources of water–lake shores, streams, rivers, natural springs. Where there was no obvious water supply people began to dig wells, there are wells dating back to 6500 BCE. As settlements grew the problem of water supply and sewage disposal became important and the profession of water manager or hydraulic engineer came into existence. Channelling of fresh water and sewage disposal, recycling of wastewater etc. Initial all of this was powered by gravity but over time other systems of moving water, such as the bucket water wheel or noria were developed for lifting water from one channel into another, appearing in Egypt around the fourth century BCE.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/nora_hidraulica_pormenor.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/10/nora_hidraulica_pormenor.jpg?w=1024\" alt=\"\" class=\"wp-image-9770\"></a><figcaption class=\"wp-element-caption\">Close-up of the Noria do Mouchão Portugal Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Probably the most spectacular surviving evidence of the water management in antiquity are the massive aqueducts built by Roman engineers to bring an adequate supply of drinking water to the Roman settlements. Alone the city of Rome had eleven aqueducts built between 312 BCE and 226 CE, the shortest of which the Aqua Appia from 312 BCE was 16.5 km long with a capacity of 73,000 m<sup>3</sup> per day and the longest the Aqua Anio Novus from 52 CE was 87 km long with a capacity of 189,000 m<sup>3</sup> per day. The Aqua Alexandrina from 226 CE was only 22 km long but had a capacity of 120,00 to 320,000 m<sup>3</sup> per day.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/2880px-panorama_view_of_aqueduct_of_segovia_in_2014.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/10/2880px-panorama_view_of_aqueduct_of_segovia_in_2014.jpg?w=1024\" alt=\"\" class=\"wp-image-9774\"></a><figcaption class=\"wp-element-caption\">Panorama view of the Roman Aqueduct of Segovia in 2014 Built first century CE originally 17 kilometres long Source Wikimedia Commons</figcaption></figure>\n\n\n\n<p>The simplest water clock or clepsydra, a container with a hole in the bottom where the water was driven out by the force of gravity dates back to at least the sixteenth century BCE. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/a-reconstruction-of-the-water-clock-used-in-ancient-greece-museum-of-ancient.png\"><img src=\"https://thonyc.files.wordpress.com/2022/10/a-reconstruction-of-the-water-clock-used-in-ancient-greece-museum-of-ancient.png?w=850\" alt=\"\" class=\"wp-image-9775\"></a><figcaption class=\"wp-element-caption\">A reconstruction of the water clock used in ancient Greece (Museum of Ancient Agora/Athens) Figure 5: Water Clock/Clepsydra <a href=\"https://www.researchgate.net/figure/A-reconstruction-of-the-water-clock-used-in-ancient-Greece-Museum-of-Ancient_fig2_352508462\">Source</a></figcaption></figure>\n\n\n\n<p>It evolved over the centuries with complex feedback mechanism to keep the water level and thus the flow constant. Water clocks reach an extraordinary level of sophistication as illustrated by the Astronomical Clock Tower of Su Song (1020–1101 CE) in China </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/clock_tower_from_su_songs_book_desmear.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/10/clock_tower_from_su_songs_book_desmear.jpg?w=681\" alt=\"\" class=\"wp-image-9777\"></a><figcaption class=\"wp-element-caption\">The original diagram of Su’s book showing the inner workings of his clocktower Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>and the Elephant Clock invented by the Islamic engineer al-Jazari (1136-1206). Al-Jazari invented many water powered devices.  </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/al-jazari_elephant_clock.png\"><img src=\"https://thonyc.files.wordpress.com/2022/10/al-jazari_elephant_clock.png?w=654\" alt=\"\" class=\"wp-image-9779\"></a><figcaption class=\"wp-element-caption\">Al-Jazari’s elephant water clock (1206) Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Much earlier the Greek engineer Hero of Alexandria (c. 10–c. 70 CE), as well as numerous devices driven by wind and steam, invented a stand-alone fountain that operates under self-contained hydro-static energy, known as Heron’s Fountain. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/1280px-herons_fountain.svg_.png\"><img src=\"https://thonyc.files.wordpress.com/2022/10/1280px-herons_fountain.svg_.png?w=558\" alt=\"\" class=\"wp-image-9781\"></a><figcaption class=\"wp-element-caption\">Diagram of a functioning Heron’s fountain Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>All of the above is out of the realm of engineers. Another engineer Archimedes (c. 287–c. 212 BCE), is the subject of possibly the most well-known story in the history of science, one needs only utter the Greek word εὕρηκα (Eureka) to invoke visions of crowns of gold, bathtubs, and naked bearded man running through the streets shouting the word. In fact, you won’t find this story anywhere in Archimedes not insubstantial writings. The source of the story is in <em>De architectura</em> by Vitruvius (C. 80-70–after c. 15 BCE), so two hundred years after Archimedes lived. You can read the original in translation below:</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/telescope-literature20221009_13510429_39.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/10/telescope-literature20221009_13510429_39.jpg?w=714\" alt=\"\" class=\"wp-image-9783\"></a><figcaption class=\"wp-element-caption\">Vitruvius “Ten Books on Architecture”, Ed. Ingrid D. Rowland &amp; Thomas Noble Howard, (CUP, 1999) p. 108</figcaption></figure>\n\n\n\n<p>However, Archimedes did write a book <em>On Floating Bodies</em>, which now only exists partially in Greek but in full in a medieval Latin translation. This book is the earliest known work of the branch of physics known as hydrostatics. It contains clear statement of two fundamental principles of hydrostatics, Firstly Archimedes’ principle:</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>Any body wholly or partially immersed in a fluid experiences an upward force (buoyancy) equal to the weight of the fluid displaced</p>\n</blockquote>\n\n\n\n<p>Secondly the principle of floatation:</p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>Any floating object displaces its own weight of fluid.</p>\n</blockquote>\n\n\n\n<p>As well these two fundamental principles, he also discovered that a submerged object displaces a volume of water equal to its own volume. This is the discovery that led to the legendary of mythical Eureka incident. A crown of pure gold would have a different displacement volume to one of a gold and silver amalgam. The bath story was, as we will see later, highly implausible because it would be very, very difficult to measure the difference in the displaced volumes of water of the two crowns.</p>\n\n\n\n<p>Whilst water management continued to develop through out the Middle Ages, with the invention of every better water mills etc., In the Renaissance the profession hydraulic engineer saw developments in two areas. Firstly, the increase in wealth and the development of residences saw the emergence of the Renaissance Garden. Large ornamental gardens the usually featured extensive and often spectacular water features. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/villa_deste_fountain_and_pools.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/10/villa_deste_fountain_and_pools.jpg?w=1024\" alt=\"\" class=\"wp-image-9785\"></a><figcaption class=\"wp-element-caption\">Garden of Villa d’Este Tivoli (1550–1572) Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>The Renaissance mathematici employed by potentates and aristocrats were often expected to serve as hydraulic engineers alongside their other functions as instrument makers, astrologers etc. Secondly the major increase in mining for precious and semi-precious metals meant ever deeper mines, which brought with it the problem of pumping water out of the mines.</p>\n\n\n\n<p>Archimedes’ <em>On Floating Bodies</em> was translated into Latin by William of Moerbeke (c. 1215–1286) in the thirteenth century and no complete Greek manuscript is known to exist. This translation was edited by Nicolò Tartaglia Fontana (c. 1506–1557) and published in print along with other works by Archimedes by Venturino Ruffinelli in Venice in 1543, as<em> Opera Archimedis Syracvsani philosophi et mathematici ingeniosissimi</em></p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/965075_00009_944.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/10/965075_00009_944.jpg?w=663\" alt=\"\" class=\"wp-image-9787\"></a><figcaption class=\"wp-element-caption\"><strong>Opera Archimedis Syracvsani philosophi et mathematici ingeniosissimi</strong>, <em>1543</em> <a href=\"https://exhibits.museogalileo.it/archimedes/image/OperaArchimedisSyracusaniPhilosophiEtMathematiciIngeniosissimiNicolaumTartaleamFacsimile.html\">Source</a></figcaption></figure>\n\n\n\n<p>The Nürnberger theologian and humanist Thomas Venatorius (1488–1551) edited the first printed edition of the Greek manuscripts of Archimedes, in a bilingual Greek/Latin edition, which was published in Basel by Johann Herwagen in 1544. The Greek manuscript had been brought to Nürnberg by the humanist scholar, Willibald Pirckheimer (1470–1530) from Rome and the Latin translation by Jacopo da Cremona (fl. 1450) was from the manuscript collection of Regiomontanus (1436-1476). </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/be_1076_0001.tif.jpeg\"><img src=\"https://thonyc.files.wordpress.com/2022/10/be_1076_0001.tif.jpeg?w=643\" alt=\"\" class=\"wp-image-9789\"></a><figcaption class=\"wp-element-caption\"><a href=\"https://collections.thulb.uni-jena.de/receive/HisBest_cbu_00000067?derivate=HisBest_derivate_00001568\">Source</a></figcaption></figure>\n\n\n\n<p>Venatorius claimed, in the foreword to the Archimedes edition to have studied mathematics under <a href=\"https://thonyc.wordpress.com/2010/05/15/circumnavigating-the-globe/\">Johannes Schöner (1577–1547) </a>but if then as a mature student in Nürnberg and not as a schoolboy. </p>\n\n\n\n<p>A reconstruction of <em>On Floating Bodies</em> was published by Federico Commandino (1509–1575) in Bologna in 1565. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/med_998_front_libro_1_944.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/10/med_998_front_libro_1_944.jpg?w=757\" alt=\"\" class=\"wp-image-9791\"></a><figcaption class=\"wp-element-caption\"><a href=\"https://mostre.museogalileo.it/archimede/immagine/ArchimedisDeIisQuaeVehunturAquaLibriDuoFedericoCommandinoFacsimile.html\">Source</a></figcaption></figure>\n\n\n\n<p>Tartaglia, who also produced an Italian edition of <em>On floating Bodies</em>, was the first Renaissance scholar to address Archimedes work on hydrostatics. It did not play a major role in his own work, but he was the first to draw attention to the relationship between the laws of fall and Archimedes’ thoughts on flotation. Tartaglia’s work was read by his one-time student, Giambattista Benedetti ((1530–1590), Galileo (1564–1642), and Simon Stevin (1548–1620), amongst other, and was almost certainly the introduction to Archimedes’ text for all three of them. </p>\n\n\n\n<p>Benedetti replaced Aristotle’s concepts of fall in a fluid directly with Archimedes’ ideas in his work on the laws of fall, equating resistance in the fluid with Archimedes’ upward force or buoyancy. This led him to his anticipations of Galileo’s work on the laws of fall. </p>\n\n\n\n<p>Moving onto Simon Stevin, who wrote a major work on hydrostatics, his <em>De Beghinselen des Waterwichts</em> (<em>Principles on the weight of water</em>) in 1586 and a never completed practical <em>Preamble to the Practice of Hydrostatics</em>. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/sce00082.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/10/sce00082.jpg?w=965\" alt=\"\" class=\"wp-image-9793\"></a><figcaption class=\"wp-element-caption\"><a href=\"https://deepblue.lib.umich.edu/bitstream/handle/2027.42/144576/science.html\">Source</a></figcaption></figure>\n\n\n\n<p>One of Benedetti’s major works, <em>Demonstratio propotionummotuum localiumcontra Aristotilem et omnes philosphos</em> (1554) had been plagiarised by the French mathematician Jean Taisnier (1598–1562) <em>Opusculum perpetua memoria dignissimum, de natura magnetis et ejus effectibus, Item de motu continuo</em> (1562) and it was this that Stevin read rather than Benedetti’s original. Taisnier’s plagiarism was also translated into English by Richard Eden (c. 1520–1576) an alchemist and promotor of overseas exploration. Stevin a practical engineer ignored or rejected the equivalence between the laws of fall and the principle of buoyancy, concentrating instead on the relationship between flotation and the design of ship’s hulls. His major contribution was the so-called hydrostatic paradox often falsely attributed to Pascal. This states that the downward pressure exerted by a fluid in a vessel is only dependent on its depth and not on the width or length of the vessel. </p>\n\n\n\n<p>Of the three, Galileo is most well-known for his adherence to Archimedes. He clearly stated that in his natural philosophy he had replaced Aristotle with Archimedes as his ancient Greek authority, and this can be seen in his work. His very first work was an essay <em>La Bilancetta </em>(<em>The Little Balance</em>) written in 1586, but first published posthumously in 1644, which he presented to both Guidobaldo del Monte (1545–1607) and Christoph Clavius (1538–1612), both leading mathematical authorities, in the hope of winning their patronage. He was successful in both cases. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/med_1133_bilanc_front_300.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/10/med_1133_bilanc_front_300.jpg?w=300\" alt=\"\" class=\"wp-image-9795\"></a><figcaption class=\"wp-element-caption\">Galileo Galilei, <em>La bilancetta</em>, in <em>Opere di Galileo Galilei</em> (facsimile) <a href=\"https://exhibits.museogalileo.it/archimedes/object/GalileoGalileiBilancettaOpereGalileoGalileiFacsimile.html\">Source:</a></figcaption></figure>\n\n\n\n<p>Realising, that the famous bathtub story couldn’t actually have worked, Galileo tried to recreate how Archimedes might actually have done it. He devised a very accurate hydrostatic balance that would have made the discovery feasible. </p>\n\n\n\n<p>Later in life, when firmly established as court philosopher in Florence, Galileo was called upon by Cosimo II Medici to debate the principles of flotation with the Aristotelian physicist Lodovico delle Columbe (c. 1565–after 1623), as after dinner entertainment. As I have written before one of Galileo’s principal functions at the court in Florence was to provide such entertainment as a sort of intellectual court jester. Galileo was judged to have carried the day and his contribution to the debate was published in Italian, as <em>Discorso intorno alle cose che stanno in su l’acqua, o che in quella si muovono</em>, (<em>Discourse on Bodies that Stay</em> <em>Atop Water, or Move in It</em>) in 1612. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/3999123.jpeg\"><img src=\"https://thonyc.files.wordpress.com/2022/10/3999123.jpeg?w=304\" alt=\"\" class=\"wp-image-9797\"></a><figcaption class=\"wp-element-caption\"><a href=\"https://www.e-rara.ch/zut/content/titleinfo/3999116/?lang=de\">Source</a></figcaption></figure>\n\n\n\n<p>As was his wont, Galileo mocked his Aristotelian opponent is his brief essay, which brought him the enmity of the Northern Italian Aristotelians. Although Galileo’s approach to the topic was Archimedean, he couldn’t explain everything and not all that he said was correct. However, this little work enjoyed a widespread reception and was influential.</p>\n\n\n\n<p>Our last Renaissance contribution to hydrostatics was made by Evangelista Torricelli (1608–1647), a student of Benedetto Castelli (1578–1643) himself a student of Galileo, and like Stevin’s work it came from the practical world rather than the world of science. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/evangelista_torricelli_by_lorenzo_lippi_circa_1647_galleria_silvano_lodi__due.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/10/evangelista_torricelli_by_lorenzo_lippi_circa_1647_galleria_silvano_lodi__due.jpg?w=762\" alt=\"\" class=\"wp-image-9799\"></a><figcaption class=\"wp-element-caption\">Evangelista Torricelli by Lorenzo Lippi Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>Torricelli was looking for a solution as to why a suction pump could only raise water to a hight of ten metres, as recounted in Galileo’s <em>Discorsi e Dimostrazioni Matematiche, intorno a due nuove scienze</em> (<em>Discourses and Mathematical Demonstrations Relating to Two New Sciences</em>) (1638), a major problem for the expanding deep mining industry, which needed to pump water out of its mines. Torricelli in his investigations invented the Torricellian tube, later called the barometer, with which he demonstrated that there was a limit to the height of a column of liquid that the weight of the atmosphere, or air pressure, could support. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/nsrw_torricellis_experiment.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/10/nsrw_torricellis_experiment.jpg?w=480\" alt=\"\" class=\"wp-image-9801\"></a><figcaption class=\"wp-element-caption\">Torricelli’s experiment Source: Wikimedia Commons</figcaption></figure>\n\n\n\n<p>He also incidentally demonstrated the existence of a vacuum, something Aristotle said could not exist. </p>\n\n\n\n<p>Torricelli’s work marks the transition from Renaissance science to what is called modern science. Building on the work of Benedetti, Stevin, Galileo, and Torricelli, Blaise Pascal (1623–1662) laid some of the modern foundation of hydrodynamics and hydrostatics, having a unit for pressure named after him and being sometimes falsely credited with discoveries that were actually made in the earlier phase by his predecessors. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/blaise_pascal_versailles.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/10/blaise_pascal_versailles.jpg?w=860\" alt=\"\" class=\"wp-image-9803\"></a><figcaption class=\"wp-element-caption\">Painting of Pascal made by François II Quesnel for Gérard Edelinck in 1691. Source:Wikimedia Commons</figcaption></figure>\n"
}