{
  "title":"You Are History",
  "date":"2022-10-31T07:54:50.000000Z",
  "author":null,
  "id":"http://thonyc.wordpress.com/?p=9821",
  "link":"https://thonyc.wordpress.com/2022/10/31/you-are-history/",
  "content":"\n<p>Do you have children, grandchildren, nephews &amp; nieces, grandnephews &amp; grandnieces, the children of friends, age group 7–12, that you would like to give a book as a Christmas present. An entertaining but also educational book, a well written and beautifully illustrated book, a fascinating and intriguing book? Then look no further, I have the very thing for you. It’s Greg Jenner’s <em>You Are History</em>, illustrated by Jenny Taylor. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://thonyc.files.wordpress.com/2022/10/you-are-history20221029_10370696_01.jpg\"><img src=\"https://thonyc.files.wordpress.com/2022/10/you-are-history20221029_10370696_01.jpg?w=767\" alt=\"\" class=\"wp-image-9823\"></a></figure>\n\n\n\n<p>That’s historian Greg Jenner star of radio and TV, he’s part of the crew that magic <em>Horrible Histories</em> onto your TV screens, and mega podcast star with his <a href=\"https://www.bbc.co.uk/programmes/p07mdbhg/episodes/downloads\"><em>You’re Dead to Me</em>.</a> The book follows a child through its day, from being woken up by the alarm clock in the early morning to finally going to bed at night. At each station throughout the day the history of the everyday objects encountered is presented and explained is entertaining witty texts illustrated by wonderful pictures. Alarm clock, Toothpaste, letterbox, pencil case, chocolate, bicycle, cutlery, pyjamas, and, and, and, and, and … <strong>in total 137 objects</strong> that we encounter almost daily. This book is a winner. Greg is a serious historian, despite his love of bad jokes, and a little bird has told me that he has had everything fact checked by experts, so the child, who reads this delightful tome, is getting some solid history served up to them, as well as being entertained.</p>\n\n\n\n<p>The book is available from 3 November, so get your orders in now and delight that child in your life on Christmas Day, or any other day for that matter.  </p>\n"
}