{
  "title":"[Guide] How to install ECL on Windows 10",
  "date":"2021-08-30T15:59:38.000000-07:00",
  "author":"/u/Fibreman",
  "id":"t3_petce1",
  "link":"https://www.reddit.com/r/lisp/comments/petce1/guide_how_to_install_ecl_on_windows_10/",
  "content":"<div class=\"md\"><p>I needed a little bit more help than the info <a href=\"https://gitlab.com/embeddable-common-lisp/ecl/-/blob/master/INSTALL\">that was in here</a> to install ECL on my Windows Machine and I'm sure I'm not the only one. I've left some extra steps here that might be useful to someone else. </p> <p>As a side note... I had trouble installing ecl in the C:\\Program Files (I think b/c of the space in the name) so I ended up installing it in my home dir. I'm a linux guy so the command prompt is confusing for me :)</p> <p><strong>Getting ECL</strong></p> <ol> <li><p>Go to <a href=\"https://gitlab.com/embeddable-common-lisp/ecl/-/tree/master\">https://gitlab.com/embeddable-common-lisp/ecl/-/tree/master</a></p> <p>1a. Make sure you are on the master branch (unless you want the develop branch)</p></li> <li><p>Download the zip file by clicking the download button (next to blue clone button)</p></li> </ol> <p>​</p> <p><strong>Extracting ECL</strong></p> <ol> <li><p>I want it in a folder called home in C:\\home so I created a folder there called home. </p></li> <li><p>Extract the zip file to your chosen folder (in my case home)</p></li> </ol> <p>​</p> <p><strong>Visual Studio</strong></p> <p>Visual studio is needed to compile the files that you extracted </p> <ol> <li><p>Download Visual Studio <a href=\"https://visualstudio.microsoft.com/\">https://visualstudio.microsoft.com/</a></p></li> <li><p>Open Visual Studio</p></li> <li><p>If you don't have the developer command prompt in Tools &gt; Command Line &gt; Developer Command Prompt then..</p></li> <li><p>Open the Tools Tab</p></li> <li><p>Go to Extensions and Updates</p></li> <li><p>Search the market place for Visual Studio Command Prompt (devCmd)</p></li> <li><p>Download it. Close Visual Studio and restart.</p></li> <li><p>Open Visual Studio (RUN AS ADMINISTRATOR. If not it might not allow you to install ECL in the folder you want when you run the developer prompt)</p></li> <li><p>Open the Visual Studio command prompt in the Tools tab</p></li> <li><p>In the Command Prompt cd C:\\path\\to\\ecl-master or whatever the name of the unzipped folder was called</p></li> <li><p>cd to the msvc folder inside the unzipped ecl folder</p></li> <li><p>Type nmake and hit enter in the command prompt</p></li> <li><p>After that finishes run nmake install prefix=&quot;C:\\path\\to\\your\\desired folder&quot; ECL_WIN64=1 (I used ECL_WIN64 b/c it said that was the 64bit version in the INSTALL file)</p> <p>13a. ECL will install all files into the given prefix folder. If you don't a bunch of loose files in that folder make sure to specify a subfolder in your prefix path. I.E <em>C:\\Program Files\\ecl</em> instead of C:\\Program Files</p></li> </ol> <p>​</p> <p>Updating your Path variable so you can launch ecl from the cmd prompt</p> <p>1 Click the start button on your desk top</p> <ol> <li><p>Type the word &quot;path&quot;</p></li> <li><p>Click &quot;Edit the system environment variables&quot; result</p></li> <li><p>Click the Environment Variables button in the System Properties window</p></li> <li><p>Scroll through the System variables window and double click path</p></li> <li><p>Click the new button</p></li> <li><p>Type the path to your ecl folder with the ecl executable in it. In my case it's C:\\home\\ecl</p></li> <li><p>Save and close the window</p></li> <li><p>Open cmd prompt and type ecl then hit enter</p></li> <li><p>ECL should launch</p></li> <li><p>Type (quit) in the ECL repl to quit ;)</p></li> </ol> </div>   submitted by   <a href=\"https://www.reddit.com/user/Fibreman\"> /u/Fibreman </a>   to   <a href=\"https://www.reddit.com/r/lisp/\"> r/lisp </a> <br> <span><a href=\"https://www.reddit.com/r/lisp/comments/petce1/guide_how_to_install_ecl_on_windows_10/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/lisp/comments/petce1/guide_how_to_install_ecl_on_windows_10/\">[comments]</a></span>"
}