{
  "title":"Teach lisp to high schoolers?",
  "date":"2022-11-15T20:26:29.000000Z",
  "author":"/u/joshuacottrell",
  "id":"t3_yw8jgl",
  "link":"https://www.reddit.com/r/lisp/comments/yw8jgl/teach_lisp_to_high_schoolers/",
  "content":"<div class=\"md\"><p>Three questions (roughly):</p> <ol> <li>Would Lisp (any specific flavor (SBCL, Chez Scheme, Racket, etc.)) be a good fit for a beginner programming class?</li> <li>If lisp (or one of) is the &quot;best&quot; choice then what book should the class go through? I think SICP is too long and high level for the class. Is HtDP suitable for a short class, maybe not even finishing much of the book? <em>Realm of Racket</em> or <em>Racket Programming the Fun Way</em>? Would <a href=\"https://bootstrapworld.org/materials/fall2022/en-us/#BuildYourOwn\">Bootstrap world</a> be a better choice than a book? Or maybe choose specific <a href=\"https://scratch.mit.edu/\">Scratch</a> or <a href=\"https://code.org\">Code.org</a> tutorials/classes? Or a particular teaching language(s) in the Racket ecosystem?</li> <li>What book would you suggest in preparation for teaching the class, aside from the two above? I've seen <em>Don't Teach Coding: Until You Read This Book</em> recommended on <a href=\"https://racket-lang.org/books.html\">racket-lang books</a>. Any actual reviews of it? Don't bother defaming it, I've read <a href=\"https://www.reddit.com/r/Racket/comments/oeqiu5/dont_teach_coding_until_you_read_this_book/\">similar posts on reddit</a> and found them lacking actual interaction with the book (and lacking knowledge of who picks the title) as well as disrespectful to the author.</li> </ol> <p>Lots of background (actual context if you decide to answer one or more of the above):</p> <ul> <li>The class... <ul> <li>starts in early February.</li> <li>is a high school elective for students with very little or no programming experience.</li> <li>is expected to be 5 to 10 students.</li> <li>is only one hour, one day a week for 10 weeks.</li> </ul></li> <li>There's potential for further semesters of classes and lots of student-driven work outside the classroom but it shouldn't be required.</li> <li>I'm open to other languages but I personally enjoy lisp, et. al. much more so I'm thinking the students would too.</li> <li>I'm also open to doing two different languages by dividing the semester in two.</li> </ul> <p>Why did I ask <a href=\"/r/lisp\">/r/lisp</a>? I wanted to ask the Lisp community because of the familiarity with Racket and with ASL/DSL creation as a teaching aid. I've also been most helped by lisp and its advocates in my own learning about the place the languages in the broader scope of software engineering/developing/programming.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/joshuacottrell\"> /u/joshuacottrell </a>   to   <a href=\"https://www.reddit.com/r/lisp/\"> r/lisp </a> <br> <span><a href=\"https://www.reddit.com/r/lisp/comments/yw8jgl/teach_lisp_to_high_schoolers/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/lisp/comments/yw8jgl/teach_lisp_to_high_schoolers/\">[comments]</a></span>"
}