{
  "title":"Shared Future: What We’ve Learned So Far",
  "date":"2022-11-08T17:08:00.000000Z",
  "author":null,
  "id":"https://collabfund.com/blog/shared-future-what-weve-learned/",
  "link":"https://collabfund.com/blog/shared-future-what-weve-learned/",
  "content":"<p>We launched Collab’s <a href=\"https://sharedfuture.xyz/\">Shared Future</a> in March 2022. A lot has changed since then.</p>\n\n<p>The Russia-Ukraine war has led to severe energy shortfalls and skyrocketing energy prices. Supply chains have snarled even more, pushing inflation to double digits. The remedy—higher interest rates—then caused a funding contraction across the capital stack, making it harder for founders to raise venture funding.</p>\n\n<p>At the same time, the world has recommitted to the fight against climate change: the US passed $400B+ in climate funding across several bills, including the <a href=\"https://www.ctvc.co/inflation-reduction-acts-climate-tech-impact-111/\">IRA</a>; California and New York banned combustion-engine vehicles starting in 2035; and one of China’s main coal regions will invest $87B to construct 60 GW of carbon-free energy (the equivalent of 3 million solar panels).</p>\n\n<p>These changes—global and local, positive and negative—underscore the need for programs like Shared Future.</p>\n\n<h3 id=\"launching-shared-future\">Launching Shared Future</h3>\n\n<p>The impetus for Shared Future was to address the growing climate crisis – one that has only accelerated through record-breaking hurricanes, headline-grabbing droughts, and devastating wildfires.</p>\n\n<p>But we were also motivated by the less visible effects of climate change: encroaching insurance premiums for homeowners, temporary blackouts for families trying to stay warm in the winter, and once-in-a-generation heat waves that now bake cities year after year.</p>\n\n<p>We launched Shared Future because we knew that the tectonic shift required to limit climate change calls for an unprecedented wave of innovation. From Meta’s <a href=\"https://www.cnbc.com/2022/07/30/facebook-former-cto-mike-schroepfer-on-his-new-climate-change-focus.html\">former CTO</a> to new university graduates around the globe, the fight against climate change is drawing the best talent. True to Collab’s ethos, Shared Future is an opportunity to bet on the intersection of for-profit and for-good.</p>\n\n<p>That is why we structured Shared Future as an index fund of the most promising climate startups. We believe this vintage of climate founders, like the wave of social media, fintech and crypto entrepreneurs before them, will generate incredible returns. And we set up the fund to create an opportunity for Collaborative’s core funds to double down on the best of the best with additional funding.</p>\n\n<p>Modeled after the successful Covid-19 initiative <a href=\"https://fastgrants.org/\">Fast Grants</a>, the original vision for Shared Future was simple: An application form that would take entrepreneurs less than an hour to complete, programmatic funding decisions within 48 hours, bank wires following in 10 days or less. Collaborative raised $10 million, gathered a coalition of mission-aligned partners, and started funding companies. We were much more worried about missing out on supporting important work than looking silly. With a “Let’s-do-it!” attitude and an understanding we would learn along the way, we started funding companies in just a matter of weeks.</p>\n\n<h3 id=\"our-progress-to-date\">Our Progress to Date</h3>\n\n<p>We could not be more excited about what Shared Future has already achieved.</p>\n\n<p>First, we decided to fund a few cohorts of startups at leading innovation hubs like <a href=\"https://www.activate.org/fellowship\">Activate Fellows</a>, <a href=\"https://www.ycombinator.com/\">Y Combinator</a>, and <a href=\"https://airminers.org/\">Airminers</a>. At launch, our hypothesis was that innovation hubs would enable us to quickly and programmatically find top-quality entrepreneurs. Our Activate partnership demonstrates just how much value this model can generate: we offered 40+ slots to Activate companies this year, frequently collaborate on programming, and have even funded Activate alumni. Today, we see Shared Future as a ‘network of networks’ that will enable ‘collisions’ between the best founders, capital, and tools dedicated to solving climate change.</p>\n\n<p>Second, we are on track to meet our goal of backing 100 companies this year. We have allocated capital to 90+ and have already sent wires to 60+ startups. Examples of companies in our portfolio include:</p>\n\n<ul>\n  <li>\n    <p><a href=\"https://www.alga.bio/\">Alga Biosciences</a> has developed a kelp-based feed additive and a proprietary production method that reduces cow methane emissions by 95%. These results are not only best-in-class, but the feed additive can be produced at scale for a fraction of the cost of current alternatives.</p>\n  </li>\n  <li>\n    <p><a href=\"https://www.carboncrusher.io/\">Carbon Crusher</a> has pioneered a bitumen-free (meaning asphalt-free) road creation process that is cheaper, faster, and carbon-negative. The team is already operating in four countries in Europe and is looking to enter the US market this year.</p>\n  </li>\n  <li>\n    <p><a href=\"https://www.seabound.co/\">Seabound</a> is leading the charge to decarbonize shipping, a major contributor to climate change, by developing a ship-based carbon capture system. Since launch in late 2021, the team built 2 working prototypes, signed 6 letters of intent with major shipowners, and raised $4.6M in seed funding from Lowercarbon Capital, Y Combinator, Soma Capital, and others.</p>\n  </li>\n  <li>\n    <p><a href=\"https://www.phasebiolabs.com/\">Phase Biolabs</a> is making carbon negative chemicals and carbon neutral e-fuels from CO2 using fermentation. The team was recently accepted into the prestigious Breakthrough Fellows program.</p>\n  </li>\n  <li>\n    <p><a href=\"https://channingcopper.com/\">Channing St. Copper Co.</a> is on a mission to improve people’s lives through home electrification. Their first product is an induction electric range that does not require major electrical upgrades. This allows  homeowners and renters to easily access the superior cooking experience of induction as well as the personal and planetary health benefits that come from eliminating the toxic emissions created when burning fossil fuels in the home.</p>\n  </li>\n</ul>\n\n<p>Furthermore, we have seen clear examples of how Shared Future’s participation in a round enables companies to accelerate their funding – the definition of catalytic capital. One company, for example, struggled to raise a pre-seed round until investors found out that Collab had invested; after that, the team was able to quickly close &gt;$1M.</p>\n\n<p>Overall, we are thrilled that founders are seeking out Shared Future both because of the impact of the capital for their operations and what it means for their long-term journey.</p>\n\n<h3 id=\"what-surprised-us--where-were-doubling-down\">What Surprised Us &amp; Where We’re Doubling Down</h3>\n\n<p>As expected, Shared Future’s inaugural year has also been filled with the unexpected.</p>\n\n<p>First, we were blown away by the level of enthusiasm with which our initiative was received. Within hours after launching publicly, we received an extraordinary amount of requests to contribute to our efforts. This led us to identify a group of ‘accelerants:’ partners that can deliver exceptional value to our companies. Accelerants range from one of the largest mining companies in the world, which has offered to explore pilot opportunities with our portfolio founders, to highly successful founders that want to mentor new Shared Future leaders.</p>\n\n<p>Second, we were pleasantly surprised that our vision of a ‘network of networks’ has already started to materialize. For example, we recently connected an EV policy expert and a leading mileage-tracking company with our portfolio companies that are focused on this sector. We also saw an overwhelming response to our in-person event in San Francisco this July. The 70+ attendees made the room buzz with energy – and we’re now working on upcoming events.</p>\n\n<p>Third, we predicted upon launching Shared Future that similar initiatives would follow, which would require us to develop a value proposition beyond just rapid capital. This trend has been particularly true in climate tech, where dry powder continues to be abundant. Today, we are excited to see more Shared Future-like programs.</p>\n\n<p>As a result of similar capital coming online, we are doubling down on adding value to startups. This is also where we need to invest the most time and attention this coming quarter. This means fostering a strong, founder-driven community alongside the right set of tools and accelerants. We now invite Shared Future teams to Collab’s Wednesday ‘Founder Talks,’ wherein an experienced founder walks through their journey and what they’ve learned. We see teams that regularly attend Founder Talks ask for specific introductions. We want to replicate and augment such learning opportunities. Over the next two quarters we will continue to find ways to foster founder-to-founder introductions, programming, and general communication tools.</p>\n\n<h3 id=\"what-does-shared-future-tell-us-about-climate-funding-models\">What Does Shared Future Tell Us About Climate Funding Models?</h3>\n\n<p>Coupled with the desire to alleviate the climate crisis, Shared Future was born to address a set of challenges in the climate tech funding model.</p>\n\n<p>First, founders at the lab stage often struggle to make progress as quickly as they’d like because they cannot get funding; but they cannot get funding because they need to make progress. Second, funding climate tech startups has significantly more uncertainty than in other sectors, so many investors will only dip their toes in if an established investor signals interest first. Third, moving atoms and carbon molecules is inherently CapEx intensive, so startups need more funding and help than their software-only counterparts. Finally, most climate founders are first-time entrepreneurs, often coming from academic backgrounds, and would benefit greatly from tapping a high-quality network of like-minded leaders. Despite high-profile new climate tech funds announced over the past years, these challenges still ring true.</p>\n\n<h3 id=\"conclusion\">Conclusion</h3>\n\n<p>There is still much work to be done to support our existing companies and to identify the next batch.</p>\n\n<p>We are deeply grateful to our partners (<a href=\"https://www.sweetgreen.com/\">Sweetgreen</a>, <a href=\"https://goldhirshfoundation.org/\">Goldhirsh Foundation</a>, and <a href=\"https://www.banffadvisors.com/\">Banff Advisors</a>) as well as our LPs. Without your commitment and trust, Shared Future would not exist. As we continue to build, we hope to earn the worth of your partnership each and every day.</p>\n\n<p>In short, the Collab team has been hard at work to truly embody our mission of providing catalytic capital and support. We live for and are energized by finding the best climate tech founders. We believe that the next world-defining founder is out there, ready to leave the lab, waiting for a first check and the right partner to begin their journey. At Shared Future, we intend to be that first partner, ready to catalyze hundreds of climate solutions.</p>\n"
}