{
  "title":"Cumulative vs. Cyclical Knowledge",
  "date":"2022-10-27T20:55:00.000000Z",
  "author":null,
  "id":"https://collabfund.com/blog/cumulative-vs-cyclical-knowledge/",
  "link":"https://collabfund.com/blog/cumulative-vs-cyclical-knowledge/",
  "content":"<p>President James Garfield died because the best doctors in the country didn’t believe in germs, probing Garfield’s bullet wound after an assassination attempt with ungloved, unwashed fingers that almost certainly contributed to his fatal infection.</p>\n\n<p>It sounds crazy – 1881 wasn’t <em>that</em> long ago – but historian Candice Millard writes in her book <em>Destiny of the Republic</em> how controversial germ theory was to 19th-century doctors:</p>\n\n<blockquote>\n  <p>They found the notion of “invisible germs” to be ridiculous, and they refused to even consider the idea that they could be the cause of so much disease and death.</p>\n\n  <p>Even the editor of the highly respected Medical Record found more to fear than to admire in [antiseptic pioneer] Lister’s theory. “Judging the future by the past,” he wrote, “we are likely to be as much ridiculed in the next century for our blind belief in the power of unseen germs as our forefathers were for their faith in the influence of spirits.”</p>\n\n  <p>Not only did many American doctors not believe in germs, they took pride in the particular brand of filth that defined their profession.</p>\n\n  <p>They spoke fondly of the “good old surgical stink” that pervaded their hospitals and operating rooms, and they resisted making too many concessions even to basic hygiene … They believed that the thicker the layers of dried blood and pus, black and crumbling as they bent over their patients, the greater the tribute to their years of experience … They preferred, moreover, to rely on their own methods of treatment, which not infrequently involved applying a hot poultice of cow manure to an open wound.</p>\n</blockquote>\n\n<p>Even a child reading this today recognizes how insane this is. And it’s hardly an isolated example. Doctors used to <a href=\"https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(02)88719-0/fulltext\">prescribe chloroform</a> for asthma and cigarettes for hay fever. They <a href=\"https://bigthink.com/health/milk-transfusion/\">injected cow’s milk</a> into the veins of tuberculosis patients, hoping the fat would transform into white blood cells.</p>\n\n<p>Mercifully, we’ve moved on. We believe new crazy stuff, but not <em>that</em> crazy stuff. Everyone learned, those learnings were universally accepted and passed down the generations who are now better off because of it. Reading about medicine from 100 years ago makes you feel utterly disconnected from today’s world, like you’re reading about a different topic altogether.</p>\n\n<p>But take something like money.</p>\n\n<p>These lines were written 130 years ago by author William Dawson:</p>\n\n<blockquote>\n  <p>It would seem that the anxieties of getting money only beget the more torturing anxiety of how to keep it.</p>\n\n  <p>More lives have been spoiled by competence than by poverty; indeed, I doubt whether poverty has any effect at all upon a strong character, except as a stimulus to exertion.</p>\n\n  <p>The thing that is least perceived about wealth is that all pleasure in money ends at the point where economy becomes unnecessary. The man who can buy anything he covets values nothing that he buys.</p>\n</blockquote>\n\n<p>Or this, written by Earnest Hemingway in 1936:</p>\n\n<blockquote>\n  <p>He remembered poor Scott Fitzgerald and his romantic awe of [the rich] … He thought they were a special glamorous race and when he found they weren’t it wrecked him as much as any other thing that wrecked him.</p>\n</blockquote>\n\n<p>Or this, written by a lawyer in 1934, taking account of the bubble preceding the Great Depression:</p>\n\n<blockquote>\n  <p>In normal times the average professional man makes just a living and lives up to the limit of his income because he must dress well, etc. In times of depression he not only fails to make a living but has no surplus capital to buy bargains in stocks and real estate. I see now how very important it is for the professional man to build up a surplus in normal times. Without it he is at the mercy of the economic winds.</p>\n</blockquote>\n\n<p>Or this, describing the 1920s Florida real estate:</p>\n\n<blockquote>\n  <p>From 1919 to 1929, both forms of personal debt—mortgages and installment credit—soared. The volume of home mortgages more than tripled, and the amount of outstanding installment debt more than doubled.</p>\n</blockquote>\n\n<p>Or this <a href=\"https://www.theguardian.com/books/2015/mar/27/seneca-fat-cat-philosopher-emily-wilson-a-life\">account</a> of Seneca, who lived 2,000 years ago:</p>\n\n<blockquote>\n  <p>Enemies accused him of preying on affluent elderly people in the hope of being remembered in their wills, and of “sucking the provinces dry” by lending money at a steep rate of interest to those in the distant parts of the empire.</p>\n</blockquote>\n\n<p>It’s all so relatable. Like nothing has changed. We’ve always been asking the same questions, dealing with the same problems, and falling for the same false solutions. We probably always will.</p>\n\n<p>Reading old finance articles makes you feel like the ancient past was no different than today – the opposite feeling you get reading old medical commentary.</p>\n\n<p>Of course there are things we knew about medicine 200 years ago that were true and things we believed about money 100 years ago that were false. But in degree there is no comparison – there’s no financial equivalent of everyone denying germs only to eventually agree that it’s so obviously true it’s not worth debating.</p>\n\n<p>In some fields our knowledge is seamlessly passed down across generations. In others, it’s fleeting. To paraphrase investor Jim Grant: Knowledge in some fields is cumulative. In other fields it’s cyclical (at best).</p>\n\n<p>There are occasional periods when society learns that debt can be dangerous, greed backfires, and more money won’t solve all your problems. But it quickly forgets and moves on. Again and again. Generation after generation.</p>\n\n<p>I think there are a few reasons this happens, and what it means we have to accept.</p>\n\n<p><strong>Some fields have quantifiable truths, while others are guided by vague beliefs and individual circumstances</strong>. Physicist Richard Feynman said, “Imagine how much harder physics would be if electrons had feelings.” Well, people do. So any topic guided by behavior – money, philosophy, relationships, etc. – can’t be solved with a formula like physics and math.</p>\n\n<p>Neil deGrasse Tyson says, “The good thing about science is that it’s true whether or not you believe in it.” You can disagree and say science is the practice of continuous exploration and changing your mind, but in general he’s right. Germ theory is true and we know it’s true. But what about the proper level of savings and spending to live a good life? Or how much risk to take? Or the right investing strategy given today’s economy? Those kinds of questions do not lend themselves to scientific answers. They’re subjective, nuanced, and impacted by how the economy changes over time. So often there simply isn’t relevant information to pass down to the next generations. Even when firm financial rules exist, some truths have to be experienced firsthand to be understood.</p>\n\n<p><strong>Cyclical knowledge, and the inability to fully learn from others’ past experiences, means you have to accept a level of volatility and fragility not found in other fields</strong>. I can imagine a world in 50 years where things like cancer and heart disease are either non-existent or effectively controlled. I cannot ever imagine a world where economic volatility is tamed and people stop making financial decisions they eventually regret – no matter how much history of past mistakes we have to study.</p>\n"
}