{
  "title":"Handle Hard Well",
  "date":"2022-10-27T17:24:00.000000Z",
  "author":null,
  "id":"https://collabfund.com/blog/handle-hard-well/",
  "link":"https://collabfund.com/blog/handle-hard-well/",
  "content":"<p>I have been writing these articles for close to a decade now. In doing so I have covered many topics, but none have resonated more than this issue of adversity. As a result, my antenna is up. This is why I happened to notice something this past Sunday afternoon while watching the Buffalo Bills play the Kansas City Chiefs, specifically the two starting quarterbacks — Josh Allen and Patrick Mahomes.</p>\n\n<p>Allen and Mahomes may be the two best quarterbacks in the NFL today. Allen is currently the frontrunner to be this year’s MVP, while Patrick Mahomes was the League MVP in 2018 and Super Bowl MVP in 2020. Yet, neither was expected to even make it to the NFL. In fact, Mahomes wasn’t even ranked in the top 50 recruits in his home state of Texas and Allen failed to receive <em>a single</em> <em>scholarship</em> <em>offer</em> coming out of high school.</p>\n\n<p>Intrigued, I started doing some more digging.</p>\n\n<p>Like Josh Allen, Aaron Rodgers, the four-time and two-time reigning NFL MVP, also didn’t receive a scholarship offer coming out of high school. He was then passed over by <em>21 other teams</em> and had to back up Brett Favre for three seasons before starting his first NFL game.</p>\n\n<p>How about the 2019 MVP, the year between Rodgers and Mahomes? Lamar Jackson was a three star recruit (out of five) who wasn’t even among the top 400 recruits his senior year in high school. He was also strongly encouraged by the “experts” to play a position other than quarterback.</p>\n\n<p>The the last MVP outside of this group? Tom Brady, who has become the greatest quarterback of all time <a href=\"https://www.youtube.com/watch?v=o5fdhfVrg1I\">after being passed over by </a><em><a href=\"https://www.youtube.com/watch?v=o5fdhfVrg1I\">every</a></em><a href=\"https://www.youtube.com/watch?v=o5fdhfVrg1I\"> NFL franchise multiple times</a> in the 2000 NFL draft until the Patriots finally drafted him in the 6th round.</p>\n\n<p>The list doesn’t end there. Of the top ten quarterbacks heading into this season, only <em>one</em> was rated a five-star recruit coming out of high school. Of the 32 starting quarterbacks in the NFL today, you can count the number of five-star recruits on just <em>one</em> hand. The fact is, this group of predominantly three-star quarterbacks was considered by many to be too short, slow, inaccurate, or raw to become regular starters. Yet, they are currently occupying the most demanding job in all of sports, while countless five-star “sure things” have flamed out along the way.</p>\n\n<p>The question is why?</p>\n\n<p>Duke women’s head basketball coach, Kara Lawson, said it better than I ever could in a recent speech to her team about how important it is to “<a href=\"https://www.youtube.com/watch?v=oDzfZOfNki4\">handle hard wel</a>l.”</p>\n\n<p><strong>“Most people think things are going to get easier. Life is going to get easier. Basketball is going to get easier. School is going to get easier. It never gets easier. What happens is you become someone who handles hard stuff better. And if you think life when you leave college is going to all of a sudden get easier because you graduated and you got a Duke degree, it’s not going to get easier. It’s going to get harder. <em>So make yourself a person that ‘handles hard well’</em>.”</strong></p>\n\n<p>So how does this relate to NFL quarterbacks? While five-star football recruits likely expected to start immediately when they reached campus, three-star recruits had to compete to win their starting spots. While five-stars were reading their own press clippings, three-stars likely didn’t have any clippings to read. While many five-stars maxed out in high school by maturing physically early or focusing exclusively on football, many three-stars matured later, played multiple sports growing up, and juggled other responsibilities.</p>\n\n<p><a href=\"https://www.latimes.com/sports/story/2021-01-23/josh-allen-firebaugh-california-town-buffalo-bills-nfl\">Josh Allen</a> is the poster child. He was an undersized kid from a two stop-light town better known for producing melons than athletes. Instead of traveling around the country to attend elite quarterback camps, he was playing three sports, busing tables at his mother’s restaurant, and working on the family farm weeding fields, moving irrigation pipes and driving the tractor. Instead of transferring to a larger high school after a breakout junior season, he and his parents decided to pass on the opportunity. Why? Because they believed that, “<a href=\"https://buffalonews.com/sports/bills/you-bloom-where-youre-planted-the-cultivation-of-josh-allen-part-1/video_edd08018-6274-583b-b9fe-0166eed45576.html\">you bloom where you’re planted</a>.”</p>\n\n<p>Even after a strong senior season, Allen didn’t receive a single Division 1 offer. Without one, he went to junior college where he had to win the starting job. After generating nearly 450 yards per game, Allen <em>still</em> only received one Division 1 offer (The University of Wyoming). He sat for much of his first season in Laramie, but won the starting job his junior and senior seasons where he excelled.</p>\n\n<p>Yet, even with this success, countless pundits were skeptical about his professional prospects, pointing to the fact that he had faced weak competition and was not accurate enough to play in the NFL. Yet, the Buffalo Bills were willing to take a chance.</p>\n\n<p>Why?</p>\n\n<p>Because they needed someone who had repeatedly beaten the odds. After all, the Bills hadn’t won their division or a playoff game in close to two-and-a-half decades, and had <em>twenty</em> starting quarterbacks along the way.</p>\n\n<p>So, why did the Bills think this unpolished 22-year-old quarterback who had not received a single scholarship offer out of high school could turn this beleaguered franchise around?</p>\n\n<p><strong>Because Allen knew how to “handle hard well.”</strong></p>\n\n<p>Since he was drafted, Allen has started more than 60 games, thrown over 110 touchdowns, passed for more than 15,000 yards, and rushed for close to 2,500 yards. He is arguably the most exciting player in the NFL today. Most importantly, he has led the Bills to the playoffs for three consecutive seasons, helped them win their division the past two seasons, and has them atop the NFL this year. Allen has literally <em>saved the franchise</em>.</p>\n\n<p>So, why does this matter?</p>\n\n<p>It matters because when the majority of the starting quarterbacks in the NFL were middle-of-the-road college recruits, a lot of “experts” missed something. When the past four NFL MVPs either didn’t receive a college scholarship, were advised to play another position, or not drafted until the 6th round, it is worth looking into why. When the common thread among each of these quarterbacks is that they have had to overcome significant adversity and have “handled hard well”, there should be lessons that go well beyond football.</p>\n\n<p>In the financial markets, we may be in the midst of learning one of these lessons.</p>\n\n<p>A decade of historically low interest rates lulled investors into a sense of complacency. Even the best among us came to believe it was normal for the NASDAQ to compound at 20% annually, venture capital firms to produce billion dollar unicorns, mortgage rates to remain below 3% (since 1971 the average mortgage rate has been close to 8%), and diversification to no longer matter.</p>\n\n<p>Like the sirens from Greek mythology, low interest rates seduced investors into speculating in cryptocurrencies, meme stocks, and get-rich-quick schemes. In pursuit of higher returns, investors’ due diligence waned and their perception of risk became skewed, especially as nearly every investment they touched appreciated in value. <em>It all felt too easy</em>. In short, low rates convinced a lot of investors they were five-star recruits.</p>\n\n<p>This is nothing new. This sort of behavior stretches across generations. As Walter Bagehot, the British journalist and businessman, said in the mid-1800’s,</p>\n\n<p><strong>“It is a fact of experience that when the interest of money is 2% (or less), capital habitually emigrates and is wasted on foolish speculations, which never yield any adequate return. If the old, tried, and safe investments no longer yield their accustomed returns, we must take what they do yield, or try what is untried. We must either be poorer or less safe; less opulent or less secure.”</strong></p>\n\n<p>The bad news is that when investors have historically chosen the latter, trouble has followed. Unfortunately, in pursuit of higher returns, many investors this time around once again chose what is untried, less safe, and less secure. This means we are likely in for a tough sled. It is going to be hard. Interest rates are the price of money and that price has gone up. A lot.</p>\n\n<p>These periods aren’t fun. They never are, but the good news is that in their wake something positive happens. The adversity will separate the wheat from the chaff, the three-stars with upside from five-stars without it, and those who can “handle hard well” from those who cannot. As a result, while I don’t know how long this economic downturn will last or how severe it will be, I do expect that those who have overcome adversity in the past and have excelled in multiple endeavors (as opposed to having a singular focus) will separate themselves from those who haven’t. Like the Buffalo Bills with Josh Allen, this period will create an opportunity for investors to find their quarterback for the next decade, be it in funds, companies, or business divisions.</p>\n"
}