{
  "title":"Expectations and Reality",
  "date":"2022-10-24T22:36:00.000000Z",
  "author":null,
  "id":"https://collabfund.com/blog/expectations-and-reality/",
  "link":"https://collabfund.com/blog/expectations-and-reality/",
  "content":"<p>In 2004 the <em>New York Times</em> interviewed Stephen Hawking, the late scientist whose motor-neuron disease left him paralyzed and unable to talk since age 21.</p>\n\n<p>Apparently in a good mood, the <em>Times</em> asked Hawking: “Are you always this cheerful? Seriously, how do you keep your spirits up?”</p>\n\n<p>“My expectations were reduced to zero when I was 21,” Hawking said. “Everything since then has been a bonus.”</p>\n\n<p>Quite a lesson, isn’t it?</p>\n\n<p>And it’s one that applies to a lot of things.</p>\n\n<hr>\n\n<p>Part of what makes any joke funny is the surprise. The setup leads you down one path (“Someone gets in a car accident every nine seconds”), then the punchline comes in a direction you didn’t expect (“Imagine how bad a driver that guy is.”)</p>\n\n<p>The setup of that (very bad) joke is sad. The punchline is meaningless. It’s the gap between the two – the punchline deviating from your expectations – that might make you laugh. Few one-line jokes are funny; there’s not enough potential to set someone’s expectations, so it’s harder to surprise.</p>\n\n<p>So many things work like that. People get excited when they’re surprised. Not when something big happens, or when they find the right answer. They get happy, mad, scared, amused, and astounded when they stumble across a gap between expectations and reality.</p>\n\n<p>There are so many examples of this that defy intuition.</p>\n\n<p>Will Smith writes in his biography that:</p>\n\n<ul>\n  <li>\n    <p>Becoming famous is amazing.</p>\n  </li>\n  <li>\n    <p>Being famous is a mixed bag.</p>\n  </li>\n  <li>\n    <p>Losing fame is miserable.</p>\n  </li>\n</ul>\n\n<p>The amount of fame almost doesn’t matter. Going from a nobody to a little famous creates a huge gap between what you expected your life to be and what it became – same on the way down, in the other direction. But being famous merely meets expectations.</p>\n\n<p>Tennis player Naomi Osaka said last summer that she got to a point in her career where winning a major world tournament didn’t bring any joy – “I feel more like a relief,” she <a href=\"https://www.tennis.com/news/articles/naomi-osaka-isn-t-enjoying-herself-even-when-she-wins-so-you-can-understand-her-\">said</a>.</p>\n\n<p>I have a friend who grew up in abject poverty in Africa. He now works in tech in California. He says to this day he is still blown away when a hot meal is put in front of him. It’s astounding to him how abundant food is in America. Part of me is a little envious of that trait – he finds immense pleasure from something I don’t think twice about.</p>\n\n<p>Harry Truman – a failed retailer, failed farmer, failed zinc miner, failed oil driller, and senator held on leash by local Missouri businessmen – was almost universally panned when he became President after Franklin Roosevelt died. The <em>Washington Post</em> wrote: “We should be less than candid at this grave moment if we did not recognize the great disparity between Mr. Truman’s experience and the responsibilities that have been thrust upon him.” Historian David McCoullough wrote: “To many it was not just that the greatest of men had fallen, but that the least of men— or at any rate the least likely of men— had assumed his place.” Today, Truman is <a href=\"https://en.wikipedia.org/wiki/Historical_rankings_of_presidents_of_the_United_States\">consistently ranked </a>among historians’ top-10 presidents of all time, often ahead of Roosevelt. Part of that, I’ve come to believe, is that expectations for Truman’s abilities were so low that any leadership qualities he put forth blew people’s minds. A little success was a win; a big success felt like a miracle.</p>\n\n<p>Actual circumstances don’t make much difference in all of these cases. What generates all the emotion is just how big the gap is between expectations and reality.</p>\n\n<p>When you think of it like that you realize how powerful expectations are. They can make the best tennis player in the world feel miserable and a paralyzed man feel amazing. It’s astounding.</p>\n\n<p>Everyone, everywhere, doing almost any task, is just in pursuit of finding some space between expectations and reality.</p>\n\n<p>But that’s so easy to overlook.</p>\n\n<p>Peter Kaufman, CEO of Glenair and one of the smartest people you will ever come across, wrote once:</p>\n\n<blockquote>\n  <p>We tend to take every precaution to safeguard our material possessions because we know what they cost. But at the same time we neglect things which are much more precious because they don’t come with price tags attached: The real value of things like our eyesight or relationships or freedom can be hidden to us, because money is not changing hands.</p>\n</blockquote>\n\n<p>Same with expectations – they’re easy to ignore because their value isn’t on a price tag.</p>\n\n<p>But your happiness completely relies on expectations.</p>\n\n<p>Your boss’s impression of your career relies on them.</p>\n\n<p>Consumer confidence relies on them.</p>\n\n<p>What moves the stock market relies on them.</p>\n\n<p>So why do we pay so little attention to them?</p>\n\n<p>We spent so much effort trying to improve our income, skills, and ability to forecast the future – all good stuff worthy of our attention. But on the other side there’s almost a complete ignorance of expectations, especially managing them with as much effort as we put into changing our circumstances.</p>\n\n<hr>\n\n<p>Aldous Huxley said, “Most human beings have an almost infinite capacity for taking things for granted.”</p>\n\n<p>How true, and how scary. Imagine a life where almost everything gets better but you never appreciate it because your expectations rise as fast as your circumstances. It’s terrifying, and almost as bad a world where nothing gets better.</p>\n\n<p>Asked, “You seem extremely happy and content. What’s your secret to living a happy life?” 98-year-old Charlie Munger recently replied:</p>\n\n<blockquote>\n  <p>The first rule of a happy life is low expectations. If you have unrealistic expectations you’re going to be miserable your whole life. You want to have reasonable expectations and take life’s results good and bad as they happen with a certain amount of stoicism.</p>\n</blockquote>\n\n<p>My friend Brent has a related theory about marriage: It only works when both people want to help their spouse while expecting nothing in return. If you both do that, you’re both pleasantly surprised.</p>\n\n<p>Both of those are easier said than done. I think it’s often hard to distinguish high expectations from motivation. Low expectations feels like giving up and minimizing your potential.</p>\n\n<p>The only way around that might be recognizing two things.</p>\n\n<p>One, the realization that most good outcomes come from a minority of the actions you take, so it’s normal if most of what you do doesn’t work out. Failing nine times and having a big win on the tenth attempt is about as good as it gets in a lot of things – investments, relationships, careers, etc. When you accept that losing often is the only path to winning occasionally, it’s easier to keep your expectations low without losing ambition and motivation.</p>\n\n<p>Two, understand how the expectation game is played. It’s a mental game, and it’s often a crazy and agonizing game, but it’s a game that everyone is forced to play, so you should be aware of the rules and strategies. It goes like this: You think you want progress, both for yourself and for the world. But most of the time that’s <a href=\"https://collabfund.com/blog/death-taxes-and-a-few-other-things/\">not actually what you want</a>. You want to feel a gap between what you expected and what actually happened. And the expectation side of that equation is not only important, but often it’s more in your control than managing your circumstances.</p>\n"
}