{
  "title":"A Few Good Stories",
  "date":"2022-11-10T13:59:00.000000Z",
  "author":null,
  "id":"https://collabfund.com/blog/a-few-stories-i-like/",
  "link":"https://collabfund.com/blog/a-few-stories-i-like/",
  "content":"<p>I recently had lunch with a guy who’s close with Warren Buffett.</p>\n\n<p>This guy – we’ll call him Jim (not his real name) – was driving around Omaha with Buffett in late 2009. The global economy was crippled at this point, and Omaha was no exception. Stores were closed, businesses were boarded up.</p>\n\n<p>Jim said to Warren, “It’s so bad right now. How does the economy ever bounce back from this?”</p>\n\n<p>Warren said, “Jim, do you know what the best-selling candy bar was in 1962?”</p>\n\n<p>“No.” Jim said.</p>\n\n<p>“Snickers,” said Warren.</p>\n\n<p>“And do you know what the best-selling candy bar is today?” Warren said.</p>\n\n<p>“No,” said Jim.</p>\n\n<p>“Snickers,” said Warren.</p>\n\n<p>Then silence. That was the end of the conversation.</p>\n\n<p>I think what Buffett meant was: Focusing on what’s never going to change is more important than trying to anticipate how something might change.</p>\n\n<hr>\n\n<p>Virtually everything was in short supply during World War II. The U.S. Army produced over 100 million uniforms to supply the Allies, which left little fabric left over for civilian clothes. It got worse in 1943 when the Army mandated that the synthetic material typically used in bathing suits had to be reserved for making military parachutes.</p>\n\n<p>Clothing companies got creative by designing bathing suits with less and less fabric. One French designer named Louis Réard took it to the extreme, designing a bathing suit with as little fabric as he could get away with.</p>\n\n<p>Réard introduced the new bathing suit in 1946. When deciding what to call it, he read in a newspaper about nuclear bomb tests that were taking place on a thin strip of rocks in the Pacific and were catching the public’s attention.</p>\n\n<p>A thin strip catching people’s attention? That’s exactly what Réard was trying to do, too. So he named his swimsuit after the atoll where the nuclear tests were taking place – Bikini.</p>\n\n<hr>\n\n<p>When giving tests, Stanford professor Ronald Howard used to make students put the percentage odds they thought they were correct next to each answer.</p>\n\n<p>If you said you were 100% confident that your answer was correct and it turned out to be wrong, you failed the entire test.</p>\n\n<p>If you said you were 0% confident and your answer happened to be correct, you got no credit.</p>\n\n<p>Everything in between gave you a confidence-adjusted score.</p>\n\n<p>I’ve never heard of a better way to teach people that life is about probabilities, not certainties.</p>\n\n<hr>\n\n<p>In 1907, author William Dawson wrote about how the feeling of wealth is relative to what you’re accustomed to:</p>\n\n<blockquote>\n  <p>A man of education, accustomed to easy means, would suffer tortures unspeakable if he were made to live in a single room of a populous and squalid tenement, and had to subsist upon a wage at once niggardly and precarious. He would be tormented with that memory of happier things, which we are told is a ‘sorrow’s crown of sorrow.’</p>\n\n  <p>But the man who has known no other condition of life is unconscious of its misery. He has no standard of comparison. An environment which would drive a man of refinement to thoughts of suicide, does not produce so much as dissatisfaction in him. Hence there is far more happiness among the poor than we imagine.</p>\n</blockquote>\n\n<p>To drive home his point: Dawson was himself an educated man, fairly successful and accustomed to easy means by the standard of his day. But Dawson, who died in 1928, spent most of his life without electricity or air conditioning. He never had antibiotics, Advil, or a Polio vaccine. He never experienced reasonably accurate weather forecasts, or an interstate highway.</p>\n\n<p>An average American today sent back in time to experience Dawson’s life would suffer the same “tortures unspeakable” he wrote about. But he didn’t have modern times to compare his life to, so it felt luxurious to him.</p>\n\n<p>Everything good in life is just <a href=\"https://collabfund.com/blog/expectations-and-reality/\">the gap between expectations and reality.</a></p>\n\n<hr>\n\n<p>America’s decision to invade Northern Africa in November 1942 was extremely unpopular with military leaders, even President Roosevelt’s closest advisors. By almost every account, the troops weren’t ready, the planning was rushed, and the target goals were too ambitious. The top generals saw no downside to waiting a few more months. Dwight Eisenhower, then a general, predicted that Roosevelt’s hasty order to invade would become “the blackest day in history.”</p>\n\n<p>The invasion worked. But looking back after the war, the president’s advisors wondered why he was in such a hurray.</p>\n\n<p>One explanation was that the American people were antsy for something – anything – to happen after Pearl Harbor and Germany’s declaration of war. Roosevelt’s own son wrote him a letter saying he and his fellow soldiers were sitting around and “not having any fun … just waiting our turn.” Scratching those itches may have superseded military strategy.</p>\n\n<p>George Marshall, then Army chief of staff, said after the war: “The leader in a democracy has to keep the people entertained. That may sound like the wrong word, but it conveys the thought.”</p>\n\n<p>Most decisions aren’t made on a spreadsheet, where you just add up the numbers and a rational answer pops out. There’s a human element that’s hard to quantify, hard to explain, and can seem totally detached from the original goal, yet carries more influence than anything else.</p>\n\n<hr>\n\n<p>Martin Luther King’s famous speech at the Lincoln Memorial on August 28th, 1963, did not go down as planned.</p>\n\n<p>King’s advisor and speechwriter, Clarence Jones, drafted a full speech for King to deliver, based on, he recalled, a “summary of ideas we had talked about.”</p>\n\n<p>The first few minutes of King’s speech follow the script. Video shows him constantly looking down at his notes, reading verbatim. “Go back to Georgia, go back to Louisiana, go back to the slums and ghettos of our northern cities, knowing that somehow this situation can and will be changed.”</p>\n\n<p>Just then, around halfway through the speech, gospel singer Mahalia Jackson – who was standing to King’s left, maybe 10 feet away – shouts out, “Tell ‘em about the dream Martin! Tell ‘em about the dream!”</p>\n\n<p>Jones recalls: “[King] looks over at her in real time, then he takes the text of the written speech and he slides it to the left side of the lectern. He grabs the lectern and looks out on more than 250,000 people.”</p>\n\n<p>There’s then a six-second pause before King looks up at the sky and says:</p>\n\n<blockquote>\n  <p>I have a dream. It is a dream deeply rooted in the American dream.</p>\n\n  <p>I have a dream that one day this nation will rise up and live out the true meaning of its creed: “We hold these truths to be self-evident, that all men are created equal.”</p>\n\n  <p>I have a dream that my four little children will one day live in a nation where they will not be judged by the color of their skin but by the content of their character.</p>\n\n  <p>I have a dream today!</p>\n</blockquote>\n\n<p>The rest was history.</p>\n\n<p>Jones says: “That portion of the speech, which is most celebrated in this country and around the world, is not the speech that he planned to give.”</p>\n\n<p>The best story – not the most prepared, or the most thought out, or the most analytical – wins.</p>\n"
}