{
  "title":"Very Important and Hard to Teach",
  "date":"2022-11-02T19:48:00.000000Z",
  "author":null,
  "id":"https://collabfund.com/blog/very-important-and-hard-to-teach/",
  "link":"https://collabfund.com/blog/very-important-and-hard-to-teach/",
  "content":"<p>The most important decisions in your life may be whether to marry, who to marry, and whether to have kids. But none of those topics are taught in school. They’re hardly even discussed. How could they be? They aren’t problems you can distill down to an equation, or even a broad principle.</p>\n\n<p>People have different personalities, goals, experiences, and levels of chance and serendipity, all of which make universal truths hard to find and difficult to teach. No matter how smart the world becomes, the best answer will always be, “You’ve got to figure it out for yourself.”</p>\n\n<p>A lot of things work like that. Some of the most important topics are the hardest to teach, and real world experience is the only school.</p>\n\n<p>A few others:</p>\n\n<p>How to get along with people you disagree with.</p>\n\n<p>How to respect the views of people who’ve had different life experiences than you.</p>\n\n<p>How to recognize that your own views would be different if you were born in a different country or era.</p>\n\n<p>How to recognize and appreciate luck.</p>\n\n<p>How to deal with regret.</p>\n\n<p>Where to live.</p>\n\n<p>How to advertise your skills and accomplishments without being insufferable.</p>\n\n<p>How to avoid being swayed by bullshit and charlatans.</p>\n\n<p>How to manage the balance between confidence and ego, recognizing that you might be unique but you’re not special.</p>\n\n<p>How to accept your own faults without guilt.</p>\n\n<p>How to be curious about fields that have nothing to do with your career.</p>\n\n<p>How to change your mind, especially about things that were once core to your identity.</p>\n\n<p>How to deal with a certain level of hassle and nonsense without losing your cool.</p>\n\n<p>How to experience the agony of financial loss even when you’re aware of the odds of a bad outcome.</p>\n\n<p>How to accept critical feedback.</p>\n\n<p>How to be inspired by others’ success while avoiding envy.</p>\n\n<p>Recognizing how incentives affect your behavior, often for the worse.</p>\n\n<p>How to accept things that are easy to ignore because it’s painful to admit they’re true.</p>\n\n<p>How to recognize the long-term consequences of your actions.</p>\n\n<p>How to balance optimism and pessimism so you can exploit opportunities with realistic expectations.</p>\n\n<p>There are no easy rules to learn and memorize – you’ve got to figure those out for yourself.</p>\n"
}