{
  "title":"Racket v8.7",
  "date":"2022-11-14T22:31:18.000000Z",
  "author":"The Unknown Author",
  "id":"urn:http-blog-racket-lang-org:-2022-11-racket-v8-7-html",
  "link":"http://blog.racket-lang.org/2022/11/racket-v8-7.html?utm_source=all&utm_medium=Atom",
  "content":"Racket version 8.7 is now available from https://download.racket-lang.org/\n\nAs of this release:\n\n\n \n  Typed Racket offers Shallow and Optional modes for its gradual  types. These modes lower the cost of interacting with untyped code,  but provide less protection against buggy interactions.  (see https://docs.racket-lang.org/ts-reference/behavior-of-types.html )\n \n  Racket uses Unicode 14.0 for character and string operations, and  includes grapheme operations. DrRacket supports emojis.  (see https://docs.racket-lang.org/gui/editor-overview.html#%28part._graphemes%29 )\n \n  Racket supports RV64G (RISC-V).\n \n  Programmers can disable definition shadowing using  (#%declare #:require=define).  (see https://docs.racket-lang.org/reference/module.html#%28form.%28%28quote.~23~25kernel%29._~23~25declare%29%29 )\n \n  The module dependency graphs available using raco dependencies-graph  and DrRacket’s Module browser are faster and have new package  filtering support.  (see https://docs.racket-lang.org/drracket/module-browser.html#%28idx._%28gentag.39.%28lib._scribblings%2Fdrracket%2Fdrracket..scrbl%29%29%29 )\n \n  DrRacket is more responsive when killing programs that produce a lot  of output.\n \n  Plot 3D allows negative altitude values (e.g., looking at the plot  from “below”).  (see https://docs.racket-lang.org/plot/plotting.html#%28def._%28%28lib._plot%2Fmain..rkt%29._plot3d%29%29 )\n \n  The scriblib/bibtex and scriblib/autobib libraries support DOIs.  (see https://docs.racket-lang.org/scriblib/autobib.html#%28def._%28%28lib._scriblib%2Fautobib..rkt%29._make-bib%29%29 )\n \n  There are many other repairs and improvements!\n\nThe following people contributed to this release:\n\nAdit Cahya Ramadhan, Alex Harsányi, Bart van Strien, Ben Greenman, Bob Burger, Bogdan Popa, Cameron Moy, cheeze2000, D. Ben Knoble, Dan Anderson, Fred Fu, Geoffrey Knauth, Gustavo Massaccesi, J. Ryan Stinnett, Jack Firth, Jason Hemann, Jimmy McNutt, John Clements, Lîm Tsú-thuàn, M. Taimoor Zaeem, Mao Yifu, Matthew Flatt, Matthias Felleisen, Mike Sperber, Noah Ma, Oliver Flatt, Paulo Matos, Philip McGrath, Reuben Thomas, Robby Findler, Ryan Culpepper, Sam Phillips, Sam Tobin-Hochstadt, Samuel Bronson, Shu-Hung You, Sorawee Porncharoenwase, Sorin Muntean, Stephen Chang, William J. Bowman, and Winston Weinert\n\nOfficial installers for Racket on many platforms are available from https://download.racket-lang.org/.\n\nIf you are new to Racket try our Getting started guide.\n\nQuestions and feedback about the release are welcome on Discourse.\n    "
}