{
  "title":"Email Netiquette\n    ",
  "date":"2022-11-03T09:07:35.000000Z",
  "author":"Idiomdrottning",
  "id":"https://idiomdrottning.org/email-netiquette",
  "link":"https://idiomdrottning.org/email-netiquette",
  "content":"The most important rule for email is to live and let live.\n            Other people are gonna bork up the subject lines, CC you on list mail,\n              be overly verbose or terse, top-post, bottom-post, interleave,\n              fullquote, forget to quote, reply too quickly, too slowly, ask too\n              many questions, too few questions, have annoying signatures etc etc\n              etc. That’s fine.\n            Get and keep your own house in order with whatever filters and\n              templates you need. Then don’t worry about it.\n            I love reading advice that’s about dealing with email, like\n            \n              three.sentenc.es\n              inbox zero\n            \n            What I’m over, though, is advice that’s about how horrible everyone\n              else is emailing.\n            We needed email but people got stressed out and they started flocking\n              to these silo sites like Facebook and Twitter which have a more\n              codified interaction pattern that enforces or rewards brevity, picture\n              tagging, and event scheduling.\n            If we wanna get people back into email then we can’t be all shamey and\n              gatekeepy about it.♥\n            Deep dive into quoting styles\n            Above, I was “let’s be all kumbaya and it’s all good” when it comes to\n              the various email quote styles and that’s still my position so the following\n              is just unnecessarily digging in to the details. Which some people do\n              find kind of fun.\n            “Top-posting” and “bottom-posting” is the same kind of fevered\n              language that spawned phrases like “tabbed browsing”. The 90s was a\n              trip and a half. “Posting” comes from Usenet rather than from e-mail.\n            Top-posting\n            Let’s start with the straight facts. There are places online where\n              they’ll get mad at you for top-posting and there are places online\n              where they’ll get mad at you for not top-posting. That’s not a fact\n              that’s going to change any time soon. There’s not gonna be peace in\n              the top-posting world. There are also bots (like customer service\n              bots) that only work with one of the two styles.\n            As a general rule of thumb with plenty of exceptions, top-posting is\n              generally associated with businesses and the corporate world whereas\n              bottom-posting is associated with a nostalgia for old-school Usenet\n              culture. They hate top-posting and call it “TOFU” (text on top,\n              full-quote under).\n            It’s also true that some email apps only support top-posting. It’s the\n              only way to post. It’s also a consequence of a misreading of the\n              format-flowed RFC where it’s not possible to hand-insert leading quote\n              marks (there’s no prohibition against using the MUA’s UI to insert\n              quote marks, but a lot ofq MUAs don’t implement that). I think the RFC\n              did the wrong thing with that decision and should’ve left our ability\n              to manually quote alone. Someone wrote in asked what the\n                problem was, specifically. It’s that many apps, when you are trying to\n                add a &gt; character to the front of a line, will undo that by inserting\n                a leading space and messing with the text wrapping. I talked to the\n                guy who invented format=flowed about it, and he said that that was\n                intentional, that apps should instead provide an explicit UI for\n                quoting in case someone wants to write &gt; at the start of the line for\n                other reasons. I don’t think that was the right call because &gt; at the\n                start of a line is so unusual in most contexts, but, even if it was\n                the right call, mail apps should then make damn sure to have a quote\n                editing facility.\n            Top-posting can be ugly and pointless and redundant but that\n              redundancy can also be a strength if messages wander astray or are\n              forwarded separately or are handled by queue apps, and give some of\n              the same context advantages as bottom-posting can.\n            Snip-posting\n            This is a word I came up with now to describe a kind of bottom-posting\n              where you quote just a few sentences of what you’re replying to.\n            This is the kind of messages that most of the nostalgia nerds are happy\n              to receive, especially on Usenet where messages would get lost or\n              jumbled or arrive out of order. It’s also often used on BB type forums\n              even today, and it’s been used in essay writing since the ancient\n              times before computers.\n            Context, followed by continuation. You can see how people think it’s\n              clear and concise, but others don’t like it. I have an example, but\n              that example more specifically was:\n            Inline-posting\n            Also known as interleaving. You quote the entire message and\n              interleave your responses, sometimes quoting just one level of the\n              original. It’s a li’l tricky to explain so I’ll show you.\n            Alice writes:\n            Hiya Bob, how are you? I was thinking about that Frobnication project\nand whether or not we should loop in Carol on that.\n\n            Bob replies:\n            &gt; &gt; Hiya Bob, how are you?\n&gt;\n&gt; I'm doing much better, thanks. Sorry for messing up your hallway last\n&gt; time.\n&gt;\n&gt; &gt; I was thinking about that Frobnication project\n&gt;\n&gt; Oh, yeah, that. I think we should hold off on that actually. I might\n&gt; have another idea.\n&gt;\n&gt; &gt; and whether or not we should loop in Carol on that.\n&gt;\n&gt; No, for crying out loud! No offense but she'll just bungle it!\n\n            Alice replies:\n            &gt; Sorry for messing up your hallway last time.\n\nI forgive you. Just please try to be more careful.\n\n&gt; I think we should hold off on [Frobnication] actually. I might\n&gt; have another idea.\n\nOh, now I'm really curious! But remember that Frobnication also would\nsolve our issues around distimming. Is that something your other idea\ncan handle?\n\n&gt; &gt; and whether or not we should loop in Carol on that.\n&gt;\n&gt; No, for crying out loud! No offense but she'll just bungle it!\n\nI trust her. Everyone's entitled to a couple of mistakes.\n\n            Since you add one &gt; every time you quote, an odd number of &gt; indicates\n              something the other person wrote, and an even number indicates\n              something yourself wrote earlier that’s still here for context.\n            This used to be my favorite among textual communication but it’s\n              becoming a rarity. Doing it well is kind of an art and more\n              importantly, a lot of apps make it actually impossible (because of the\n              format=flowed RFC). The only way they could do it, in addition to\n              learning the nuances of this style, is if they changed emailing app!\n              That’s kind of a big ask.\n            One of the secrets to the interleaving style is that although it can\n              be tricky to learn, it really gives you a lot, too. It helps you\n              support and focus your writing, and anchor it in listening.\n            Also, a pro tip if you are interleaving: read the other person’s\n                message first!\n            Or you’ll get into situations like this:\n            Carol sends:\n            Alice, I was thinking about that tricky broken down bicycle. I've\nactually figured out a way to fix it. I've fixed it and Ted will come\nby with it this afternoon.\n\n            Alice replies:\n            &gt; Alice, I was thinking about that tricky broken down bicycle.\n\nOh, yeah! The one you irreparably broke, you insufferable clod!\n\n&gt; I've actually figured out a way to fix it.\n\nAs if that were even possible, you dimwit!\n\n&gt; I've fixed it and Ted will come by with it this afternoon.\n\nOh, OK, good.\n\n            If you don’t read before you leap, you can make wrong assumptions about\n              things that actually are addressed further down in the text.\n            And, not everyone appreciates interleaving. I remember emailing a girlfriend in\n              the nineties and I was (kind of patronizingly) thinking: “she probably\n              doesn’t grok this nerdy interleaving stuff, I’ll just write full on\n              letters as if we were writing by hand”, never quoting anything. It was\n              kind of a challenge and one warm summer day I was in a super hurry and\n              my brain was all zonked out and I was like “I’ll just try\n              interleaving, it might be fine” and sure enough, it was not fine.\n            “Why did you just send back everything I wrote? Don’t you care enough\n              to write an email of your own?!”\n            Bottom-posting\n            Both snip-posting and inline-posting are examples of bottom-posting,\n              but sometimes people just quote every single thing in the thread, I’m\n              talking the full-quote of all full-quotes, and reply under.\n            This is what a cargo-cult fear of top-posting leads to. It can also be\n              a consequence of when people use BB style forums and aren’t used to,\n              or don’t have time to, do careful quote editing, snipping, and\n              inlining. It’s fine if the occasional poster does it that way since\n              it’s usually balanced out by those posters who do trim more carefully.\n            Fine isn’t the same as good, though. Who actually genuinely likes this\n              style? Honestly? I know, I know, my entire point with this page is to\n              be all-kumbaya-all-the-time, and, again, I stand by that. If you truly\n              enjoy this style, or if you’re using an app that mandates this style,\n              go right ahead.\n            I just wanna make MUA implementers a li’l bit more aware that this\n              style is just brutal and in many ways the worst-of-both-worlds. As\n              full-quote-y and context-free as top-posting, as re-ready and\n              text-sloggy as the other forms bottom-posting.\n            I’ve seen some apps actually enforce this style, like Delta Chat,\n              where you can reply without any quote at all but only to the latest\n              post, and reply with full-quote over (i.e. bottom-post without\n              snipping or editing or interleaving) to any post (the latest, or older).\n            That’s a problem as far as I’m concerned. Not happy with that aspect\n              of an otherwise great app.\n            Which brings us to…\n            No quote\n            Replying without any quote at all, which Delta Chat introduced me to,\n              is a style I kind of like and have really taken to, but I’ve also\n              gotten pushback on it from people who use Gmail’s mobile app. I don’t\n              know how that app shows email but people have been getting confused.\n            No quote is normal in the world of IRC and text messaging and on the\n              Fediverse. Even though the latter doesn’t have a proper thread view to\n              speak of, people are usually happy to reply without a quote. No quote\n              is also natural in real conversation, of course. Most of the time\n              we’re just replying, not rephrasing what the other person just said.\n            On the other hand, as Chris wrote in:\n            \n              On the other hand, I and other blind people have found no-quoting\n                problematic on websites like lobsters, because it isn’t always\n                obvious what’s being replied to in a long thread. Lobsters mailing\n                list mode was a blessing.\n            \n            Conclusion\n            Getting your own house in order is the first, last, and only step to\n              email netiquette. Complaining about other people’s quoting style or\n              posting style is the real faux pas.\n    "
}