{
  "title":"Haskell development job with Well-Typed",
  "date":"2021-08-02T17:00:00.000000-07:00",
  "author":"christine, andres, duncan, adam",
  "id":"http://www.well-typed.com/blog/2021/08/haskell-development-job-with-well-typed",
  "link":"https://well-typed.com/blog/2021/08/haskell-development-job-with-well-typed",
  "content":"tl;dr If you’d like a job with us, send your application as soon as possible.\nWe are looking for a Haskell expert to join our team at Well-Typed. This is a great opportunity for someone who is passionate about Haskell and who is keen to improve and promote Haskell in a professional context.\nAbout Well-Typed\nWe are a team of top notch Haskell experts. Founded in 2008, we were the first company dedicated to promoting the mainstream commercial use of Haskell. To achieve this aim, we help companies that are using or moving to Haskell by providing a range of services including consulting, development, training, and support and improvement of the Haskell development tools. We work with a wide range of clients, from tiny startups to well-known multinationals. We have established a track record of technical excellence and satisfied customers.\nOur company has a strong engineering culture. All our managers and decision makers are themselves Haskell developers. Most of us have an academic background and we are not afraid to apply proper computer science to customers’ problems, particularly the fruits of FP and PL research.\nWe are a self-funded company so we are not beholden to external investors and can concentrate on the interests of our clients, our staff and the Haskell community.\nAbout the job\n\nThe role is not tied to a single specific project or task, and is fully remote.\nIn general, work for Well-Typed could cover any of the projects and activities that we are involved in as a company. The work may involve:\n\nworking on GHC, libraries and tools;\nHaskell application development;\nworking directly with clients to solve their problems;\nteaching Haskell and developing training materials.\n\nWe try wherever possible to arrange tasks within our team to suit peoples’ preferences and to rotate to provide variety and interest.\nWell-Typed has a variety of clients. For some we do proprietary Haskell development and consulting. For others, much of the work involves open-source development and cooperating with the rest of the Haskell community: the commercial, open-source and academic users.\nOur ideal candidate has excellent knowledge of Haskell, whether from industry, academia or personal interest. Familiarity with other languages, low-level programming and good software engineering practices are also useful. Good organisation and ability to manage your own time and reliably meet deadlines is important. You should also have good communication skills.\nYou are likely to have a bachelor’s degree or higher in computer science or a related field, although this isn’t a requirement.\nFurther (optional) bonus skills:\n\nexperience in teaching Haskell or other technical topics,\nexperience of consulting or running a business,\nknowledge of and experience in applying formal methods,\nfamiliarity with (E)DSL design,\nknowledge of concurrency and/or systems programming,\nexperience with working on GHC,\nexperience with web programming (in particular front-end),\n… (you tell us!)\n\nOffer details\nThe offer is initially for one year full time, with the intention of a long term arrangement. Living in England is not required. We may be able to offer either employment or sub-contracting, depending on the jurisdiction in which you live.\nIf you are interested, please apply by email to jobs@well-typed.com. Tell us why you are interested and why you would be a good fit for Well-Typed, and attach your CV. Please indicate how soon you might be able to start.\nWe will consider applications as we receive them, summer vacations permitting. In any case, please try to get your application to us by 31 August 2021.\n    "
}