{
  "title":"Why is the S combinator an S?",
  "date":"2021-08-28T09:02:00.000000-07:00",
  "author":"Mark Dominus",
  "id":"tag:,2021:/math/combinator-s",
  "link":"https://blog.plover.com/math/combinator-s.html",
  "content":"The most important combinator in\ncombinatory logic is the  combinator,\ndefined simply:\n\n$$\nS x y z ⇒ (x z)(y z)\n$$\n\nor in -calculus terms:\n\n$$\nS = \\lambda x y z. (x z)(y z).\n$$\n\nA wonderful theorem states that any\n-expression with no free variables can be converted into a\ncombinator expression that contains only the combinators  and\n, where  is really the only interesting one of the three,\n being merely the identity function, and  a constructor of\nconstant functions:\n\n$$\n\\begin{align}\nI x   &amp; = x \\\\\nK x y &amp; = x \\\\\n\\end{align}\n$$\n\nIn fact one can get along without  since .\n\nA not-too-infrequently-asked question is why the three combinators are\nnamed as they are.  The  is an identity function and pretty obvious\nstands for “identity”.\n\nSimilarly the  constructs constant functions:  is the combinator which\nignores its argument and yields . So it's not hard to imagine that\n is short for Konstant, which is German for “constant”; no\nmystery there.\n\nBut why ?  People typically guess that it stands for\n“substitution”, the idea being that if you have some application\n$$A\\,B$$\nthen  allows one to substitute some term  for a free variable\n in both  and  prior to the application:\n\n$$\nS\\, A\\, B\\, T = A[v/T]\\, B[v/T].\n$$\n\nAlthough this seems plausible, it's not correct.\n\nCombinatory logic was introduced in a 1924 paper of Moses Schönfinkel. In it,\nhe defines a family of combinators including the standard , ,\nand ; he shows that only  and  are required.  His\ninitial set of combinators comprises the following:\n\n$$\n\\begin{array}{cllrl}\nI &amp; \\textit{Identitätsfunktion} &amp; \\text{“identity function”}&amp; I\\,x =&amp; x  \\\\\nC &amp; \\textit{Konstanzfunktion} &amp; \\text{“constancy function”} &amp; C\\,x\\,y =&amp; x \\\\\nT &amp; \\textit{Vertauschungsfunktion} &amp; \\text{“swap function”} &amp; T\\,x\\,y\\,z=&amp; x\\,z\\,y \\\\\nZ &amp; \\textit{Zusammensetzungsfunktion} &amp; \\text{“composition function”} &amp; Z\\,x\\,y\\,z=&amp; x\\,(y\\,z) \\\\\nS &amp; \\textit{Verschmelzungsfunktion} &amp; \\text{“fusion function”} &amp; S\\,x\\,y\\,z=&amp; x\\,z\\,(y\\,z)\n\\end{array}\n$$\n\n(Schönfinkel also had combinators representing logical operations (one\ncorresponding to the Sheffer stroke, which had\nbeen discovered in 1913), and to quantification, but those don't\nconcern us right now.)\n\n and  are now usually called  and .  These names\nprobably originated in Curry's Grundlagen der kombinatorischen Logik\n(1930).  Curry 1930 is probably also the origin of the change from\n to .  I have no idea why Schönfinkel chose to abbreviate\nKonstanzfunktion as  instead of . Curry notes that for\n Schönfinkel has , but does not explain his\nchanges.  In Curry and Feys’ influential 1958 book on combinatory\nlogic, the   and  combinators given names that are are\nliteral translations of Schönfinkel's: “elementary permutator” and\n“elementary compositor”.\n\nReturning to the  combinator, one sees that its German name in\nSchönfinkel's paper, Verschmelzungsfunktion, begins with the letter V, but\nso does Vertauschungsfunktion, so abbreviating either with V would\nhave been ambiguous.  Schönfinkel instead chose to abbreviate\nVerschmelzungsfunktion with S for its root schmelzen, “fusion”,\nand Vertauschungsfunktion with T for its root tauschen, “swap”.\nThe word schmelzen is akin to English words “melt” and “smelt”.\n\nThe “swap” is straightforward: the  combinator swaps the order of\nthe arguments to  in : $$T\\,x\\,y\\,z = x\\,z\\,y$$ but\ndoes not otherwise alter the structure of the expression.\n\nBut why is  the “melting” or “fusion” combinator?  It's because\nSchönfinkel was interested in reducing abitrary mathematical expressions to\ncombinators. He will sometimes have an application \nand he wants to ‘fuse’ the two occurrences of .  He can do this\nby rewriting the expression as . Schönfinkel says:\n\n\n  Der praktische Nutzen der Function  besteht ersichtlich darin,\n  daß sie es ermöglicht, mehrmals auftresnde Veränderliche — und bis\n  zu einem gewissen Grade auch individuelle Functionen — nur einmal\n  auftreten zu lassen.\n  \n  Clearly, the practical use of the function  will be to enable\n  us to reduce the number of occurrences of a variable — and to some\n  extent also of a particular function — from several to a single one.\n\n\n(Translation from van Heijenoort, p. 362.)\n\nSo there you have it: the  combinator is so-named not for\nsubstitution, but because S is the first letter of schmelzen, ‘to\nfuse’.\n\nReferences\n\n\nSchönfinkel, M.  “Über die Bausteine der mathematischen Logik” (“On the building-blocks\nof mathematical logic”), Mathematische Annalen (1969), p. 305–316; Berlin,\nGöttingen, Heidelberg.\n\nEnglish translation in Van Heijenoort, Jean (ed.) From Frege to\nGödel: a Source Book in Mathematical Logic, 1879–1931 (1967)\npp. 355–366 Harvard University Press; Cambridge and London.\nCurry, H.B.\n“Grundlagen der kombinatorischen Logik”\n(“Fundamentals of combinatory logic”), _American Journal of\nMathematics Vol. 52, No. 3 (Jul., 1930), pp. 509-536.\nCurry, H.B. and Robert Feys Combinatory Logic (1958) p. 152\nNorth-Holland Publishing Company, Amsterdam.\n\n    "
}