{
  "title":"GHC 9.2.1-rc1 is now available",
  "date":"2021-08-06T17:00:00.000000-07:00",
  "author":"ghc-devs",
  "id":"http://haskell.org/ghc/blog/20210807-ghc-9.2.1-rc1-released.html",
  "link":"http://haskell.org/ghc/blog/20210807-ghc-9.2.1-rc1-released.html",
  "content":"GHC 9.2.1-rc1 is now available\nbgamari - 2021-08-07\n\nThe GHC team is very happy to announce the availability of the release cadidate of the 9.2.1 release. Binary distributions, source distributions, and documentation are available at downloads.haskell.org.\nGHC 9.2 will bring a number of exciting features including:\n\nA native code generation backend for AArch64, significantly reducing compilation times on ARM platforms such as the Apple M1.\nMany changes in the area of records, including the new RecordDotSyntax and NoFieldSelectors language extensions, as well as Support for DuplicateRecordFields with PatternSynonyms.\nIntroduction of the new GHC2021 language extension set, giving users convenient access to a larger set of language extensions which have been long considered stable.\nMerge of ghc-exactprint into the GHC tree, providing infrastructure for source-to-source program rewriting out-of-the-box.\nIntroduction of a BoxedRep RuntimeRep, allowing for polymorphism over levity of boxed objects (#17526)\nImplementation of the UnliftedDataTypes extension, allowing users to define types which do not admit lazy evaluation (proposal)\nThe new -hi profiling mechanism which provides significantly improved insight into thunk leaks.\nSupport for the ghc-debug out-of-process heap inspection library ghc-debug\nSupport for profiling of pinned objects with the cost-centre profiler (#7275)\nIntroduction of Haddock documentation support in TemplateHaskell (#5467)\n\nThank you to GitHub, IOHK, the Zw3rk stake pool, Tweag I/O, Serokell, Equinix, SimSpace, and other anonymous contributors whose on-going financial and in-kind support has facilitated GHC maintenance and release management over the years. Moreover, this release would not have been possible without the hundreds of open-source contributors whose work comprise this release.\nAs always, do give this a try and open a ticket if you see anything amiss.\nHappy testing,\n\nBen\n\n    "
}