{
  "title":"GHC 8.10.6 is now available",
  "date":"2021-08-13T17:00:00.000000-07:00",
  "author":"ghc-devs",
  "id":"http://haskell.org/ghc/blog/20210814-ghc-8.10.6-released.html",
  "link":"http://haskell.org/ghc/blog/20210814-ghc-8.10.6-released.html",
  "content":"GHC 8.10.6 is now available\nZubin Duggal - 2021-08-14\n\nThe GHC team is very pleased to announce the availability of GHC 8.10.6. Source and binary distributions are available at the usual place.\nThis is a bugfix release, fixing many issues present in GHC 8.10.5, including:\n\nA fix for segmentation faults in GHCi on aarch64-darwin due to an incorrect foreign import in haskeline. See this blog post by Ben Gamari for more details on how your library could be affected.\nA fix for a critical bug affecting Haskell Language Server (HLS) among other applications caused by missing RTS symbols required for statically linked builds of the GHC library (#19763).\nNo longer emitting spurious warnings for LLVM versions (LLVM 9-12) that were actually supported (#19973, #19829, #19959).\nNumerous bug fixes for the new LLVM based aarch64-darwin backend (#20132).\nFixes and stability improvements for the non-moving GC (#19715).\nMany other bug fixes for the RTS (#18033, #20132, #20093, #19421).\nMany packaging related fixes, including versioned ghc-pkg executables (#20087), and actually distributing GHC versions linked against the integer-simple big integer backend (#18967, #19953) on both Windows and Alpine Linux. Previous releases were still linked against the GMP library due to a misconfiguration of the builders.\nA significant refactoring of process fixing numerous bugs mostly on Apple platforms (#19994, process refactoring).\nA FreeBSD release after fixing issues that caused GHC 8.10.5 to be unable to build (#19958, #19948).\nBug fixes for the linker on Darwin platforms (#20004, #19968, #19950).\n\nA complete list of bug fixes and improvements can be found in the release notes.\nAs always, feel free to report any issues you encounter via gitlab.haskell.org.\n    "
}