{
  "title":"How to fix hiring?",
  "date":"2021-08-28T09:57:00.000000-07:00",
  "author":"Mark Dominus",
  "id":"tag:,2021:/misc/job-interview.idea",
  "link":"https://blog.plover.com/misc/job-interview.idea.html",
  "content":"On Twitter, Mike Coutermarsh suggested:\n\n\n  Job interview: “algorithms”\n  \n  Reality: “Turn a 127 message deep slack thread between 5 engineers\n  into a decision”\n\n\nI suppose this was meant facetiously but I think it might contain the\ngerm of a good idea.\n\nApplicants are usually given timed a programming quiz.  What if\ninstead, the candidate was supplied with the 127-message Slack thread\nand given 24 hours to write up a proposal document?  I honestly think\nthis might produce good results.\n\nSuch a submission would be extremely probative of the candidate's\ntalents and abilities, including:\n\n\nreading and understanding technical arguments\nbalancing engineering tradeoffs\nforeseeing potential issues\nwriting clear English\nplanning\nseriousness\nwriting coherent, well-organized, and persuasive documents\n\n\nIt is much more difficult to cheat on this task than on a typical\nprogramming exercise. The candidate certainly can't submit a\nprewritten essay that they found somewhere; that would be easy to\ndetect. A candidate who can take someone else's prewritten essay and\nquickly rewrite it to plausibly appear original is probably quite\nwell-qualified on many of the important metrics!  (Plus an additional\nimportant one: the ability to do research. They had to locate,\nrecognize, and read the essay they rewrote.)\n\nIt shouldn't be hard to change up the essay topic periodically, since\nthe engineers will be producing several of those 127-message Slack\nthreads every month.  This also tends to impede cheating.\n\nWhen a good candidate comes for an in-person interview, you have a\nready-made topic of conversation.  Instead of coding at the\nwhiteboard, you can ask them to discuss their proposal.\n\nComplaints that this would discriminate against candidates with poor\ncommand of English do not hold water.  Good command of English is one\nof the job requirements, and the whole point of a job interview is to\ndiscriminate against unqualified candidates.  Besides, if the hiring\nprocess encourages candidates to improve their English writing\nabilities, rather than cramming a bunch of red-black-tree algorithms,\nlanguage trivia, or irrelevant brainteasters, so much the better for\neveryone.\n    "
}