{
  "title":"This search algorithm is usually called \"group testing\"",
  "date":"2022-10-23T16:25:00.000000Z",
  "author":"Mark Dominus",
  "id":"tag:,2022:/prog/interval-search-2",
  "link":"https://blog.plover.com/prog/interval-search-2.html",
  "content":"Yesterday I described an algorithm\nthat locates the ‘bad’ items among a set of items, and asked:\n\n\n  does this technique have a name?\n  If I wanted to tell someone to use it, what would I say?\n\n\nThe answer is: this is group testing, or, more\nexactly, the “binary splitting” version of adaptive group testing,\nin which we are allowed to adjust the testing strategy as we go along.\nThere is also non-adaptive group testing in which we come up with a\nplan ahead of time for which tests we will perform.\n\nI felt kinda dumb when this was pointed out, because:\n\n\nA typical application (and indeed the historically first application) is for\ndisease testing\nMy previous job was working for a company doing high-throughput\ndisease testing\nI found out about the job when one of\nthe senior engineers there happened to overhear me musing about group testing\nNot only did I not remember any of this when I wrote the blog post, I even\nforgot about the disease testing application while I was writing the\npost!\n\n\nOh well.  Thanks to everyone who wrote in to help me!  Let's see,\nthat's Drew Samnick, Shreevatsa R., Matt Post, Matt Heilige, Eric\nHarley, Renan Gross, and David Eppstein. (Apologies if I left out your\nname, it was entirely unintentional.)\n\nI also asked:\n\n\n  Is the history of this algorithm lost in time, or do we know who first\n  invented it, or at least wrote it down? \n\n\nWikipedia is quite confident about this:\n\n\n  The concept of group testing was first introduced by Robert Dorfman in\n  1943 in a short report published in the Notes section of Annals of\n  Mathematical Statistics.  Dorfman's report – as with all the\n  early work on group testing – focused on the probabilistic problem,\n  and aimed to use the novel idea of group testing to reduce the\n  expected number of tests needed to weed out all syphilitic men in a\n  given pool of soldiers.\n\n\nEric Harley said: \n\n\n  [It] doesn't date back as far as you might think, which then makes me\n  wonder about the history of those coin weighing puzzles.\n\n\nYeah, now I wonder too.  Surely there must be some coin-weighing\npuzzles in\nSam Loyd or\nH.E. Dudeney that predate Dorfman?\n\nDorfman's original algorithm is not the one I described.  He divides\nthe items into fixed-size groups of n each, and if a group of n\ncontains a bad item, he tests the n items individually.  My proposal\nwas to always split the group in half.  Dorfman's two-pass approach is\nmuch more practical than mine for disease testing, where the test\nmaterial is a body fluid sample that may involve a blood draw or\nsticking a swab in someone's nose, where the amount of material may be\nlimited, and where each test offers a chance to contaminate the sample.\n\nWikipedia has an article about a more sophisticated of the binary-splitting algorithm I described.\nThe theory is really interesting, and there are many ingenious\nmethods.\n\nThanks to everyone who wrote in.  Also to everyone who did not.\nYou're all winners.\n\n[ Addendum 20221108: January First-of-May has brought to my attention\nsection 5c of David Singmaster's Sources in Recreational Mathematics,\nwhich has notes on the known history of coin-weighing puzzles.\nTo my surprise, there is nothing there from Dudeney or Loyd; the\nearliest references are from the American Mathematical Monthly\nin 1945.  I am sure that many people would be interested in further\nnews about this. ]\n    "
}