{
  "title":"A replacement for strong parameters",
  "date":"2022-11-09T00:00:00.000000Z",
  "author":null,
  "id":"http://ryanbigg.com/2022/11/a-replacement-for-strong-parameters",
  "link":"http://ryanbigg.com/2022/11/a-replacement-for-strong-parameters",
  "content":"<p>I’m not going to take <a href=\"https://dev.37signals.com/vanilla-rails-is-plenty\">this week’s (very obvious) bait about how “Vanilla Rails is plenty”</a>.</p>\n\n<p>In the past, I’ve spent effort watching DHH’s videos and <a href=\"https://ryanbigg.com/2018/03/on-writing-software-well-2-a-review\">issuing a (time-stamped) rebuttal</a>, and writing up about <a href=\"https://ryanbigg.com/2017/06/current-considered-harmful\">a new Rails feature I would consider harmful</a>.</p>\n\n<p><strong>I even <a href=\"https://leanpub.com/maintain-rails/\">wrote a book called Maintainable Rails</a> that offers my take on how to build a maintainable Rails application. A whole 30,000 words of it!</strong></p>\n\n<p>I am not going to follow that pattern today, even though the vanilla Rails article is <em>concerning</em>.</p>\n\n<p>You know, if their apps were <em>maintainable</em>, then they wouldn’t need to keep re-writing them completely, yeah?</p>\n\n<p>I digress.</p>\n\n<p>Today, I want to cover a <em>different</em> feature of Rails that I think could be improved: strong parameters.</p>\n\n<p>The <a href=\"https://guides.rubyonrails.org/action_controller_overview.html#nested-parameters\">documentation for strong_parameters</a> always makes me a little confused with all of its different kinds of brackets. It feels like someone discovered Lisp and then thought it would be good to have as many brackets in Ruby, only to abandon the idea half-way.</p>\n\n<p>Here’s a complicated example from that documentation.</p>\n\n<pre><code class=\"language-ruby\">params.permit(:name, { emails: [] },\n              friends: [ :name,\n                         { family: [ :name ], hobbies: [] }])\n</code></pre>\n\n<p>The documentation goes on to explain:</p>\n\n<blockquote>\n  <p>This declaration permits the name, emails, and friends attributes. It is expected that emails will be an array of permitted scalar values, and that friends will be an array of resources with specific attributes: they should have a name attribute (any permitted scalar values allowed), a hobbies attribute as an array of permitted scalar values, and a family attribute which is restricted to having a name (any permitted scalar values allowed here, too).</p>\n</blockquote>\n\n<p>The documentation also explains that the permitted scalar values are:</p>\n\n<pre><code>The permitted scalar types are `String`, `Symbol`, `NilClass`, `Numeric`, `TrueClass`, `FalseClass`, `Date`, `Time`, `DateTime`, `StringIO`, `IO`, `ActionDispatch::Http::UploadedFile`, and `Rack::Test::UploadedFile`.\n</code></pre>\n\n<p>That’s quite a few permitted types!</p>\n\n<p>How might we approach this differently? I think we could do this in a clearer fashion with a gem called <a href=\"https://dry-rb.org/gems/dry-schema/1.10/\">dry-schema</a>. The dry-schema gem allows us to define particular schemas that our data should comply with, and like strong parameters it will automatically drop keys that are not specified in the schema itself.</p>\n\n<h3 id=\"creating-the-schema\">Creating the schema</h3>\n\n<p>Let’s try creating a schema from the above strong parameters code, but this time in dry-schema. I’m also going to add an extra field here called age:</p>\n\n<pre><code class=\"language-ruby\">PersonSchema = Dry::Schema.Params do\n  required(:name).filled(:string)\n  required(:age).filled(:integer)\n  required(:emails).value(array[:string]).value(min_size?: 1)\n  required(:friends).array(:hash) do\n    required(:name).filled(:string)\n    required(:family).hash do\n      required(:name).filled(:string)\n    end\n  end\n  required(:hobbies).array(:string)\nend\n</code></pre>\n\n<p>With this schema we’re clearly defining the types of the data that we expect. Now we’ve limited the type of <code>name</code> to string, so it can no longer accept a file for its value. That is probably for the best.</p>\n\n<p>The <code>required(:friends).array(:hash)</code> syntax might hurt a little bit to read, but it means “an array of any length, where the values are all hashes”. The block of this method then defines the permitted keys within those hashes.</p>\n\n<p>You could define this schema at the top of your controller, if you like, or in its own file at <code>app/schemas/person_schema.rb</code>. It really should depend on the context in which it is used.</p>\n\n<p>It goes further than strong parameters, because it specifies the types expected for things such as emails and hobbies, whereas strong parameters would allow any “permitted scalar values” in there, including things such as numbers. The <code>dry-schema</code> version <em>also</em> specifies that there has to be at least one email address.</p>\n\n<h3 id=\"using-a-valid-set-of-parameters\">Using a valid set of parameters</h3>\n\n<p>A hash that would pass the checks for this schema.</p>\n\n<pre><code class=\"language-ruby\">params = {\n  name: &quot;Ryan&quot;,\n  age: 34,\n  emails: [&quot;me@ryanbigg.com&quot;],\n  hobbies: [&quot;MTG&quot;, &quot;Coding&quot;],\n  friends: [\n    {\n      name: &quot;Dear&quot;,\n      family: { name: &quot;Reader&quot; }\n    }\n  ]\n}\n</code></pre>\n\n<p>We can check this with:</p>\n\n<pre><code class=\"language-ruby\">result = PersonSchema.(params)\n</code></pre>\n\n<p>We will get a <code>Dry::Schema::Result</code> back from this, which we can grab the output of with:</p>\n\n<pre><code>result.output\n</code></pre>\n\n<h3 id=\"type-coercions\">Type-coercions</h3>\n\n<p>Another hash that would pass the checks, even though it might not look like it, is this one:</p>\n\n<pre><code class=\"language-ruby\">params = {\n  name: &quot;Ryan&quot;,\n  age: &quot;34&quot;,\n  emails: [&quot;me@ryanbigg.com&quot;],\n  hobbies: [&quot;MTG&quot;, &quot;Coding&quot;],\n  friends: [\n    {\n      name: &quot;Dear&quot;,\n      family: { name: &quot;Reader&quot; }\n    }\n  ]\n}\n</code></pre>\n\n<p>The <code>age</code> key here is specified as a string, but the schema says the type must be an <code>integer</code>. Let’s look at what happens:</p>\n\n<pre><code class=\"language-ruby\">result = PersonSchema.(params)\nresult.output[:age] # =&gt; 34\n</code></pre>\n\n<p>The <code>Dry::Schema.Params</code> type will do its best to cooerce string parameter values to their matching Ruby counterparts. This will also work for things such as dates in the “YYYY-MM-DD” formats, too. No more needing to do a <code>Date.parse</code> if that parameter is being sent to something else, like a service object instead of a model.</p>\n\n<h3 id=\"unknown-keys-are-removed\">Unknown Keys are removed</h3>\n\n<p>Like with strong parameters, if we attempt to pass an extra key:</p>\n\n<pre><code class=\"language-ruby\">params = {\n  name: &quot;Ryan&quot;,\n  age: 34,\n  emails: [&quot;me@ryanbigg.com&quot;],\n  hobbies: [&quot;MTG&quot;, &quot;Coding&quot;],\n  friends: [\n    {\n      name: &quot;Dear&quot;,\n      family: { name: &quot;Reader&quot; }\n    }\n  ],\n  very_smart: true\n}\n</code></pre>\n\n<p>Then the schema will remove this additional key, proving that I am just regular smart, if that.</p>\n\n<h3 id=\"re-using-schemas\">Re-using schemas</h3>\n\n<p><code>dry-schema</code> also allows us to re-use schemas. Let’s say that we have two schemas, our <code>PersonSchema</code> and another schema called <code>FriendSchema</code> that defines the shape of the friend keys. Heres how we could use those together:</p>\n\n<pre><code class=\"language-ruby\">FriendSchema = Dry::Schema.params do\n  required(:name).filled(:string)\n  required(:family).hash do\n    required(:name).filled(:string)\n  end\nend\n\nPersonSchema = Dry::Schema.Params do\n  required(:name).filled(:string)\n  required(:age).filled(:integer)\n  required(:emails).value(array[:string]).value(min_size?: 1)\n  required(:friends).array(FriendSchema)\n  required(:hobbies).array(:string)\nend\n</code></pre>\n\n<p>This is particularly helpful if you had a couple of complicated data structures that you wanted to validate at the same time, and use each of those schemas in different locations.</p>\n\n<p>I’d like to see strong parameters do that!</p>\n\n<h3 id=\"error-messages-are-provided\">Error messages are provided</h3>\n\n<p>If the hash passed in is completely invalid, like this one:</p>\n\n<pre><code class=\"language-ruby\">params = {}\nresult = PersonSchema.(params)\n</code></pre>\n\n<p>Then we can retrieve error messages that are similar to Active Model validations back out:</p>\n\n<pre><code>=&gt; {:name=&gt;[&quot;is missing&quot;], :age=&gt;[&quot;is missing&quot;], :emails=&gt;[&quot;is missing&quot;], :friends=&gt;[&quot;is missing&quot;], :hobbies=&gt;[&quot;is missing&quot;]}\n</code></pre>\n\n<p>On top of this, the <code>result</code> is also going to respond to <code>success?</code> with <code>false</code>, meaning we could use this in a controller action to check if the parameters are valid, before even passing them to their final destination. That might be a model (with, perhaps, it’s own validations), or it could\nbe another service.</p>\n\n<hr>\n\n<p>I’ve only scratched the surface on what <code>dry-schema</code> can do. I purposely wanted to keep this post short today to cover how it could replace strong parameters within Rails to provide a much better developer experience than that bracketed mess.</p>\n\n<p>If you’d like to know what else dry-schema can do, make sure to check out <a href=\"https://dry-rb.org/gems/dry-schema/\">its documentation here</a>.</p>\n"
}