{
  "title":"What we learned about impacting software developer happiness",
  "date":"2022-11-08T00:00:00.000000Z",
  "author":null,
  "id":"https://blog.testdouble.com/posts/2022-11-08-impacting-software-developer-happiness/",
  "link":"https://blog.testdouble.com/posts/2022-11-08-impacting-software-developer-happiness/",
  "content":"<p>Let’s start off with this quick fact: in a recent 2022 survey, when Test Double employees were asked if Test Double is a fulfilling place to work, 96% of respondents said “Yes!”</p>\n<img src=\"https://cdn-blog.testdouble.com/img/impacting-developer-happiness/happiness-survey-fulfilled-results-donut.8c2f1c3ed3eb06b64d059ac205a45923484a74d5992b537994329d94e1d4aefe.png\" alt=\"Chart of 96% survey responders say Test Double is a fulfilling place to work\">\n\n<p>With so many companies seeing an increase in turnover, <a href=\"https://www.forbes.com/sites/forbeshumanresourcescouncil/2022/03/15/why-employers-should-fight-for-employee-satisfaction-during-the-great-resignation/\">employee satisfaction is becoming even more of a discussed priority</a>. At Test Double, we conduct an internal Happiness Survey several times a year. After seeing recent Happiness Survey results, I was curious to discover driving factors, so I could share Test Double’s approach to learning about what impacts software developer happiness.</p>\n<p>In my research, I stumbled upon two helpful articles by Nectar HR digging into the importance of employee happiness. I’d suggest checking these out as well:</p>\n<ul>\n<li><a href=\"https://nectarhr.com/blog/employee-happiness-at-work\">13 Ways to Increase Employee Happiness &amp; Productivity at Work in 2022</a></li>\n<li><a href=\"https://nectarhr.com/blog/employee-retention-strategies\">A Crowdsourced Guide to Employee Retention Strategies in 2022</a></li>\n</ul>\n\n\n\n<h2 id=\"how-we-track-happiness\">\n  \n    <a class=\"heading-anchor\" href=\"#how-we-track-happiness\">How we track happiness</a>\n  \n</h2>\n<p>To actively keep a pulse on how everyone here at Test Double is feeling, <a href=\"https://blog.testdouble.com/posts/2021-08-17-agent-profile-steve-jackson/\">Steve Jackson</a> organizes a Happiness Survey several times a year. The survey consists of questions about needs based on the BICEPS model, which is an acronym for</p>\n<ul>\n<li>Belonging</li>\n<li>Improvement</li>\n<li>Choice</li>\n<li>Equality / Fairness</li>\n<li>Predictability</li>\n<li>Significance</li>\n</ul>\n<p>The concept of the BICEPS core needs was brand new to me. To learn more about what these mean, check out <a href=\"https://www.palomamedina.com/biceps\">https://www.palomamedina.com/biceps</a></p>\n<p>The survey also aims to get a better understanding of employees' thoughts on the company, fulfillment, our Employee Stock Ownership Plan (ESOP), areas to focus on improvements, etc.</p>\n<p>For example, some of the questions from our latest survey were:</p>\n<ul>\n<li>What obstacles or opportunities will influence your career growth?</li>\n<li>What activities help you feel connected to others?</li>\n<li>I feel Test Double should improve awareness/focus on…</li>\n</ul>\n<p>The anonymous results are then compiled and shared in an internal git repo. Responses include both agreement ratings and open-ended comments. The Test Double leadership team takes these ratings, comments, and suggestions to heart and incorporates the results into strategic planning every year.</p>\n\n\n\n<h2 id=\"notable-ways-test-double-cultivates-happiness\">\n  \n    <a class=\"heading-anchor\" href=\"#notable-ways-test-double-cultivates-happiness\">Notable ways Test Double cultivates happiness</a>\n  \n</h2>\n<p>After sorting through the responses of the last few surveys, some repeating themes emerged on what leads to developer happiness at Test Double. And you might be expecting a lot of focus on process improvements, but there’s a lot more to it.</p>\n\n\n\n<h3 id=\"autonomy-trust-flexibility-control-of-schedule\">\n  \n    <a class=\"heading-anchor\" href=\"#autonomy-trust-flexibility-control-of-schedule\">Autonomy, trust, flexibility, control of schedule</a>\n  \n</h3>\n<p>Working across multiple time zones—both internally and with our clients—presents scheduling challenges. However, Test Double’s philosophy is to trust our consultants to work however works best for them. And that’s not exclusive to time or location. It also means being able to make your own technical decisions where you see fit—and playing into your strengths to provide even more impact.</p>\n<p>Here are some of the common, summarized responses around what people appreciate:</p>\n<ul>\n<li>Having control of when and where to work</li>\n<li>Being able to have a flexible schedule, especially with a family</li>\n<li>Having the autonomy to be trusted to make my own decisions on how I approach solutions</li>\n<li>Glad that there is no micromanagement which can be very demoralizing, limiting, and lead to stress</li>\n</ul>\n\n\n\n<h3 id=\"connectedness-11s-hangouts-homeroom\">\n  \n    <a class=\"heading-anchor\" href=\"#connectedness-11s-hangouts-homeroom\">Connectedness, 1:1s, hangouts, Homeroom</a>\n  \n</h3>\n<p>To facilitate a sense of belonging (and good fun), Test Double has various different opportunities to “meet up,” including 1:1 coffee times randomly assigned every week, pairing time, interest groups like Book Club, TDD Corner, React Corner, DevOps corner, and different employee resource groups (ex. People of Color).</p>\n<p>A specific call-out mentioned multiple times is Homerooms. When you join Test Double, you get assigned a “homeroom” with 3-4 other peers to meet weekly. This helps create a connection and relationships with the same folks every week.</p>\n<p>On the flip side of connectedness, being a remote company and having to deal with the pandemic has many responses expressing the much-needed return of “in-person” events/retreats. While we’ve always been 100% remote, Test Double pre-pandemic held in-person retreats each year but hasn’t been able to safely do so the past few years. The survey gave Test Double further insight into how important it still is to balance a physical, in-person presence since everyone misses it.</p>\n<div class=\"aside-wrap\">\n  <p class=\"aside\">Check out this blog post from Justin Searls on <a href=\"https://blog.testdouble.com/posts/2020-03-19-remote-but-not-alone/\">other good tips for remote work</a>.</p>\n</div>\n\n\n\n\n<h3 id=\"success-agents-feeling-supported-frequent-feedback\">\n  \n    <a class=\"heading-anchor\" href=\"#success-agents-feeling-supported-frequent-feedback\">Success Agents, feeling supported, frequent feedback</a>\n  \n</h3>\n<p>In my personal career, Test Double has been by far the best role model of a company that truly cares about seeking and giving feedback. It’s not just simply saying, “we think everyone should get feedback,” and leaving it at that. It’s more of a “let’s use every opportunity we can to learn and improve” discussion, and it gets revisited very often.</p>\n<p>Each employee has what we call a Success Agent who provides a great place to have conversations on growth (both technical and personal) and feedback. A primary part of these chats can be about your career path and making sure that you’re heading in a meaningful direction.</p>\n<p>Here are some of the most stated reasons why Test Double employees love their Success Agents:</p>\n<ul>\n<li>Good sounding board for making decisions and helping lift blockers</li>\n<li>Getting accountability updates on goals helps align goals with my projects</li>\n<li>Helps to improve my skills, making me a better consultant</li>\n<li>Still maintaining a team connection while also working on a client’s project</li>\n</ul>\n\n\n\n<h3 id=\"what-can-i-do-to-improve-my-teams-happiness\">\n  \n    <a class=\"heading-anchor\" href=\"#what-can-i-do-to-improve-my-teams-happiness\">What can I do to improve my team’s happiness?</a>\n  \n</h3>\n<p>It is very probable co-workers on your own team share similar principles and desires, so it may help to address the same trends we are finding here at Test Double. If you’re looking to get an even better picture, here are some starting points to consider:</p>\n<ul>\n<li>How are you actively keeping a pulse on your employee happiness and satisfaction?</li>\n<li>Read more on the BICEPS model and take a minute to consider what are the top two most important needs for yourself. Are those being met at your organization? Send it out to the rest of your team to gain their perspectives. Discuss if your work environment is filling those needs and what you could focus on to make improvements.</li>\n<li>Are you creating a culture of open feedback and discussions on your employees' growth and careers? Are career goals being discussed and tracked enough?</li>\n<li>How do your team and folks across your company stay connected?</li>\n</ul>\n<p>If you’re interested in learning more about Test Double or have any thoughts on our Happiness Survey results, <a href=\"https://testdouble.com/contact\">continue the conversation here</a> or send us a message on <a href=\"https://twitter.com/testdouble\">Twitter</a> or <a href=\"https://www.linkedin.com/company/testdouble\">LinkedIn</a>.</p>\n"
}