{
  "title":"Double Agent Profile: Cliff Pruitt",
  "date":"2022-10-18T00:00:00.000000Z",
  "author":null,
  "id":"https://blog.testdouble.com/posts/2022-10-18-agent-profile-cliff-pruitt/",
  "link":"https://blog.testdouble.com/posts/2022-10-18-agent-profile-cliff-pruitt/",
  "content":"<p><strong>Name:</strong> Cliff Pruitt<br>\n<strong>Designation:</strong> Agent 0050<br>\n<strong>Double Agent Role:</strong>  Senior Software Consultant<br>\n<strong>Special Skills:</strong> Asking questions, Thinking ahead<br>\n<strong>Aliases:</strong> 🙅🏼‍♂️<br>\n<strong>Location:</strong> Tampa, FL<br>\n<strong>Favorite Emoji:</strong>  😄</p>\n\n\n\n<h3 id=\"what-impact-are-you-proudest-of-in-your-career\">\n  \n    <a class=\"heading-anchor\" href=\"#what-impact-are-you-proudest-of-in-your-career\">What impact are you proudest of in your career?</a>\n  \n</h3>\n<p>Oh, I don’t know. I feel weird thinking about my career in that way. I guess if I had to pick, it would be a toss-up. I’ve always loved Ruby and Rails, and for a lot of my career, I thought it would be so cool to have some PR accepted into Rails. I was fortunate enough to spend a good chunk of time at GitHub on a team that maintained continuous Rails upgrades. That gave me the opportunity to get <a href=\"https://contributors.rubyonrails.org/contributors/cliff-pruitt/commits\">20 commits</a> into Rails. Of those, adding <a href=\"https://github.com/rails/rails/pull/37940\">Disallowed Deprecations</a> was probably the one I was most excited about. Seeing something you’ve long wanted to do actually happen is pretty cool.</p>\n<p>On the other hand, I’ve always loved helping people learn about Rails and helping them understand how things work beyond a surface level. I was part of a Test Double team doing some Rails training for a client, which was bringing on a large number of engineers who were experienced in other languages and needed to ramp up on Rails quickly. It was really rewarding to see how well the curriculum was received, how productive the devs were with Rails, and how this training was expanded as more groups were onboarded. I think the best part was hearing new hires asking if we’d be doing it again as much as a year after we wrapped up the training. I guess that means it was good!</p>\n\n\n\n<h3 id=\"looking-ahead-what-has-you-most-excited-for-the-next-year-at-work\">\n  \n    <a class=\"heading-anchor\" href=\"#looking-ahead-what-has-you-most-excited-for-the-next-year-at-work\">Looking ahead, what has you most excited for the next year at work?</a>\n  \n</h3>\n<p>I think maybe just having the chance to work with more Test Double agents that I haven’t worked directly with in the past. There are so many brilliant people here, and every time I work with someone new, I feel like I grow, and my perspectives change. I want more of that.</p>\n\n\n\n<h3 id=\"what-is-your-favorite-thing-about-being-a-double-agent-at-test-double\">\n  \n    <a class=\"heading-anchor\" href=\"#what-is-your-favorite-thing-about-being-a-double-agent-at-test-double\">What is your favorite thing about being a Double Agent at Test Double?</a>\n  \n</h3>\n<p>Hands down, it’s the people I work with. Yes, we get to solve a bunch of different problems for our clients and get to use a bunch of different technologies to do it, and that’s cool, but it’s really the people I work with that make being here great. Every agent I interact with is supportive, helpful, encouraging and genuinely seems to care about others. Those in leadership positions work extremely hard to facilitate the growth of our agents and make working here sustainable and rewarding. I’ve been here for almost four years, and sometimes it still catches me off guard how much people seem to care about each other.</p>\n<p>Also, the fact that the commute from bedroom to office is four feet doesn’t hurt.</p>\n\n\n\n<h3 id=\"what-do-you-think-makes-test-double-unique\">\n  \n    <a class=\"heading-anchor\" href=\"#what-do-you-think-makes-test-double-unique\">What do you think makes Test Double unique?</a>\n  \n</h3>\n<p>I’ve never worked with another consultancy, so I really can’t say for sure, but the emphasis they place on success for individual consultants, not just on the company as a whole, seems really significant to me.</p>\n\n\n\n<h3 id=\"what-have-you-been-thinking-about-a-lot-lately-in-software-development-and-why\">\n  \n    <a class=\"heading-anchor\" href=\"#what-have-you-been-thinking-about-a-lot-lately-in-software-development-and-why\">What have you been thinking about a lot lately in software development, and why?</a>\n  \n</h3>\n<p>Until recently, I’ve been doing a lot of work on an app that makes a lot of calls to external APIs, more than most apps I’ve worked on in the past. The process of writing and maintaining tests, particularly when mocking multiple API calls for a single test, was pretty slow and painful. I’ve really been thinking about a solid set of patterns and tools that enforce good boundaries and make testing API-heavy apps less cumbersome, avoiding mocking HTTP requests at all. I don’t think I have a great solution, but it’s the topic that seems to keep bubbling up to the surface for me lately.</p>\n\n\n\n<h3 id=\"what-has-you-most-excited-about-this-year-outside-of-work\">\n  \n    <a class=\"heading-anchor\" href=\"#what-has-you-most-excited-about-this-year-outside-of-work\">What has you most excited about this year outside of work?</a>\n  \n</h3>\n<p>Ha! I am seriously not looking that far ahead. My ambition is to be as independent and disconnected from the contemporary grocery store food supply as possible. We’ve been doing a lot of foundational work to grow and raise our own food, and we’re hoping that this is the year that we start to see a lot of that pay off. It’s a lot of work, though, and a lot of learning from mistakes. One thing at a time.</p>\n\n\n\n<h3 id=\"what-bookpodcastmovietv-show-have-you-been-thinking-about-a-lot-lately-and-why\">\n  \n    <a class=\"heading-anchor\" href=\"#what-bookpodcastmovietv-show-have-you-been-thinking-about-a-lot-lately-and-why\">What book/podcast/movie/TV show have you been thinking about a lot lately, and why?</a>\n  \n</h3>\n<p>I watch a little TV and enjoy reading, but I’m not really much of a media consumer. I’d rather be outside doing something. I’m currently working on building better soil in our garden area, and <a href=\"https://www.jefflowenfels.com/books-by-jeff-lownfels/\">Teaming With Microbes</a> has been a great book on that subject. In Florida, we usually can’t grow the same standard veggies as a lot of the rest of the country. We’re much better off planting things that naturally do well in our zone, and <a href=\"https://www.youtube.com/channel/UC208478ECji1rdkDDbB0vHQ\">David the Good’s survival gardener YouTube channel</a> has some pretty great info for our semi-tropical climate.</p>\n\n\n\n<h3 id=\"whats-something-interesting-about-you-thats-not-on-your-resume-or-linkedin\">\n  \n    <a class=\"heading-anchor\" href=\"#whats-something-interesting-about-you-thats-not-on-your-resume-or-linkedin\">What’s something interesting about you that’s not on your resume or LinkedIn?</a>\n  \n</h3>\n<p>I originally went to college planning to get a fine art degree. I left school around 2000 to take a job doing in-house graphic design for web and print and ended up learning to program along the way. I found over time, I liked writing code more than pushing pixels around, and here I am today at Test Double.</p>\n<p><em>This interview is based on shared documentation with Cliff Pruitt and Cathy Colliver. It may or may not self-destruct.</em></p>\n"
}