{
  "title":"Too much developer generalization can hurt",
  "date":"2022-11-16T00:00:00.000000Z",
  "author":null,
  "id":"https://blog.testdouble.com/posts/2022-11-16-how-too-much-generalization-can-hurt/",
  "link":"https://blog.testdouble.com/posts/2022-11-16-how-too-much-generalization-can-hurt/",
  "content":"<p>This is a tale of personal frustration and reflection made immortal.</p>\n\n\n\n<h2 id=\"setting-the-stage\">\n  \n    <a class=\"heading-anchor\" href=\"#setting-the-stage\">Setting the stage</a>\n  \n</h2>\n<p>Laying in bed this morning, I realized that I’ve worked in five different ecosystems in just the last two years:</p>\n<ol>\n<li>an enterprise client (Windows, C#, NServiceBus, Azure, VS Enterprise)</li>\n<li>an enterprise client (Windows, Scala, Apache Spark, DataBricks, IntelliJ (Windows shortcuts).  And also C#, AWS, Kafka, with a dash of Angular for good measure (VS Enterprise))</li>\n<li>a seed start-up (Windows, Mongo Realm (JavaScript), Svelte, Flutter, VS Code)</li>\n<li>a start-up client (Linux, React, VS Code)</li>\n<li>an enterprise client (Mac, Kotlin, Spring Boot, AWS, IntelliJ (Mac shortcuts))</li>\n</ol>\n<p>Actually, that’s more like eight.</p>\n<p>I’m not even counting tinkering with Arduino or Unity or dabbing a toe into the worlds of Elixir, Ruby, and Python. I also didn’t list ancillary tools, which vary as much as the tech stacks. Each of the above are things where my primary job and success was grounded in adapting to the platform and delivering paradigmatically quality code for each and helping others do the same. Oh yeah, and architecting and socializing platform-appropriate solutions.</p>\n<p>In the same timeframe, I’ve also transitioned from Windows to Linux to Mac. Windows to Linux was comparatively easy. Shifting from Windows/Linux to Mac has been much harder and I’m not even close to over it (no help from the hardware being painfully unusable).</p>\n<p>These are simply just facts.</p>\n<p>Oh, and to top it off, my next engagement is slated to be Windows Desktop development, RDPing from a mac. 🍰</p>\n\n\n\n<h3 id=\"the-outcome\">\n  \n    <a class=\"heading-anchor\" href=\"#the-outcome\">The outcome</a>\n  \n</h3>\n<p>It feels like I have no idea how to write code anymore.</p>\n<p>And the shift in operating systems and IDEs means where I was previously adroit in navigating my environment, the code, and generally feeling good, now I have to do a double-take for basic text editing and frequently find myself reaching for the mouse.</p>\n<p>Do I appreciate the different perspectives each has given me?  Yes, absolutely.</p>\n<p><strong>But the mental jumble is hurting me, and it’s becoming apparent that it’s hurting my career, too.</strong></p>\n\n\n\n<h3 id=\"what-this-looks-like-in-action\">\n  \n    <a class=\"heading-anchor\" href=\"#what-this-looks-like-in-action\">What this looks like in action</a>\n  \n</h3>\n<p><strong>Interviewer:</strong> Tell me a little about yourself.</p>\n<p><strong>Me:</strong> Well, according to my resume, I’m pretty awesome.</p>\n<p><strong>Interviewer:</strong> Can you do xyz?</p>\n<p><strong>Me:</strong> Probably, I’ve done it or something similar before.</p>\n<p><strong>Interviewer:</strong> Please code your way out of this bag.</p>\n<p><strong>Me:</strong> Sure! … Just a sec while I look up the syntax.</p>\n<p><strong>Interviewer:</strong> What about using this language feature?</p>\n<p><strong>Me:</strong> Oh… right.  Yeah, good idea.</p>\n<p><strong>Interviewer:</strong> Thanks for your time. We were looking for somebody with a bit more experience, though.</p>\n<p>Some generalization is good, but clearly it can go too far.</p>\n\n\n\n<h3 id=\"an-analogy\">\n  \n    <a class=\"heading-anchor\" href=\"#an-analogy\">An analogy</a>\n  \n</h3>\n<p>Maybe the feeling can be likened to trying to learn a foreign language. And then another. And then another. I studied German in high school and Japanese about a decade ago. Most recently, I’ve been trying to learn Spanish, and in order to get my brain to stop reaching for the other languages, I’ve had to cut exposure so that it builds new pathways without constantly wandering off in the wrong direction. Coding feels somewhat similar in that so much mental effort is spent just finding which paths are applicable that there’s little left for scouting out idiomatic approaches or choosing the best one.</p>\n<p>Sumimasen, ¿puedo tener ein bisschen más bitte ka. <em>(Pardon me, can I have a little more, please?)</em></p>\n<hr>\n<p><em>Author’s note: The abrupt ending is intentional. I will attempt to explore more around the topic of developer generalization for both individuals and employers in future collaborative posts. Thank you to the initial reviewers from Test Double who assured me that this post has value by itself. Stay tuned!</em></p>\n"
}