{
  "title":"Just failed 2/3 technical samples during a practical interview. Feels bad.",
  "date":"2022-11-15T19:43:06.000000Z",
  "author":"/u/ringzero_",
  "id":"t3_yw7fqk",
  "link":"https://www.reddit.com/r/Malware/comments/yw7fqk/just_failed_23_technical_samples_during_a/",
  "content":"<div class=\"md\"><p>Man, the posts I often read on Reddit about failing technical interviews in STEM came to fruition for me today. I had my second round/interview for a malware analyst position at [insert large cyber company] which was a 2+ hour practical where I had to reverse two PE's, both encrypted with a custom packer, and then go through several non-PE files such as OLE documents, PDFs, PowerShell script, and others in which I had to do standard malware analysis. I had 45 minutes per PE and used up the full 45 on both. I could not figure out how to decrypt the custom packer in either. For the third, I did well and managed to identify all of files correctly and give a rough explanation of what each file's intent was quickly before the interview needed to end.</p> <p>I wasn't afraid to admit when I was especially stuck at a certain point and asked questions for which direction I should potentially go from here. When I received hints or feedback, I was sure to add what they were saying to a .txt file on the VM that they were able to see my note-taking which I would reference later. I also talked out loud, nonstop about what I was doing so they could understand my thought process and then maybe shed light as to why I was stuck.</p> <p>But, yeah... this was an eye-opening experience. I need to spend more quality time in debuggers and disassemblers in which a PE is obfuscated with a custom packer as I only had experience with identifying known packers and then, if necessary, attempting to manually unpack them. All I can say is that I tried my best and didn't give up before the time ran out. The interviewer said HR would get back to me in a day or two, but I imagine they say that even if a rejection is provided. I was told they have three different teams, all with different experience and duties. Unless one of those teams focuses more on threat research with light reversing, I don't really think I can provide what they're looking for. I didn't say that, of course.</p> <p>Thanks for reading, lol. I just needed to let it out to some people that (may) understand.</p> </div>   submitted by   <a href=\"https://www.reddit.com/user/ringzero_\"> /u/ringzero_ </a>   to   <a href=\"https://www.reddit.com/r/Malware/\"> r/Malware </a> <br> <span><a href=\"https://www.reddit.com/r/Malware/comments/yw7fqk/just_failed_23_technical_samples_during_a/\">[link]</a></span>   <span><a href=\"https://www.reddit.com/r/Malware/comments/yw7fqk/just_failed_23_technical_samples_during_a/\">[comments]</a></span>"
}