{
  "title":"Quicklisp news: August 2021 Quicklisp dist update now available",
  "date":"2021-08-07T11:40:00.000000-07:00",
  "author":null,
  "id":"http://blog.quicklisp.org/2021/08/august-2021-quicklisp-dist-update-now.html",
  "link":"http://blog.quicklisp.org/2021/08/august-2021-quicklisp-dist-update-now.html",
  "content":"<p><b> New projects</b>: </p><ul><li><a href=\"https://github.com/charje/cache-while/\">cache-while</a> — A Common Lisp macro for defining temporary caches that invalidate based on expressions evaluating to different values. — LLGPL</li><li><a href=\"https://github.com/K1D77A/cl-coinpayments/\">cl-coinpayments</a> — Helpers for working with the coinpayments.net api. — MIT</li><li><a href=\"https://github.com/Goheeca/cl-drawille/\">cl-drawille</a> — cl-drawille: Drawing in terminal with Unicode Braille characters. — MIT</li><li><a href=\"https://github.com/naryl/sha1/\">cl-sha1</a> — SHA1 Digest and HMAC for LispWorks. — Apache 2.0</li><li><a href=\"https://github.com/copyleft/cl-webdriver-client/\">cl-webdriver-client</a> — cl-webdriver-client is a binding library to the Selenium 4.0 — MIT</li><li><a href=\"https://github.com/dtenny/clj-con/\">clj-con</a> — Implements Clojure-styled concurrency operations such as `future` and `promise`. — MIT</li><li><a href=\"https://github.com/dtenny/clj-re/\">clj-re</a> — Implements Clojure-styled regexp operations such as `re-matches` and `re-find`. — MIT</li><li><a href=\"https://shinmera.github.io/depot\">depot</a> — Protocol for transparent collections of files. — zlib</li><li><a href=\"https://gitlab.com/ambrevar/fof\">fof</a> — Enable rapid file search, inspection and manipulation — GPL3+</li><li><a href=\"https://github.com/hyotang666/hash-table-ext/\">hash-table-ext</a> — Tiny extensions for common lisp hash-tables. — MIT</li><li><a href=\"https://github.com/interactive-ssr/hunchenissr-routes/\">hunchenissr-routes</a> — Better routes to be used with Hunchenissr. — LLGPL</li><li><a href=\"https://github.com/hemml/OMGlib/\">omglib</a> — A Common Lisp library to build fully dynamic web interfaces — GPL3</li><li><a href=\"https://github.com/hyotang666/query-repl/\">query-repl</a> — REPL for user query. — MIT</li><li><a href=\"https://github.com/tdrhq/slite/\">slite</a> — SLIME based Test-runner for FiveAM tests (and possibly others in the future) — Apache License, Version 2.0</li><li><a href=\"https://github.com/y2q-actionman/with-c-syntax/\">with-c-syntax</a> — with-c-syntax is a fun package which introduces the C language syntax into Common Lisp. — WTFPL</li></ul><p><b>Updated projects</b>: 3d-vectors, alexandria, also-alsa, april, architecture.builder-protocol, bdef, caveman, check-bnf, chipz, chirp, cl+ssl, cl-ana, cl-collider, cl-cuda, cl-debug-print, cl-environments, cl-form-types, cl-gamepad, cl-gserver, cl-i18n, cl-kraken, cl-las, cl-liballegro, cl-migratum, cl-mixed, cl-opencl, cl-opencl-utils, cl-patterns, cl-ses4, cl-sse, cl-utils, cl-webkit, clack, clem, clog, closer-mop, cmd, colored, command-line-arguments, common-doc, common-html, common-lisp-jupyter, consfigurator, core-reader, croatoan, cserial-port, cytoscape-clj, dartscluuid, data-frame, dexador, dfio, drakma, drakma-async, file-attributes, flexi-streams, gendl, generic-cl, harmony, imago, introspect-environment, jingoh, kekule-clj, lack, lisp-binary, lisp-stat, lispbuilder, lyrics, markup, mcclim, mito, mnas-package, mnas-string, mutility, neural-classifier, null-package, nyxt, overlord, parachute, petalisp, portable-condition-system, postmodern, prompt-for, qlot, quickutil, quilc, read-as-string, rove, sanity-clause, screamer, sel, serapeum, shasht, shop3, sketch, sly, snappy, snooze, special-functions, speechless, static-dispatch, stumpwm, tailrec, ten, tfeb-lisp-hax, tfeb-lisp-tools, trestrul, trivial-ed-functions, trivial-inspector-hook, ufo, uiop, uncursed, vellum, vellum-csv, vgplot, vk, websocket-driver, whirlog, zacl.</p><p><b>Removed projects</b>: lucerne</p><p>To get this update, use (ql:update-dist &quot;quicklisp&quot;). Enjoy!</p>"
}