{
  "title":"Quicklisp news: November 2022 Quicklisp dist update now available",
  "date":"2022-11-07T00:27:00.000000Z",
  "author":null,
  "id":"http://blog.quicklisp.org/2022/11/november-2022-quicklisp-dist-update-now.html",
  "link":"http://blog.quicklisp.org/2022/11/november-2022-quicklisp-dist-update-now.html",
  "content":"<p> <b>New projects:</b></p><ul><li><a href=\"https://github.com/40ants/40ants-asdf-system/\">40ants-asdf-system</a> — Provides a class for being used instead of asdf:package-inferred-system. — BSD</li><li><a href=\"https://github.com/Shinmera/action-list\">action-list</a> — An implementation of action lists — zlib</li><li><a href=\"https://github.com/Hectarea1996/adp/\">adp</a> — Add Documentation, Please. A documentation generator. — The Unlicense</li><li><a href=\"https://github.com/dtqec/anatevka/\">anatevka</a> — A distributed blossom algorithm for minimum-weight perfect matching. — MIT</li><li><a href=\"https://github.com/y2q-actionman/cl-annot-revisit/\">cl-annot-revisit</a> — Re-implementation of 'cl-annot', an annotation syntax library for Common Lisp. — WTFPL</li><li><a href=\"https://github.com/alangalvino/cl-bloom-filter/\">cl-bloom-filter</a> — Just another Common Lisp bloom filter implementation, enjoy it! — </li><li><a href=\"https://github.com/digikar99/cl-cblas/\">cl-cblas</a> — A cl-autowrap generated wrapper around CBLAS which provides a C interface to the Basic Linear Algebra Subprograms. — MIT</li><li><a href=\"https://github.com/rajasegar/cl-djula-svg/\">cl-djula-svg</a> — Handle SVGs in Djula Templates — MIT</li><li><a href=\"https://github.com/rajasegar/cl-djula-tailwind/\">cl-djula-tailwind</a> — Tailwind classes for Djula templates — MIT</li><li><a href=\"https://github.com/facts-db/cl-facts/\">cl-facts</a> — in-memory graph database — ISC</li><li><a href=\"https://github.com/BohongHuang/cl-glib\">cl-glib</a> — GLib binding for Common Lisp. — lgpl3</li><li><a href=\"https://github.com/BohongHuang/cl-gobject-introspection-wrapper\">cl-gobject-introspection-wrapper</a> — Wrap and call GObject Introspection FFI function in LISP style, based on cl-gobject-introspection. — lgpl3</li><li><a href=\"https://github.com/facts-db/cl-lessp/\">cl-lessp</a> — Generic order predicate — ISC</li><li><a href=\"https://github.com/eigenhombre/cl-oju/\">cl-oju</a> — Common Lisp equivalents of core Clojure functions, especially sequence-related ones — MIT</li><li><a href=\"https://github.com/facts-db/cl-rollback/\">cl-rollback</a> — rollback functions — ISC</li><li><a href=\"https://github.com/mmontone/cl-sentry-client\">cl-sentry-client</a> — Sentry client — MIT</li><li><a href=\"https://github.com/varjagg/cl-union-find/\">cl-union-find</a> — An implementation of UNION-FIND datastructure — LGPL</li><li><a href=\"https://github.com/nlamirault/climc/\">climc</a> — A common lisp Instant Messaging client. — MIT License</li><li><a href=\"https://github.com/rabbibotton/clog-plotly/\">clog-plotly</a> — New CLOG System — BSD</li><li><a href=\"https://github.com/rabbibotton/clog-terminal/\">clog-terminal</a> — CLOG Terminal — BSD</li><li><a href=\"https://github.com/sirherrbatka/de-mock-racy/\">de-mock-racy</a> — Simplistic mocking library. — BSD simplified</li><li><a href=\"https://lisp-stat.dev/docs/manuals/distributions/\">distributions</a> — Random numbers and distributions — MS-PL</li><li><a href=\"https://github.com/tfeb/dsm\">dsm</a> — Destructuring match — MIT</li><li><a href=\"https://github.com/tdrhq/easy-macros/\">easy-macros</a> — An easier way to write 90% of your macros — Apache License, Version 2.0</li><li><a href=\"https://shinmera.github.io/filesystem-utils/\">filesystem-utils</a> — A collection of utilities for filesystem interaction. — zlib</li><li><a href=\"https://github.com/johnlorentzson/filter-maker/\">filter-maker</a> — CLIM program for letting users make filters out of predicates and keys. — BSD 2-Clause</li><li><a href=\"https://github.com/tdrhq/fiveam-matchers/\">fiveam-matchers</a> — An extensible matchers library for FiveAM — Apache License, Version 2.0</li><li><a href=\"https://github.com/timeolord/infix-reader/\">infix-reader</a> — A reader macro to allow for infix syntax with { ... } — Unlicence</li><li><a href=\"https://sr.ht/~shunter/wayflan/\">input-event-codes</a> — Port of all constants from input-event-codes.h from both Linux and FreeBSD — MIT</li><li><a href=\"https://github.com/plkrueger/instance-tracking/\">instance-tracking</a> — Defines a class that tracks its instances — MIT</li><li><a href=\"https://github.com/KinaKnowledge/json-lib/\">json-lib</a> — A simple and relatively fast JSON parser and encoder — MIT</li><li><a href=\"https://github.com/dzangfan/lineva/\">lineva</a> — Linear evaluation macro system — GPLv3</li><li><a href=\"https://shinmera.github.io/luckless/\">luckless</a> — Lockless data structures — zlib</li><li><a href=\"https://github.com/Hectarea1996/more-cffi/\">more-cffi</a> — Extension of the CFFI project. A facility to wrap C bindings and write documentation. — The Unlicense</li><li><a href=\"https://github.com/ntrocado/music-spelling/\">music-spelling</a> — Automatic pitch and rhythm spelling. — Apache 2.0</li><li><a href=\"https://github.com/walpurgisnatch/nail/\">nail</a> — library providing convenient functions for working with linalg, statistics and probability. — MIT</li><li><a href=\"https://github.com/atlas-engineer/ndebug/\">ndebug</a> — A toolkit to construct interface-aware yet standard-compliant debugger hooks. — BSD 3-Clause</li><li><a href=\"https://github.com/digikar99/numericals/\">numericals</a> — A high performance numerical computing library for Common Lisp (focus: basic math operations) — MIT</li><li><a href=\"https://github.com/atlas-engineer/ospm/\">ospm</a> — OS package manager interface — BSD 3-Clause</li><li><a href=\"https://github.com/walpurgisnatch/pero/\">pero</a> — Logging and text file perations library — MIT</li><li><a href=\"https://github.com/plkrueger/pk-serialize/\">pk-serialize</a> — Serialization of Common Lisp data structures — MIT</li><li><a href=\"https://lisp-stat.dev/\">statistics</a> — A consolidated system of statistical functions — MS-PL</li><li><a href=\"https://github.com/walpurgisnatch/stepster/\">stepster</a> — Web scraping library — MIT</li><li><a href=\"https://cicadas.surf/cgit/colin/testiere.git/\">testiere</a> — Up Front Testing for DEFUN and DEFMETHOD — GPLv3</li><li><a href=\"https://notabug.org/cage/trivial-sanitize\">trivial-sanitize</a> — clean html strings: &quot;<a>foo</a>&quot; â†' &quot;foo&quot; — LLGPL</li><li><a href=\"https://github.com/plkrueger/tsqueue/\">tsqueue</a> — Thread Safe Queue — MIT</li><li><a href=\"https://github.com/marcoheisig/Typo/\">typo</a> — A portable type inference library for Common Lisp — MIT</li><li><a href=\"https://git.sr.ht/~shunter/wayflan/\">wayflan</a> — From-scratch Wayland client implementation — BSD 3-Clause</li><li><a href=\"https://gitlab.com/Aksej/yah\">yah</a> — Yet Another Heap — BSD-3</li></ul><p><b>Updated projects</b>: 3d-quaternions, 3d-vectors, abstract-arrays, acclimation, agnostic-lizard, alexandria-plus, architecture.builder-protocol, array-utils, assoc-utils, auto-restart, bdef, bit-smasher, blackbird, bp, bst, caveman, cephes.cl, cerberus, cffi, chunga, ci, ci-utils, cl+ssl, cl-all, cl-async, cl-autowrap, cl-bmas, cl-charms, cl-collider, cl-confidence, cl-cron, cl-data-structures, cl-form-types, cl-forms, cl-gamepad, cl-generator, cl-git, cl-gserver, cl-i18n, cl-info, cl-interpol, cl-isaac, cl-json-pointer, cl-kaputt, cl-las, cl-lib-helper, cl-liballegro, cl-liballegro-nuklear, cl-libuv, cl-lzlib, cl-marshal, cl-migratum, cl-mixed, cl-mock, cl-naive-store, cl-openal, cl-patterns, cl-pdf, cl-protobufs, cl-randist, cl-random-forest, cl-replica, cl-scsu, cl-semver, cl-sendgrid, cl-ses4, cl-steamworks, cl-str, cl-telegram-bot, cl-tls, cl-torrents, cl-unix-sockets, cl-utils, cl-wav, cl-webkit, cl-xkb, cl-yaml, cl-yxorp, cl-zstd, clack, clgplot, clingon, clj-re, clobber, clog, clog-ace, closer-mop, clsql, clss, cluffer, clunit2, clx, cmd, coleslaw, common-lisp-jupyter, commondoc-markdown, compiler-macro-notes, conduit-packages, consfigurator, croatoan, css-lite, cytoscape-clj, damn-fast-priority-queue, data-frame, data-lens, data-table, datamuse, defmain, dense-arrays, depot, dexador, dfio, dissect, doc, docparser, docs-builder, eclector, erudite, extensible-compound-types, fast-io, fiveam-asdf, flare, float-features, font-discovery, for, functional-trees, github-api-cl, gtirb-capstone, gtirb-functions, gtwiwtg, gute, harmony, http2, hunchensocket, hunchentoot-errors, imago, in-nomine, ironclad, jp-numeral, json-schema, jsonrpc, kekule-clj, lack, latter-day-paypal, lift, linear-programming, linear-programming-glpk, lisp-binary, lisp-critic, lisp-namespace, lisp-stat, lisp-unit2, literate-lisp, log4cl-extras, ltk, lunamech-matrix-api, markup, math, mcclim, mito, mnas-graph, mnas-package, multiposter, mutility, myway, neural-classifier, nfiles, nhooks, nkeymaps, nodgui, numcl, numerical-utilities, nyxt, omglib, one-more-re-nightmare, osc, osicat, overlord, papyrus, parachute, pathname-utils, periods, petalisp, pgloader, piping, plot, plump, polymorphic-functions, posix-shm, postmodern, pp-toml, query-fs, quick-patch, quri, random-state, replic, rutils, sel, select, serapeum, shasht, shop3, simple-neural-network, sketch, skippy-renderer, slite, sly, snakes, special-functions, speechless, spinneret, staple, stripe-against-the-modern-world, stumpwm, stumpwm-dynamic-float, tfeb-lisp-hax, tfeb-lisp-tools, trace-db, trivial-clipboard, trivial-extensible-sequences, trivial-file-size, trivial-mimes, uax-15, uiop, usocket, utilities.print-items, utilities.print-tree, vellum, vellum-binary, vellum-postmodern, vk, with-c-syntax, wuwei, xml-emitter, yason, zippy.</p><p><b>Removed projects</b>: cl-json-template, cl-schedule, cl-splicing-macro, mito-attachment, trivial-timers.</p><p>To get this update, use <code>(ql:update-dist &quot;quicklisp&quot;)</code></p><p>I apologize for the long gap between this update and the last. I intend to get back on a monthly schedule.</p>"
}