{
  "title":"Nicolas Hafner: Release Date Announcement! - November Kandria Update",
  "date":"2022-11-15T13:51:37.000000Z",
  "author":null,
  "id":"https://reader.tymoon.eu/article/417",
  "link":"https://reader.tymoon.eu/article/417",
  "content":"<img alt=\"https://kandria.com/media/trailer%20cover.png\" src=\"https://kandria.com/media/trailer%20cover.png\"><p>This update's an important one! The final release date, a new trailer, and some more announcements. Dang! Well, without further ado:</p><h2 id=\"release date: 11th of january!\">Release Date: 11th of January!</h2><p>Alright, I'm happy to announce that we got a final release date for Kandria, which is as the title says, <strong>Wednesday, 11th of January 2023</strong>! To celebrate the release date announcement, and the large amounts of progress we've made polishing the game, please enjoy this brand new trailer as well:</p><p>The game will release on <a class=\"external-link\" href=\"https://kandria.com/steam\">Steam</a>, <a class=\"external-link\" href=\"https://kandria.com/itch\">itch.io</a>, and onto <a class=\"external-link\" href=\"https://kandria.com\">the website</a> as a direct sale. All copies of the game will be DRM-free. I'm also excited to say that the game will release both in <strong>English</strong> and in <strong>German</strong>, translated by yours truly. We have enough time left over to do the localisation, so I really want to do it.</p><h2 id=\"shevalin single\">Shevalin Single</h2><p>The full soundtrack of the game (which is excellent, by the way!) will be released together with the game in January. However, you can enjoy a single from the soundtrack right now:</p><p><a href=\"https://hypeddit.com/q89kb4\">https://hypeddit.com/q89kb4</a></p><p>This is Shevalin, the ending credits song, composed by our very talented Mikel Dale, and sung by the incredible Julie Elven. I hope you enjoy it!</p><h2 id=\"user feedback\">User Feedback</h2><p>Currently we're still polishing everything we can find and responding to user feedback. One of the most prominent things we noticed watching people play was that they were confused by the locked doors in the first region of the game. So hey, we finally added crashable doors:</p><img alt=\"https://filebox.tymoon.eu//file/TWpZeE5nPT0=\" src=\"https://filebox.tymoon.eu//file/TWpZeE5nPT0=\"><p>If you're part of the beta programme, please give the game a try! We still have some time to include more changes if you have any suggestions.</p><h2 id=\"development\">Development</h2><p>Okey, <a class=\"external-link\" href=\"https://reader.tymoon.eu/article/416\">last month</a> we got a new roadmap, so let's look at that now:</p><ul><li><p><s>Add <em>even more</em> detail tiles, foliage, and animal spawners throughout the world</s></p></li><li><p><s>Fine-tune the levelling, trade prices, and enemy difficulty</s></p></li><li><p><s>Create new key art</s></p></li><li><p><s>Create a new trailer</s></p></li><li><p>Spruce up some of the sound effects <s>and music tracks</s></p></li><li><p>Create achievement icons and integrate them into the game</p></li><li><p>Translate everything (over 50'000 words) into German</p></li><li><p><strong>Release the full game</strong></p></li><li><p>Backport re-usable components into Trial</p></li><li><p>Separate out the assets from the main repository</p></li><li><p>Publish the source code under a permissive license</p></li><li><p>Fix a plethora of bugs and inconveniences in Alloy</p></li><li><p>Polish the editor and make it more stable</p></li><li><p><strong>Release the editor</strong></p></li><li><p>Develop a modding system for Trial</p></li><li><p>Finish the Forge build system at least to an extent where it's usable</p></li><li><p>Integrate the mod.io API with the modding system</p></li><li><p>Create a mod manager and browser UI</p></li><li><p>Document more parts of Trial and Kandria</p></li><li><p><strong>Release an official modding kit</strong></p></li></ul><p>Alright! Until the 11th of January finally hits, please continue to share the <a class=\"external-link\" href=\"https://kandria.com/steam\">steam page</a> with your friends and other communities!</p>"
}