{
  "title":"Gusto Eng Spotlight Series: Sofia Carrillo",
  "date":"2022-11-15T18:31:53.000000Z",
  "author":null,
  "id":"https://medium.com/p/ef412c9fefc9",
  "link":"https://medium.com/gusto-engineering/gusto-eng-spotlight-series-sofia-carrillo-ef412c9fefc9?source=rss----645edd256348---4",
  "content":"<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*o4xhfpsBPmRxvXbr.jpeg\"></figure><p><strong><em>This blog series is dedicated to celebrating our Black, Latinx, and Women Engineers who are making an impact in the lives of our Gusties and Gustomers (Gusto customers) every day.</em></strong></p><blockquote><strong>Today, we’re spotlighting Sofia Carrillo, who has been with Gusto for 3 years working primarily on the Accountants Engineering team, building reporting features, bulk tools, and more for our accounting partners.</strong></blockquote><blockquote>Our interviewers are Kevin Gadd and Kim Nguyen. Kevin recruits engineering talent to Gusto as part of the Engine Invite team, while Kim builds features to improve the partner developer experience as part of Gusto Embedded.</blockquote><h3>Kevin: Tell us a little about how you got to Gusto.</h3><p><strong>Sofia: </strong>I got to know about Gusto through Wallbreakers (now known as <a href=\"https://speak.careers/\">Speak_</a>). It’s like <a href=\"https://www.code2040.org/\">Code2040</a> in that they help connect candidates from underrepresented groups to companies that value diverse candidates. I was part of Wallbreakers’ pilot year, and they connected me with several companies, one of them being Gusto. They ended up offering me a job and the rest is history!</p><h3>Kevin: In your role here at Gusto, what has been one of your proudest accomplishments/impacts you have had on the SMB customers we serve?</h3><p><strong>Sofia: </strong>One of my proudest achievements was shipping a feature a few days before the end of 2020. That year was one of Gusto’s busiest times because of the new 1099 NEC, COVID/PPP complexities, and deferring billing because of the pandemic.</p><p>The project we worked on was a self-service feature so accountants could modify S-Corp benefit amounts for tax reporting. Modifying these numbers could result in tax consequences, so we didn’t allow users to edit this without reaching out to our care team. To help with our end-of-year rush and empower our accountants to serve their clients, we built this feature that allowed only accountants to make this update.</p><p>The end result was that we shipped the feature, and it worked with no bugs! I felt really proud of this feature because it meant that both our Gustomers (Gusto customers) and our Customer Experience team wouldn’t have to spend extra time on the phone figuring out these cases.</p><p>Before the self-service roll-out, unblocking via email could take anywhere between 3–5 days. Now with self-editing, this happens within minutes for our Gustomers. We saw an immediate decrease from 300 cases, which would have been 900–1500 collective days saved!</p><h3>Kevin: How has Gusto played a role and supported you in your journey as an engineer?</h3><p><strong>Sofia:</strong> Gusto has played a big part in growing me as an engineer. There’s a spirit here around learning and growing. For instance, I don’t ever feel discouraged to ask questions. I also think there’s a lot of trust in engineers — I’ve gotten to work on projects that I otherwise wouldn’t have at other companies. So I’d say it comes down to the culture around growth collaboration and encouraging a learning mindset, regardless of one-another’s level of experience.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*XyTKJJR5ISK9vXSK\"><figcaption>Enjoying the trails in Nederland, Colorado</figcaption></figure><h3>Kevin: What makes you excited about the work you do to serve SMB customers here at Gusto?</h3><p><strong>Sofia:</strong> The reason I got into engineering and computer science was that I could do things that could give people back time. What excites me about the work I do at Gusto is that I give our customers time to spend on their own lives!</p><h3>Kevin: What advice would you give to someone looking to break into engineering or are just getting started?</h3><p><strong>Sofia: </strong>The first thing I’d say is learn your data structures: how to create them, interact with them, and which ones you should choose depending on the problem. Whether you come from a non-tech background, a coding bootcamp, or a formal CS degree, everyone in the industry should know these fundamentals. With that said, Gusto does a great job hiring folks from all of those backgrounds.</p><p>One other advice I have is to pick a dynamic programming language to interview in, that makes everything easier! Make sure you’re comfortable with the language you choose, but don’t get caught in the small details. Engineering is really all about abstractions and understanding higher level concepts. If you can understand how to problem-solve at a higher level, you can apply it across the board.</p><h3>Kim: What does your typical day at Gusto look like? What are your favorite parts of the day?</h3><p><strong>Sofia: </strong>My typical day has definitely changed over time. In the beginning, it was picking up tickets from the backlog, making updates, creating pull requests, and merging code.</p><p>Now, after being at Gusto for a few years, my day is mostly spent pairing and unblocking other engineers. I also do a LOT of code reviews. That means giving feedback on code, letting others know more efficient ways to write code, and finding bugs if any. The last major part of my day is meeting with stakeholders — product, design, teams that depend on us, or teams that we depend on.</p><p>My favorite part of the day is pairing and unblocking other engineers though. There’s something very satisfying when I help an engineer understand something and the lightbulb switches on. I feel like I’m multiplying myself because I’m enabling my team to do more!</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*3RNAVvdw4VvJu72p\"><figcaption>Posing next to a mural in Denver</figcaption></figure><h3>Kim: How have you sponsored other engineers? Is sponsoring other engineers an important aspect of your role?</h3><p><strong>Sofia: </strong>It’s definitely an important part of my role! At Gusto, the more senior you are, the more you’re expected to bring engineers up with you. Gusto also has a formal mentorship program where you can be connected with another mentor.</p><p>And since I was once a new grad engineer that joined Gusto, I was especially passionate about mentoring other new grads. Sponsoring to me means advocating for them to own their own project, looking out for their career path and advocating for them to have conversations with their PE for internal mobility.</p><h3>Kim: What are some resources you’ve learned from? Any particular role models?</h3><p><strong>Sofia: </strong>I’m a big docs person — I’ll always read the README.md! And lucky for us, the developer world has great documentation!. Apollo and React both have great written documentation for instance.</p><p>For role models — I think all of the Staff &amp; Principal engineers at Gusto helped me grow. They do for me what I do for the engineers on my team today: they offer pairing time, opportunities for projects, and feedback on how I could execute on projects technically.</p><h3>Kim: What advice would you give to a more junior engineer on how to start operating at a senior level here at Gusto?</h3><p><strong>Sofia:</strong> Show that you’re able to take on projects independently. The next step is the coordination and communication piece. How can I delegate this to others? How can I write tickets that give context for others to do this work? As a senior engineer, I might know how I would approach and solve this, but how can I give someone enough context to do it themselves. Context building is a huge piece for junior engineers to advance into senior engineering.</p><h3>Kevin: Thank you so much for taking the time to talk with us!</h3><p><strong>Sofia: </strong>Thank you, this was so much fun!</p><p><em>Originally published at </em><a href=\"https://engineering.gusto.com/gusto-eng-spotlight-series-sofia-carrillo/\"><em>https://engineering.gusto.com</em></a><em> on November 15, 2022.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=ef412c9fefc9\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/gusto-engineering/gusto-eng-spotlight-series-sofia-carrillo-ef412c9fefc9\">Gusto Eng Spotlight Series: Sofia Carrillo</a> was originally published in <a href=\"https://medium.com/gusto-engineering\">Gusto Engineering</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}