{
  "title":"Rules, Truths, Beliefs",
  "date":"2021-08-25T12:32:00.000000-07:00",
  "author":null,
  "id":"http://www.collaborativefund.com/blog/rules-truths-beliefs/",
  "link":"http://feedproxy.google.com/~r/collabfund/~3/_sEAAJfEUnk/",
  "content":"<p><strong>The luckier</strong> you are the nicer you should be.</p>\r\n\r\n<p><strong>Past performance</strong> increases confidence more than ability.</p>\r\n\r\n<p><strong>There’s a sweet spot</strong> where you grasp the important stuff but you’re not smart enough to be bored with it.</p>\r\n\r\n<p><strong>The line</strong> <strong>between bold and reckless</strong> is thin and often only visible with hindsight, so be careful who you admire and what you admire them for.</p>\r\n\r\n<p><strong>“Everyone has</strong> <a href=\"https://twitter.com/foolsbookie/status/1419744570183766017?s=20\">a story but few</a> have an audience,” so there’s so much going on in the world that almost everyone is blind to.</p>\r\n\r\n<p><strong>Few things</strong> <strong>are more persuasive</strong> than the opinion you desperately want or need to be true.</p>\r\n\r\n<p><strong>Average returns</strong> sustained for an above-average period of time leads to extraordinary returns.</p>\r\n\r\n<p><strong>Every investor is making a bet on the future</strong>. It’s only called speculation when you disagree with someone else’s bet or time horizon.</p>\r\n\r\n<p><strong>Statistics and probability are</strong> the most relevant but perhaps least-taught maths in schools. They have so many real-world consequences about how people think about everyday risk. And yet.</p>\r\n\r\n<p><strong>Price drives</strong> <strong>narrative and narrative drives price</strong>, so crazy things can last a long time.</p>\r\n\r\n<p><strong>People who</strong> <strong>are exceptionally good</strong> at one thing tend to be exceptionally bad at other things, but if you’re good at one thing people will try to emulate everything you do.</p>\r\n\r\n<p><strong>The market</strong> <strong>is rational</strong> but investors play different games and those games look irrational to people playing a different game.</p>\r\n\r\n<p><strong>It’s easy</strong> <strong>to ignore the power of tail events</strong> because it’s painful to accept that most of what happens isn’t that important.</p>\r\n\r\n<p><strong>“It’s very common</strong> to be utterly brilliant and still think you’re way smarter than you actually are.” – Charlie Munger</p>\r\n\r\n<p><strong>Don’t debate</strong> someone if the outcome can’t be objectively measured.</p>\r\n\r\n<p><strong>Baseball player Dan Quisenberry</strong> <strong>once said, “The future is much like the present, only longer.”</strong> I like that idea and think it has two takeaways. One, by the time one problem ends a new one has already arrived; there’s no glorious time when everyone can relax. Two, the scenes change, but people don’t. They’re motivated and flawed the same way today that they were 100 years ago and will be 100 years from now.</p>\r\n\r\n<p><strong>To paraphrase</strong> Jon Stewart: The only reason the world seemed like a better place during your childhood is because you were a child.</p>\r\n\r\n<p><strong>“Be more patient”</strong> in investing is the “sleep 8 hours” of health. It sounds too simple to take seriously but will probably make a bigger difference than anything else you do.</p>\r\n\r\n<p><strong>“We’re all</strong> <strong>just guessing</strong>, but some of us have fancier math.” – Josh Brown</p>\r\n\r\n<p><strong>You’re not</strong> <strong>a machine</strong>, so don’t expect to always be rational. Aiming to be reasonable is the best anyone can do.</p>\r\n\r\n<p><strong>Uncertainty</strong> <strong>amid danger feels awful.</strong> So it’s comforting to have strong opinions even if you have no idea what you’re talking about, because shrugging your shoulders feels reckless when the stakes are high.</p>\r\n\r\n<p><strong>“Human beings</strong> <strong>cannot comprehend</strong> very large or very small numbers. It would be useful for us to acknowledge that fact.” – Kahneman</p>\r\n\r\n<p><strong>The best story</strong> <strong>always wins</strong>. “What you do in this world is a matter of no consequence. The question is what can you make people believe you have done.” - Sherlock Holmes</p>\r\n\r\n<p><strong>Investors as a group</strong> <strong>don’t learn from booms and busts</strong> because when people say they’ve learned their lesson they underestimate how much of their previous mistakes were caused by emotions that will return when faced with similar circumstances.</p>\r\n\r\n<p><strong>If you</strong> <strong>don’t know why an asset has gone up</strong> you’ll probably be quick to bail when it goes down.</p>\r\n\r\n<p><strong>When asked</strong> <strong>what it takes to win a Nobel prize</strong>, Francis Crick said, “Oh, it’s very simple. My secret has been I know what to ignore.” Avoiding can be more important than finding.</p>\r\n\r\n<p><strong>The best way</strong> <strong>to get someone to believe something</strong> is not to show them facts, because facts can be interpreted in different ways. It’s to make their income or approval in a social circle depend on believing it.</p>\r\n\r\n<p><strong>Lots of</strong> contrarianism is actually cynicism and lots of patience is actually stubbornness.</p>\r\n\r\n<p><strong>It’s easiest</strong> <strong>to convince people that you’re special</strong> if they don’t know you well enough to see all the ways you’re not.</p>\r\n\r\n<p><strong>Comedians are</strong> <strong>the best thought leaders</strong> because they understand how the world works but they want to make you laugh rather than making themselves feel smart.</p><img src=\"http://feeds.feedburner.com/~r/collabfund/~4/_sEAAJfEUnk\" height=\"1\" width=\"1\" alt=\"\">"
}