{
  "title":"Fresh Insights Into The Growing Home Garden Trend",
  "date":"2021-08-24T14:26:00.000000-07:00",
  "author":null,
  "id":"http://www.collaborativefund.com/blog/fresh-insights-into-the-growing-home-garden-trend/",
  "link":"http://feedproxy.google.com/~r/collabfund/~3/drDwtwScksw/",
  "content":"<p><em>62% of Americans want to grow their own food, according to Collaborative Fund’s latest research into micro-farming and the home garden craze. Innovative indoor systems are making it easier than ever.</em></p>\r\n\r\n<p>The distance from farm to table may be shrinking, as new options for growing produce at home crop up. To understand the potential market for in-home veggie stands, Collaborative Fund surveyed 267 Americans. We asked about home gardening to gauge people’s interest in growing their own food, and to uncover potential barriers. While many people turned to gardening during pandemic lockdowns, how do they feel about it now?</p>\r\n\r\n<p><img src=\"http://www.collaborativefund.com/uploads/CollaborativeFund_GreenThumbsGraphic6-ef61a6.png\" alt=\"CollaborativeFund_GreenThumbsGraphic6-ef61a6.png\"></p>\r\n\r\n<p><strong>NOT NICHE</strong></p>\r\n\r\n<p>There’s a broad market for home garden products. Almost two-thirds of those we surveyed said they bought at least one plant in the past 12 months. They are also frequent salad shoppers: 73% are buying produce at least weekly; only 7% said they bought produce “rarely” or “never.” Most people are interested in growing their own produce at home. 62% said they are interested or open to it. There was substantial enthusiasm, with 23% of respondents saying they were “definitely” interested.</p>\r\n\r\n<p><img src=\"http://www.collaborativefund.com/uploads/Alt_GreenThumbs.png\" alt=\"Alt_GreenThumbs.png\"></p>\r\n\r\n<p><strong>LOTS OF PLANT-BUYERS, FEWER GREEN THUMBS</strong></p>\r\n\r\n<p>While 63% of respondents said they buy plants, only 34% think they have a green thumb (top 2 box). Another 29% have a mixed record. This low confidence opens the door for systems that claim to be fool-proof.</p>\r\n\r\n<p><strong>FRESH TASTE IS THE TOP MOTIVATOR</strong></p>\r\n\r\n<p>We asked the best reason to grow your own greens. “Freshness / Taste” was the top answer, chosen the most (29%), followed by “Food safety / security (knowing how it is grown)” (14%). Saving money, health, and a “fun or relaxing hobby” rounded out the top 5 reasons. Environmental benefits like reducing one’s carbon footprint or reducing waste were less motivating.</p>\r\n\r\n<p><strong>HIGH POTENTIAL WITH LAPSED GARDENERS</strong></p>\r\n\r\n<p>Our research uncovered a large potential market for easier growing systems: lapsed gardeners. Only 27% of respondents are currently raising their own gardens, but a hefty 45% said that they used to. We asked them why they gave it up. The top response was a lack of space; many people mentioned moving to a city or apartment. The #2 reason was lack of time, and the #3 answer was “too much work.” Other respondents mentioned pests like squirrels that always thwarted their gardening efforts.</p>\r\n\r\n<p><img src=\"http://www.collaborativefund.com/uploads/CollaborativeFund_GreenThumbsGraphic4.png\" alt=\"CollaborativeFund_GreenThumbsGraphic4.png\"></p>\r\n\r\n<p><strong>THE NEW GARDEN: EASY, STYLISH, AND EARTH-FRIENDLY</strong></p>\r\n\r\n<p>Aspiring home gardeners who lack space, time, or a green thumb are getting some help from the latest systems. These kits or hydroponic structures are delivered to your door and offer a choice of plants, from salad greens to herbs to edible flowers.</p>\r\n\r\n<p>Indoor systems with built-in lights like <a href=\"https://risegardens.com/\">Rise Gardens</a>, <a href=\"https://www.ivegebox.com/\">Vegebox</a>, and <a href=\"https://mygardyn.com/\">My Gardyn</a> remove the need for outdoor garden space. Families might enjoy the <a href=\"https://backtotheroots.com/\">Back to the Roots</a> water garden, a planter that sits atop a fish tank (apparently plants like fish poop, and the roots clean the tank).</p>\r\n\r\n<p><a href=\"https://www.lettucegrow.com/\">Lettuce Grow</a> offers flexibility with their <a href=\"https://www.lettucegrow.com/the-farmstand\">Farmstand</a>, a stylish and expandable garden tower that can live outdoors or stay inside with additional lights. It was the <a href=\"https://heavy.com/garden/hydroponic-garden/\">top pick</a> in hydroponic gardens from the editors at Heavy, who liked that it only takes five minutes per week, uses very little water, and reduces your carbon footprint.</p>\r\n\r\n<p>If you like your fresh greens with an even fresher attitude, check out the plant kits from <a href=\"https://www.growgardenio.com/\">Gardenio</a>. According to their website, “We are latinx, womxn, lgbtqia+ owned. We give a s–t. We’re the new face of gardening and don’t even wear flannel. Lots of denim tho.”</p>\r\n\r\n<p><img src=\"http://www.collaborativefund.com/uploads/CollaborativeFund_GreenThumbsGraphic5.png\" alt=\"CollaborativeFund_GreenThumbsGraphic5.png\"></p>\r\n\r\n<p><strong>OUTDOOR SPACE OPTIONAL</strong></p>\r\n\r\n<p>With most lapsed gardeners citing lack of space as the top reason they stopped, the small footprint of plant kits and hydroponic systems have a lot of appeal. Many work indoors, making it easier for apartment-dwellers to get in on the satisfaction of harvesting their own, home-grown salad. Most of our survey respondents already have their own outdoor space (68%), but some might still be excited about indoor options, given the time and effort it takes to garden outdoors (as well as the pests they have to battle).</p>\r\n\r\n<p><strong>HOME GARDENING IS HERE TO STAY, NO GREEN THUMB NEEDED</strong></p>\r\n\r\n<p>With high interest from consumers and increasing options from new players in the category, more and more people may try their hand at growing lettuce, tomatoes, herbs, and more. Most people already buy plants, eat a lot of produce, and want to garden. But only a third have a “green thumb,” creating big opportunity for easy systems. There’s a high-potential target of folks who used to garden but stopped because it was too much work, they don’t have the space, or they gave up fighting animals that ate their plants. Companies in the micro-farming category already talk about how they make it easy, but could do more to emphasize the top purchase driver: the unbeatable fresh-picked taste.</p>\r\n\r\n<p><img src=\"http://www.collaborativefund.com/uploads/CF_GreenThumb_pullquote.png\" alt=\"CF_GreenThumb_pullquote.png\"></p><img src=\"http://feeds.feedburner.com/~r/collabfund/~4/drDwtwScksw\" height=\"1\" width=\"1\" alt=\"\">"
}