{
  "title":"Other People’s Mistakes",
  "date":"2021-08-05T13:30:00.000000-07:00",
  "author":null,
  "id":"http://www.collaborativefund.com/blog/mistakes/",
  "link":"http://feedproxy.google.com/~r/collabfund/~3/V1aX8Boeb44/",
  "content":"<p>George Carlin once <a href=\"https://www.youtube.com/watch?v=8rh6qqsmxNs&amp;ab_channel=Mentat99\">joked</a> how easy it is to spot stupid people. “Carry a little pad and pencil around with you. You’ll wind up with 30 or 40 names by the end of the day. It doesn’t take long to spot one of them, does it? Takes about eight seconds.”</p>\r\n\r\n<p>Like most comedy it’s funny because it’s true.</p>\r\n\r\n<p>But Daniel Kahneman mentions a more important truth in his book, <em>Thinking, Fast and Slow</em>: “It is easier to recognize other people’s mistakes than our own.”</p>\r\n\r\n<p>I would add my own theory: It’s easier to blame other people’s mistakes on stupidity and greed than our own.</p>\r\n\r\n<p>That’s because when you make a mistake, I judge it solely based on what I see. It’s quick and easy.</p>\r\n\r\n<p>But when I make a mistake there’s a long and persuasive monologue in my head that justifies bad decisions and adds important context other people don’t see.</p>\r\n\r\n<p>Everyone’s like that. It’s normal.</p>\r\n\r\n<p>But it’s a problem, because it makes it easy to underestimate your own flaws and become too cynical about others’.</p>\r\n\r\n<p>I try to stop myself whenever my explanation for other people’s behavior – financial or otherwise – is “well, they’re not very smart.” Or greedy. Or immoral. Yeah, sometimes it’s true. But probably less than we assume. More often there’s something else going on that you’re not seeing that makes the behavior more understandable, even if it’s still wrong.</p>\r\n\r\n<p>A few things make it that way.</p>\r\n\r\n<p><strong>1. When judging others’ poor behavior it’s easy to underestimate your own susceptibility to the power of incentives.</strong></p>\r\n\r\n<p>The worst behavior resides in industries with the most extreme incentives. Finance, where scams are everywhere. High-end art, where counterfeits proliferate.</p>\r\n\r\n<p>But it’s important to ask: Are immoral people attracted to industries where there are big rewards for bad behavior? Or do big rewards for bad behavior cause good people to slide into immorality, justifying their decisions along the way?</p>\r\n\r\n<p>I think so often it’s the latter.</p>\r\n\r\n<p>It helps explain things like the 2008 financial crisis. Was it caused by greedy bankers? Maybe here and there. But the huge majority of it was good, honest people who wanted to do the right thing but whose definition of “the right thing” is instantly warped when they’re paid $8 million a year to sell subprime bonds.</p>\r\n\r\n<p>Incentives are almost like a drug in their ability to cloud your judgment in a way you would have found unthinkable beforehand. They can get good people to justify all kinds of things.</p>\r\n\r\n<p>That doesn’t excuse bad behavior. But it’s hard to know what you’d be willing to do until you’re exposed to an extreme incentive, and that blindness makes it easy to criticize other people’s mistakes when you yourself may have been just as tempted if you were in their shoes.</p>\r\n\r\n<p><strong>2. It’s hard to tell the difference between boldness and recklessness, greed and ambition,</strong> <strong>contrarian and wrong.</strong></p>\r\n\r\n<p>The same traits needed to be hugely successful are often the same traits needed to spark a catastrophe. Not always, but a lot of the time.</p>\r\n\r\n<p>A low-probability bet that works makes you look like a genius.</p>\r\n\r\n<p>A low-probability bet that fails makes you look like a … failure, maybe even an idiot, in the eyes of others.</p>\r\n\r\n<p>But the difference between the two may have been minuscule. It could have been the same person doing the exact same thing ending up on the fortune or unfortunate <a href=\"https://www.collaborativefund.com/blog/ironies-of-luck/\">side of luck</a>.</p>\r\n\r\n<p>Everything worth pursuing has a less than 100% chance of working. And a lot of terrible ideas have at least some chance of working. So you can make good decisions that don’t work, bad ones that do, and everything in between.</p>\r\n\r\n<p>The hard thing is that when the probability isn’t easy to determine, the path of least resistance is to put your own failures in the “good bet that unfortunately didn’t work” category and other people’s failures in the “that was clearly a bad idea” one.</p>\r\n\r\n<p>When judging others you want a simple story – did it work or did it not? And when judging yourself you want a comforting story – “my actions were worthwhile and I’m a good person.”</p>\r\n\r\n<p>But those are just the easy explanations, not necessarily the right ones. So you may not be as great, and other people may not be as bad, as it looks.</p>\r\n\r\n<p><strong>3. Not all relevant information is visible.</strong></p>\r\n\r\n<p>My brother in law, a social worker, recently told me, “All behavior makes sense with enough information.”</p>\r\n\r\n<p>It’s such a good point.</p>\r\n\r\n<p>You see someone doing something crazy and think, “Why in the world would you do that?” Then you sit down with them, hear about their life, and after a while you realize, “Ah, I kind of get it now.”</p>\r\n\r\n<p>Everyone is a product of their own life experiences, few of which are visible or known to other people.</p>\r\n\r\n<p>What makes sense to me might not make sense to you because you don’t know what kind of experiences have shaped me and vice versa.</p>\r\n\r\n<p>The question, <em>“Why don’t you agree with me?”</em> can have infinite answers.</p>\r\n\r\n<p>Sometimes one side is selfish, or stupid, or blind, or uninformed.</p>\r\n\r\n<p>But usually a better question is, “<em>What have you experienced that I haven’t that would make you believe what you do? And would I think about the world like you do if I experienced what you have?”</em></p>\r\n\r\n<p>It’s the question that contains the most answers of why people don’t agree with each other.</p>\r\n\r\n<p>But it’s such a hard question to ask.</p>\r\n\r\n<p>It’s uncomfortable to think that what you haven’t experienced might change what you believe because it’s admitting your own ignorance. It’s much easier to assume those who disagree with you aren’t thinking as hard as you are – especially when judging others’ mistakes.</p><img src=\"http://feeds.feedburner.com/~r/collabfund/~4/V1aX8Boeb44\" height=\"1\" width=\"1\" alt=\"\">"
}