{
  "title":"Hanging By A Thread",
  "date":"2021-08-11T13:23:00.000000-07:00",
  "author":null,
  "id":"http://www.collaborativefund.com/blog/thread/",
  "link":"http://feedproxy.google.com/~r/collabfund/~3/E1JA_sUhrKY/",
  "content":"<p>A big lesson from history is how chance encounters lead to both magic and mayhem in ways that would have been impossible to predict.</p>\r\n\r\n<p>Let me show you three times history hung by a thread.</p>\r\n\r\n<hr></hr>\r\n\r\n<p>Giuseppe Zangara was tiny, barely five feet tall. He stood on a chair outside a Miami political rally in 1933 because that was the only way he could aim his gun across the crowd.</p>\r\n\r\n<p>Zangara fired five shots. One of them hit Chicago mayor Anton Cermak, who was shaking hands with Zagara’s intended target. Cermak died. The target – Franklin Roosevelt – was sworn in as president two weeks later.</p>\r\n\r\n<p>Within months of inauguration Roosevelt transformed the U.S. economy through the New Deal. John Nance Garner – who would have become president had Zangara hit his target – opposed most of the New Deal’s deficit spending. He almost certainly wouldn’t have enacted the same policies, some of which still shape today’s economy.</p>\r\n\r\n<hr></hr>\r\n\r\n<p>Captain William Turner invited his niece, actress Mercedes Desmore, to tour his massive ocean liner before it sailed from New York To Liverpool.</p>\r\n\r\n<p>The ship’s crew, eager to leave on time, removed the gangway for departure while Desmore was still onboard. She was stuck on a ship about to begin a seven-day voyage. Her furious uncle made the crew re-dock the ship so she could get off.</p>\r\n\r\n<p>The redocking delayed the ship’s departure. No one could have known that six days later the delay would mean that Turner’s ship – the Lusitania – would sail into the path of a German submarine at the very moment its periscope could finally see through the day’s diminishing fog.</p>\r\n\r\n<p>The Lusitania was hit with a torpedo, killing 1,200 passengers and becoming the most important trigger to rally U.S. public support for entering World War I.</p>\r\n\r\n<p>Had it sailed through the Celtic Sea half an hour earlier – had Desmore’s tour not caused a delay – the Lusitania would have been cloaked in heavy fog. The ship likely would have avoided attack. A country may have avoided a war that became the seed event for the rest of the 20th century.</p>\r\n\r\n<hr></hr>\r\n\r\n<p>Robert E. Lee had one last shot to escape Ulysses Grant’s troops and regroup to gain the upper hand in the Civil War. His plan was bold but totally plausible. All he needed was food for his hungry troops.</p>\r\n\r\n<p>An order was put in to have rations delivered to a Virginia supply depot for Lee’s men.</p>\r\n\r\n<p>But there was a communication error in Richmond, and the wagons delivered boxes of ammunition but not a morsel of food.</p>\r\n\r\n<p>Lee said the mishap “was fatal, and could not be retrieved.” His troops were starving. The Civil War ended two days later.</p>\r\n\r\n<p>History hangs by a thread.</p>\r\n\r\n<hr></hr>\r\n\r\n<p>You can play this game all day. Every big event could have turned out differently if a few little puffs of nothingness went the other direction. It’s so easy to prove how fragile big events are to trivia and accident that you start to wonder what the point is.</p>\r\n\r\n<p>It’s even crazier when you realize that every modern event has its roots in big past events, some of which occurred decades ago.</p>\r\n\r\n<p>Take a simple question like, “What caused the financial crisis?”</p>\r\n\r\n<p>When asked that most people point to things like lending standards and the Federal Reserve.</p>\r\n\r\n<p>But if you keep digging into the roots of what happened you go down a rabbit hole that never ends.</p>\r\n\r\n<p>To understand the financial crisis you have to understand the mortgage market.</p>\r\n\r\n<p>What shaped the modern mortgage market? Well, you have to understand the 30-year decline in interest rates that preceded it.</p>\r\n\r\n<p>What caused falling interest rates? Well, you have to understand the inflation of the 1970s.</p>\r\n\r\n<p>What caused that inflation? Well, you have to understand the monetary system of the 1970s and the hangover effects of the Vietnam War.</p>\r\n\r\n<p>What caused the Vietnam War? Well, you have to understand the West’s fear of communism after World War II.</p>\r\n\r\n<p>What caused World War II? Well, you have to understand World War I.</p>\r\n\r\n<p>What caused World War I? Well, for the Americans’ participation, an actress toured her uncle’s boat and then …</p>\r\n\r\n<p>That’s also a game you can play all day.</p>\r\n\r\n<p>And an endless number of modern innovations were born out of those freak events. The modern grocery store <a href=\"https://www.collaborativefund.com/blog/when-the-magic-happens/\">was invented</a> because food sellers were trying to survive the Great Depression. Penicillin <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3673487/\">owes its existence</a> to World War II. So do radar, jets, nuclear energy, rockets, and helicopters. mRNA vaccines will owe their existence to Covid-19. All of those big events could have turned out completely differently if a few minor accidents had gone a different way.</p>\r\n\r\n<p>So much of history hangs by a thread.</p>\r\n\r\n<p>Finance professor Ellroy Dimson says, “risk means more things can happen than will happen.” An important point here is that if none of these big events occurred, something else just as wild and unpredictable could have taken their place. Even when some part of the outcome is the same, the context and little bits of trivia are different in a way that can totally change the final story. America may have joined World War I without the Lusitania’s sinking, but its participation could have been less, or later, or not as popular. That could have shifted how the interwar period in the 1920s and 1930s played out, which would have impacted how World War II occurred, which would have altered the course of the most promising inventions of the 20th century … on and on, endlessly.</p>\r\n\r\n<p>I try to keep two things in mind in a world that’s this fragile to chance.</p>\r\n\r\n<p>One is to base your predictions on how people behave vs. specific events. Predicting what the world will look like in, say, 2050, is just impossible. But predicting that people will still respond to greed, fear, opportunity, exploitation, risk, uncertainty, tribal affiliations and social persuasion in the same way is a bet I’d take.</p>\r\n\r\n<p>Another – made so starkly in the last year and a half – is that no matter what the world looks like today, and what seems obvious today, everything can change tomorrow because of some tiny accident no one’s thinking about. Events, like money, compound. And the central feature of compounding is that it’s never intuitive how big something can grow from a small beginning.</p><img src=\"http://feeds.feedburner.com/~r/collabfund/~4/E1JA_sUhrKY\" height=\"1\" width=\"1\" alt=\"\">"
}