{
  "title":"The Myth of Lifelong Personality Development",
  "date":"2021-08-19T06:43:03.000000-07:00",
  "author":null,
  "id":"https://replicationindex.com/?p=15363",
  "link":"https://replicationindex.com/2021/08/19/the-myth-of-lifelong-personality-development/",
  "content":"\n<p>The German term for development is Entwicklung and evokes the image of a blossom slowly unwrapping its petals.  This process has a start and a finish. At some point the blossom is fully open. Similarly, human development has a clear start with conception and usually an end when an individual becomes an adult. Not surprisingly, developmental psychology initially focused on the first two decades of a human life. </p>\n\n\n\n<p>At some point, developmental psychologists also started to examine the influence of age at the end of life. Here, the focus was on successful aging in the face of biological decline. The idea of development at the beginning of life and decline at the end of life is consistent with the circle of life that is observed in nature. </p>\n\n\n\n<p>In contrast to the circular conception of life, some developmental psychologists propose that that some psychological processes continue to develop throughout adulthood. The idea of life-long development or growth makes the most sense for psychological processes that depend on learning. Over the life course, individuals acquire knowledge and skills. Although practice or the lack thereof may influence performance, individuals with a lot of experience are able to build on their past experiences.  </p>\n\n\n\n<p>Personality psychologists have divergent views about the development of personality. Some assume that personality is like many other biological traits. They develop during childhood when the brain establishes connections. However, when this process is completed, personality remains fairly stable. Moreover, new experiences may still change neural patterns and personality, but these changes will be idiosyncratic and differ from person to person. These theories do not predict a uniform increase in some personality traits during adulthood. </p>\n\n\n\n<p>An alternative view is that we can distinguish between immature and mature personalities and that personality changes towards a goal of the completely mature personality, akin to the completely unfolded blossom. Moreover, this process of personality development or maturation does not end at the end of childhood. Rather, it is a lifelong process that continuous over the adult life-span. Accordingly, personality becomes more mature as individuals are getting older. </p>\n\n\n\n<h3>What is a Mature Personality?</h3>\n\n\n\n<p>The notion of personality development during adulthood implies that some personality traits are more mature than others. After all, developmental processes have an end goal and the end goal is the mature state of being. </p>\n\n\n\n<p>However, it is difficult to combine the concepts of personality and development because personality implies variation across individuals, just like there is variation across different types of flowers in terms of the number, shape, and color of petals.  Should we say that a blossom with more petals is a better blossom? Which shape or color would reflect a better blossom? The answer is that there is no optimal blossom. All blossoms are mature when they are completely unfolded, but this mature state can look every different for different flowers. </p>\n\n\n\n<p>Some personality psychologists have not really solved this problem, but rather used the notion of personality development as a label for any personality changes irrespective of direction. “The term ‘personality development’, as used in this paper, is mute with regard to direction<br>of change. This means that personality development is not necessarily positive change due to functional adjustment, growth or maturation” (Specht et al., 2014, p. 217).  While it is annoying that researchers may falsely use the term development when they mean change, it does absolve the researchers from specifying a developmental theory of personality development.</p>\n\n\n\n<p>However, others take the notion of a mature personality more seriously  (e.g., Hogan &amp; Roberts, 2004, see also Specht et al., 2014). Accordingly, “a mature person from the observer’s viewpoint would be agreeable (supportive and warm), emotionally stable (consistent and positive), and conscientious (honoring commitments and playing by the rules)” (Hogan &amp; Roberts, 2008, p. 9).  According to this conception of a mature personality, the goal of personality development is to achieve a low level of neuroticism and high levels of agreeableness and conscientiousness.  </p>\n\n\n\n<p>Another problem for personality development theories is the existence of variation in mature traits in adulthood. If agreeableness, conscientiousness, and emotional stability are so useful in adult life, it is not clear why some individuals are biologically disposed to have low levels of these traits. The main explanation for variability in traits is that there are trade-offs and that neither extreme is optimal. For example, too much conscientiousness may lead to over-regulated behaviors that are not adaptive when life changes and being too agreeable makes individuals vulnerable to exploitation. In contrast, developmental theories imply that individuals with high levels of neuroticism and low levels of agreeableness or conscientiousness are not fully developed and would have to explain why some individuals do to achieve maturity.</p>\n\n\n\n<p>Developmental processes also tend to have a specified time for the process to be completed. For example, flowers blossom at a specified time of year that is optimal for pollination. In humans, sexual development is completed by the end of adolescence to enable reproduction. So, it is reasonable to ask why development of personality should not also have a normal time of completion. If maturity is required to take on the tasks of an adult, including having children and taking care of them, the process should be completed during early adulthood, so that these trait are fully developed when they are needed. It would therefore make sense to assume that most of the development is completed by age 20 or at least age 30, as proposed by Costa and McCrae (cf. Specht et al., 2014). It is not clear why maturation would still occur in middle age or old age. </p>\n\n\n\n<p>One possible explanation for late development could be that some individuals have a delayed or “arrested” development. Maybe some environmental factors impede the normal process of development, but the causal forces persist and can still produce the normative change later in adulthood. Another possibility is that personality development is triggered by environmental events. Maybe having children or getting married are life events that trigger personality development in the same way men’s testosterone levels appear to decrease when they enter long-term relationships and have children.  </p>\n\n\n\n<p>In short, a theory of lifelong development faces some theoretical challenges and alternative predictions about personality in adulthood are possible.</p>\n\n\n\n<h2>Empirical Claims</h2>\n\n\n\n<p>Wrzus and Roberts (2017) claim that agreeableness, conscientiousness, and emotional stability increase from young to middle adulthood citing Roberts et al. (2006), Roberts &amp; Mroczek (2008), and Lucas and Donnellan (2011).  They also propose that these changes co-occur with life transitions citing Bleidorn (2012, 2015), Le Donnellan, &amp; Conger (2014), Lodi Smith &amp; Roberts (2012), Specht, Egloff, and Schmukle (2011) and Zimmermann and Neyer (2013).  A causal role of life events is implied by the claim that mean levels of the traits decrease in old age (Berg &amp; Johansson, 2014; Kandler, Kornadt, Hagemeyer, &amp; Neyer, 2015; Lucas &amp; Donnellan, 2011; Mottus, Johnson, Starr, &amp; Neyer, 2012). Focusing on work experiences, Asselmann and Specht (2020) propose that conscientiousness increases when people enter the workforce and decreases again at the time of retirement.</p>\n\n\n\n<p>A recent review article by Costa, McCrae, and Lockenhoff (2019) also suggests that neuroticism decreases and agreeableness and conscientiousness increase over the adult life-span. However, they also point out that these age-trends are “modest.” They suggest that traits change by about one T-score per decade, which is a standardized mean difference of less than .2 standard deviations per decade. However, this effect size implies that changes may be as large as 1 standard deviation from age 20 to age 70. </p>\n\n\n\n<p>More recently, Graham et al. (2020) summarized the literature with the claim that “during the emerging adult and midlife years, agreeableness, conscientiousness, openness, and extraversion tend to increase and neuroticism tends to decrease” (p. 303). However, when they conducted an integrated analysis of 16 longitudinal studies, the results were rather different. Most importantly, agreeableness did not increase. The combined effect was b = .02, with a 95%CI that included zero, b = -.02 to .07. Despite the lack of evidence that agreeableness increases with age during adulthood, the authors “tentatively suggest that agreeableness may increase over time” (p. 312).</p>\n\n\n\n<p>The results for conscientiousness are even more damaging for the maturation theory. Here most datasets show a decrease in conscientiousness and the average effect size is statistically significant, b = -.05, 95%CI = -.09 to -.02. However, the effect size is small, suggesting that there is no notable age trend in conscientiousness. </p>\n\n\n\n<p>The only trait that showed the predicted age-trend was neuroticism, but the effect size was again small and the upper bound of the 95%CI was close to zero, b = -.05, 95%CI = -.09 to -.01.</p>\n\n\n\n<p>In sum, recent evidence from several longitudinal studies challenges the claim that personality develops during adulthood. However, longitudinal studies are often limited by rather short time-intervals of a few years up to one decade.  If effect sizes over one decade are small, they can be easily masked by method artifacts (Costa et al., 2019). Although cross-sectional studies have their own problem, they have the advantage that it is much easier to cover the full age-range of adulthood.  The key problem in cross-sectional studies is that age-effects can be confounded with cohort effects. However, when multiple cross-sectional studies from different survey years are available, it is possible to separate cohort effects and age-effects. (Fosse &amp; Winship, 2019). </p>\n\n\n\n<h2>Model Predictions</h2>\n\n\n\n<p>The maturity model also makes some predictions about age-trends for other constructs. One prediction is that well-being should increase as personality becomes more mature because numerous meta-analyses suggest that emotional stability, agreeableness, and conscientiousness predict higher well-being (<a href=\"https://psycnet.apa.org/record/2020-03328-001\">Anglim et al., 2020</a>). That being said, falsification of this prediction does not invalidate the maturity model. It is possible that other factors lower well-being in middle age or that higher maturity does not cause higher well-being. However, if the maturity model correctly predicts age effects on well-being, it would strengthen the model. I therefore tested age-effects on well-being and examined whether they are explained by personality development. </p>\n\n\n\n<h2>Statistical Analysis</h2>\n\n\n\n<p>Fosse and Winship (2019) noted that “despite the existence of hundreds, if not thousands, of articles and dozens of books, there is little agreement on how to adequately analyze age, period, and cohort data” (p. 468). This is also true for studies of personality development. Many of these studies fail to take cohort effects into account or ignore inconsistencies between cross-sectional and longitudinal results. </p>\n\n\n\n<p>Fosse and Winship point out that that there is an identification problem when cohort, period, and age effects are linear, but not if the trends have different distributions. For example, if age effects are non-linear, it is possible to distinguish between linear cohort effects, linear period effects, and non-linear age effects.  As maturation is expected to produce stronger effects during early adulthood than in middle and may actually show a decline in older age, it is plausible to expect a non-linear age effect.  Thus, I examined age-effects in the German Socio-Economic Panel using a statistical model that examines non-linear age effects, while controlling for linear cohort and linear period effects.  </p>\n\n\n\n<p>Moreover, I included measures of marital status and work status to examine whether age effects are at least partially explained by these life experiences. The inclusion of these measures can also help with model identification (Fosse &amp; Winship, 2019). For example, work and marriage have well-known age-effects. Thus, any age-effects on personality that are mediated by age are easily distinguished from cohort or period effects. </p>\n\n\n\n<h2>Measurement of Personality</h2>\n\n\n\n<p>Another limitation of many previous studies is the use of sum scores as measures of personality traits.  It is well-known that these sum scores are biased by response styles (Anusic et al., 2009). Moreover, sum scores are influenced by the specific items that were selected to measure the Big Five traits and specific items can have their own age effects (Costa et al., 2019; Terracciano, McCrae, Brant, &amp; Costa, 2005).  Using a latent variable approach, it is possible to correct for random and systematic measurement errors and age effects on individual items.  I therefore used a measurement model of personality that corrects for acquiescence and halo biases (Anusic et al., 2009).  The specification of the model and detailed results can be found on OSF (<a href=\"https://osf.io/vpcfd/\" rel=\"noreferrer noopener\">https://osf.io/vpcfd/</a>).  </p>\n\n\n\n<p>A model that assumed only age effects did not fit the data as well as a model that also allowed for cohort and period effects,  chi2(df = 211) = 6651, CFI = .974, RMSEA = .021 vs. chi2(df = 201) = 5866, CFI = .977, RMSEA = .020, respectively.   This finding shows that age-effects are confounded with other effects in models that do not specify cohort or period effects. </p>\n\n\n\n<p>Figure 1 shows the age effects for the Big Five traits. </p>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://i1.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-23.png?ssl=1\"><img width=\"604\" height=\"603\" src=\"https://i1.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-23.png?resize=604%2C603&amp;ssl=1\" alt=\"\" class=\"wp-image-15481\"></a></figure>\n\n\n\n<p>The results do not support the maturation model. The most inconsistent finding is a strong negative effect of age on agreeableness.  However, other traits also did not show a continuous trend throughout adulthood. Conscientiousness increased from age 17 to 35, but remained unchanged afterwards, whereas Openness decreased slightly until age 30 and then increased continuously. </p>\n\n\n\n<p>To examine the robustness of these results, I conducted sensitivity analyses with varying controls. The results for agreeableness are shown in Figure 2.  </p>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://i0.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-13.png?ssl=1\"><img width=\"604\" height=\"603\" src=\"https://i0.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-13.png?resize=604%2C603&amp;ssl=1\" alt=\"\" class=\"wp-image-15423\"></a></figure>\n\n\n\n<p>All models show a decreasing trend, but the effect sizes vary. No controls, controlling for either cohort effects or time effects produces a decreasing age trend, but the effect size is small as most scores deviate less than .2 standard deviations from the mean (i.e., zero). However, controlling for time and cohort effects results in the strong decrease observed in Figure 1. Controlling for halo bias makes only a small difference. It is possible that the model that corrects for cohort and time effects overcorrects because it is difficult to distinguish age and time effects. However, none of these results are consistent with the predictions of the maturation model that agreeableness increases throughout adulthood. </p>\n\n\n\n<p>Figure 3 takes a closer look at Neuroticism. Inconsistent with the maturation model, most models show a weak increase in neuroticism. The only model that shows a weak decrease controls for cohort effects only. One possible explanation for this finding is that it is difficult to distinguish between non-linear and linear age effects and that the negative time effect is actually an age effect. Even if this were true, the effect size of age is small. </p>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://i1.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-14.png?ssl=1\"><img width=\"604\" height=\"603\" src=\"https://i1.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-14.png?resize=604%2C603&amp;ssl=1\" alt=\"\" class=\"wp-image-15427\"></a></figure>\n\n\n\n<p>The results for conscientiousness are most consistent with the maturation hypothesis.  All models show a big increase from age 17 to age 20, and still a substantial increase from age 20 to age 35. At this point, conscientiousness levels remain fairly stable or decrease in the model that controls only for cohort effects.  Although these results are most consistent with the maturation model, they do not support the prediction of a continuous process throughout adulthood. The increase is limited to early adulthood and is stronger at the beginning of adulthood, which is consistent with biological models of development (Costa et al., 2019). </p>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://i0.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-15.png?ssl=1\"><img width=\"604\" height=\"603\" src=\"https://i0.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-15.png?resize=604%2C603&amp;ssl=1\" alt=\"\" class=\"wp-image-15429\"></a></figure>\n\n\n\n<p>Although not central to the maturation model, I also examined the influence of controls on age-effects for Extraversion and Openness. </p>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://i0.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-21.png?ssl=1\"><img width=\"604\" height=\"603\" src=\"https://i0.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-21.png?resize=604%2C603&amp;ssl=1\" alt=\"\" class=\"wp-image-15478\"></a></figure>\n\n\n\n<p>Extraversion shows a very small increase over time in the model without controls and the model that controls only for period (time) effects. However, this trend turns negative in models that control for cohort effects. However, all effect sizes are small. </p>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://i2.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-22.png?ssl=1\"><img width=\"604\" height=\"603\" src=\"https://i2.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-22.png?resize=604%2C603&amp;ssl=1\" alt=\"\" class=\"wp-image-15480\"></a></figure>\n\n\n\n<p>Openness shows different results for models that control for cohort effects or not. Without taking cohort effects into account, openness appears to decrease. However, after taking cohort effects into account, openness stays relatively unchanged until age 30 and then increases gradually. These results suggest that previous cross-section studies may have falsely interpreted cohort effects as age-effects and that openness does not decrease with age.</p>\n\n\n\n<h2>Work and Marriage as Mediators</h2>\n\n\n\n<p>Personality psychologists have focussed on two theories to explain increases in conscientiousness during early adulthood. Some personality psychologists assume that it reflects the end stage of a biological process that increases self-regulation throughout childhood and adolescence (Costa &amp; McCrae, 2006; Costa et al., 2019). The process is assumed to be complete by age 30. The present results suggest that it may be a bit later at age 35.  The alternative theory is the social roles influence personality (Roberts, Wood, &amp; Smith, 2005). A key prediction of the social investment theory is that personality development occurs when adults take on important social roles such as working full time, entering long-term romantic relationships (marriage), or parenting. </p>\n\n\n\n<p>The SOEP makes it possible to test the social investment theory because it included questions about work and marital status. Most young adults start working full-time during their 20s, suggesting that work experiences may produce the increase in conscientiousness during this period. In Germany, marriage occurs later when individuals are in their 30s. Therefore marriage provides a particularly interesting test of the social investment theory because marriage occurs when biological maturation is mostly complete. </p>\n\n\n\n<p>Figure 7 shows the age effect for work status.  The age effect is clearly visible for all models and only slightly influenced by controlling for cohort or time effects. </p>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://i1.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-16.png?ssl=1\"><img width=\"604\" height=\"603\" src=\"https://i1.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-16.png?resize=604%2C603&amp;ssl=1\" alt=\"\" class=\"wp-image-15435\"></a></figure>\n\n\n\n<p>Figure 8 shows the figure for marital status with cohabitating participants counted as married.  The figure confirms that most Germans enter long-term relationships in their 30s. </p>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://i1.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-17.png?ssl=1\"><img width=\"604\" height=\"603\" src=\"https://i1.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-17.png?resize=604%2C603&amp;ssl=1\" alt=\"\" class=\"wp-image-15437\"></a></figure>\n\n\n\n<p>To examine the contribution of work and marriage to the development of conscientiousness, I included marriage and work as predictors of conscientiousness. In this model the age-effects on conscientiousness can be decomposed into (a) an effect mediated by work (age -&gt; work -&gt; C), (b) an effect mediated by marriage (age -&gt; married -&gt; C), and an effect of age that is mediated by unmeasured variables (e.g., biological processes).  Results are similar for the various models and I present the results for the model that controls for cohort and time effects. </p>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://i2.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-18.png?ssl=1\"><img width=\"604\" height=\"603\" src=\"https://i2.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-18.png?resize=604%2C603&amp;ssl=1\" alt=\"\" class=\"wp-image-15440\"></a></figure>\n\n\n\n<p>The results show no effect of marriage; that is the effect size for the indirect effect is close to zero, but both work and unmeasured mediators contribute to the total age effect. The unmeasured mediators produce a step increase in the early 20s. This finding is consistent with a biological maturation hypothesis. Moreover, the unmeasured mediators produce a gradual decline over the life span with a surprising uptick at the end.  This trajectory may be a sign of cognitive decline.  The work effect increases much more gradually and is consistent with the social-role theory.  Accordingly, the decrease in conscientiousness after age 55 is related to retirement.  The negative effect of retirement on conscientiousness raises some interesting theoretical questions about the definition of personality.  Does retirement really alter personality or does it merely alter situational factors that influence conscientious behaviors? To separate these hypotheses, it would be important to examine behaviors outside of work, but the trait measure that was used in this study does not provide information about the consistency of behaviors across different situations. </p>\n\n\n\n<p>The key finding is that the data are consistent with two theories that are often treated as mutually exclusive and competing hypotheses.  The present results suggest that biological processes and social roles contribute to the development of conscientiousness during early adulthood. However, there is no evidence that this process continuous in middle or late adulthood and role effects tend to disappear as soon as individuals are retiring. </p>\n\n\n\n<h2>Personality Development and Well-Being</h2>\n\n\n\n<p>One view of personality assumes that variation is personality is normal and that no personality trait is better than another. In contrast, the maturation model implies that some traits are more desirable, if only because they are instrumental to fulfill roles of adult life like working or maintaining relationships (McCrea &amp; Costa, 1991). Accordingly, more mature individuals should have higher well-being. While meta-analyses suggest that this is the case, they often do not control for rating biases. When rating biases are taken into account, the positive effects of agreeableness and conscientiousness are not always found and are small  (Schimmack, Schupp, &amp; Wagner, 2008; Schimmack &amp; Kim, 2020).  </p>\n\n\n\n<p>Another problem for the maturation theory is that well-being tends to decrease from early to middle adulthood when maturation should produce benefits. However, it is possible that other factors explain this decrease in well-being and maturation buffers these negative effects. To test this hypothesis, I added life-satisfaction to the model and examined mediators of age-effects on life-satisfaction. </p>\n\n\n\n<p>An inspection of the direct relationships of personality traits and life-satisfaction confirmed that life-satisfaction ratings are most strongly influenced by neuroticism, b = -.37, se = .01. Response styles also had notable effects; halo b = .15, se = .01, acquiescence, b = .19, se = .01. The effects of the remaining Big Five traits were weak: E b = .078, se = .01, A = .07, se = .01, C = .02, se = .005, O = .07, se = .01. The weak effect of conscientiousness makes it unlikely that age-effects on conscientiousness contribute to age-effects on life-satisfaction. </p>\n\n\n\n<p>The next figure shows the age-effect for life-satisfaction. The total effect is rather flat and shows only an increase in the 60s. </p>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://i1.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-20.png?ssl=1\"><img width=\"604\" height=\"603\" src=\"https://i1.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-20.png?resize=604%2C603&amp;ssl=1\" alt=\"\" class=\"wp-image-15450\"></a></figure>\n\n\n\n<p>The mostly stable level of life-satisfaction masks two opposing trends. As individuals enter the workforce and get married, life-satisfaction actually increases. The positive trajectory for work reverses when individuals retire, while the positive effect of marriage remains.  However, the positive effects of work and marriage are undone by unexplained factors that decrease well-being until age 50, when a rebound is observed.  Neuroticism is not a substantial mediator because there are no notable age-effects on neuroticism. Conscientiousness is not a notable mediator because it does not predict life-satisfaction. </p>\n\n\n\n<p>The main insight from these findings is that achieving major milestones of adult life is associated with increased well-being, but that these positive effects are not explained by personality development. </p>\n\n\n\n<h2>Discussion</h2>\n\n\n\n<p></p>\n\n\n\n<p>Narrative reviews claim that personality develops steadily through adulthood. For example, in a just published review of the literature Roberts and Yoon claim that “agreeableness, conscientiousness, and emotional stability show increases steadily through midlife” (p. 10). Roberts and Yoon also claim that “forming serious partnerships is associated with decreases in neuroticism and increases in conscientiousness” (p. 11). The problem with these broad and vague statements is that they ignores inconsistencies across cross-sectional and longitudinal analyses (Lucas &amp; Donnellan, 2011), inconsistencies across populations (Graham et al., 2020), and effect sizes (Costa et al., 2019). </p>\n\n\n\n<p>The present results challenge this simplistic story of personality development. First, only conscientiousness shows a notable increase from late adolescence to middle age and most of the change occurs during early adulthood before the age of 35. Second, formation of long-term relationships had no effect on neuroticism or conscientiousness.  Participation in the labor force did increase conscientiousness, but these gains were lost when older individuals retired. If conscientiousness were a sign of maturity, it is not clear why it would decrease after it was acquired. In short, the story of life-long development is not based on scientific facts. </p>\n\n\n\n<p>The notion of personality development is also problematic from a theoretical perspective. It implies that some personality traits are better, more mature, than others. This has led to calls for interventions to help people to become more mature (<a href=\"http://Bleidorn, W., Hill, P. L., Back, M. D., Denissen, J. J. A., Hennecke, M., Hopwood, C. J., Jokela, M., Kandler, C., Lucas, R. E., Luhmann, M., Orth, U., Wagner, J., Wrzus, C., Zimmermann, J., &amp; Roberts, B. (2019). The policy relevance of personality traits. American Psychologist, 74(9), 1056–1067. https://doi.org/10.1037/amp0000503\">Bleidorn et al., 2019</a>).  However, this proposal imposes values and implicitly devalues individuals with the wrong traits. An alternative view treats personality as variation without value judgment. Accordingly, it may be justified to help individuals to change their personality if they want to change their personality, just like gender changes are now considered a personal choice without imposing gender norms on individuals. However, it would be wrong to subject individuals to programs that aim to change their personality, just like it is now considered wrong to subject individuals to interventions that target their sexual orientation. Even if individuals want to change, it is not clear how much personality can be changed. Thus, another goal should be to help individuals with different personality traits to feel good about themselves and to live fulfilling lives that allow them to express their authentic personality. The rather weak relationships between many personality traits and well-being suggests that it is possible to have high well-being with a variety of personalities. The main exception is neuroticism, which has a strong negative effect on well-being. However, the question here is how much of this relationship is driven by mood disorders rather than normal variation in personality. The effect may also be moderated by social factors that create stress and anxiety. </p>\n\n\n\n<p>In conclusion, the notion of personality development lacks clear theoretical foundations and empirical support. While there are some relatively small mean level changes in personality over the life span, they are relatively trivial compared to the large stable variance in personality traits across individuals. Rather than considering this variation as arrested forms of development, it should be celebrate as diversity that enriches everybody’s life.</p>\n\n\n\n<p><strong>Conflict of Interest</strong>: My views may be biased by my (immature) personality (high N, low A, low C). </p>\n\n\n\n<p><strong>P.S. </strong> I asked Brent W. Roberts for comments, but he declined the opportunity.  Please share your comments in the comment section. </p>\n"
}