{
  "title":"How to Build a Monster Model of Well-Being: Part 8",
  "date":"2021-08-03T15:18:28.000000-07:00",
  "author":null,
  "id":"https://replicationindex.com/?p=15271",
  "link":"https://replicationindex.com/2021/08/03/how-to-build-a-monster-model-of-well-being-part-8/",
  "content":"\n<p>So far, I have built a model that relates the Big Five personality traits to well-being. In this model well-being is defined as the weighted average of satisfaction with life domains, positive affect (happy) and negative affect (sad). I showed that most of the personality effects of the Big Five were mediated by the cheerfulness facet of extraversion and the depressiveness facet of neuroticism. I then showed that that there were no gender differences in well-being because women score higher on depressiveness and cheerfulness. Finally, I showed that middle aged parents of students have lower well-being than students and that these age effects were mediated by lower cheerfulness and lower satisfaction with several life domains. The only exception was romantic satisfaction that was higher among parents than among students<br>(<a href=\"https://replicationindex.com/2020/11/30/how-to-build-a-monster-model-of-well-being-part-1/\">Part 1</a>, <a href=\"https://replicationindex.com/2020/12/01/how-to-build-a-monster-model-of-well-being-part-2/\">Part 2</a>, <a href=\"https://replicationindex.com/2021/01/02/monstermodel3/\">Part 3</a> , <a href=\"https://replicationindex.com/2021/07/22/how-to-build-a-monster-model-of-well-being-part-4/\">Part 4</a>. <a rel=\"noreferrer noopener\" href=\"https://replicationindex.com/2021/07/31/how-to-build-a-monster-model-of-well-being-part-5/\">Part 5</a>, <a href=\"https://replicationindex.com/2021/08/01/how-to-build-a-monster-model-of-well-being-part-6/\">Part 6</a>, <a href=\"https://replicationindex.com/2021/08/02/how-to-build-a-monster-model-of-well-being-part-7/\">Part7</a>).  Part 8 examines the relationship between positive illusions and well-being. </p>\n\n\n\n<h3>Positive Illusions and Well-Being</h3>\n\n\n\n<p>Philosophers have debated whether positive illusions should be allowed to contribute to individuals’ well-being (Sumner, 1996). Some philosophers demand true happiness, where illusions can produce experiences of happiness, but these experiences do not count towards an individual’s well-being. Other theories, most prominently hedonism, have no problem with illusory happiness. Ideally, we would just live a perfect simulated live (think The Matrix) and not care one bit about the fact that our experiences are not real. A third version allows for illusions to contribute to our well-being, if we choose a sweet lie over a bitter truth. </p>\n\n\n\n<p>Psychologists tried to settle these questions empirically. An influential article by Taylor and Brown (1988) declared that positive illusions are good for us (our well-being and mental health) and that realistic perceptions of our lives may be maladaptive and may cause depression. In a world of Covid-19, massive forest fires and flooding, this view rings true. However, positive illusions may also have negative effects that can undermine short-lived benefits of positive illusions. </p>\n\n\n\n<p>Diener et al. (1999) list a few studies that seemed to support the view that individuals with positive illusions have higher levels of well-being. However, a key problem in research on positive illusions and well-being is that positive illusions and well-being are often measured with self-ratings. It is therefore unclear whether a positive correlation between these two measures reveals a substantial relationship or simply shared method variance. Relatively few studies have tackled this problem and the results are inconsistent (<a href=\"https://journals.sagepub.com/doi/10.1177/1088868318756467\">Dufner et al., 2019</a>).  Studies that use informant ratings of well-being are particularly rare and suggest that any effect of positive illusions is at best small (Kim, Schimmack, &amp; Oishi, 2012; Schimmack &amp; Kim, 2020). </p>\n\n\n\n<p>The monster-model uses the Mississauga Family Study data that were used by Schimmack and Kim (2020). Thus, no effect of positive illusions on well-being is expected. However, the present model examines a new hypothesis that was not investigated by Schimmack and Kim (2020) because the model focussed on the Big Five and did not include facet measures of cheerfulness and depressiveness. The present study examined whether positive illusions in perceptions of the self are related to cheerfulness and depressiveness. To test this hypothesis, the positive illusion factor of self-ratings was related to cheerfulness, depressiveness as well as to experiences of positive affect, negative affect, and life-satisfaction. </p>\n\n\n\n<p>The model is illustrated in Figure 1. </p>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://i1.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-3.png?ssl=1\"><img width=\"604\" height=\"356\" src=\"https://i1.wp.com/replicationindex.com/wp-content/uploads/2021/08/image-3.png?resize=604%2C356&amp;ssl=1\" alt=\"\" class=\"wp-image-15284\"></a></figure>\n\n\n\n<p>Figure 1 is a bit messy and it may be helpful to read previous posts for the basic model that connects factors (in black) with each other (Black lines). Each factor is based on four indicators (self-ratings, informant ratings by students, informant ratings by mothers, and informant ratings by fathers). Figure 2 shows only the self-ratings as orange boxes marked with sr next to each factor. it is assumed that all of these self-ratings share method variance due to a general evaluative bias factor. This factor is represented as the bigger orange box marked as SR in capital letters. It is assumed that all self-ratings load on this factor (orange arrows). Furthermore, the model assumes a positive effect of cheerfulness on evaluative biases (green arrow) and that positive experiences (happy) are influenced by evaluative biases (another green arrow). Depressiveness is expected to be a negative predictor of the evaluative bias factor (red arrow) and evaluative biases are assumed to have a negative effect on sadness (also a red arrow). </p>\n\n\n\n<p>Fitting this model to the data reduced model fit, chi2( 1591) = 2655, CFI = .960, RMSEA = .022. The reason is that the general evaluative factor did not explain all of the residual correlations among self-ratings. To improve model fit, additional correlated residuals were allowed. For example, residual variance in self-ratings of recreation satisfaction and friendship satisfaction were correlated. These residual correlations were freed to maintain good fit. The fit of the final model was close to the fit to a model that allowed all correlated residual to be correlated, chi2(1542) = 2082, CFI = .980, RMSEA = .016. </p>\n\n\n\n<p>The first important finding was that all self-ratings showed a significant loading (p &lt; .001) on the evaluative bias factor in the predicted direction.  The lowest loading was observed for extraversion, b = .18, se = .04, Z = 4.8. The highest loading was observed for self-ratings of positive affect, b = .62, se = .04, Z = 15.1. The loading for self-ratings of life-satisfaction was b = .51, se = .04, Z = 13.7. These results confirm that evaluative biases make a substantial contribution to self-ratings of well-being. </p>\n\n\n\n<p>Reproducing Schimmack and Kim’s results, evaluative biases did not predict life-satisfaction (i.e., the shared variance by self-ratings and informant ratings), b = .03, se = .04, Z = 0.7. Evaluative biases also predicted neither positive affect (happy), b = .02, se = .04, Z = 0.4, nor negative affect (sadness), b = -.04, se = .05, Z = 0.8. </p>\n\n\n\n<p>The new findings were that cheerfulness was not a significant predictor of evaluative biases, b = .09, se = .06, Z = 1.5, and that depressiveness was a positive rather than negative predictor of evaluative biases, b = .13, se = .06, Z = 2.7.  Thus, there is no evidence that individuals with a depressive personality have a negative bias about their personalities or lives. The positive relationship might be a statistical fluke or it might show some deliberate rating bias to overcorrect for negative biases. </p>\n\n\n\n<p>As hinted at in Part 7, the evaluative bias factor was significantly correlated with age, b = .37, se = .05, Z = 7.5.  At least in this study, parents provided more favorable ratings of themselves than students. Whether this finding shows a general age trend remains to be examined. However, the finding casts a shadow on studies that rely on self-ratings to study personality development. Maybe some of the positive trends such as increased agreeableness or decreased neuroticism are inflated by these biases. It is therefore important to study personality development with measurement models that control for evaluative biases in personality ratings.</p>\n\n\n\n<h3>Conclusion</h3>\n\n\n\n<p>The present results challenge the widely held believe that positive illusions are beneficial for well-being and that the absence of positive illusions is associated with depression. At the same time, the present study did replicate previous findings that measures of positive illusions are correlated with self-ratings of well-being. In my opinion, this finding merely reveals that a positive rating bias also influences self-ratings of well-being. Future research needs to ensure that method bias does not produce spurious correlations between measures of positive illusions and measures of well-being. It is sad but true that thirty years of research have been wasted on studies that did not control for method variance even though method variance in personality ratings has been demonstrated over 100 years ago (Thorndike, 1920) and is one of the most robust and well-replicated findings in personality research (Campbell &amp; Fiske, 1959). </p>\n"
}