{
  "title":"Racism and Traffic Stops",
  "date":"2022-10-19T03:01:04.000000Z",
  "author":null,
  "id":"https://replicationindex.com/?p=19451",
  "link":"https://replicationindex.com/2022/10/18/racism-and-traffic-stops/",
  "content":"\n<p></p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://i0.wp.com/replicationindex.com/wp-content/uploads/2022/10/image-18.png?ssl=1\"><img width=\"604\" height=\"267\" src=\"https://i0.wp.com/replicationindex.com/wp-content/uploads/2022/10/image-18.png?resize=604%2C267&amp;ssl=1\" alt=\"\" class=\"wp-image-19453\"></a></figure>\n\n\n\n<p>Recently, a team of German sociologists combined data about racial biases in police stops in the United States (Stanford Open Policing Project ; Pierson et al., 2020) and data about county-level average levels of racial biases collected  by Project Implicit (Xu et al., 2022).  The key finding was that various measures of racial bias were correlated with racial bias in traffic stops by police (published in the <a href=\"https://journals.sagepub.com/doi/suppl/10.1177/09567976211051272/suppl_file/sj-pdf-1-pss-10.1177_09567976211051272.pdf\">Supplement Table 2</a>). </p>\n\n\n\n<figure class=\"wp-block-image size-full\"><a href=\"https://i0.wp.com/replicationindex.com/wp-content/uploads/2022/10/image-19.png?ssl=1\"><img width=\"604\" height=\"554\" src=\"https://i0.wp.com/replicationindex.com/wp-content/uploads/2022/10/image-19.png?resize=604%2C554&amp;ssl=1\" alt=\"\" class=\"wp-image-19455\"></a></figure>\n\n\n\n<p>The authors missed an opportunity to examine the validity of different measures of racial attitudes under the assumption that all measures, implicit and explicit, reflect a common attitude rather than distinct attitudes (Schimmack, 2021). If implicit measures tapped some distinct form of unconscious bias, they should show incremental predictive validity. To examine this question, I used the correlations in Table 2 and fitted a structural equation model to the data.  I found that a model with a single racial bias factor fitted the data reasonably well, chi2 (df = 9, N ~ 300) = 34.52, CFI = .975, RMSEA = .097.  The effect size of b = .369 for bias implies that for every increase in bias by one standard deviation, there is a .369 increase in racial bias in traffic stops. This is considered a moderate effect size in comparison to other effect sizes in the social sciences. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://i0.wp.com/replicationindex.com/wp-content/uploads/2022/10/image-20.png?ssl=1\"><img width=\"604\" height=\"434\" src=\"https://i0.wp.com/replicationindex.com/wp-content/uploads/2022/10/image-20.png?resize=604%2C434&amp;ssl=1\" alt=\"\" class=\"wp-image-19458\"></a></figure>\n\n\n\n<p>  ,The more interesting result is that the race IAT and simple self-report measures of racial bias are equally valid measures of counties’ average level of racial bias. The effect sizes are .797 for the feeling thermometer, .784 for a simple preference rating, and .834 for the race Implicit Association Test; a computerized task that is less susceptible to socially desirable responding. The high validity coefficients of these measures can be explained by the aggregation of individuals’ scores. Aggregation reduces random measurement error as well as systematic biases that are unique to individuals.  Thus, the present results show that race IAT scores are valid measures of racial biases at the aggregated level. The results also show that self-ratings provide as much valid information. This undermines claims by Greenwald, who developed the IAT, that the race IAT is a more valid measure of racial biases than self-ratings (see also Schimmack, 2021, for studies at the individual level). </p>\n\n\n\n<p>The figure also shows an additional relationship between the race IAT and the weapons IAT. This relationship reveals that IAT tasks reflect some information that is not captured by self-reports. However, it is not clear whether this variance is method variance or valid variance of unconscious bias. In the latter case, the unique variance in the race IAT could predict police stops in addition to the bias factor (incremental predictive validity). </p>\n\n\n\n<p>Adding this path did not improve model fit and the effect size estimate was not significantly different from zero,  b =  -.045, 95%CI = -.305 to .214.  These results are consistent with many other results that the incremental predictive validity of the race IAT is elusive and even if it is not zero, it is likely to be negligible (Kurdi et al., 2019). </p>\n\n\n\n<p>In short, the article could have made a nice contribution to the literature by demonstrating that implicit and explicit measures of racial bias show high convergent validity when they are aggregated to measure racial bias of US counties, and by demonstrating that racial bias predicts an important behavior, namely police officers’ decision to conduct a traffic stop. </p>\n\n\n\n<p>However, the discussion of the results in the article is problematic and may reveal a sociological bias or the lack of lived experience of German researchers. The authors interpret the results as evidence that situational factors explain the results.  </p>\n\n\n\n<p>“<strong>The observed relationships between regional-level bias and police traffic stops underscore the role of the context in which police officers operate. Our findings are consistent with theorizing by Payne et al. (2017), who argued that some contexts expose individuals more regularly to stereotypes and/or prejudice, increasing mental accessibility of biased thoughts and feelings, in turn influencing individual behavior. Consequently, behavioral expressions of prejudice and stereotypes often reflect properties of contexts rather than stable dispositions of people (but see Connor &amp; Evers, 2020)</strong>.”</p>\n\n\n\n<p>The plausible alternative explanation is relegated to a “but see.”  As a German who has lived in the United States and is constantly exposed to US media while living in Canada, I think the “but” deserves more attention and is actually a more plausible explanation of these findings. After all, police officers are not Robo-Cops or United Nations soldiers. They are typically born and raised in the county or in close proximity they are working in (<a href=\"https://en.wikipedia.org/wiki/Flint_Town\">Flint Town</a>).  As a result, their own racial biases are likely to be similar to the racial biases measured in the Project Implicit data (see <a href=\"https://psycnet.apa.org/record/2021-76221-001\">Andersen et al., 2021</a>, for race IAT scores of police officers).  Thus, it is entirely possible that racial biases of police officers, rather than some mysterious unidentified social context,  contribute to the racial biases in police stops.  This does not mean that social factors are not at play. The fact that racial bias is not some involuntary, unconscious bias means that better training and incentives can be used to reduce bias in police officers’ behaviors without changing their attitudes and feelings. Traffic stops are clearly deliberate actions that are not made in a split second. Thus, officers can be trained in avoiding biases in their actions without the need to change their implicit or explicit attitudes. Although attitude change would be desirable, it is difficult and will take time. For now, Black citizens are likely to settle for equal treatment rather than waiting for changes in implicit attitudes that are difficult to measure and have no known effects on behavior. </p>\n\n\n\n<p>In conclusion, it is well known that racism is a problem among US police officers. Often these officers are known and remain on the force.  This study shows that these racial attitudes have clear consequences that sometimes lead to the death of innocent Black civilians. To attribute these incidences to some abstract contextual factors ignores the lived experiences of thousands of African Americans. The data are fully consistent with the common assumption of African Americans that racists cops are more likely to pull them over.  The present study showed that this fear is more justified in counties with higher levels of racism. </p>\n"
}