{
  "title":"Three Ways To Separate Plain Text From HTML Using Java",
  "date":"2022-11-15T16:15:41.000000Z",
  "author":null,
  "id":"http://dzone.com/articles/3284691",
  "link":"http://dzone.com/articles/three-ways-to-separate-plain-text-from-html-using",
  "content":"<p>On each webpage we visit, we are confronted with a huge variety of multimedia content, all of which is put together and presented using <a href=\"https://dzone.com/refcardz/core-html\">Hyper Text Markup Language (HTML)</a>.  HTML is a basic programming language that many developers are familiar with, composed of elements that – when interpreted by a browser – typically form a coherent, organized, and intentional display with various customized elements.  This code provides the framework for how we view images, videos, bodies of writing, hyperlinks, data entry fields, and anything else you can think of on a web page – and all that code is available for anyone to view with a simple right-click on any browser.</p>\n<p>Given the immense volume of formatting elements present in any complex HTML string, the actual subject of the code - the text contents and file paths buried within those strings - can be a bit difficult to access independently of those formatting specifications. If, for example, we want to review web copy and subsequently edit or manipulate that text in a meaningful way, we’re going to have a difficult time copying and pasting that information from the displayed web page directly. We’ll just end up with a mess of inconsistently formatted text riddled with hyperlinks, logos, disjointed tabs and spaces, and more.  This isn’t to say that it can’t be done. We can, of course, copy small snippets of text from any web page and reformat those snippets to resemble their original form in rich text editors like Microsoft Word.  The issue is that this “point and click” approach chews up valuable time in our workday, and if we need to scale up our operation to include multiple websites and thousands of characters worth of text, we’ll be doing ourselves a big disservice in the long run by attempting to do so manually.</p>"
}