{
  "title":"Daily 10 Tech Q&amp;A With Bala",
  "date":"2022-11-16T18:35:49.000000Z",
  "author":null,
  "id":"http://dzone.com/articles/3285173",
  "link":"http://dzone.com/articles/daily-10-tech-qampa-with-bala",
  "content":"<article> \n <p>With the growing number of cyber security threats, it is essential for everyone to know, mitigate, monitor, and prevent attacks on your apps. I have started this technology series as a small contribution to sharing the knowledge of whatever I have gone through so far. I hope my efforts will be useful to many software engineering aspirants and professionals who wish to use this information in their day-to-day work.</p> \n <h2><strong>1. What Are the Important Aspects to Consider in Order to Secure Your Applications?</strong></h2> \n <section> \n  <br> \n  <ul> \n   <li><a href=\"https://dzone.com/articles/authentication-cluster\">Authentication and authorization</a> ( if your authentication part is compromised, hackers can easily penetrate into a user app and do whatever they want, so it is important to safeguard your authentication mechanism to the app, API, or system.</li> \n   <li>Logging:<a href=\"https://dzone.com/articles/application-logging-what-when\"> Application logs</a> are essential and, more importantly, without which you won’t be able to identify any security incident; application-specific data is used for investigation. You should follow the best practices as much as you can to log the data.</li> \n   <li><a href=\"https://dzone.com/articles/what-is-encryption-and-how-does-it-work\">Encryption </a>on data: There are multiple encryption algorithms that I will cover at the end of the video today; it is safe when you encrypt the data while transmitting from sender to receiver. Decryption is done at the receiver level to get the actual data.</li> \n  </ul> \n  <h2><strong>2. Why Should You Use WAF Along With a Firewall?</strong></h2> \n  <p>Firewalls are the first level of protection that permits or blocks network traffic based on IP addresses and port numbers. It can allow traffic to default ports http80 and https443.</p></section></article>"
}