{
  "title":"Episode 443: Your Network Is Your Net Worth with Roman Turner",
  "date":"2022-11-09T13:00:00.000000Z",
  "author":null,
  "id":"0d880f5d-cefc-4bce-aa88-21c737dadb00",
  "link":"https://www.therubyonrailspodcast.com/443",
  "content":"\n        <p>Roman Turner is a classically trained French chef turned developer. He's now a Software Developer at America's Test Kitchen. He and Brittany discuss personal branding, attracting and keeping members in the Ruby/Rails community and advice for junior developers seeking their first role. </p>\n\n<p><strong>Show Notes &amp; Links:</strong></p>\n\n<ul>\n<li><a href=\"https://www.americastestkitchen.com/\" rel=\"nofollow\">America's Test Kitchen</a></li>\n<li><a href=\"http://jewelers-apprentice.com/\" rel=\"nofollow\">Jeweler’s Apprentice</a></li>\n<li><a href=\"https://twitter.com/scoop_law\" rel=\"nofollow\">Roman (@scoop_law) / Twitter</a></li>\n</ul>\n\n<p><strong>Sponsored By:</strong></p>\n\n<p><a href=\"https://www.honeybadger.io/\" rel=\"nofollow\">Honeybadger</a></p>\n\n<p>Honeybadger monitors your cron jobs and services to make sure they don't silently disappear. When Honeybadger is quiet, life is good. Check monitoring off your todo list. Try Honeybadger free for 15 days.</p>\n\n<p><a href=\"https://www.jetbrains.com/ruby/\" rel=\"nofollow\">JetBrains RubyMine</a> </p>\n\n<p>RubyMine is an intelligent cross-platform IDE that provides all essential tools for Ruby and Ruby on Rails developers out of the box. It offers smart code completion and analysis, easy code navigation, safe automated refactorings, an interactive debugger, Git workflow support, database integration, and many other tools. All tools are integrated together in a highly customizable, productive, user-friendly environment.</p>\n\n<p>To get a special 20% discount for the listeners of The Ruby on Rails Podcast just enter the discount code <strong>railspodcast</strong> during <a href=\"https://www.jetbrains.com/ruby/\" rel=\"nofollow\">purchase</a>. You can apply this discount to JetBrains All products pack and use IDEs of your choice.</p>\n      "
}