{
  "title":"Practical Steps To Build Transparency In Your Remote Business",
  "date":"2022-11-04T09:00:00.000000Z",
  "author":null,
  "id":"https://smashingmagazine.com/2022/11/practical-steps-build-transparency-remote-business/",
  "link":"https://smashingmagazine.com/2022/11/practical-steps-build-transparency-remote-business/",
  "content":"<p>It used to be the norm that businesses were opaque, with employees only having access to what they needed to get their work done. Over the past twenty years, though, there has been an increase in transparency in businesses: an <a href=\"https://hbr.org/2012/04/transparency-is-the-new-leader\">article in HBR describes transparency as a leadership imperative</a>, and studies conducted by companies like <a href=\"https://slack.com/intl/en-gb/blog/transformation/trust-tools-and-teamwork-what-workers-want\">Slack</a> and <a href=\"https://www.tinypulse.com/resources/employee-engagement-survey-2013\">Tinypulse</a> highlight the importance of transparency to employees. </p>\n<blockquote>“Transparency is the process of being open, honest, and straightforward about various company operations. Transparent companies share information relating to performance, small business revenue, internal processes, sourcing, pricing, and business values.”<br><br>— <a href=\"https://www.forbes.com/sites/mikekappel/2019/04/03/transparency-in-business-5-ways-to-build-trust/\">Forbes</a></blockquote>\n\n<p>Companies can be transparent with their employees only; others take it further and are transparent with the world. In a remote organization, transparency is even more critical. When you rarely see your colleagues, <strong>transparency helps people feel connected to one another and to the business</strong>. It can also help to reduce timezone bias as it relies on asynchronous communication, which makes it easier for people at any timezone to participate. </p>\n<p>In this article, I will share some tactics for improving transparency within your organization. Some of them are tactics I’ve implemented myself through my years as a remote worker and leading a remote company, and others are best practices and guidance shared by companies leading the pack in terms of remote work.</p>\nTactics To Improve Transparency\n<h3>Default To Open</h3>\n<p>Imagine signing in to your company’s Slack team, where little of the day-to-day work happens in public channels. Some people say hi in the morning or goodbye in the evening, but all the work happens in private channels and DMs. The <code>#general</code> channel is a dead zone. Work happens in silos, and it’s hard to know what is going on at any one time. Individuals have to ask for information when needed, and sometimes they don’t even know where to look. This can cause bottlenecks and slow down work. </p>\n<p>At the opposite end of the spectrum is a remote team where everything is in the open: hundreds of channels cover the whole range of work done in the company, and personal interests are chucked in too. Just by looking at the list of channels in your work’s messaging platform, you’ll see the overall work and identity of the company, and anyone can jump into any channel and connect with what’s going on there. It <strong>makes people feel more connected to work across the company</strong> rather than restricting people to work silos. It also has the advantage of exposing questions and discussions to more people. You never know who might have the answer to your question, and by posting it in public, someone you wouldn’t expect might be able to help. </p>\n<h4>Practical Tips</h4>\n<ul>\n<li><strong>Onboard new employees on how to work in the open through their onboarding period</strong> and gently nudge them to post questions and work discussions in public channels.</li>\n<li><strong>Create naming conventions for your teams’ channels</strong> because you will end up with a lot, and it helps with the organization if people can see them grouped together (e.g., <code>#marketing-content</code>, <code>#marketing-design</code>, <code>#dev-qa</code>, and so on).</li>\n<li>Remember that <strong>some things that shouldn’t be public</strong>. Human Resources matters such as illness or performance and anything that is a <a href=\"https://ico.org.uk/for-organisations/guide-to-data-protection/guide-to-the-general-data-protection-regulation-gdpr/lawful-basis-for-processing/special-category-data#:~:text=personal%20data%20revealing%20religious%20or,used%20for%20identification%20purposes\">special category data under GDPR</a> should not be shared by the company. You can, however, be transparent about what won’t be open. </li>\n</ul>\n<h3>Lean In To Asynchronous Communication</h3>\n<p>Synchronous communication happens in real time, whether that’s on a video or voice call, messaging, teams, or in person. Asynchronous communication happens in your own time, and immediate responses are not requested or expected within the exchange. </p>\n<p>There are many <a href=\"https://remote.com/blog/why-you-should-be-doing-async-work\">reasons why asynchronous communication</a> is beneficial in a remote company:</p>\n<ul>\n<li>Reduces roadblocks as employees don’t need to be online at the same time;</li>\n<li>Increases flexibility for employees as they can prioritize when to respond;</li>\n<li><a href=\"https://language.work/research/killing-time-at-work/\">Combats presenteeism</a>;</li>\n<li>Demonstrates trust in employees;</li>\n<li>Reduces timezone bias;</li>\n<li>Increases transparency as it relies on written communication and documentation.</li>\n</ul>\n<p>Prioritizing asynchronous communication over synchronous communication doesn’t mean that you will never have a meeting or talk at the same time. Instead, it means that your first preference is tools such as documentation and shared issue trackers/task managers instead of having a call. <strong>Documentation</strong> is kept up to date so people can find what they need for themselves, and <strong>issue trackers</strong> capture what someone is doing and where they are at and provide spaces for collaboration that don’t require everyone to be online at the same time. By preferring these practices over synchronous practices, work carried out within the organization is always transparent and available.</p>\n<h4>Practical Tips</h4>\n<ul>\n<li><strong>Choose a tool that people love to use that they can use to keep track of their work.</strong> There are so many project management tools that you should be able to find one that suits your way of working.</li>\n<li><strong>Keep your issue tracker updated with all of the most up-to-date information</strong> about where a task or project is, including links to works in progress, such as Google Docs, Slides, and spreadsheets.</li>\n<li><strong>Create guidelines and onboard people to this way of working.</strong> Don’t just assume that people know how to work asynchronously. If they are from a traditional office, it’s unlikely that they will.</li>\n<li><strong>Encourage everyone to ask, “do I need a meeting for this?”</strong> and make working in other spaces the default. This ensures full transparency of what’s happening, and people can engage in their own time.</li>\n<li><strong>Make sure that decisions are documented</strong> so that everyone knows what action to take and why. </li>\n</ul>\n<h3>Document Processes And Continuously Improve</h3>\n<p>Effective remote companies need to have great documentation. This is especially true as companies grow. When you’re a small number of people, with just a handful of people in each role, it can feel easier just to get on and do the work and not worry about documentation.</p>\n<p>Without embedded, documented practices, different approaches to the same task will proliferate, and it will become difficult to know what is the }}best approach for the organization as a whole}}. The growth that is not managed leads to inefficiencies within the business because things spin up in new ways all the time. When new employees join, they are unclear about whose approach is the right approach, and interpersonal issues may surface just because people disagree about the best way to do things.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c0e19928-c755-4df3-a8be-65a9525e42be/4-practical-steps-build-transparency-remote-business.png\"></p>\n<p>Good documentation creates a shared expectation about how things should be done. A well-documented process should be a ladder rather than a cage. It should provide you with the steps to get to where you want to go, which you might need to adapt to your specific circumstance rather than being something fixed that you have to stick to rigidly. </p>\n<p>For documentation to be useful, it has to be kept up-to-date. Out-of-date documentation is worse than no documentation at all, as it tells you the wrong way to go about doing something. Therefore, I advocate keeping documentation as straightforward and to the point as possible — only enough information so that a reader can achieve their goals. Anything else is just maintenance overhead that you don’t need. </p>\n<p> Once you have good documentation in place, it means that all employees can find what they need by looking at the documentation.</p>\n<p>Employees shouldn’t need to jump on a call for a walkthrough, ping lots of different people to find out what they need, or be confused by the different ways that they are told to do something. This is essential to enable everyone to work autonomously and reduce time wasted on calls because something isn’t written down. </p>\n<h4>Practical Tips</h4>\n<ul>\n<li>Ensure that your <strong>documentation tool has everything you need to ensure that people can navigate and update it easily</strong>. We find built-in version control essential to see what has changed (spoiler: we use WordPress for documentation).</li>\n<li><strong>Add dates to your documentation</strong>, so people know when it was written. If you want to embed practices of continuous improvement, you can add expiry dates to your documents, and process owners are expected to review and complete any updates. </li>\n<li><strong>Provide clear expectations around documentation.</strong> If a process exists, it must be documented.</li>\n<li>Gitlab sets the standard with their <a href=\"https://about.gitlab.com/company/culture/all-remote/handbook-first-documentation/\"><strong>“handbook-first” approach</strong></a>. It’s worth reading how they approach documentation and adapting what is useful to your own context. </li>\n</ul>\n<h3>Manage The Noise</h3>\n<p>An advantage of transparency is that information is there to be found. However, there needs to be the correct systems and processes in place so that people can find them. As someone from a company that has been remote for 10+ years, I’m amazed at the amount of documentation and communication that has built up over the years, not to mention the proliferation of tools. If you’re early in your remote journey, I highly recommend creating structures now that will enable you to keep on top of all the comms as you grow.</p>\n<p><strong>You need to proactively manage your docs and tools</strong>. It’s like a garden: you plant flowers in the flower beds, maybe a few trees and shrubs, and get your lawn looking lovely. But over time, the weeds start to appear, the shrubs become overgrown, and the flowers need to be dead-headed. </p>\n<p>Transparency can have a <a href=\"https://www.glassdoor.com/employers/blog/transparency-in-the-workplace/\">positive impact on your company</a>, but if you don’t tend to your documentation and information, it can end up being like an overgrown garden, where you have to clamber through weeds to get what you want or find a path through it.</p>\n<h4>Practical Tips</h4>\n<ul>\n<li><strong>Create onboarding pathways for different roles</strong> so that when new people join the company, they know where to find what they need and are taken through it step by step.</li>\n<li><strong>Stay on top of your information architecture</strong> and make sure it remains intuitive for employees. Ideally, keep your IA the same or similar across your different tools (e.g., GDrive for docs, handbooks, and so on).</li>\n<li>Often, people will just search for what they need to make sure that you have a working search tool. </li>\n<li><strong>Set expectations about what people need to stay on top of.</strong> It’s important that people are up-to-date on what’s happening in their areas, but do they need to read every piece of communication? </li>\n<li>Create an announcements channel or blog, with the expectation that the only items posted are things that everyone has to read. This makes sure that nothing important gets missed.  </li>\n</ul>\n<h3>Record Meetings And Provide Useful Notes</h3>\n<p>Preferencing asynchronous communication doesn’t mean ever communicating synchronously. There are times when meetings are inevitable and valuable. However, that doesn’t mean that what happens in the meeting needs to stay within the black box of that meeting. We have tools at our disposal to make these transparent, but as with all things, we want these to be as frictionless as possible.</p>\n<p>Recording a meeting so that anyone who is not present can catch up on it can be helpful. Also, this <strong>reduces the need for detailed minutes</strong> as anyone who wants specific details can watch the recording or catch up on the transcript (zoom has built-in transcription features, which provide a good enough transcript to scan what’s going on). This may not be suitable for all meetings as it can have a knock-on effect on people’s behavior, making them more guarded. </p>\n<p>Alongside that, there are the <strong>meeting notes</strong>. There are as many different ways of producing notes as there are people writing them. You need to determine the purpose of your notes to put them in the best format for your organization. When thinking about it, ask yourself what someone who hasn’t attended the meeting needs to know. If a video is available, do they need full minutes or just notes about decisions, actions, and deadlines? Who is going to take the notes? Are they always taken by a specific person, or is it a role that rotates? </p>\n<h4>Practical Tips</h4>\n<ul>\n<li><strong>Always have an agenda for a meeting</strong> and ensure that anyone who adds an item to the agenda also writes a summary with links to supporting documentation. This provides the basis for the notes and means the note taker doesn’t have to re-summarise.</li>\n<li><strong>Make sure everyone knows what the expectations are around meeting notes.</strong> A standard meeting template means that everyone knows what they need to provide before and during the meeting and that everyone reading notes knows what to look for.</li>\n<li><strong>Ask yourself if you need notes every time.</strong> Maybe a video suffices for a discussion, especially if all of your actions are captured in your issue tracker. Maybe it’s enough just to keep an activity log, so everyone stays on top of what’s next.</li>\n</ul>\n<h3>Onboard New Team Members To Transparency</h3>\n<p>Something I have been guilty of is assuming that people will just be able to join the company and instantly normalize how transparent we are. Actually, it’s quite challenging for someone to go from an organization that is not transparent or doesn’t really think about it to one in which everything is out in the open. </p>\n<p>It requires some empathy and imagination to recognize the experience of someone who has just joined the company. As there is a lot of noise, communication, and notifications, there is <strong>a mountain of information to climb</strong> and years of asynchronous communication stacked up. On top of that is the feeling of vulnerability that comes with being a new employee. When the expectation is that everything is discussed in public channels, it can make people feel reticent about putting themselves out there, asking the “stupid” questions that are so important to navigating your way around somewhere new.</p>\n<p>That makes it essential to familiarise people with the concepts and tactics of transparency through the onboarding process and for managers and peers to support new starters with that. You can’t just assume someone will get it, so you need to support them to succeed. </p>\n<h4>Practical Tips</h4>\n<ul>\n<li><strong>Have clear expectations about what people should read and what they can let pass them by.</strong> Otherwise, some people will try to read everything. For most people, the work of their immediate team and essential company announcements suffice to begin with.</li>\n<li><strong>Talk about transparency through the onboarding process</strong>, why it is important, and how you practice it within your company.</li>\n<li><strong>Adjust to your new employee’s level of comfort.</strong> Some people will jump straight into public channels, but others will want to take their time. Work with them in DMs or private channels to begin, with the expectation that you’ll move to the public once they are onboarded.</li>\n<li><strong>Create specific pathways or tables of contents for different roles</strong> to take them through the documentation and training they need to read.</li>\n<li><strong>Provide guides and documentation on how to practice transparency</strong>, especially best practices for documentation and for using your issue tracker.</li>\n</ul>\n<h3>Make Use Of Integrations, APIs And Bots</h3>\n<p>Integrations, APIs, and Bots let us automate work and prevent information from getting stuck in silos. One of the first things I look for when I’m sourcing a new tool is what integrations it has and whether it will integrate with my stack. If it doesn’t have a native integration, does it have an API so we can have a developer build an integration for us? Or, for simple integration, you can use a tool like <a href=\"https://zapier.com/\">Zapier</a> to connect your tools together.</p>\n<p> If you’ve been remote for a long time, you can have a proliferation of tools, and manually moving data between them leaves room for human error and creates a huge administrative burden.</p>\n<p>However, if you don’t transfer your data, it can lead to information remaining in silos and not getting to where it needs to be. If you are building out a stack for your remote team, I highly recommend working with tools and apps that integrate with one another.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7c7404b4-e9d0-4d21-b62a-d4a02c4aeee8/8-practical-steps-build-transparency-remote-business.png\"></p>\n<p>As well as integrations, bots can be massively helpful in automating tasks and removing the need for people to manually run different processes. Some tools that I have found to be useful are  <a href=\"https://geekbot.com/\">geekbot</a>, which we use for standups, and <a href=\"https://www.donut.com/\">donut</a>, which we use for <strong>social connections</strong> like pairing people up for a coffee. You can use integrations to pipe posts from other tools, such as GitHub or Hubspot, into your Slack Channel or MS Teams. Geekbot fatigue is real, though, so beware of having too many standups and bots running simultaneously because if they’re not used well, they can become a bureaucratic task that no one loves.</p>\n<h4>Practical Tips</h4>\n<ul>\n<li><strong>Figure out the bots which are right for your organization.</strong> Both Slack and Teams have a lot of bots available. </li>\n<li><strong>When you are signing up for a new tool, look at the integrations that it currently has</strong> and think about how you might want to use the tool in the future.</li>\n<li><strong>Connect your issue tracker and any other asynchronous tools to your messaging app</strong> so that any activity is piped into relevant channels.</li>\n<li>If bots are causing too much noise, consider creating <strong>firehose channels</strong>, which are just for piping in information from a specific tool or project.</li>\n</ul>\n<h3>Equip Everyone To Give And Receive Feedback</h3>\n<p>When your company is transparent, everything is out in the open all of the time. This means that <strong>a culture of transparency</strong> must go hand in hand with a culture of feedback. Drive-by feedback from people who don’t have context on a specific project is rarely helpful, nor are cryptic one-liners that say something isn’t great but don’t provide anything constructive about why.</p>\n<p>This type of feedback can make people reticent about working in the open, and they can hold things back until they feel it is totally ready. Equally unhelpful are feedback requests that are just “what do you think?” or “can I have feedback?” These requests rarely elicit high-quality feedback.</p>\n<p>When you equip your team to give feedback, you create a space where people are okay putting their half-finished projects out there because they know any feedback will be provided in good faith and will <strong>help them to achieve their goals</strong>. You also need to ensure that people are open to feedback, listen, and receive it in a non-defensive manner. Ultimately, it is up to the person who receives the feedback whether they should implement it or not, but you should always listen and try to understand the other person’s perspective.</p>\n<h4>Practical Tips</h4>\n<ul>\n<li><strong>Set company-wide expectations around feedback.</strong> Some companies might prefer a free-for-all where anyone can provide feedback all the time; others prefer to set the expectation that feedback should come only when it is asked for.</li>\n<li><strong>Be very specific on what you are asking for feedback for</strong>: is it on the design, the content, the tone of voice, the structure, or the message? This will help you to get high-quality feedback.</li>\n<li><strong>Research different feedback methodologies and adopt a few that are right for your company.</strong> <a href=\"https://www.radicalcandor.com/\">Radical Candor</a> is a very popular technique; <a href=\"https://handbook.hmn.md/working-here/continuous-improvement/giving-feedback/\">I like Situation, Behaviour, Impact</a> because of its simplicity, but <a href=\"https://getlighthouse.com/blog/give-feedback-team-sh-t-sandwich/\">there are lots of options out there</a>. Whatever you use should be straightforward enough for anyone to use.</li>\n</ul>\n<h3>Build A Culture Of Transparency</h3>\n<p>You can build transparency into your practices, but you also need to build it into your culture. A common way to do this is to write transparency into your values, which is great but rarely enough. You’ve got to embed transparency into everything you do, which I hope some of the practices above will help with.</p>\n<p>One of the most powerful ways to become more transparent as a company is for people to role-model transparency, especially leaders. If a leader behaves in a particular way, others follow. It follows that if someone at the top does something, then it is acceptable behavior.</p>\n<p>If a leader does everything in Direct Messages, brings people into meetings all the time, and works in silos, then others will do the same. If your leaders default to open communications, asynchronous practices, collaboration, and information sharing, then they create an environment where <strong>others will follow</strong>.</p>\n<p> It’s not enough for a CEO or founder to say they want to be transparent — they have to practice it like everyone else.</p>\n<p>And remember, full transparency isn’t for everyone or for every company. You can set limits on what you are transparent about: some organizations share salaries, others don’t, some share financial info, others don’t, some share everything publicly, and others don’t. Being transparent isn’t necessarily sharing everything; it’s being upfront about what you are going to share, what you aren’t, and why. But remember that some level of transparency in a remote organization will go a long way to helping you be successful.</p>\n<h4>Practical Tips</h4>\n<ul>\n<li><strong>Role-modelling transparent behaviors should be built into the expectations of every leader</strong>. This could be written into role descriptions or behavior frameworks.</li>\n<li>It’s easy to find yourself working on something in a DM or private space; when you do, gently suggest to others that a discussion is moved into a public channel.</li>\n<li><strong>Acknowledge behavior and actions that are transparent.</strong> We have a kudos bot in our HRS which we can use to credit positive behavior, and transparency is a consideration within our career progression framework.</li>\n</ul>\nThe Transparency Trap?\n<p>Generally, I am a big advocate of transparency, but it’s <a href=\"https://www.mckinsey.com/business-functions/people-and-organizational-performance/our-insights/the-dark-side-of-transparency\">not without its pitfalls</a>. If you want your organization to be more transparent, then you need to be aware of what these are so that you can work against them. Some examples are:</p>\n<ul>\n<li>Decision-making can take a lot longer because so many people can provide input.</li>\n<li>Information overload can be a burden on employees, and they can feel fatigued by the amount of communication.</li>\n<li>Employees can feel that they are constantly being observed, which can leave them feeling exposed and vulnerable.</li>\n<li>Some employees will hide what they are doing just to get it right, even if there is nothing to hide.</li>\n<li>People experiment less because they are afraid to take risks or be vulnerable in front of others.</li>\n<li>There is an additional administrative burden as people have to produce meeting notes, update documentation and issue trackers, and generally perform what they are doing.</li>\n<li>Access to a company’s financial information can cause anxiety when times are rocky.</li>\n<li>Creative work may not always benefit from transparency as people can self-censor during the development process.</li>\n<li>Sharing all meetings can lead to self-censorship, which can stifle debate.</li>\n</ul>\n<p>The researcher Ethan Bernstein <a href=\"https://hbr.org/2014/10/the-transparency-trap\">talks about the <strong>“transparency trap”</strong></a> and explains how some organizations have “found the sweet spot between privacy and transparency, getting the benefits of both.” This means employing different types of boundaries to ensure that <strong>privacy is maintained in some areas without losing the benefits of transparency</strong>. However transparent you plan to be, it’s important to keep these challenges in mind so that you can work and don’t overwhelm or undermine your employees while still getting all of the benefits of transparency.</p>\n"
}