{
  "title":"Design Systems: Useful Examples and Resources",
  "date":"2022-11-09T07:00:00.000000Z",
  "author":null,
  "id":"https://smashingmagazine.com/2022/11/design-systems-inspiration-resources-case-studies/",
  "link":"https://smashingmagazine.com/2022/11/design-systems-inspiration-resources-case-studies/",
  "content":"<p>Design systems ensure alignment, reusability, and consistency across a project or brand. And while we have gotten very good at breaking down UIs into reusable components, a lot of design systems aren’t as useful and practical as they could be, or they aren’t even used at all. So how can you make sure that the work you and your team put into a design system really pays off? How can you <strong>create a design system that everyone loves to use</strong>?</p>\n<p>In this post, we’ll take a closer look at <strong>interesting design systems</strong> that have mastered the challenge and at <strong>resources</strong> that help you do the same. We’ll explore how to deal with naming conventions, how motion and accessibility fit into a design system, and dive deep into case studies, Figma kits, and more. We hope that some of these pointers will help you create a design system that works well for you and your team.</p>\n<h3>Table of Contents</h3>\n<p>Below you’ll find quick jumps to real-world design systems and specific design system topics. Scroll down for a general overview. Or <a href=\"https://www.smashingmagazine.com/2022/11/design-systems-inspiration-resources-case-studies/#inspiring-real-world-design-systems\">skip the table of contents</a>.</p>\n<ul>\n  <li><a href=\"#audi-visual-examples-of-do-s-and-don-ts\">Audi Design System</a></li>\n  <li><a href=\"#brand-estonia-custom-design-attributes\">Brand Estonia Design System</a></li>\n  <li><a href=\"#accessibility-in-design-systems\">Carbon Design System</a></li>\n  <li><a href=\"#shopify-if-and-more-data-visualization\">Culture Amp Design System</a></li>\n  <li><a href=\"#deutsche-bahn-content-guidelines-and-ux-writing\">Deutsche Bahn Design System</a></li>\n  <li><a href=\"#shopify-if-and-more-data-visualization\">If Design System</a></li>\n  <li><a href=\"#nord-accessibility-and-naming-conventions\">Nord Design System</a></li>\n  <li><a href=\"#olympic-brand-branding-and-multi-lingual-design\">Olympic Brand Design System</a></li>\n  <li><a href=\"#shopify-if-and-more-data-visualization\">Shopify Design System</a></li>\n  <li><a href=\"#workbench-comprehensive-live-examples\">Workbench Design System</a></li>\n  <li><a href=\"#accessibility-in-design-systems\">accessibility</a></li>\n  <li><a href=\"#brand-expression-in-design-systems\">brand expression</a></li>\n  <li><a href=\"#design-system-case-studies\">case studies</a></li>\n  <li><a href=\"#brand-estonia-custom-design-attributes\">custom design attributes</a></li>\n  <li><a href=\"#shopify-if-and-more-data-visualization\">data visualization</a></li>\n  <li><a href=\"#enterprise-design-system-101\">enterprise design systems</a></li>\n  <li><a href=\"#design-systems-for-figma\">Figma kits</a></li>\n  <li><a href=\"#workbench-comprehensive-live-examples\">live examples</a></li>\n  <li><a href=\"#measuring-a-design-system\">measuring design systems</a></li>\n  <li><a href=\"#motion-in-design-systems\">motion</a></li>\n  <li><a href=\"#olympic-brand-branding-and-multi-lingual-design\">multi-lingual design</a></li>\n  <li><a href=\"#design-system-naming-conventions\">naming conventions</a></li>\n  <li><a href=\"#design-system-roi-calculator\">ROI calculator</a></li>\n  <li><a href=\"#deutsche-bahn-content-guidelines-and-ux-writing\">UX writing</a></li><br>  <li><a href=\"#audi-visual-examples-of-do-s-and-don-ts\">visual examples</a></li>\n  <li><a href=\"#design-system-in-90-days\">workbook</a></li>\n</ul>\n\nInspiring Real-World Design Systems\n<h3>Nord: Accessibility And Naming Conventions</h3>\n<p>Bringing together everything that’s required to manage a healthcare business digitally, Nordhealth creates software that aims to redefine healthcare. As such, their design system <a href=\"https://nordhealth.design/\">Nord</a> is heavily focused on accessibility.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/86142247-6bf8-4405-8308-fa217201f2d7/nord-design-system-opt.png\"></p>\n<p>Nord offers plenty of customization options, themes, and a fully-fledged CSS framework, plus dedicated guides to <a href=\"https://nordhealth.design/naming/\">naming conventions</a> and <a href=\"https://nordhealth.design/localization/\">localization</a>, for example. Unfortunately, the <a href=\"https://nordhealth.design/figma/\">Nord Figma Toolkit</a> isn’t open-sourced yet.</p>\n<h3>Workbench: Comprehensive Live Examples</h3>\n<p>Gusto serves more than 200,000 businesses worldwide, automating payroll, employee benefits, and HR. To enable their team to <strong>develop cohesive and accessible experiences</strong> for Gusto’s platform, the <a href=\"https://workbench.gusto.com/\">Workbench</a> design system encompasses Gusto’s design philosophy, design tokens, creative assets, React components, and utilities — and documentation to tie it all together.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0e0ef814-2122-4d87-b1e6-62ef78970666/workbench-design-system-opt.png\"></p>\n<p>What really stands out in the Workbench system are the comprehensive live examples that explain exactly how components should be used in different contexts. Do’s and don’ts, visual explanations, and implementation details ensure that both designers and developers working with Workbench can <strong>use the design system effectively</strong>. For even more convenience, there’s also a <a href=\"https://marketplace.visualstudio.com/items?itemName=gusto-design-systems.workbench-vscode\">Gusto Workbench VS Code Extension</a> with common snippets for UI components.</p>\n<h3>Olympic Brand: Branding And Multi-Lingual Design</h3>\n<p>The Olympic Games are probably one of the most widely recognized brands in the world. Since the birth of the modern Games more than 125 years ago, hundreds of people have grown and enhanced the Olympic brand. To <strong>increase consistency, efficiency and impact</strong> across all that they do, the IOC hired a Canadian agency to create a comprehensive design system that conveys the timeless values of the Olympic Games and propels the brand into the future.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/fbf44214-e73f-4103-90b7-497e781753cc/olympic-design-system-opt.png\"></p>\n<p>The <a href=\"https://olympics.com/ioc/olympic-brand\">Olympic design system</a> is focused on branding and identity design, but also provides examples of illustrations and graphic elements. It shows how to manage multi-lingual challenges and how to use typography, with plenty of good and not-so-good examples and guidance notes along the way.</p>\n<h3>Brand Estonia: Custom Design Attributes</h3>\n<p>Pure and contrasting nature, digital society, and smart, independent-minded people are the <strong>core values behind the brand</strong> Estonia. The <a href=\"https://brand.estonia.ee/?lang=en\">Brand Estonia design system</a> maps the country’s strengths and shows how to express them through writing, designs, presentations, and videos.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7e8d5fb7-e81a-4651-9a92-9361a62dacdb/estonia-design-system-opt.png\"></p>\n<p>Stories, core messages, facts, and plenty of examples and templates provide a solid foundation for creating texts and designs across the brand — be it on the web, in social media, or print. A special highlight of Estonia’s design system lies on authentic photos and custom <strong>design attributes</strong> such as wordmarks and boulders to underline the message.</p>\n<h3>Audi: Visual Examples Of Do’s And Don’ts</h3>\n<p>Audi UIs range from websites to applications for a particular service. The <a href=\"https://www.audi.com/ci/en/guides/user-interface/introduction.html\">Audi design system</a> provides a joint set of components, modules, and animations to create a well-balanced, system-wide user experience — from the app to the vehicle.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b11a7bc5-74ea-415f-8799-6bd021fdd905/audi-design-system-opt.png\"></p>\n<p>Along with brand appearance guidelines and UI components, a handy feature of the design system is its <strong>comprehensive set of visual examples</strong> of how a component should (and shouldn’t) be used in Audi’s interfaces. There is also a Audi UI Kit for Figma and a Sketch UI library that ensure that designers use the most up-to-date components and icons in their products.</p>\n<h3>Deutsche Bahn: Content Guidelines And UX Writing</h3>\n<p>Deutsche Bahn, the national railway company of Germany, is one of the most recognized brands in Germany. With the help of their <a href=\"https://marketingportal.extranet.deutschebahn.com/en/brandguide/homepage\">DB Digital Product Platform</a>, the company enables developers, designers, and copywriters to build flexible digital experiences with an emphasis on mobility.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3b6899d5-fc08-4e52-9131-51146a588e58/db-design-system-opt.png\"></p>\n<p>The design system features content guidelines, accessibility considerations, code examples, components, and contextual examples of how to use them. It also provides <strong>guidelines around UX writing</strong> and helpful visual guides to accessibility and logo. Everything is open source on GitHub and NPM.</p>\n<h3>Shopify, If, And More: Data Visualization</h3>\n<p>Data is pretty much useless if we can’t make sense of it. Luckily, data visualization helps us tell the full story. But how to include data visualization in a design system? Here are some examples.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d4f08796-d948-4a63-8666-2dcc7f54765d/if-colors-opt.png\"></p>\n<p>Shopify’s design system <a href=\"https://polaris.shopify.com/design/data-visualizations\">Polaris</a> maps out guidelines for how to approach data visualization and defines five core traits for successful data visualizations. Do’s and don’ts for different data visualizations deliver practical examples. <a href=\"https://cultureamp.design/guidelines/data-visualization/\">Culture Amp</a> features helpful further reading <strong>resources for each type of data visualization</strong> they define in their design system. The <a href=\"https://design.if.eu/design/foundation/data-visualization\">If Design System</a> shines a light on color in data visualizations, and the <a href=\"https://carbondesignsystem.com/data-visualization/getting-started/\">Carbon Design System</a> comes with demos and ready-to-use code snippets for React, Angular, Vue, and Vanilla.</p>\n<h3>Design Systems For Figma</h3>\n<p>Atlassian, Uber, Shopify, Slack — these are just a few of the design systems you’ll find on <a href=\"https://www.designsystemsforfigma.com/\">Design Systems For Figma</a>. Curated by Josh Cusick, the site is a growing repository of <strong>freely available Figma kits</strong> of design systems — grouped, organized, and searchable.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/cee57740-8471-46b8-9de0-8aa6d00ca90f/design-systems-for-figma-opt.png\"></p>\n<p>Not featured in the collection, but worth looking into as well, is the <a href=\"https://www.figma.com/community/file/946837271092540314\">GOV.UK design system Figma kit</a>. It focuses specifically on complex user journeys and web forms. Lots of valuable insights and inspiration are guaranteed.</p>\nDesign System Resources\n<h3>Design System Naming Conventions</h3>\n<p>Let’s face it, naming things can be hard. Particularly in a design system, where you need to find names for your components, styles, and states that can be <strong>easily understood by everyone</strong> who works with it. But how to best tackle the task? Ardena Gonzalez Flahavin explores not only <a href=\"https://backlight.dev/blog/naming-conventions-for-design-systems/\">why we should care about naming in our design systems</a> but also what we should keep in mind when doing so.</p>\n<p>Shayna Hodkin also summarized <a href=\"https://www.invisionapp.com/inside-design/naming-conventions/\">best practices for solid naming conventions</a> for the different categories in a design system — from colors and text styles to layer styles and components.</p>\n<p>Another great read on the topic comes from Jules Mahe. To help you <strong>find the right balance</strong> between clarity, searchability, and consistency, Jules summarized <a href=\"https://zeroheight.com/blog/naming-conventions-for-your-design-system/\">tips for naming your design files</a>, understanding what you need to name in a design system, and structuring it. Three useful resources for futureproofing your design system.</p>\n<h3>Accessibility In Design Systems</h3>\n<p>When building a design system, it’s a good idea to include guidelines and documentation for accessibility right from the beginning. By doing so, you reduce the need for repeat accessibility work and <strong>give your team more time to focus</strong> on new things instead of spending it on recreating and testing accessible color palettes or visible focus states again and again. In her <a href=\"https://tetralogical.com/blog/2022/06/24/accessible-design-systems/\">article on accessible design systems</a>, Henny Swan explores what an accessible design system needs to include and how to maintain it.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8e8aa096-31e4-4f21-8bd2-7f3d10091703/accessibility-beyond-compliance-opt.png\"></p>\n<p>To shift the understanding of accessibility from one of basic compliance to a truly inclusive, human-centered experience, the team at AdHoc released their <a href=\"https://adhoc.team/playbook-accessibility/\">Accessibility Beyond Compliance Playbook</a>. It explores several ways to improve accessibility — from the immediate task of building accessible products to creating teams of people that underscore an Accessibility Beyond Compliance mindset.</p>\n<p>Another handy resource to <strong>help you incorporate accessibility efforts</strong> comes from IBM. Their open-source <a href=\"https://carbondesignsystem.com/guidelines/accessibility/overview/\">Carbon Design System</a> is based on WCAG AA, Section 508, and European standards to ensure a better user experience for everyone. It gives valuable insights into how users with vision, hearing, cognitive, and physical impairments experience an interface and what designers should think about to ensure their design patterns are operable and understandable.</p>\n<p>For more <strong>practical tips</strong>, be sure to check out the <a href=\"https://www.ibm.com/able/requirements/requirements/\">IBM Accessibility Requirements</a> checklist on which Carbon is based. It features detailed tips to make different components and design patterns comply with accessibility standards. A way forward to empowering your diverse user base.</p>\n<h3>Brand Expression In Design Systems</h3>\n<p>When it comes to visual elements like icons and illustrations, many companies have difficulties finding the right balance between being on-brand, useful, and scalable. The team behind <em>Design Systems For Figma</em> also faced this challenge and came up with a recipe for creating and scaling a system of visuals. Elena Searcy <a href=\"https://www.designsystemsforfigma.com/blog/brand-expression-in-design-systems-icons-illustrations\">summarized how this system works</a>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2b265783-402a-4bf9-b395-cd3a2c7c9434/design-system-illustrations-opt.png\"></p>\n<p>In her blog post, Elena starts with the smallest visual element, an icon, explaining what her team aims for when choosing and creating icons to make them <strong>align with the brand</strong> and provide real value for the user. Elena also shares insights into how they handle illustrations, including a scalable way of creating them and considerations regarding anatomy, style, and color. A great example of how a set of established rules can help make visuals more meaningful.</p>\n<h3>Motion In Design Systems</h3>\n<p>Motion in design is powerful. It can help to reduce cognitive load, guide users through pages and actions, provide user feedback, improve the discoverability of features, and improve perceived response time. To <strong>make full use of motion</strong>, the design team at Salesforce created an end-to-end motion language for their products: the <a href=\"https://medium.com/salesforce-ux/what-you-need-to-know-about-the-new-salesforce-kinetics-system-ce10e9ae66a9\">Salesforce Kinetics System</a>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1f1de13e-ecc1-4061-8838-9bff19cd01c9/motion-design-systems-opt.png\"></p>\n<p>As Pavithra Ramamurthy, Senior Product Designer at Salesforce, explains, the intention behind the Salesforce Kinetics System is to enable the evolution and scaling of kinetic patterns across products, with design system components that are pre-baked with motion right out-of-the-box.</p>\n<p>But how do you scale these motion patterns from design system to product? How would teams <strong>actually use the artifacts in their daily workflows</strong>? Pavithra wrote a <a href=\"https://medium.com/salesforce-ux/how-we-brought-kinetics-to-salesforces-new-global-navigation-48d6193325db\">case study</a> that takes a closer look to demonstrate the possibilities. Interesting insights guaranteed.</p>\n<h3>Enterprise Design System 101</h3>\n<p>Introducing an enterprise design system is a lot of work. But it is work that will pay off. Especially with large teams, multiple platforms, and numerous user interfaces to manage, having a single source of truth helps <strong>maintain a consistent user experience</strong>. So what do you need to consider when building your own? <a href=\"https://adamfard.com/blog/enterprise-design-system\">Adam Fard takes a closer look</a>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/877d4883-420e-4b31-b35d-47d77096b81f/enterprise-design-systems-opt.png\"></p>\n<p>As Adam explains, an enterprise design system is a system of best practices, reusable design elements, processes, usage guidelines, and patterns that help reinforce the brand, improve the UX design process, and optimize the user experience. He compares it to a box of Lego: the building blocks are the collection of code and design components, the building instructions that you’ll usually find inside the box correspond to <strong>a collection of guidelines</strong>, processes, and best practices that ensure that co-designing and cross-collaboration are seamless. If your enterprise traverses numerous sites or apps, Adam’s writeup is a great opportunity to get familiar with the concept of enterprise design systems.</p>\n<h3>Measuring A Design System</h3>\n<p>When you’ve built a design system or are just about to start working on one, metrics might not be the thing you’re concerned about at first sight. However, measuring your design system is more important than you might think. In his article “<a href=\"https://zeroheight.com/blog/how-to-measure-your-design-system/\">How to measure your design system?</a>”, Jules Mahe dives deeper into why it’s worth the effort.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/df549d2d-2a10-4012-a48b-355a90ca7065/measuring-design-system-opt.png\"></p>\n<p>Jules explains how to define the KPIs for your design system and how to get quantitative data measurements to learn more about a design system’s efficiency. Qualitative data conducted with the help of surveys and interviews make the narrative more compelling. Of course, Jules also takes <strong>a closer look at how to use the data</strong>. As he concludes, measuring a design system is challenging and requires time, but it will be a goldmine and one of the essential levers for your design system’s growth and sustainability.</p>\n<h3>Design System ROI Calculator</h3>\n<p>Your boss is hesitant that the work you’ll put into a design system will eventually pay off? The <a href=\"https://www.knapsack.cloud/calculator\">Design System ROI Calculator</a> might be just what you need to convince them that the time and money invested in a design system is a good investment.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/cd11dd9c-1682-401f-bc4f-c5f308269b97/roi-calculator-opt.png\"></p>\n<p>The ROI calculator helps you understand and project cost savings when implementing a design system. It calculates total employee savings from implementing a design system, as well as <strong>time saving and efficiency gain</strong> by component or UI element. To estimate total savings, you can select between different scenarios based on team size and product calculation.</p>\n<h3>Design System Case Studies</h3>\n<p>Having robust components and patterns that can be reused in different situations is the essential idea behind every design system and often seems like the magical wand everyone has waited for to <strong>solve challenges and improve collaboration</strong>. Henry Escoto, UX &amp; Design at FOX Corporation, offers a perspective on design systems that is a bit different. He claims that it’s actually the practice which can truly make a difference.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4ea23ac9-8603-45ff-87b9-cfc56b6de375/design-systems-case-studies-opt.png\"></p>\n<p>In his case study “<a href=\"https://medium.com/fox-tech/our-design-system-journeys-a533c206f5ca\">Our Design System Journeys</a>”, Henry shares in-depth insights into FOX Tech Design’s design systems Delta and Arches to find answers to the following questions: How will a design system truly help your product design? What does it take to <strong>build and execute a design system</strong> within an organization? How to inject the practice into existing workflows? And last but not least, what is the pay off of such an investment?</p>\n<p>Another interesting case study comes from Jan Klever. Jan is a designer at Quero Educação and also fills the role of the organization’s Design System Ops. He shares from his team’s experience <a href=\"https://bootcamp.uxdesign.cc/ops-the-design-system-has-evolved-6f072696e828\">how having a dedicated Design System Ops role can help when it comes to maintenance</a> and following up on the product.</p>\n<h3>Design System In 90 Days</h3>\n<p>When you’re starting to work on a design system, you do it with the intent to build something that lasts, a system that teams love to use and that saves them precious time in their daily work. However, many attempts to build a design system end up in great libraries that don’t get used as much as you had hoped. But how do you create <strong>a design system that becomes an established part</strong> of your organization’s workflow? SuperFriendly published a <a href=\"https://superfriendly.com/design-systems/books/design-system-90-days/\">practical workbook</a> in which they take you and your team from zero to a design system that lasts — in 90 days.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/dd4bdec3-4b5e-464c-8370-082e8387b59b/90-days-design-system-opt.png\"></p>\n<p>Written for cross-disciplinary teams of design, engineering, and product, the workbook consists of a 130-page PDF and FigJam prompts and Figma templates you’ll use to complete activities. No theory, <strong>only clear instructions</strong> on what to do and how to do it over a 90-day timeframe. At $349, the workbook isn’t cheap, but considering that it can save you about 6–9 months of figuring out what work to do, the investment is definitely worth considering.</p>\nWrapping Up\n<p>Have you come across a design system you found helpful? Or a resource or case study that eased your work and that you’d like to share with others? We’d love to hear about it in the comments below.</p>\n"
}