{
  "title":"Futuristic CSS",
  "date":"2022-10-21T12:00:00.000000Z",
  "author":null,
  "id":"https://smashingmagazine.com/2022/10/futuristic-css/",
  "link":"https://smashingmagazine.com/2022/10/futuristic-css/",
  "content":"<p>I run the yearly State of CSS survey, asking developers about the CSS features and tools they use or want to learn. The survey is actually open right now, so <a href=\"https://survey.devographics.com/survey/state-of-css/2022?source=smashing_magazine_futuristic_css\">go take it</a>!</p>\n<p>The goal of the survey is to help anticipate future CSS trends, and the data is also used by browser vendors to inform their roadmap. </p>\n<p>This year, Lea Verou pitched in as lead survey designer to help select which CSS features to include. But even though we added many new and upcoming features (some of which, like <a href=\"https://caniuse.com/css-nesting\">CSS nesting</a>, aren’t even supported yet), some features were so far off, far-fetched, and futuristic (or just plain made-up!) that we couldn’t in good conscience include them in the survey. </p>\n<p>But it’s fun to speculate. So today, let’s take a look at some CSS features that might one day make their way to the browser… or not!</p>\nCSS Toggles\n<p>The CSS checkbox hack has been around for <a href=\"https://css-tricks.com/the-checkbox-hack/\">over ten years</a>, and it still remains the only way to achieve any kind of “toggle effect” in pure CSS (I actually used it myself recently for <a href=\"https://sachagreif.com/work-with-me/\">the language switcher on this page</a>).</p>\n<p>But what if we had <em>actual</em> toggles, though? What if you could handle tabs, accordions, and more, all without writing a single line of JavaScript code?</p>\n<p>That’s exactly what Tab Atkins and Miriam Suzanne’s <a href=\"https://tabatkins.github.io/css-toggle/\">CSS Toggles</a> proposal wants to introduce. The proposal is quite complex, and the number of details and edge cases involved makes it clear that this will be far from trivial for browser vendors to implement. But hey, one can dream, and in fact, an experimental implementation <a href=\"https://twitter.com/yisibl/status/1581324896310681600\">recently appeared in Chrome Canary</a>!</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b8cb3f85-97c3-4bff-b343-ccbd60a0032d/3-futuristic-css.png\"></p>\nCSS Switch Function\n<p>A major trend in recent years — not only in CSS but in society at large — has been recognizing that we’ve often done a poor job of serving the needs of a diverse population. In terms of web development, this translates into building websites that can adapt not only to different devices and contexts but also to different temporary or permanent disabilities such as color blindness or motion sickness. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bf67cb23-9587-476f-a8fa-25f6958e2cc2/4-futuristic-css.png\"></p>\n<p>The result is that we often need to target these different conditions in our code and react to them, and this is where Miriam Suzanne’s <a href=\"https://css.oddbird.net/rwd/switch/\"><code>switch</code> proposal</a> comes in:</p>\n<pre><code>.foo {\n  display: grid;\n  grid-template-columns: switch(\n    auto /\n     (available-inline-size &gt; 1000px) 1fr 2fr 1fr 2fr /\n     (available-inline-size &gt; 500px) auto 1fr /\n   );\n}\n</code></pre>\n\n<p>While the initial proposal focuses on testing <code>available-inline-size</code> as a way to set up grid layouts, one can imagine the same <code>switch</code> syntax being used for many other scenarios as well, as a complement to media and container queries. </p>\nIntrinsic Typography\n<p><a href=\"https://css-tricks.com/intrinsic-typography-is-the-future-of-styling-text-on-the-web/\">Intrinsic typography</a> is a technique coined by Scott Kellum, who developed the type-setting tool <a href=\"https://typetura.com/\">Typetura</a>. In a nutshell, it means that instead of giving the text a specific size, you let it set its own size based on the dimensions of the element containing it: </p>\n<blockquote>Instead of sizing and spacing text for each component at every breakpoint, the text is given instructions to respond to the areas it is placed in. As a result, intrinsic typography enables designs to be far more flexible, adapting to the area in which it is placed, with far less code.</blockquote>\n\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2bd59246-ada5-427a-8220-0b2f4c528b2b/5-futuristic-css.png\"></p>\n<p>This goes beyond what the already quite useful <a href=\"https://utopia.fyi/type/calculator\">Utopia Type Scale Calculator</a> can offer, as it only adapts based on viewport dimensions — not container dimensions. </p>\n<p>The only problem with Typetura is that it currently requires a JavaScript library to work. As is often the case, though, one can imagine that if this approach proves popular, it’ll <a href=\"https://github.com/w3c/csswg-drafts/issues/6245\">make its way to native CSS</a> sooner or later. </p>\n<p>We can already achieve a lot of this today (or pretty soon, at least) with <a href=\"https://ishadeed.com/article/container-query-units/\">container query units</a>, which lets you reference a container’s size when defining units for anything inside it. </p>\nSibling Functions\n<p>It’s common in Sass to write loops when you want to style a large number of items based on their position in the DOM. For example, to progressively indent each successive item in a list, you could do the following:</p>\n<pre><code>@for $i from 1 through 10 {\n  ul:nth-child(#{$i}) {\n    padding-left: #{$i * 5px}\n  }\n}\n</code></pre>\n\n<p>This would then generate the equivalent of 10 CSS declarations. The obvious downside here is that you end up with ten lines of code! Also, what if your list has more than ten elements?</p>\n<p>An elegant solution currently in the works is <a href=\"https://github.com/w3c/csswg-drafts/issues/4559\">the <code>sibling-count()</code> and <code>sibling-index()</code> functions</a>. Using <code>sibling-index()</code>, the previous example would become:</p>\n<pre><code>ul &gt; li {\n  padding-left: calc(sibling-index() * 5px); \n}\n</code></pre>\n\n<p>It’s an elegant solution to a common need!</p>\nCSS Patterns\n<p>A long, long time ago, I made a little tool called <a href=\"http://www.patternify.com/\">Patternify</a> that would let you draw patterns and export them to base64 code to be dropped inline in your CSS code. My concept was to let you use patterns inside CSS but with <a href=\"https://css-doodle.com/\">CSS Doodle</a>. Yuan Chuan had the opposite idea: what if you used CSS to <em>create</em> the patterns?</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0e3fd70f-49e0-4059-94f4-df2c84ae5f44/2-futuristic-css.png\"></p>\n<p>Now pure-CSS pattern-making <a href=\"https://projects.verou.me/css3patterns/#\">has been around for a while</a> (and recently got more elaborate with the introduction of <a href=\"https://css-tricks.com/background-patterns-simplified-by-conic-gradients/\">conic gradients</a>), but Yuan Chuan definitely introduced some key new concepts, starting with the ability to randomize patterns or easily specify a grid. </p>\n<p>Obviously, CSS Doodle is probably far more intricate than a native pattern API would ever need to be, but it’s still fun to imagine what we could do with just a few more pattern-focused properties. The <a href=\"https://github.com/w3c/csswg-drafts/issues/6807\"><code>@image</code> proposal</a> might be a step in that direction, as it gives you tools to define or modify images right inside your CSS code. </p>\nNative HTML/CSS Charts\n<p>Now we’re really getting into wild speculation. In fact, as far as I know, no one else has ever submitted a proposal or even blogged about this. But as someone who spends a lot of their time working on <a href=\"https://2021.stateofcss.com/\">data visualizations</a>, I think native HTML/CSS charts would be amazing!</p>\n<p>Now, most charts you’ll come across on the web will be rendered using SVG or sometimes Canvas. In fact, this is the approach we use for the surveys through the DataViz library <a href=\"https://nivo.rocks/\">Nivo</a>. </p>\n<p>The big problem with this, though, is that neither SVG nor Canvas are really responsive. You can scale them down proportionally, but you can’t have the same fine-grained control that something like CSS Grid offers. </p>\n<p>That’s why some have tried to lay out charts using pure HTML and CSS, like <a href=\"https://chartscss.org/\">charting library <code>Charts.css</code></a>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/55914b8f-bbc3-42eb-b905-5f8a2ebde89d/6-futuristic-css.png\"></p>\n<p>The problem here becomes that once you go past simple blocky bar charts, you need to use a lot of hacks and complex CSS code to achieve what you want. It can work, and libraries like <code>Charts.css</code> do help a lot, but it’s not easy by any means. </p>\n<p>That’s why I think having native chart elements in the browser could be amazing. Maybe something like:</p>\n<pre><code>&lt;linechart&gt;\n  &lt;series id=&quot;series_a&quot;&gt;\n    &lt;point x=&quot;0&quot; y=&quot;2&quot;/&gt;\n    &lt;point x=&quot;1&quot; y=&quot;4&quot;/&gt;\n    &lt;point x=&quot;2&quot; y=&quot;6&quot;/&gt;\n  &lt;/series&gt;\n  &lt;series id=&quot;series_b&quot;&gt;\n    &lt;point x=&quot;0&quot; y=&quot;6&quot;/&gt;\n    &lt;point x=&quot;1&quot; y=&quot;4&quot;/&gt;\n    &lt;point x=&quot;2&quot; y=&quot;2&quot;/&gt;\n  &lt;/series&gt;\n&lt;/linechart&gt;\n</code></pre>\n\n<p>You would then be able to control the chart’s spacing, layout, colors, and so on by using good old CSS — including media and container queries, to make your charts look good in every situation.</p>\n<p>Of course, this is something that’s already possible through web components, and many are experimenting in this direction. But you can’t beat the simplicity of pure HTML/CSS. </p>\nAnd Also…\n<p>Here are a couple more quick ones just to keep you on your toes:</p>\n<h3>Container Style Queries</h3>\n<p>You might already know that container queries let you define an element’s style based on the width or height of its containing element. <a href=\"https://www.w3.org/TR/css-contain-3/#container-style-query\">Container style queries</a> let you do the same, but based on that container’s — you guessed it — style, and there’s actually already an experimental implementation for it in Chrome Canary. </p>\n<p>As <a href=\"https://css-tricks.com/early-days-of-container-style-queries/\">Geoff Graham points out</a>, this could take the form of something like:</p>\n<pre><code>.posts {\n  container-name: posts;\n}\n\n@container posts (background-color: #f8a100) {\n  /* Change styles when `posts` container has an orange background */\n  .post {\n    color: #fff;\n  }\n}\n</code></pre>\n\n<p>This is a bit like <code>:has()</code>, if <code>:has()</code> lets you select based on styles and not just DOM properties and attributes, which, now that I think about it, might be another cool feature too!</p>\n<h3>Random Numbers</h3>\n<p>People have tried to simulate a random number generator in CSS for a long time (using the <a href=\"https://lea.verou.me/2020/07/the-cicada-principle-revisited-with-css-variables/\">“Cicada Principle” technique</a> and <a href=\"https://uxdesign.cc/creating-randomness-with-pure-css-a990dafcd569\">other hacks</a>), but having true built-in randomness would be great. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/5d9d4458-59ce-4497-b08b-fbdadfac383d/1-futuristic-css.png\"></p>\n<p>A <strong>CSS random number generator</strong> would be useful not just for pattern-making but for any time you need to make a design feel a little more organic. There is <a href=\"https://github.com/w3c/csswg-drafts/issues/2826#issuecomment-1204305712\">a fairly recent proposal</a> that suggests a syntax for this, so it’ll be interesting to see if we ever get CSS randomness!</p>\n<h3>Grid Coordinates Selector</h3>\n<p>What if you could target grid items based on their position in a grid or flexbox layout, either by styling a specific row or column or even by targeting a specific item via its <code>x</code> and <code>y</code> coordinates? </p>\n<p>It might seem like a niche use case at first, but as we use Grid and Subgrid more and more, we might also need new ways of targeting specific grid items. </p>\n<h3>Better Form Styling</h3>\n<p>Styling form inputs has traditionally been such a pain that many UI libraries decide to abstract away the native form input completely and recreate it from scratch using a bunch of <code>div</code>s. As you might imagine, while this might result in nicer-looking forms, it usually comes at the cost of accessibility. </p>\n<p>And while things have been getting better, there’s certainly still a lot we could improve when it comes to forming input styling and styling native widgets in general. The new <a href=\"https://hidde.blog/custom-select-with-selectmenu/\"><code>&lt;selectmenu&gt;</code> element</a> proposal is already a great start in that direction.</p>\n<h3>Animating To Auto</h3>\n<p>We’ve all run into this: you want to animate an element’s height from <code>0</code> to, well, however big it needs to be to show its contents, and that’s when you realize CSS doesn’t let you animate or transition to <code>auto</code>. </p>\n<p>There are <a href=\"https://css-tricks.com/using-css-transitions-auto-dimensions/\">workarounds</a>, but it would still be nice to have this fixed at the browser level. For this to happen, we’ll also need to be able to use <code>auto</code> inside <code>calc</code>, for example <code>calc(auto / 2 + 200px / 2)</code>.</p>\nPredicting The Future\n<p>Now let’s be real for a second: the chances of any of these features being implemented (let alone supported in all major browsers) are slim, at least if we’re looking at the next couple of years.  </p>\n<p>But then again, people thought the same about <code>:has()</code> or native CSS nesting, and it does look like we’re well on our way to being able to use those two — and many more — in our code sooner than later. </p>\n<p>So let’s touch base again five years from now and see how wrong I was. Until then, I’ll keep charting the course of CSS through our yearly surveys. And I hope you’ll help us by <a href=\"https://survey.devographics.com/survey/state-of-css/2022?source=smashing_magazine_futuristic_css\">taking this year’s survey</a>!</p>\n<p><em>Thanks to Lea Verou and Bramus Van Damme for their help with this article.</em></p>\n"
}