{
  "title":"Designing The Perfect Mobile Navigation UX",
  "date":"2022-11-02T14:00:00.000000Z",
  "author":null,
  "id":"https://smashingmagazine.com/2022/11/navigation-design-mobile-ux/",
  "link":"https://smashingmagazine.com/2022/11/navigation-design-mobile-ux/",
  "content":"<p>When it comes to <strong>complex navigation on mobile</strong>, we often think about hamburger menus, full-page overlays, animated slide-in-menus, and a wide range of nested accordions. Not all of these options perform well, and there are some alternative design patterns that are worth exploring. Let’s dive in!</p>\n\n\n<p></p><p>This article is <strong>part of our ongoing series</strong> on <a href=\"/category/design-patterns\">design patterns</a>. It’s also a part of the <a href=\"https://smashingconf.com/online-workshops/workshops/vitaly-friedman-ux/\">4-weeks live UX training</a> 🍣 and is available in our recently released <a href=\"https://smart-interface-design-patterns.com/\">8h-video course</a>.</p>\n1. Avoid Too Many Signposts In Your Navigation\n<p>One of the most common strategies for navigation on mobile is to use a good ol’ <a href=\"https://www.smashingmagazine.com/2017/06/designing-perfect-accordion-checklist/\">accordion</a>. In fact, <strong>accordions work very well</strong> for multiple levels of navigation and are usually better than slide-in menus. However, since we open and collapse menus, we also need to indicate it with an icon. This often results in <strong>too many signs</strong> pulling user’s attention in too many directions.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/35fd061c-5589-4045-8de4-d7c5bae0839a/15-vodafone.jpg\"></p>\n<p>In the example above, <a href=\"https://www.vodafone.de\">Vodafone</a> uses <strong>3 different icons</strong>, pointing either to the bottom (accordion collapsed), to the top (accordion open), or to the right. The latter indicates that the selection is a <em>link</em>, driving users to a category page. This is, however, not immediately obvious.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bd7383bf-d083-4362-98b2-350ddad75c8c/vodafone-mock-up.jpg\"></p>\n<p>An alternative — and perhaps a slightly more obvious way — is by <strong>adding a link underline</strong> to links and removing the icons next to them altogether. As a side effect, if we eventually have to mix collapsible menus and links to categories, it’s perhaps a bit more obvious which is which.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/212a87d1-425b-484a-ad43-3f57c868637f/11-swisscom.jpg\"></p>\n<p>In general, pointing users in too many directions is often unnecessary. It’s quite likely that you’ll be able to achieve better results with <strong>just two icons</strong>, indicating whether an accordion is open or not. That’s how it’s done on <a href=\"https://www.swisscom.ch/\">Swisscom</a> (pictured above), for example.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3d40221d-6c67-4728-b1b4-0ca5a4c78a95/01-posturinn.jpg\"></p>\n<p>Alternatively, <a href=\"https://posturinn.is\">Icelandic Postal Service</a> uses <strong>just one single icon</strong>, and to indicate expansion of the accordion, changes the color of the heading of the section. This seems to be working fairly well, too.</p>\n<p>It’s a good idea to avoid too many icons guiding users in too many directions. If we can get away without them, it’s a good idea to test what happens if we do.</p>\n2. Don’t Overload Your Navigation With Multiple Actions\n<p>Sometimes navigation menus combine <strong>two different functions</strong> in one single navigation bar. For example, what if you have <strong>categories</strong> that you want to link to directly, but then you also want to allow for quick jumps into <strong>sub-menu items</strong>?</p>\n<p>Usually, this means adding two different actions to the same navigation bar. A tap on the title of the category would lead to the category; a tap on the icon would open an accordion or prompt a separate view. And to make this difference a bit more obvious, we often add a <strong>vertical separator</strong>. Unfortunately, in practice, that doesn't work too well.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/10ccbebd-e482-4ccb-82bb-efa5f5852d01/tivoli-separator.png\"></p>\n<p>In the example above on <a href=\"https://www.tivoli.dk/en/\">Tivoli Gardens Copenhagen</a>, each section title is linked to a standalone category page. A tap on the icon on the right, however, opens a separate sub-navigation. Indeed, a vertical separator does help to distinguish between the two actions, but it still <strong>causes plenty of mistakes</strong>.</p>\n<p>Sometimes users want to just <em>assess</em> the navigation at a glance, and they aren’t yet committing to going to a dedicated page. Yet here they are, being <strong>pushed towards a page</strong> just when they aren’t ready to go there at all. And once they do, they then have to return back to the previous page and start all over again. Ideally, we’d avoid this problem altogether.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/47e6eb93-5dbe-46ed-853f-33c41b95ddda/04-mammut.jpg\"></p>\n<p>On <a href=\"https://www.mammut.com/eu/en\">Mammut</a>, the <strong>entire navigation bar</strong> drives the user to the second level of navigation. Their users can move to discover all items within the category or jump into a sub-category. Problems solved. Rather than overloading the navigation bar with separators and separate actions, we can help users <strong>move forward confidently and comfortably</strong> and prevent mistakes altogether. The next action is always just a tap away.</p>\n<p>Always consider adding a link to the category page within the expanded accordion or in a separate view, and assign only a singular function to the entire bar — opening that view. </p>\n3. Use The Billboard Pattern For Top Tasks\n<p>Not every navigation item is equally important. Some items are more frequently used, and they might deserve a little bit more spotlight in your navigation. In fact, if some items are more important than others, we can use the <strong>billboard pattern</strong> and display them more prominently above the navigation.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/5c2e6130-e0be-4f69-af57-c54dbd70a981/billboard-pattern.png\"></p>\n<p>In the examples above — <a href=\"https://www.otto.de\">Otto</a>, <a href=\"https://www.koreapost.go.kr/\">Korea Post</a> and <a href=\"https://deutschepost.de/\">Deutsche Post</a> — we display the most important topics or features more prominently while the rest of the navigation is available, but gets a slightly less prominent presence.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/21bcdebe-9d83-4ab5-aa4a-680381302cb2/otto-billboard-pattern.png\"></p>\n4. Nested Accordions Work For Expert Users\n<p>Just like we might have too many icons, we might end up with too many nested levels of navigation, neatly packaged within <strong>nested accordions</strong>. For complex sites, it seems like one of the few options to present a huge amount of navigation available on the site. In fact, we could argue that by allowing users to jump from any page to any page on the 4th or even 5th level of navigation, we can <strong>massively speed them</strong> up in their journeys.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/52c77133-b31c-4574-add4-fa8c2f8e5b2b/08-european-central-bank.jpg\"></p>\n<p>Surprisingly enough, this seems to be right. <strong>Expert users</strong> typically don’t have massive usability issues with multiple nested accordions. However, <strong>infrequent users</strong> often struggle to find the information that they need because they don’t understand how the information is organized.</p>\n<p>In complex environments, navigation usually <strong>mirrors the way the organization is structured internally</strong>, and without that prior knowledge finding the right route to the right page is difficult at best. In that case, once a user is looking for something very specific, they seem to use search rather than traversing the navigation tree up and down. This becomes apparent especially when the contrast between levels isn’t obvious, such as on <a href=\"https://www.who.int/\">WHO</a>, for example (pictured below).</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1ff18c03-1a35-49b7-9fae-980c2c4d4ab3/07-wto.jpg\"></p>\n<p>If we need to include multiple levels of navigation within nested accordions, it’s a good idea to sparkle just a tiny bit of typographic and visual contrast to the menu so that <strong>every level of navigation is clearly distinct</strong>, and it’s also obvious when links to actual pages start appearing. Compare the quick mock-up below. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/cd2eadda-d19f-41fa-b48e-f501cee5e3fc/21-wto-optimized.jpg\"></p>\n<p>Another way to indicate multiple levels of nesting is by <strong>adding different types of icons</strong> to make it more obvious where users currently are. This is how it’s done on the <a href=\"https://www.su.se/cmlink/stockholm-university\">Stockholm University website</a>. Personally, I wasn’t able to verify how well this design pattern works, but when combined with better typographic contrast, this might be performing better and is definitely worth testing.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/22bf791c-2ec4-42d2-b6e5-4bb5b0c3fd3a/18-stockholm-university.jpg\"></p>\n<p><a href=\"https://dinoffentligetransport.dk/\">DOT</a>, a public transportation website from Denmark, uses the <code>+</code> icon across multiple levels for their nested accordions. While the chevron is positioned on the left, the <code>+</code> are always positioned on the right. Thus, they display <strong>four levels of navigation</strong> with nested accordions. Perhaps it’s a bit too much navigation, but it seems to be working fairly well.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/15569baf-1566-4344-b721-6c945f0bf4f8/dot-nested-accordions.png\"></p>\n<p>On the other hand, it might not be needed at all. <a href=\"https://allianz.de/\">Allianz</a> gets away with using a single icon (chevron up and down), but with <strong>clearly different designs</strong> for every navigation level. The first level is highlighted with white text on a blue background; the second level is designed in bold; and the third level is plain text (which could, of course, be links, too).</p>\n<p>Plus, instead of showing all items at the same time, only <strong>four most important ones</strong> are displayed at first, and the others are available on a separate page. This a great example worth keeping in mind.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bb1b6ecc-c2be-4ca8-855c-d9a0e980d4d5/12-allianz.jpg\"></p>\n<p><strong>Nested accordions</strong> can work with enough contrast between each level. However, if you have more than three levels of navigation, making it work with a bit of indentation and various typographic styles will become quite difficult.</p>\n5. Slide-In-Menus Don’t Perform Very Well\n<p>Admittedly, many navigation menus on mobile aren’t accordions. Because each navigation section might contain dozens and dozens of sub-navigation items, it’s common to see the so-called <strong>slide-in menus</strong>, with navigation items sliding in horizontally and presenting users with a comprehensive menu of all options available on that level.</p>\n<p>With that pattern, <strong>quick jumps</strong> from one level to another are impossible, as users always have to go back to the previous level to move forward.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6a24c7fe-aa00-46c5-9260-ddcc40bf28a4/09-unilever.jpg\"></p>\n<p><a href=\"https://www.unilever.com\">Unilever</a> displays <strong>only one level of navigation at a time</strong>. As users navigate further down the rabbit hole, they are presented with only one level at a time. This does work well to fit all the items and all the levels that an organization might ever need. However, if a user isn’t quite sure where to go, the discovery of content tends to be slower. Also, it’s not necessarily clear where the “Back” button will go to.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3992eeba-9fba-4b61-8b99-b624a01ba7f4/02-deutsche-post.jpg\"></p>\n<p>If we do use a slide-in menu, it’s a good idea to <strong>replace a generic “Back” button</strong> with a more contextual label, explaining to users where exactly they will be returning to. <a href=\"https://deutschepost.de/\">Deutsche Post</a> (pictured above) does just that. Also, notice that the main page of the menu features some of the top tasks on the site, in additionally to the slide-in menu.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/4bef334f-2bfa-49b1-8060-51fda008060c/13-new-england-journal-of-medicine.jpg\"></p>\n<p>Additionally, <a href=\"https://www.nejm.org/\">The New England Journal of Medicine</a> adds some typographic contrast to each section, so it’s a bit more obvious right away what would open up another section and what is a link driving to a new page. In fact, we can go quite far by just <strong>making links more obvious</strong> yet again, as displayed in the example of <a href=\"https://www.adac.de/\">ADAC</a> below.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f96101c2-26fa-490d-bb40-162c15be8b36/22-adac-optimized.jpg\"></p>\n<p>It’s worth noting that <strong>animated slide-ins can be quite disorienting</strong>, distracting, and annoying for people who use the navigation a lot. Add to that the slow speed of content discovery, a few too many icons, and a bit too little contrast between the items, and you have a recipe for disaster.</p>\n<p>A slide-in menu is an option but <strong>rarely the best one</strong>. It surely doesn’t perform as well as accordions where jumps between levels are faster and there is rarely a need to go back. However, accordions aren’t the only option we have — especially when we want to help users <strong>navigate between levels faster</strong>, not slower.</p>\n6. The Navigation Stack Works For Quick Jumps\n<p>As we move users from one level to another, we also need to provide a way for them to move back. But instead of just displaying a &quot;Back&quot; button, we can stack all the previous sections like a breadcrumb under each other. And so we get a <strong>navigation stack</strong>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b57180fa-595b-4857-b513-a345912f0201/cool-blue-stacking.png\"></p>\n<p>On <a href=\"https://www.coolblue.nl/en/mobile-phones/smartphones\">Coolblue</a>, a Dutch retailer, as users keep exploring deeper levels of navigation, they can always return all the way to the previous levels that they’ve been coming from. This allows for <strong>faster jumps between levels</strong>, and is definitely a good idea when driving users from one-page overlay to another.</p>\n7. Use Curtain Pattern To Show Multiple Levels of Navigation\n<p>It shouldn’t be a big revelation that the speed of navigation is at its maximum when we display navigation options right away. This is why we see <strong>large buttons</strong> appearing as large clickable cards, filters, and bottom sheets. However, how do we use it in our navigation menus which barely have any place anyway?</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9748d90c-dfbf-4d0c-83c6-442240efccaa/01-lcfc-vertical-split-navigation.jpg\"></p>\n<p>We could make better use of the available space. For example, what if <strong>split the screen vertically</strong>, showing one level of navigation on each? Very much like a curtain that we’d pull to one side of a window. That’s what <a href=\"https://www.lcfc.com/\">LCFC</a> (pictured above) does. To move between levels, we don’t need to close any menus or return back at all — instead, we click on large areas, move forward, and explore.</p>\n<p>And what if you <strong>need slightly more space</strong> for your lengthy navigation labels? Well, the labels could <strong>wrap onto multiple lines</strong>, or we could reduce the width by replacing text labels with icons (as long as they are unambiguous). It might not work for every project, but it seems to work for <a href=\"https://www.playstation.com/en-us/\">Playstation</a> (pictured below).</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/00619f8d-ced5-4aa1-bd38-66ccf64f3fa9/02-curtain-split-navigation-playstation.jpg\"></p>\n<p>The entire first level of navigation collapses into <em>tabs</em>; yet moving from one level to the other doesn’t require any jumps back. You might be wondering what the three vertical lines represent — ideally, one could drag away the pane, but it doesn’t seem to be working as expected, unfortunately.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ef2e3c73-80a0-410a-929a-4d28a4c7d4f6/espn-curtain-navigation.png\"></p>\n<p><a href=\"https://espn.com/\">ESPN</a> uses a very similar approach but reduces the amount of space for the first level to the minimum. It could be a little bit larger to prevent mistaps, but the idea is pretty much the same: showing <strong>two levels of navigation at the same time</strong>.</p>\n<p>We could use the same approach in other contexts, such as filtering. We display <strong>all filter attributes on the left</strong>, and allow users to choose the specific values for these filters in the second vertical pane. That’s what the filtering experience looks like on <a href=\"https://www.myntra.com\">Myntra</a>, an Indian eCommerce retailer pictured below.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b367d3d9-40ea-451c-b599-1bf08e62071c/03-myntra-filter-selection-triple-view.jpg\"></p>\n<p>If some filters don’t fit in the right pane, users can scroll to explore more or even <strong>search for a specific filter</strong> in the selection. Of course, the &quot;Apply&quot; button has to stay floating. It would be lovely to see the total number of results on that button, too.</p>\n<p>We could take it even further, though. For example, sometimes users need to select filters that are relevant to them and define their values in the next step. In that case, we <strong>group all filters into a few categories</strong> (or even sub-categories), and then present all of the categories and filters as sub-categories side-by-side.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e4b31635-2b04-4f21-b99f-0d15c5c90e66/04-ft-filter-constructor.jpg\"></p>\n<p>With <a href=\"https://markets.ft.com/data/equities/results\">FT Screener</a>, for example, users can add or change criteria by exploring multiple levels at the same time — both the labels for groups and the filters living within those groups. Once a filter has been chosen, it’s added to the overview on the top. That’s a <strong>simple filter constructor</strong> for sophisticated filtering on mobile.</p>\n<p>The vertical split could be used to quickly select one important present or make a single choice. That would be the case for a language selector, for example. We could organize all supported countries and languages as cards or accordions, but they could also work as <strong>vertical tabs</strong>, as it’s done in the footer of <a href=\"https://www.oracle.com/\">Oracle</a>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e7240484-4a6b-419a-a8da-0718d1261197/05-oracle-country-selector.jpg\"></p>\n<p>This way, we display <strong>only options that are relevant to users</strong>. They never have to go to irrelevant sections or pages since they get a preview and can navigate away from it quickly, should they wish to do so.</p>\n<p>In general, the curtain pattern works well with a quite <strong>flat content architecture</strong>, but is difficult to manage with three or more levels. It shows its strengths when the speed of navigation matters and when users are likely to jump between sections a lot. </p>\n<p>It’s <em>way</em> faster than slide-in-menus but less flexible than accordions. Still, a great lil’ helper to keep in mind to <strong>make better use of available space</strong> on mobile.</p>\n8. You Might Not Need 3+ Levels of Navigation\n<p>The curtain pattern works well for two levels of navigation, but you might have many more levels than that. In that case, it might be a good idea to test if it actually has to be this way. What if you <strong>show only two or three levels</strong> via your menu drawer, but then the rest would be available on standalone pages?</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bf8a342c-d254-48e6-b5cc-cbe54bf848e3/16-antwerp-university.jpg\"></p>\n<p><a href=\"https://uantwerpen.be/\">The University of Antwerp</a> gets away with just one level of navigation on mobile. All the sub-section exist on standalone pages as cards. In fact, there are dozens of links on each page, but as long as the <strong>navigation is obvious</strong>, this might be just what you need.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e3483b7d-15f1-4296-a000-600107a5d1ca/17-gov-uk.jpg\"></p>\n<p><a href=\"https://www.gov.uk\">Gov.uk</a> isn’t a particularly small website, but it features <strong>only two main sections</strong> with plenty of subsections in its navigation on mobile. However, no third or fourth-level navigation is accessible from the menu drawer. Everything else is accessible via links and cards on separate pages.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/db36c09a-7d22-490e-ad5e-ffe8c32654f5/20-korean-post.jpg\"></p>\n<p><a href=\"https://www.koreapost.go.kr/\">Korea Post</a> follows along with an interesting twist to that idea. On tap in the menu, it shows all items living on the second level, but also <strong>automatically shows the options from the third level</strong>, too. Additionally, breadcrumbs include drop-downs allowing users to jump quickly between the siblings of each level. You can find out more about that pattern (<em>sideways breadcrumbs</em>) in <a href=\"https://www.smashingmagazine.com/2022/04/breadcrumbs-ux-design/\">Designing A Perfect Breadcrumbs UX</a>.</p>\n<p>Do you need to display more than two levels of navigation? Perhaps it is indeed necessary, but chances are high that it isn’t. So perhaps it’s worth testing a design that features <strong>only two levels</strong>. Additionally, we can add another feature to it to make navigation even faster.</p>\n9. Query User’s Intent With Navigation Queries\n<p>In addition to search and navigation, we could study some of the most frequently visited pages or some of the most popular tasks, and show them directly, as we saw in the <a href=\"https://deutschepost.de/\">Deutsche Post</a> example earlier above.</p>\n<p>We could also add <a href=\"https://www.smashingmagazine.com/2022/04/designing-better-navigation-ux-queries/\">navigation queries</a> to <strong>ask users about their intent</strong>, and allow them to choose a topic relevant to them. Think about it as a mini-search engine for your navigation, designed as a seamless autocomplete experience. This would give users guidance toward the goal and help them navigate more reliably.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1df9fbaa-2e19-4b04-878c-8848cd815c6b/task-cosmos-direk.png\"></p>\n<p><a href=\"https://www.cosmosdirekt.de/\">Cosmos Direkt</a>, a German insurance company, features a &lt;select&gt;-menu that allows users to select a particular task that they’d like to perform on the site. This type of navigation exists additionally to search and classic navigation menu, but <strong>increases the speed to relevance</strong> significantly.</p>\nWrapping Up\n<p>Just as a quick summary, here are a few things to keep in mind when dealing with complex multi-level navigation:</p>\n<ul>\n<li><strong><a href=\"https://www.smashingmagazine.com/2017/06/designing-perfect-accordion-checklist/\">Accordions</a> work well</strong>, and for expert users, they work even if they are nested.</li>\n<li><strong>Remove icons that you don’t need</strong>. Avoid icons pointing in more than two directions.</li>\n<li><strong>Use the billboard pattern</strong> to highlight top tasks that users want to complete on the site.</li>\n<li>For nested navigation levels, make sure that <strong>each level is distinct</strong> (indentation + type styles).</li>\n<li>Whenever possible, <strong>make links obvious</strong> by underlining them.</li>\n<li>Slide-in-menus <strong>don’t perform very well</strong>; they are slow and distracting. Accordions are likely to perform better.</li>\n<li><strong>Keep the navigation stack</strong> of the levels that users browsed through to allow for quick jumps.</li>\n<li><strong>Curtain navigation</strong> is fast! Consider using it when you have two, or at most three, levels of navigation.</li>\n<li>Perhaps we don’t need to show all levels of navigation and instead can bring users to the relevant page to navigate from there.</li>\n</ul>\n\nMeet “Smart Interface Design Patterns”\n<p>If you are interested in similar insights around UX, take a look at <a href=\"https://smart-interface-design-patterns.com/\"><strong>Smart Interface Design Patterns</strong></a>, our shiny new <strong>8h-video course</strong> with 100s of practical examples from real-life projects. Plenty of design patterns and guidelines on everything from accordions and dropdowns to complex tables and intricate web forms — with five new segments added every year. <em>Just sayin’!</em> <a href=\"https://www.youtube.com/watch?v=aSP5oR9g-ss\">Check a free preview</a>.</p>\n<a href=\"https://smart-interface-design-patterns.com/\"><img src=\"https://res.cloudinary.com/indysigner/image/fetch/f_auto,q_80/w_400/https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7cc4e1de-6921-474e-a3fb-db4789fc13dd/b4024b60-e627-177d-8bff-28441f810462.jpeg\"></a>Meet <a href=\"https://smart-interface-design-patterns.com/\">Smart Interface Design Patterns</a>, our new video course on interface design &amp; UX.\n\n<div><a href=\"https://smart-interface-design-patterns.com/\">Jump to the video course →</a></div>\n\n<p></p><p>100 design patterns &amp; real-life \nexamples.<br>8h-video course + live UX training. <a href=\"https://www.youtube.com/watch?v=aSP5oR9g-ss\">Free preview</a>.</p>\nRelated UX Articles\n<ul>\n<li><a href=\"https://www.smashingmagazine.com/2022/04/breadcrumbs-ux-design/\">Designing Perfect Breadcrumbs UX</a></li>\n<li><a href=\"https://www.smashingmagazine.com/2022/04/designing-better-navigation-ux-queries/\">Boosting Navigation UX With Navigation Queries</a></li>\n<li><a href=\"https://www.smashingmagazine.com/2022/08/error-messages-ux-design/\">Designing Better Error Messages UX</a></li>\n<li><a href=\"https://www.smashingmagazine.com/2022/08/authentication-ux-design-guidelines/\">Rethinking Authenticaiton UX</a></li>\n<li><a href=\"https://www.smashingmagazine.com/2021/08/frustrating-design-patterns-disabled-buttons/\">Disabled Buttons UX</a></li>\n<li><a href=\"https://www.smashingmagazine.com/2022/03/designing-better-infinite-scroll/\">Designing A Perfect Infinite Scroll</a></li>\n<li><a href=\"https://www.smashingmagazine.com/category/ux/\">Design Patterns and UX on SmashingMag</a></li>\n</ul>\n"
}