{
  "title":"Putting The Graph In GraphQL With The Neo4j GraphQL Library",
  "date":"2022-11-01T11:00:00.000000Z",
  "author":null,
  "id":"https://smashingmagazine.com/2022/11/graph-neo4j-graphql-library/",
  "link":"https://smashingmagazine.com/2022/11/graph-neo4j-graphql-library/",
  "content":"<p>This article is a sponsored by <a href=\"https://srv.buysellads.com/ads/long/x/TCZPLYDDTTTTTTFR6JINCTTTTTTGPUIVKKTTTTTTCT2NTYYTTTTTTBSEP3H6KN4FKWYNLEZCVQAF5OZNFHIU4RPY27HE\">Neo4j</a></p>\n<p>GraphQL enables an API developer to model application data as a graph, and API clients that request that data to easily traverse this data graph to retrieve it. These are powerful game-changing capabilities. But if your backend isn’t graph-ready, these capabilities could become liabilities by putting additional pressure on your database, consuming greater time and resources.</p>\n<p>In this article, I’ll shed some light on ways you can mitigate these issues when you use a graph database as the backend for your next GraphQL API by taking advantage of the capabilities offered by the open-source <a href=\"https://srv.buysellads.com/ads/long/x/TCZPLYDDTTTTTTFR6JINCTTTTTTGKUIVKKTTTTTTCT2NTYYTTTTTTI4BVH7U4JBCKQ466IDGV2IUWESGCV7WALL5QYYE\">Neo4j GraphQL Library</a>.</p>\nWhat Graphs Are, And Why They Need A Database\n<p>Fundamentally, a graph is a data structure composed of nodes (the entities in the data model) along with the relationships between nodes. Graphs are all about the connections in your data. For this reason, relationships are first-class citizens in the graph data model.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/57e483d5-a44e-4a8d-953e-c47dc8dcbc80/2-graph-neo4j-graphql-library.jpg\"></p>\n<p>Graphs are so important that an entire category of databases was created to work with graphs: graph databases. Unlike relational or document databases that use tables or documents, respectively, as their data models, the data model of a graph database is (you guessed it!) a graph.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/fba15359-dfb1-4dbd-aa11-77fe6b01fcc4/3-graph-neo4j-graphql-library.png\"></p>\n<p>GraphQL is not and was never intended to be a database query language. It is indeed a query language, yet it lacks much of the semantics we would expect from a true database query language like SQL or Cypher. That’s on purpose. You don’t want to be exposing our entire database to all our client applications out there in the world.</p>\n<p>Instead, GraphQL is an API query language, modeling <em>application data</em> as a graph and purpose-built for exposing and querying that data graph, just as SQL and Cypher were purpose-built for working with relational and graph databases, respectively. Since one of the primary functions of an API application is to interact with a database, it makes sense that GraphQL database integrations should help build GraphQL APIs that are backed by a database. That’s exactly what the Neo4j GraphQL Library does — makes it easier to build GraphQL APIs backed by Neo4j.</p>\n<p>One of GraphQL’s most powerful capabilities enables the API designer to express the entire data domain as a graph using nodes and relationships. This way, API clients can traverse the data graph to find the relevant data. This makes better sense because most API interactions are done in the context of relationships. For example, if we want to fetch all orders placed by a specific customer or all the products in a given order, we’re traversing the pattern of relationships to find those connections in our data.</p>\n<p>Soon after GraphQL was open-sourced by Facebook in 2015, a crop of GraphQL database integrations sprung up, evidently in an effort to address the <em>n+1</em> conundrum and similar problems. Neo4j GraphQL Library was one of these integrations. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/08e50e67-d22d-45b3-ad80-aef7106f32e0/2-graph-neo4j-graphql-library.png\"></p>\nCommon GraphQL Implementation Problems\n<p>Building a GraphQL API service requires you to perform two steps:</p>\n<ol>\n<li>Define the schema and type definitions.</li>\n<li>Create resolver functions for each type and field in the schema that will be responsible for fetching or updating data in our data layer.</li>\n</ol>\n<p>Combining these schema and resolver functions gives you an executable GraphQL schema object. You may then attach the schema object to a networking layer, such as a Node.js web server or lambda function, to expose the GraphQL API to clients. Often developers will use tools like Apollo Server or GraphQL Yoga to help with this process, but it’s still up to them to handle the first two steps.</p>\n<p>If you’ve ever written resolver functions, you’ll recall they can be a bit tedious, as they’re typically filled with boilerplate data fetching code. But even worse than lost developer productivity is <a href=\"https://srv.buysellads.com/ads/long/x/TCZPLYDDTTTTTTFR6JINCTTTTTTG5UIVKKTTTTTTCT2NTYYTTTTTTM3YK2QD5YPWCMVMCIIJ5MJW67DMP2ACLKJW277E\">the dreaded <em>n+1</em> query problem</a>. Because of the nested way that GraphQL resolver functions are called, a single GraphQL request can result in multiple round-trip requests to the database. Addressing this typically involves a batching and caching strategy, adding additional complexity to your GraphQL application.</p>\nDoubling Down On GraphQL-First Development\n<p>Originally, the term <em>GraphQL-First Development</em> described a collaborative process. Frontend and backend teams would agree on a GraphQL schema, then go to work independently building their respective pieces of the codebase. Database integrations extend the idea of GraphQL-First development by applying this concept to the database as well. GraphQL-type definitions can now drive the database.</p>\n<p>You can find the full code examples presented here on <a href=\"https://srv.buysellads.com/ads/long/x/TCZPLYDDTTTTTTFR6JINCTTTTTTGEUIVKKTTTTTTCT2NTYYTTTTTTLBCVQW6KSLI2ASUKWD2PHP6AIZW2RUFPYSDV7YT\">GitHub</a>.</p>\n<p>Let’s say you’re building a business reviews application where you want to keep track of businesses, users, and user reviews. GraphQL-type definitions to describe this API might look something like this:</p>\n<pre><code>type Business {\n  businessId: ID!\n  name: String!\n  city: String!\n  state: String!\n  address: String!\n  location: Point!\n  reviews: [Review!]! @relationship(type: &quot;REVIEWS&quot;, direction: IN)\n  categories: [Category!]!\n    @relationship(type: &quot;IN_CATEGORY&quot;, direction: OUT)\n}\n\ntype User {\n  userID: ID!\n  name: String!\n  reviews: [Review!]! @relationship(type: &quot;WROTE&quot;, direction: OUT)\n}\n\ntype Review {\n  reviewId: ID!\n  stars: Float!\n  date: Date!\n  text: String\n  user: User! @relationship(type: &quot;WROTE&quot;, direction: IN)\n  business: Business! @relationship(type: &quot;REVIEWS&quot;, direction: OUT)\n}\n\ntype Category {\n  name: String!\n  businesses: [Business!]!\n    @relationship(type: &quot;IN_CATEGORY&quot;, direction: IN)\n}\n</code></pre>\n\n<p>Note the use of the GraphQL schema directive <a href=\"https://neo4j.com/docs/graphql-manual/current/type-definitions/relationships/\"><code>@relationship</code></a> in our type definitions. <a href=\"https://srv.buysellads.com/ads/long/x/TCZPLYDDTTTTTTFR6JINCTTTTTTGBUIVKKTTTTTTCT2NTYYTTTTTTALHCHWDV5PI53DCKBZPC2LN4JSV5AAW6LIP23SE\">GraphQL schema directives</a> are the language’s built-in extension mechanism and key components for extending and configuring GraphQL APIs — especially with database integrations like Neo4j GraphQL Library. In this case, the <code>@relationship</code> directive encodes the relationship type and direction (in or out) for pairs of nodes in the database.</p>\n<p>Type definitions are then used to define the property graph data model in Neo4j. Instead of maintaining two schemas (one for our database and another for our API), you can now use type definitions to define both the API and the database’s data model. Furthermore, since Neo4j is schema-optional, using GraphQL to drive the database adds a layer of type safety to your application.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8eb8b29f-aeef-4b13-bb15-4f165737e8f0/5-graph-neo4j-graphql-library.jpg\"></p>\nFrom GraphQL Type Definitions To Complete API Schemas\n<p>In GraphQL, you use fields on special types (Query, Mutation, and Subscription) to define the entry points for the API. In addition, you may want to define field arguments that can be passed at query time, for example, for sorting or filtering. Neo4j GraphQL Library handles this by creating entry points in the GraphQL API for <code>create</code>, <code>read</code>, <code>update</code>, and <code>delete</code> operations for each type, as well as field arguments for sorting and filtering.</p>\n<p>Let’s look at some examples. For our business reviews application, suppose you want to show a list of businesses sorted alphabetically by name. Neo4j GraphQL Library automatically adds field arguments to accomplish just this.</p>\n<pre><code>{\n  businesses(options: { limit: 10, sort: { name: ASC } }) {\n    name\n  }\n}\n</code></pre>\n\n<p>Perhaps you want to allow the users to filter this list of businesses by searching for companies by name or keyword. <a href=\"https://srv.buysellads.com/ads/long/x/TCZPLYDDTTTTTTFR6JINCTTTTTTGAUIVKKTTTTTTCT2NTYYTTTTTTMDQQQEIV2BFCJACWNPZPQAUCSPHQ3DUPIPK23VT\">The <code>where</code> argument</a> handles this kind of filtering:</p>\n<pre><code>{\n  businesses(where: { name_CONTAINS: &quot;Brew&quot; }) {\n    name\n    address\n  }\n</code></pre>\n\n<p>You can then combine these filter arguments to express very complex operations. Say you want to find businesses that are in either the Coffee or Breakfast category and filter for reviews containing the keyword “breakfast sandwich:”</p>\n<pre><code>{\n  businesses(\n    where: {\n      OR: [\n        { categories_SOME: { name: &quot;Coffee&quot; } }\n        { categories_SOME: { name: &quot;Breakfast&quot; } }\n      ]\n    }\n  ) {\n    name\n    address\n    reviews(where: { text_CONTAINS: &quot;breakfast sandwich&quot; }) {\n    stars\n    text\n  }\n }\n}\n</code></pre>\n\n<p>Using location data, for example, you can even search for businesses within 1 km of our current location:</p>\n<pre><code>{\n  businesses(\n    where: {\n      location_LT: {\n        distance: 1000\n        point: { latitude: 37.563675, longitude: -122.322243 }\n      }\n    }\n  ) {\n  name\n  address\n  city\n  state\n  }\n}\n</code></pre>\n\n<p>As you can see, this functionality is extremely powerful, and the generated API can be configured through the use of GraphQL schema directives.</p>\nWe Don’t Need No Stinking Resolvers\n<p>As we noted earlier, GraphQL server implementations require resolver functions where the logic for interacting with the data layer lives. With database integrations such as Neo4j GraphQL Library, resolvers are generated for you at query time for translating arbitrary GraphQL requests into singular, encapsulated database queries. This is a huge developer productivity win (we don’t have to write boilerplate data fetching code — yay!). It also addresses the <em>n+1</em> query problem by making a single round-trip request to the database.</p>\n<p>Moreover, graph databases like Neo4j are optimized for exactly the kind of nested graph data traversals commonly expressed in GraphQL. Let’s see this in action. Once you’ve defined your GraphQL type definitions, here’s all the code necessary to spin up your fully functional GraphQL API:</p>\n<pre><code>const { ApolloServer } = require(&quot;apollo-server&quot;);\nconst neo4j = require(&quot;neo4j-driver&quot;);\nconst { Neo4jGraphQL } = require(&quot;@neo4j/graphql&quot;);\n\n// Connect to your Neo4j instance.\nconst driver = neo4j.driver(\n  &quot;neo4j+s://my-neo4j-db.com&quot;,\n  neo4j.auth.basic(&quot;neo4j&quot;, &quot;letmein&quot;)\n);\n\n// Pass our GraphQL type definitions and Neo4j driver instance.\nconst neoSchema = new Neo4jGraphQL({ typeDefs, driver });\n\n// Generate an executable GraphQL schema object and start\n// Apollo Server.\nneoSchema.getSchema().then((schema) =&gt; {\n  const server = new ApolloServer({\n    schema,\n  });\n  server.listen().then(({ url }) =&gt; {\n    console.log(`GraphQL server ready at ${url}`);\n  });\n});\n</code></pre>\n\n<p>That’s it! No resolvers.</p>\nExtend GraphQL With The Power Of Cypher\n<p>So far, we’ve only been talking about basic <code>create</code>, <code>read</code>, <code>update</code>, and <code>delete</code> operations. How can you handle custom logic with Neo4j GraphQL Library?</p>\n<p>Let’s say you want to show recommended businesses to your users based on their search or review history. One way would be to implement your own resolver function with the logic for generating those personalized recommendations built in. Yet there’s a better way to maintain the one-to-one, GraphQL-to-database operation performance guarantee: You can leverage the power of the Cypher query language using the <a href=\"https://srv.buysellads.com/ads/long/x/TCZPLYDDTTTTTTFR6JINCTTTTTTGOUIVKKTTTTTTCT2NTYYTTTTTTM425HWWN74LVRVUV7D7Q7QCCOLEKYAF5IPF2Q3E\"><strong><code>@cypher</code> GraphQL schema directive</strong></a> to define your custom logic within your GraphQL type definitions.</p>\n<p><a href=\"https://srv.buysellads.com/ads/long/x/TCZPLYDDTTTTTTFR6JINCTTTTTT5TUIVKKTTTTTTCT2NTYYTTTTTTNL2KVYUCEZCPJC6K7S3PEAH4RDDC2YFWBDYQ34E\">Cypher is an extremely powerful language</a> that enables you to express complex graph patterns using ASCII-art-like declarative syntax. I won’t go into detail about Cypher in this article, but let’s see how you could accomplish our personalized recommendation task by adding a new field to your GraphQL-type definitions:</p>\n<pre><code>extend type Business {\n  recommended(first: Int = 1): [Business!]!\n    @cypher(\n      statement: &quot;&quot;&quot;\n        MATCH (this)&lt;-[:REVIEWS]-(:Review)&lt;-[:WROTE]-(u:User)\n        MATCH (u)-[:WROTE]-&gt;(:Review)-[:REVIEWS]-&gt;(rec:Business)\n        WITH rec, COUNT(*) AS score\n        RETURN rec ORDER BY score DESC LIMIT $first\n      &quot;&quot;&quot;\n    )\n}\n</code></pre>\n\n<p>Here, the <strong>Business</strong> type has a <strong>recommended</strong> field, which uses the Cypher query defined above to show recommended businesses whenever requested in the GraphQL query. You didn’t need to write a custom resolver to accomplish this. Neo4j GraphQL Library is still able to generate a single database request even when using a custom <strong>recommended</strong> field.</p>\nGraphQL Database Integrations Under The Hood\n<p>GraphQL database integrations like Neo4j GraphQL Library are powered by the <strong>GraphQLResolveInfo</strong> object. This object is passed to all resolvers, including the ones generated for us by Neo4j GraphQL Library. It contains information about both the GraphQL schema and GraphQL operation being resolved. By closely inspecting this object, GraphQL database integrations can generate database queries at the time queries are placed.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/dc243776-bfb9-49ca-8959-6027b62e5de9/4-graph-neo4j-graphql-library.png\"></p>\n<p>If you’re interested, <a href=\"https://srv.buysellads.com/ads/long/x/TFIQNYDDTTTTTT6247INCTTTTTTQ4SDVKKTTTTTTVTWNTYYTTTTTTNDLKRYHKWIV5V7CNAJ72HVCWSSIQ3KC5W4KCJUT\">I recently gave a talk at GraphQL Summit</a> that goes into much more detail.</p>\nPowering Low-Code, Open Source-Powered GraphQL Tools\n<p>An open-source library that works with any JavaScript GraphQL implementation can conceivably power an entire ecosystem of low-code GraphQL tools. Collectively, these tools leverage the functionality of Neo4j GraphQL Library to help make it easier for you to build, test, and deploy GraphQL APIs backed by a real graph database.</p>\n<p>For example, <a href=\"https://srv.buysellads.com/ads/long/x/TFIQNYDDTTTTTT6247INCTTTTTTQ6SDVKKTTTTTTVTWNTYYTTTTTT7DVPABF5JS62MK6624BPMS6Y7DVG3UM6JBCQ3MT\">GraphQL Mesh</a> uses Neo4j GraphQL Library to enable Neo4j as a data source for data federation. Don’t want to write the code necessary to build a GraphQL API for testing and development? The <a href=\"https://srv.buysellads.com/ads/long/x/TFIQNYDDTTTTTT6247INCTTTTTTQCSDVKKTTTTTTVTWNTYYTTTTTTJ77KRKIPB45GHLUWBZMCHJF5B3WVQ2C6MI62KSE\">Neo4j GraphQL Toolbox</a> is an open-source, low-code web UI that wraps Neo4j GraphQL Library. This way, it can generate a GraphQL API from an existing Neo4j database with a single click.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1611fd63-879f-4a3b-946a-b00a694567c0/7-graph-neo4j-graphql-library.png\"></p>\nWhere From Here\n<p>If building a GraphQL API backed by a native graph database sounds interesting or at all helpful for the problems you’re trying to solve as a developer, I would encourage you to give the Neo4j GraphQL Library a try. Also, the <a href=\"https://srv.buysellads.com/ads/long/x/TFIQNYDDTTTTTT6247INCTTTTTTQVSDVKKTTTTTTVTWNTYYTTTTTTI4BVH7U4JBCKQ466IDGV2IUWESGCV7WALL5QYYE\">Neo4j GraphQL Library landing page</a> is a good starting point for documentation, further examples, and comprehensive workshops.</p>\n<p>I’ve also written a book <a href=\"https://srv.buysellads.com/ads/long/x/TFIQNYDDTTTTTT6247INCTTTTTTQPSDVKKTTTTTTVTWNTYYTTTTTTYBWV7VC5NDPCRI66WP42W7WCEB25Q2FC2S6QMMT\"><em>Full Stack GraphQL Applications</em></a>, published by Manning, that covers this topic in much more depth. My book covers handling authorization, working with the frontend application, and using cloud services like Auth0, Netlify, AWS Lambda, and Neo4j Aura to deploy a full-stack GraphQL application. In fact, I’ve built out the very business reviews application from this article as an example in the book! Thanks to Neo4j, this book is now available as a <a href=\"https://srv.buysellads.com/ads/long/x/TFIQNYDDTTTTTT6247INCTTTTTTQKSDVKKTTTTTTVTWNTYYTTTTTTWIGK2NIEOPN2KANLLBICJKHLB3WQMBFL2S3KRVE\">free download</a>.</p>\n<p>Last but not least, I will be presenting a live session entitled “Making Sense of Geospatial Data with Knowledge Graphs” during the NODES 2022 virtual conference on Wednesday, November 16, produced by Neo4j. <a href=\"https://srv.buysellads.com/ads/long/x/TFIQNYDDTTTTTT6247INCTTTTTTQ5SDVKKTTTTTTVTWNTYYTTTTTTIZQF36FKI4VP27IKWDFVJZWAABJQJQW5N3J5HBT\">Registration is free to all attendees</a>.</p>\n"
}