{
  "title":"A Guide To Image Optimization On Jamstack Sites",
  "date":"2022-11-17T10:00:00.000000Z",
  "author":null,
  "id":"https://smashingmagazine.com/2022/11/guide-image-optimization-jamstack-sites/",
  "link":"https://smashingmagazine.com/2022/11/guide-image-optimization-jamstack-sites/",
  "content":"<p>This article is a sponsored by <a href=\"https://www.storyblok.com/\">Storyblok</a></p>\n<p>Today, creating content on the Internet is the norm, not the exception. It has never been easier to build a personalized website, digitalize a product and start seeing results. But what happens when we all start creating content on a massive scale, filling the web with more and more data, and storing hundreds of zettabytes of content?</p>\n<p>Well, it is right at that moment when big brands and hosting platforms, such as Google or Netlify, seek solutions to optimize the data we generate, make the web lighter, and therefore faster, promoting measures and techniques to improve our website’s performance, and rewarding those who do so with better positions in the ranking of their search engines. That is why, today, Web Performance is as important and trendy as having an online presence.</p>\n<p><strong>Table of Contents:</strong></p>\n<ul>\n<li><a href=\"#what-is-web-performance\">What Is Web Performance?</a></li>\n<li><a href=\"#why-image-optimization-is-so-important-for-a-jamstack-site\">Why Image Optimization Is So Important For A Jamstack Site?</a></li>\n<li><a href=\"#fixes-to-common-problems\">Fixes To Common Problems</a></li>\n<li><a href=\"#the-benefits-of-using-an-image-service-cdn\">The Benefits Of Using An Image Service CDN</a></li>\n<li><a href=\"#case-study-image-component-in-a-jamstack-site\">Case Study: Image Component In A Jamstack Site</a></li>\n<li><a href=\"#conclusion\">Conclusion</a></li>\n</ul>\n<h3>What Is Web Performance?</h3>\n<p>Web performance refers to the speed at which a website loads, how fast it’s downloaded, and how an app is displayed on the user’s browser. It is both the objective measurement and the perceived user experience (UX) of an application.</p>\n<p>If you minimize load times, improve UX and make your website faster, more users will be able to access your site regardless of device or Internet connection, increase visitor retention, loyalty, and user satisfaction, and this will ultimately help you achieve your business goals and rank better in search engines.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/790d7f1b-3b90-4399-b457-3a1a312959b3/webpage-performance-test-report-for-the-smashing-magazine-website.png\"></p>\n<h4>The Relation Between Images And Web Performance</h4>\n<p>It is clear that when we think of content, the first thing that comes to mind is text. But if we leave text aside, what other options are left? Video? Images? Yes, images play a very important role on the web today, not only on platforms that are 100% focused on this asset, such as <a href=\"https://www.pinterest.com/\">Pinterest</a> or <a href=\"https://unsplash.com/\">Unsplash</a>, but on most of the web pages we browse on a daily basis.</p>\n<blockquote>According to the Web Almanac in late 2021, 95.9 percent of pages contain at least one <code>&lt;img&gt;</code> tag, and 99.9 percent have generated at least one request for an image resource.<br><br>— <a href=\"https://almanac.httparchive.org/en/2021/media#images\">Media, Images, Web Almanac 2021 chapter</a></blockquote>\n\n<p>And, just as the use of images is so present in content creation, <strong>optimizing them is key to improving our page load speed</strong> and rendering it in the shortest possible time, as images are responsible for more bytes than any other resource. Although in the last years, the size of the image transfer per page has been reduced, thanks to the use of new image optimization techniques, there is still a lot of work to be done.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8fea09bb-c4cc-4df6-9b7d-970cac4d6f39/mobile-image-transfer-size-by-year.png\"></p>\n<p>Images are crucial elements for performance and UX, and data extracted from <a href=\"https://web.dev/vitals/\">Core Web Vitals</a> metrics such as <a href=\"https://web.dev/lcp/\">Largest Contentful Paint</a>, which attempts to identify the most important piece of the above-the-fold content on a given page, proves this.</p>\n<p>According to the analysis carried out in <a href=\"https://almanac.httparchive.org/en/2021/performance#largest-contentful-paint-lcp\">the performance section of Web Almanac</a>, the <code>img</code> tag represents <strong>42% of the LCP elements</strong> of websites, while <strong>71-79%</strong> of the pages <strong>have an image</strong> as an LCP element, because they can also be applied as background using CSS. This data makes it clear that there will be no good performance without well-optimized images.</p>\n<blockquote>Key <a href=\"https://web.dev/vitals/\">user-centric metrics</a> often depend on the size, number, layout, and loading priority of images on the page. This is why a lot of our guidance on performance talks about image optimization.<br><br>— <a href=\"https://addyosmani.com/\">Addy Osmani</a></blockquote>\n\n<h3>Why Image Optimization Is So Important For A Jamstack Site?</h3>\n<p>As you may already know, image optimization is the process that a high-quality image has to go through to be delivered in ideal conditions, sometimes with the help of an <a href=\"https://cloudinary.com/documentation/image_transformations\">Image Transformation API</a> and a global <a href=\"https://www.cloudflare.com/learning/cdn/what-is-a-cdn/\">Content Delivery Network (CDN)</a> to make the process simpler and scalable.</p>\n<p>And while optimizing images is a must in any application, in the Jamstack ecosystem, it is even more paramount, considering that one of the main goals of the Jamstack architecture is to improve web performance.</p>\n<blockquote>Jamstack is an architectural approach that decouples the web experience layer from data and business logic, improving flexibility, scalability, performance, and maintainability.<br><br>— <a href=\"https://jamstack.org/\">Jamstack.org</a></blockquote>\n\n<p>A Jamstack site is decoupled: the front end is separated from the backend and pre-built into <strong>highly optimized static pages</strong> before being deployed. But it’s not all static. It also allows dynamic content by using JS and APIs to talk to backend services.</p>\n<p>And you might ask, what do images have to do with this static site architecture? As Web Almanac addresses in the section on <a href=\"https://almanac.httparchive.org/en/2021/jamstack#images\">the impact of images on Jamstack sites</a>, <strong>images are the main bottleneck for a good UX</strong>. Most of the blame lies with using older formats, such as PNG and JPEG, instead of using the next generation ones, such as WebP or AVIF, making the user wait too long and producing poor scores in Core Web Vitals metrics.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/857ccca6-78fb-4919-a84c-7adef9970d0c/static-site-generators-adoption-by-image-format.png\"></p>\n<p>But if you’re worried that you’re not getting the performance you expected because of large, poorly optimized images, don’t worry because that’s what you’re reading this article for!</p>\nFixes To Common Problems\n<p>In most web performance measurement tools, such as <a href=\"https://www.webpagetest.org/\">WebPageTest</a> or <a href=\"https://pagespeed.web.dev/\">PageSpeed Insights</a>, when we generate a report on the status of our website, we can find parameters related to images. These parameters talk about the size, format, encoding, and so on, namely how optimized our images are.</p>\n<p>In this section, we will enumerate the problems that usually appear due to the use of images and what would be the theoretical optimization technique for each of them.</p>\n<h3>1. Use Compressed Files</h3>\n<p>Imagine working on a project like <a href=\"https://dev.to\">DEV.to</a>, where hundreds of people can upload content to your platform without being reviewed. In such a case, it would be expected for your project to have <strong>large, high-resolution images</strong>, as not everyone is aware of the bandwidth consumption and the slowdown in loading times that this entails.</p>\n<h4>Solution</h4>\n<p>Clearly, we want to give freedom to our content creators, but we can leave to chance neither the resolution nor the speed of delivery and download of the images that will be displayed on our website.</p>\n<p>The solution is to optimize our images, <strong>compressing them and reducing their size</strong> with almost no loss of quality. There’re two well-known compression techniques:</p>\n<ol>\n<li><strong>Lossy compression</strong><br>This compression type uses algorithms that <strong>eliminate the less critical data to reduce the file size</strong>.<br>When considering the use of this lossy technique, we must keep two things in mind: by discarding part of the image information, the <strong>image quality will be negatively impacted</strong>, and if someone were to compress a picture with this technique and we wanted to compress it again, it would lose even more quality.</li>\n<li><strong>Lossless compression</strong><br>On the other hand, lossless compression <strong>compresses the data without interfering with the image quality</strong>.<br>This technique allows the images not to lose quality in subsequent compressions. Still, it leads to a larger file size, which we try to avoid in cases where quality is not a game changer for the project’s value proposition.</li>\n</ol>\n<p><strong>When deciding on one of these techniques, the most important thing is to know our users</strong> and what they are looking for from our website. If we think about social networks, we can see two clear trends, those focusing on text and those focusing on multimedia content.</p>\n<p>It is clear that for text-focused social networks, losing a little bit of image quality is not a big problem for them and can reduce a fifth of the image file size, which would mean a big increase in performance. So it is clear that lossy compression would be the ideal technique for that case. However, for social networks focused on image content, the most important thing is delivering images with exceptional quality, so lossless compression would play a better role here.</p>\n<p><strong>Tip:</strong> <em>While using an Image Service CDN, compression is usually included, but it is always good to know more tools that can help us compress our images. For that, I bring you open-source tools that you can use to add image compression to your development workflow:</em></p>\n<ul>\n<li><a href=\"https://github.com/calibreapp/image-actions\">Calibre Image Actions</a> is a GitHub Action built by performance experts at <a href=\"https://calibreapp.com/\">Calibre</a> that automatically compresses JPEGs, PNGs, and WebPs in Pull Requests;</li>\n<li><a href=\"https://github.com/imgbot/Imgbot\">Imgbot</a>, which will crawl your image files in GitHub and submit pull requests after applying a lossless compression.</li>\n</ul>\n<h3>2. Serve In Next-generation (Next-gen) Formats, Encode Efficiently</h3>\n<p>Part of the problem above may be due to the <strong>use of older image formats</strong> such as JPG and PNG, which provide <strong>worse compression and larger file sizes</strong>. But not only is compression an essential factor in deciding whether to adopt a next-gen image format, but also the speed of its encoding/decoding and the quality improvement.</p>\n<p>While it is true that in recent years we have heard a lot about next-gen formats such as WebP, AVIF, or JPEG XL, it is still surprising how many websites have not migrated to these formats and continue <strong>providing bad UX and bad performance results</strong>.</p>\n<h4>Solution</h4>\n<p>It is time for us to move to a better world, where the compression of our images and their quality have no direct relationship, where we can make them take up as little space as possible without changing their visual appearance, and where next-gen formats are used.</p>\n<p><strong>By using next-gen formats</strong>, we will be able to <strong>reduce the size of our images considerably</strong>, making them <strong>download faster</strong> and consume <strong>less bandwidth</strong>, improving the UX and performance of our website.</p>\n<blockquote>“Modern image formats (AVIF or WebP) can improve compression by up to 50% and deliver better quality per byte while still looking visually appealing.”<br><br>— Addy Osmani (Image optimization expert)</blockquote>\n\n<p>Let’s look at the two most promising formats and how they differ from each other.</p>\n<ul>\n<li><strong>WebP</strong></li>\n</ul>\n<p>It is an image format that <strong>supports lossy and lossless</strong> compression, reducing file size by 25-34% compared to JPEG, as well as <strong>animation</strong> and alpha <strong>transparency</strong>, offering 26% less file size than PNG. It was a clear substitute for these formats until <a href=\"https://caniuse.com/avif\">AVIF</a> and <a href=\"https://caniuse.com/jpegxl\">JPEG XL</a> came out.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7aabd11f-4c71-4808-a9fb-6f7745b4e6d7/webp-image-format-caniuse.png\"></p>\n<p>Its advantages are its <strong>uniform support across most modern browsers</strong>, its lossless 8-bit transparency channel and lossy RGB transparency, and support for metadata of various types and animations. On the other hand, it does not support HDR or wide-gamut images, nor does it support progressive decoding.</p>\n<ul>\n<li><strong>AVIF</strong></li>\n</ul>\n<p>It is an open-source AV1 image file format for <strong>storing still and animated images with better lossy and lossless compression</strong> than most popular formats on the web today, offering a 50% saving in file size compared to JPEG. It is in direct competition with <a href=\"https://caniuse.com/jpegxl\">JPEG XL</a>, which has similar compression quality but more features.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9f19d0b8-2243-4908-bb0d-5cb8e77a1f74/avif-image-format-caniuse.png\"></p>\n<p>The advantages of the AVIF format are that it <strong>supports animations and graphic elements</strong> where JPEG has limitations, <strong>improves JPEG and WebP compression</strong>, supports 12-bit color depth enabling HDR and wide color gamut, monochrome and multichannel images, and transparencies with alpha channel. However, <strong>the major drawback</strong> of AVIF is that it is <strong>not compatible with all browsers</strong> and its encoding/decoding is more expensive in terms of time and CPU, causing some Image CDNs to still not apply AVIF as an automatic format.</p>\n<p><strong>Note</strong>: <em>If you want to know the differences between each format in detail, I recommend you read the article “<a href=\"https://www.smashingmagazine.com/2021/09/modern-image-formats-avif-webp/\">Using Modern Image Formats: AVIF And WebP</a>” by Addy Osmani, and trying out the <a href=\"https://avif-webp-quality-setting.industrialempathy.com/\">AVIF and WebP quality settings picker tool</a>.</em></p>\n<p>And remember, regardless of which format you choose, if you want an effective result, you must generate the compressed files from a master image of the best possible quality.</p>\n<p><strong>Extra tip</strong>: <em>Suppose you want to take advantage of the features of an image format with limited browser support. In that case, you can always use the <code>&lt;picture&gt;</code> HTML tag, as shown in the code below, so that the browser can pick the image format supported in the order provided.</em></p>\n<pre><code>&lt;picture&gt;\n    &lt;!-- If AVIF is not supported, WebP will be rendered. --&gt;\n    &lt;source srcset=&quot;img/image.avif&quot; type=&quot;image/avif&quot;&gt;\n    &lt;!-- If WebP is not supported, JPG will be rendered --&gt;\n    &lt;source srcset=&quot;img/image.webp&quot; type=&quot;image/webp&quot;&gt;\n    &lt;img src=&quot;img/image.jpg&quot; width=&quot;360&quot; height=&quot;240&quot; alt=&quot;The last format we want&quot;&gt;\n&lt;/picture&gt;\n</code></pre>\n\n<h3>3. Specify The Dimensions</h3>\n<p>When the <strong><code>width</code> and <code>height</code> attributes have not been added</strong> to the <code>&lt;img&gt;</code> tag, the browser cannot calculate the aspect ratio of the image and therefore does <strong>not reserve a correctly sized placeholder box</strong>. This leads to a layout shift when the image loads, causing performance and usability issues.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6070530f-1e89-4d43-a993-fb4e12a5bc24/image-width-and-height-missing-example.png\"></p>\n<h4>Solution</h4>\n<p>As developers, it is in the palm of our hands to improve the UX and make the layout shifts less likely to happen. We already have part of the way done by adding <code>width</code> and <code>height</code> to the images.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/06254d2e-5911-4d39-a4b4-e3015fa36b89/image-width-and-height-included-example.png\"></p>\n<p>At first glance, it seems like a simple task, but in the background, browsers do a tedious job of calculating the size of these images in different scenarios:</p>\n<ul>\n<li><strong>For images that are resized in responsive design.</strong></li>\n</ul>\n<p>If we have a responsive design, we will want the image to stay within the margins of the container, using the CSS below for that:</p>\n<pre><code>img {\n  max-width: 100%;\n  height: auto;\n}\n</code></pre>\n\n<p>For browsers to calculate the aspect ratio and then the correct size of our images before loading, our <code>&lt;img&gt;</code> tag must contain the defined <code>height</code> and <code>width</code> attributes when we specify the height (or width) in the CSS and the opposite property, width (or height), as auto. </p>\n<p>If there is no <code>height</code> attribute in the <code>&lt;img&gt;</code>, the CSS above sets the height to 0 initially, and therefore there will be a content shift when the image loads.</p>\n<div>\n<pre><code>&lt;img src=&quot;image.webp&quot; width=&quot;700&quot; height=&quot;500&quot; alt=&quot;The perfect scenario&quot;&gt;\n\n&lt;style&gt;\nimg {\n    max-width: 100%;\n  height: auto;\n}\n&lt;/style&gt;\n</code></pre>\n</div>\n\n<ul>\n<li><strong>For responsive images that can change their aspect ratio.</strong></li>\n</ul>\n<p>In the latest versions of Chromium, you can set <a href=\"https://github.com/whatwg/html/pull/5894\"><code>width</code> and <code>height</code> attributes on <code>&lt;source&gt;</code> elements</a> inside <code>&lt;picture&gt;</code>. This allows the parent container to have the right height before the image is loaded and to avoid layout shifts for different images.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/30de7f62-680c-4ca6-93e7-00dfb4b9e790/width-html-source-element-caniuse.png\"></p>\n<div>\n<pre><code>&lt;picture&gt;\n  &lt;source media=&quot;(max-width: 420px)&quot; srcset=&quot;small-image.webp&quot; width=&quot;200&quot; height=&quot;200&quot;&gt;\n  &lt;img src=&quot;image.webp&quot; width=&quot;700&quot; height=&quot;500&quot; alt=&quot;Responsive images with different aspect ratios.&quot;&gt;\n&lt;/picture&gt;\n</code></pre>\n</div>\n\n<p><strong>Note</strong>: <em>To know more about this topic, I recommend you to look at the article “<a href=\"https://www.smashingmagazine.com/2020/03/setting-height-width-images-important-again/\">Setting Height And Width On Images Is Important Again</a>” by Barry Pollard.</em></p>\n<h3>4. Optimize Images For All Devices, And Resize them Appropriately</h3>\n<p>Usually, with CSS, we have the superpower to make our images occupy the space we want; the problem is that all superpower comes with great responsibility. <strong>If we scale an image without previously having optimized it for that use case, we will make the browser load an image with an inadequate size</strong>, worsening the loading time.</p>\n<p>When we talk about images that are not optimized for the device and/or viewport on which they are displayed, there are three different cases:</p>\n<ul>\n<li><strong>The change of resolution</strong><br>When large images intended for desktops are displayed on smaller screens consuming up to 4 times more data, or vice versa, from mobile to desktop, losing image quality when enlarged.   </li>\n<li><strong>The change of pixel density</strong><br>When images resized by pixels are represented on screens with higher pixel density and not providing the best image quality.</li>\n<li><strong>The change of design</strong><br>When an image with important details loses its purpose on other screen sizes by not serving a cropped image highlighting them.</li>\n</ul>\n<h4>Solution</h4>\n<p>Fortunately, today we have responsive image technologies to solve the three problems listed above by offering different versions, in size, resolution, and/or design, of each image to browsers so that they determine which image to load based on the user’s screen size, and/or device features.</p>\n<p>Now let’s see how these solutions are implemented in HTML for each case:</p>\n<p>1. <strong>Resolution change fix:</strong> Responsive images with different sizes</p>\n<p>The solution is to <strong>properly resize the original image</strong> according to the viewport size.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/24d9944a-a85c-4acd-8f35-162f811b4794/responsive-images-with-different-sizes.png\"></p>\n<p>To do this, using the <code>&lt;img&gt;</code> tag with the <code>src</code> attribute won’t be enough since it only allows to specify an image file to the browser. But by adding the <a href=\"https://developer.mozilla.org/docs/Web/HTML/Element/img#attr-srcset\"><code>srcset</code></a> and <a href=\"https://developer.mozilla.org/docs/Web/HTML/Element/img#attr-sizes\"><code>sizes</code></a> attributes, we can specify more versions of the same image and media conditions so the browser can choose which one to display.</p>\n<p>Let’s see a simple example of a responsive image and understand each attribute:</p>\n<div>\n<pre><code>&lt;img\n    src=&quot;image-desktop.webp&quot;\n    srcset=&quot;image-mobile.webp 360w, image-tablet.webp 760w, image-desktop.webp 1024w&quot;\n    sizes=&quot;(max-width: 1024px) calc(100vw - 4rem), 1024px&quot;\n    alt=&quot;Image providing 3 different sizes for 3 viewports&quot;&gt;\n</code></pre>\n</div>\n\n<ul>\n<li><strong><code>src</code></strong><br>We must always add the <code>src</code> attribute to our images just in case the browser does not support <code>srcset</code> and <code>sizes</code> attributes. The <code>src</code> will serve as a fallback, so adding an <strong>image large enough</strong> to work on most devices is crucial.</li>\n<li><strong><code>srcset</code></strong><br>The <code>srcset</code> attribute is used to define a <strong>set of images with their corresponding width descriptors</strong> (image widths represented in the unit <strong>w</strong>), separated by commas, from which the browser can choose.<br>In the above example, we can see that <code>360w</code> is a width descriptor that tells the browser that image-mobile.webp is 360px wide.</li>\n<li><strong><code>sizes</code></strong> [Optional]<br>The <code>sizes</code> attribute ensures that <strong>responsive images are loaded based on the width they occupy</strong> in the viewport and not the screen size.<br>It consists of a comma-separated <strong>list of media queries that indicate how wide the image will be when displayed</strong> under specific conditions, ending with a fixed width value as a default value.</li>\n</ul>\n<p><strong>Note</strong>: <em>Units such as <code>vw</code>, <code>em</code>, <code>rem</code>, <code>calc()</code>, and <code>px</code> can be used in this attribute. The only unit that cannot be used is the percentage (<code>%</code>).</em></p>\n<p>Once we have our responsive image ready, it is <strong>up to the browser to choose the correct version using the parameters specified</strong> in the <code>srcset</code> and <code>sizes</code> attributes and what it knows about the <strong>user’s device</strong>.</p>\n<p>The browser process consists of knowing the device width, checking the <code>sizes</code> attribute, and then choosing from the <code>srcset</code> images the one that has that width. If there is no image with that width, the browser will choose the first one larger than the size got from <code>sizes</code> (as long as the screen is not high-density).</p>\n<p>2. <strong>Device’s pixel density change fix:</strong> Responsive images with different resolutions</p>\n<p>The solution is to allow the <strong>browser to choose an appropriate resolution image</strong> for each display density.</p>\n<table>\n    <thead>\n        <tr>\n            <th>Device vs CSS Pixels</th>\n            <th>360px width image by screen resolution</th>\n        </tr>\n    </thead>\n    <tbody>\n        <tr>\n            <td>1 device pixel = 1 CSS pixel</td>\n            <td>360px</td>\n        </tr>\n        <tr>\n            <td>2 device pixels = 1 CSS pixel</td>\n            <td>720px</td>\n        </tr>\n        <tr>\n            <td>3 device pixels = 1 CSS pixel</td>\n            <td>1440px</td>\n        </tr>\n    </tbody>\n</table>\n\n<p>To achieve this, we will use <code>srcset</code> again, but this time, with <strong>density descriptors, used to serve different images based on the device pixel density</strong>, not the image size, and without the need to specify the <code>sizes</code> attribute:</p>\n<div>\n<pre><code>&lt;img\n    src=&quot;image-1440.webp&quot;\n    srcset=&quot;image-360.webp 1x, image-720.webp 2x, image-1440.webp 3x&quot;\n    alt=&quot;Image providing 3 different resolutions for 3 device densities&quot;&gt;\n</code></pre>\n</div>\n\n<ul>\n<li><strong><code>src</code></strong><br>Having <em><code>image-1440.webp</code></em> as a fallback version.</li>\n<li><strong><code>srcset</code></strong><br>In this case, the <code>srcset</code> attribute is used to specify an image for each density descriptor, 1x, 2x, and 3x, telling the browser which image is associated with each pixel density.<br>For this case, if the device’s pixel density is 2.0, the browser will choose the image version <em>image-720.webp</em>.</li>\n</ul>\n<p>3. <strong>Design change fix:</strong> Different images for different displays</p>\n<p>The solution is to <strong>provide a specially designed image with different ratios or focus points for each screen size</strong>, a technique known as <strong>art direction</strong>.</p>\n<blockquote><a href=\"https://developer.mozilla.org/docs/Learn/HTML/Multimedia_and_embedding/Responsive_images#Art_direction\"><strong>Art direction</strong></a> is the practice of serving completely different looking images to different viewports sizes to improve visual presentation, rather than different size versions of the same image.</blockquote>\n\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f8fe6025-74b7-494e-b297-dbef682bdb6c/art-direction-responsive-image-example.png\"></p>\n<p>The art direction technique makes this possible through the <code>&lt;picture&gt;</code> tag, which contains several <code>&lt;source&gt;</code> tags providing the different images from which the browser will choose, and adding <code>&lt;img&gt;</code> as a fallback:</p>\n<div>\n<pre><code>&lt;picture&gt;\n  &lt;source media=&quot;(max-width: 420px)&quot; srcset=&quot;image-mobile.webp&quot; width=&quot;360&quot; height=&quot;280&quot;&gt;\n  &lt;source media=&quot;(max-width: 960px)&quot; srcset=&quot;image-tablet.webp&quot; width=&quot;760&quot; height=&quot;600&quot;&gt;\n  &lt;img src=&quot;image-desktop.webp&quot; width=&quot;1024&quot; height=&quot;820&quot; alt=&quot;Image providing 3 different images for 3 displays&quot;&gt;\n&lt;/picture&gt;\n</code></pre>\n</div>\n\n<ul>\n<li><strong><code>picture</code></strong><br>The wrapper of the different images brought by 0 or more <code>&lt;source&gt;</code> and an <code>&lt;img&gt;</code>.</li>\n<li><strong><code>source</code></strong><br>Each <code>&lt;source&gt;</code> tag specifies a media resource, in this case, an image, with its <code>srcset</code> attribute being the file path to that resource.<br><strong>The order of placement</strong> of this tag <strong>matters</strong>. <strong>The browser will read the conditions</strong> defined in the <code>media</code> attribute of each <code>&lt;source&gt;</code> <strong>from top to bottom</strong>. If any of them are true, it will display that image, and if the subsequent ones are true, they won’t be read.<br>An example would be the <code>media=&quot;(max-width: 960px)&quot;</code> of the second <code>&lt;source&gt;</code>. If the viewport’s width is 960px or less but more than 420px, <em><code>image-tablet.webp</code></em> will be displayed, but if it is less than 420px, <em><code>image-mobile.webp</code></em> will be displayed.</li>\n<li><strong><code>img</code></strong><br>When a browser does not support the <code>&lt;picture&gt;</code> or <code>&lt;source&gt;</code> tags or none of the media queries are met, the <code>&lt;img&gt;</code> tag will act as a fallback or default value and will be loaded. Therefore, it is crucial to add an appropriate size that will work in most cases.</li>\n</ul>\n<p><strong>Extra tip</strong>: <em>You can combine the art direction technique with different resolutions.</em></p>\n<div>\n<pre><code>&lt;picture&gt;\n  &lt;source media=&quot;(max-width: 420px)&quot; srcset=&quot;image-mobile.webp 1x, image-mobile-2x.webp 2x&quot; width=&quot;360&quot; height=&quot;280&quot;&gt;\n  &lt;source media=&quot;(max-width: 960px)&quot; srcset=&quot;image-tablet.webp 1x, image-tablet-2x.webp 2x&quot; width=&quot;760&quot; height=&quot;600&quot;&gt;\n  &lt;img src=&quot;image-desktop.webp&quot; srcset=&quot;image-desktop.webp 1x, image-desktop-2x.webp 2x&quot; width=&quot;1024&quot; height=&quot;820&quot; alt=&quot;Image providing 6 different images for 3 displays and 6 pixels density&quot;&gt;\n&lt;/picture&gt;\n</code></pre>\n</div>\n\n<p>By making use of width and pixel density at the same time, you can amplify the criteria for which an image source is displayed.</p>\n<p><strong>Note</strong>: <em>If you want to learn about tools that can help you crop and resize your images efficiently, you can take a look at <a href=\"https://web.dev/serve-responsive-images/\">Serve Responsive Images</a> by web.dev.</em> </p>\n<h3>5. <strong>Load your images after critical resources</strong></h3>\n<p>By default, if we do not specify the priority of our images, the browser will load them before the critical resources of our site, causing poor performance and increasing the <strong>Time To Interactive (TTI)</strong>.</p>\n<h4>Solution</h4>\n<p>Fortunately, native solutions such as <a href=\"https://web.dev/browser-level-image-lazy-loading/\">lazy loading</a> allow us to defer off-screen images, the ones the user does not see initially, and focus on the most important ones, the images above the fold.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a24b6d11-aa2c-4e13-b57a-1ef072bfa6e0/lazy-loading-attribute-caniuse.png\"></p>\n<p>To make use of this native solution, we must add the <code>loading</code> attribute to our images with the <strong>lazy</strong> value:</p>\n<div>\n<pre><code>&lt;!-- Native lazy loading --&gt;\n&lt;img src=&quot;image.webp&quot; loading=&quot;lazy&quot; width=&quot;700&quot; height=&quot;500&quot; alt=&quot;Loaded by appearance&quot;&gt;\n</code></pre>\n</div>\n\n<p>The <code>loading</code> attribute can have two values:</p>\n<ul>\n<li><code>lazy</code>: Postpones the loading of the resource until it reaches the viewport.</li>\n<li><code>eager</code>: Loads the resource immediately, regardless of where it is.<br>Although this is the browser’s default behavior, it can be helpful in cases where you prefer to set <code>loading=&quot;lazy&quot;</code> automatically on all your images and manually specify which ones will be visible first.</li>\n</ul>\n<blockquote>Since our goal is to defer images that do not appear above the fold, we mustn’t add the <code>loading</code> attribute for those displayed first. Otherwise, we can set the <code>loading=&quot;eager&quot;</code> and add <code>fetchpriority=&quot;high&quot;</code> to load them quicker.</blockquote>\n\n<p><strong>Extra tip</strong>: <em>Responsive images using the <code>&lt;picture&gt;</code> element can also be lazy-loaded only, including the <code>loading</code> attribute to the fallback <code>&lt;img&gt;</code> element.</em></p>\n<pre><code>&lt;picture&gt;\n  &lt;source media=&quot;(max-width: 420px)&quot; srcset=&quot;image-mobile.webp&quot;&gt;\n  &lt;img src=&quot;image-desktop.webp&quot; loading=&quot;lazy&quot;&gt;\n&lt;/picture&gt;\n</code></pre>\n\n<h3>6. Cache Your Images</h3>\n<p>A website’s performance can suffer if frequently accessed images are not cached, as <strong>many requests will be made to images</strong> that have already been loaded in the user’s system.</p>\n<p>Users should be able to view the images directly from their system and not wait again for them to download.</p>\n<h4>Solution</h4>\n<p>The solution is to <strong>store the heavily accessed images</strong> at the end of the user’s browser cache and use a CDN service to cache them on the server for you.</p>\n<p><strong>Note</strong>: <em>To understand how the cache works for a user and the different strategies we can follow, I recommend the talk and article “<a href=\"https://web.dev/love-your-cache/\">Love your cache</a>” by <a href=\"https://web.dev/authors/samthor/\">Sam Thorogood</a>.</em></p>\n<p>Once we have an optimization technique for each of the problems that images bring us, it is worth remembering that there are more things to consider for the accessibility and SEO of our images, such as the <code>alt</code> attribute, the file name, and its metadata.</p>\n<p>That said, it is time to see how an image service will save us hundreds of headaches. Let’s go there! 🚀</p>\nThe Benefits Of Using An Image Service CDN\n<p>All the solutions to the problems we have seen in the previous section could be solved with external tools. But why complicate things if we can just use an Image Service CDN, saving us time, reducing infrastructure costs, and automating and scaling the image optimization?</p>\n<p>An Image Service CDN is a <strong>combination of an Image Transformation API and a CDN network</strong>. It allows you to <strong>transform images on the fly</strong> by adding a few extra parameters in the URL and delivering them to users through a <strong>fast CDN with optimized caching</strong>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bfc8bb81-2bcb-4925-9ec7-df7eb671b05b/image-service-cdn-composition.png\"></p>\n<p><strong>The image transformations provided</strong> by this kind of service include modifying their <strong>format, focal point, and size by cropping or resizing</strong> them, as well as applying <strong>effects and other visual enhancements</strong>. In addition, it also allows you to optimize images so that they have the smallest possible size without losing quality, thus improving the UX and using the minimum bandwidth.</p>\n<p><strong>Note</strong>: <em>You can always learn more about the transformations that some services offer by reading their documentation, as in <a href=\"https://cloudinary.com/documentation/image_transformations\">Cloudinary</a> or <a href=\"https://imagekit.io/features/image-transformation\">Imagekit</a>.</em></p>\n<p>Thanks to the combination of the image service with the <strong>CDN network</strong>, we can <strong>speed up the delivery of our images</strong> since, after the first request, the image will be <strong>cached and served from there in future requests</strong>. But not only does it cache the original image, but it also stores all the transformations and combinations we make from it. And if that is not enough, it also creates new transformation requests from the cached version of the original image. Can it be more optimal?</p>\n<p>In the Jamstack ecosystem, it couldn’t be easier to access these services. <strong>Most headless CMSs already have their Image Service CDN</strong>, so you don’t have to leave their premises to perform your image transformations, optimizations, or cache and deliver them quickly. This article will use <strong>Storyblok Image Service CDN</strong> as an example.</p>\n<p>So now, let’s see how the Storyblok Image Service CDN can resolve the problems we listed before:</p>\n<h3>Compressing Images</h3>\n<p>The problem of using large image files can be resolved by adding <code>/m/</code> at the end of the image URL.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a5df3b51-5cfa-44f8-9fc6-47b7066028b0/original-image-vs-compressed-by-image-service-cdn.png\"></p>\n<ul>\n<li>Original image URL → <a href=\"https://a.storyblok.com/f/39898/3310x2192/e4ec08624e/demo-image.jpeg\">demo-image.jpeg</a></li>\n<li>Compressed image URL (By default 80% quality) → <a href=\"https://a.storyblok.com/f/39898/3310x2192/e4ec08624e/demo-image.jpeg/m/\">demo-image.jpeg/m/</a></li>\n</ul>\n<p>But of course, if you want to change the compression rate of your images, you can use the <strong>quality</strong> filter with a value between <strong>0</strong> and <strong>100</strong> by adding <code>/filters:quality(0-100)</code> to the URL.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ec82e208-d6f0-4898-a1aa-62a34b6fe208/compressed-with-default-quality-vs-ten-percent.png\"></p>\n<ul>\n<li>Compressed image with 10% quality → <a href=\"https://a.storyblok.com/f/39898/3310x2192/e4ec08624e/demo-image.jpeg/m/filters:quality(10\">demo-image.jpeg/m/filters:quality(10)</a>)</li>\n</ul>\n<h3>Serving The Right Format And Encoding Effectively</h3>\n<p>If we want to serve our images in a next-gen format, Storyblok’s Image Service CDN makes it easy by:</p>\n<ul>\n<li><strong>Automatic conversion to WebP if the browser supports it</strong>.<br>Storyblok chooses the WebP format as the default format due to its capabilities. By adding <code>/m/</code> to the image URL, it will be automatically served in WebP if the browser supports it.  </li>\n<li><strong>The format filter</strong><br>If we want to set a specific format, we can do it by using <a href=\"https://www.storyblok.com/docs/image-service#changing-the-format\">the format filter</a>, which supports <code>webp</code>, <code>jpeg</code>, and <code>png</code>.<br>→ <a href=\"https://a.storyblok.com/f/39898/3310x2192/e4ec08624e/demo-image.jpeg/m/200x0/filters:format(jpeg\">demo-image.jpeg/m/200x0/filters:format(jpeg)</a>)</li>\n</ul>\n<p><strong>Note</strong>: <em>If anything, I miss the integration with more new formats, such as AVIF, but I understand that they are waiting for it to consolidate and become supported by more browsers.</em></p>\n<h3>Defining Width And Height From Storyblok</h3>\n<p>Although the Image Service CDN cannot help us define the image sizes, the Headless CMS, on the other hand, can streamline this process.</p>\n<p>By simply adding a field for each attribute in our image component (Block), we can automate our front-end image component to suit the requirements of each use case.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/5da3e222-d547-418c-9803-bd4458d9f0d3/image-size-fields-inside-storyblok-headless-cms.png\"></p>\n<p><strong>Tip</strong>: <em>By creating presets of the most used images, we can make these fields be filled by default and thus improve the content editor experience.</em></p>\n<h3>Cropping Or Resizing Images</h3>\n<p>If your website has or expects to have a large number of images, maintaining each version generated for each resolution, density, or focal point can be time-consuming.</p>\n<p>An Image Service CDN saves you from manually creating cropped or resized versions from the master image through two methods:</p>\n<h4>Resizing</h4>\n<p>It iss perfect for responsive images using width or density descriptors.</p>\n<p>By adding <code>width</code> x <code>height</code> in the URL of the original image, right after <code>/m</code>, you will have a new version of your image. By setting one of the parameters to 0 each time, you will have an image with the same aspect ratio, wholly resized.</p>\n<ul>\n<li>Proportional from height → <a href=\"https://a.storyblok.com/f/39898/3310x2192/e4ec08624e/demo-image.jpeg/m/0x400\">demo-image.jpeg/m/0x400</a></li>\n<li>Proportional from width → <a href=\"https://a.storyblok.com/f/39898/3310x2192/e4ec08624e/demo-image.jpeg/m/700x0\">demo-image.jpeg/m/700x0</a> </li>\n</ul>\n<h4>Cropping</h4>\n<p>It is perfect for art direction, different aspect ratios, and focal points.</p>\n<p>By using the same technique in resizing but always providing width and height, you will be able to crop the image.</p>\n<ul>\n<li>→ <a href=\"https://a.storyblok.com/f/39898/2250x1500/c15735a73c/demo-image-human.jpeg/m/700x200\">demo-image-human.jpeg/m/700x200</a></li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/94f4285d-aa5d-4030-84a0-58013b296136/cropped-image-service-cdn-example.png\"></p>\n<p><strong>Smart Cropping Of Images</strong></p>\n<p>To put the subject of the image in the <strong>center automatically</strong>, the Image Service CDN allows you to make use of its smart feature by simply adding <code>/smart</code> to the path:</p>\n<ul>\n<li>→ <a href=\"https://a.storyblok.com/f/39898/2250x1500/c15735a73c/demo-image-human.jpeg/m/700x200/smart\">demo-image-human.jpeg/m/700x200/smart</a></li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/5b02a323-5a2b-454d-b8e6-8798259b5eea/cropped-image-service-cdn-smart-feature-example.png\"></p>\n<p><strong>Custom Focal Point Filter</strong></p>\n<p>In case the subject is not a person and the previous technique does not work for us, the Image Service allows us to specify in our images the point that we consider to be the center of a crop, also known as the <strong>focal point</strong>.</p>\n<p>This can be implemented by adding the focal filter to our image path:</p>\n<ul>\n<li>→ <a href=\"https://a.storyblok.com/f/39898/1000x600/d962430746/demo-image-human.jpeg/m/600x130/filters:focal(450x500:550x600\">demo-image-human.jpeg/m/600x130/filters:focal(450x500:550x600)</a>)</li>\n</ul>\n<p><strong>Note</strong>: <em>This can be further simplified if we are using Storyblok as a headless CMS, as it returns a focus variable on each of our images via the delivery API.</em> </p>\n<h3>Specifying The Loading Option Of The Images</h3>\n<p>As with image <code>width</code> and <code>height</code> attributes, lazy loading is not something we do through the Image Service CDN; instead, we implement it in the front-end code.</p>\n<p>To automate this process, create a single-option field on the headless CMS Storyblok showing the <code>eager</code> and <code>lazy</code> options, so the content editors can choose the option that best suits each case.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3d692068-4939-4ea2-9aeb-b5b671cacceb/loading-single-option-field-storyblok.png\"></p>\n<p><strong>Note</strong>: <em>This field can be ignored if the website only has images above the fold.</em></p>\n<p>In addition, another thing that can improve the loading of our images is to use <strong>the hint preconnect</strong> by adding the Image Service CDN domain, in this case, <code>https://a.storyblok.com/</code>.</p>\n<blockquote>The preconnect keyword is <strong>a hint to browsers that the user is likely to need resources from the target resource’s origin</strong>, and therefore the browser can likely improve the UX by preemptively initiating a connection to that origin.<br><br>— <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTML/Link_types/prefetch\">MDN docs</a></blockquote>\n\n<div>\n<pre><code>&lt;link rel=&quot;preconnect&quot; href=&quot;<a href=\"https://a.storyblok.com/\">https://a.storyblok.com/</a>&quot;&gt;\n</code></pre>\n</div>\n\n<h3>Caching Your Images</h3>\n<p>In this case, we don’t have to do anything from our side. By adding <code>/m</code> to our URL, we are already using the Image Service CDN, which by default caches our images the first time they are loaded and serves them from there in the next requests.</p>\n<p>We already know the parameters we have to add to our image URL to make use of the image service and optimize them. Combining it with an image component in the associated Headless CMS, Storyblok, which is responsible for receiving the data initially, such as the width and height attributes or their responsive sizes, we will be able to standardize the use of optimized images and create presets to automate their definition in our project.</p>\nCase Study: Image Component In A Jamstack Site\n<p>For this demo, we will use Nuxt 3 to build our static site, Vue 3 with script setup to define our image component and Storyblok as a headless CMS and Image Service CDN provider. But everything we will see can be extrapolated to any other technology.</p>\n<h3>Step 1: Create The Nuxt Project And The Storyblok Space</h3>\n<p>Let’s start by creating an account on <a href=\"https://www.storyblok.com/\">Storyblok</a> and a new space from scratch.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/172a5404-b69b-4fc1-aeeb-2e275cbf6b58/create-new-space-storyblok-screen.png\"></p>\n<p>Now, following the steps in the article <a href=\"https://www.storyblok.com/tp/add-a-headless-CMS-to-nuxt-3-in-5-minutes\">Add a headless CMS to Nuxt 3 in 5 min</a>, we are going to create our Nuxt 3 application and connect it to our space. Go to the command line and run:</p>\n<pre><code>npx nuxi init \n</code></pre>\n\n<p>Install the dependencies with <code>yarn</code> and launch your project with <code>yarn dev</code> to ensure everything goes well.</p>\n<p>To enable the Storyblok Visual Editor, we must define a default HTTPS preview URL. First, <a href=\"https://www.storyblok.com/faq/setting-up-https-on-localhost-in-nuxt-3\">set up SSL in Nuxt 3</a> and then go to your space <strong>Settings &gt; Visual Editor</strong> and add <code>https://localhost:3000/</code>:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/16f37c32-7f9e-4e39-9fad-3a9654e85ed8/default-environment-preview-url-in-the-storyblok-space.png\"></p>\n<p>Now go to the <strong>Content</strong> section in the left menu, and open the <strong>Home</strong> story. In order to see your Nuxt project, open the <strong>Entry configuration</strong> and set the real path to <code>/</code>, save, and voilá, you should be able to see the Nuxt landing page in the Visual Editor:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6695d0d8-f6b1-47e2-b81a-1b97ca250099/real-path-field-entry-configuration.png\"></p>\n<h3>Step 2: Connect The Nuxt Project To The Space’s Content</h3>\n<p>Once the Visual Editor is set up, the next step is connecting Nuxt 3 with Storyblok. To do that, we need to install the Storyblok SDK:</p>\n<pre><code>yarn add @storyblok/nuxt axios # npm install @storyblok/nuxt axios\n</code></pre>\n\n<p>And then, include the SDK as a module inside <code>nuxt.config.js</code>, providing the <strong>Preview API token</strong> that we can grab at <strong>Settings &gt; Access Tokens</strong> from our space:</p>\n<pre><code>export default defineNuxtConfig({\n    modules: [\n      [\n        '@storyblok/nuxt',\n        { accessToken: '' }\n      ]\n    ]\n})\n</code></pre>\n\n<p>The new space, by default, already contains some blocks (components), such as page, grid, and so on. Instead of using those, we are going to define our own components, so you can remove all nestable components from this space and leave only the content type <strong>Page</strong>.</p>\n<p><strong>Note</strong>: <em>Check the tutorial <a href=\"https://www.storyblok.com/docs/guide/essentials/content-structures#component\">Structures of Content tutorial</a> by Storyblok to understand the difference between Nestable and Content Types blocks.</em></p>\n<h3>Step 3: Create The Blocks (Components) In The Storyblok Space</h3>\n<p>Now, let’s <strong>create the blocks</strong> needed for this demo project in the space <strong>Block Library</strong>, where (*) means required:</p>\n<p><strong>Design Image</strong> (<code>design_image</code>) is the component we will use to define different images on different devices when using the art direction technique.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7866d35e-41f0-49cc-b907-2f707cd92b4e/design-image-component-schema.png\"></p>\n<p>A <strong>nestable</strong> component with the required fields:</p>\n<ul>\n<li><strong>image</strong> (*) (Asset &gt; Images)</li>\n<li><strong>width</strong> (*) (Number)</li>\n<li><strong>height</strong> (*) (Number)</li>\n<li><strong><code>media_condition</code></strong> (*) (Single-Option &gt; Source: Self) with the key-value pair options: mobile → <code>(max-width: 640px)</code> &amp; tablet → <code>(max-width: 1024px)</code>, being <code>(max-width: 640px)</code> the default value.</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a847e8bb-02c8-4a23-8da0-32a042309168/mediacondition-field-of-the-design-image.png\"></p>\n<p><strong>Image</strong>, the component responsible for collecting all the information necessary to optimize the image.  </p>\n<p>A <strong>nestable</strong> component with the tabs:</p>\n<ul>\n<li><strong>General</strong>, the tab containing the fields:</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8ab158d9-007f-4661-9419-ee5c51292230/image-nestable-component-general-tab-schema.png\"></p>\n<ul>\n<li><strong><code>original_image</code></strong> (*) (Asset &gt; Images)</li>\n<li>Image size (Group)<ul>\n<li><strong>width</strong> (*) (Number): Maximum width the image will have on your website.</li>\n<li><strong>height</strong> (*) (Number): Maximum height the image will have on your website.</li>\n</ul>\n</li>\n<li>Responsive image (Group)<ul>\n<li><strong><code>responsive_widths</code></strong> (Text &gt; Regex validation: (^$|^\\d+(,\\d+)*$))<br>Comma-separated list of widths that will be included on <code>srcset</code>.<br>Example: 400,760,960,1024.  </li>\n<li><strong><code>responsive_conditions</code></strong> (Text)<br>Comma-separated list of media queries, with their image slots sizes that will be included on the attribute sizes.</li>\n</ul>\n</li>\n<li>Supported densities (Group)<ul>\n<li><strong><code>density_2x</code></strong> (Boolean)</li>\n<li><strong><code>density_3x</code></strong> (Boolean)</li>\n</ul>\n</li>\n<li>Art Direction (Group)<ul>\n<li><strong><code>art_direction</code></strong> (Blocks &gt; Allow only <strong><code>design_image</code></strong> components to be inserted)</li>\n</ul>\n</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/88282733-87cd-483a-aa6a-4884ddfeebd2/image-block-artdirection-field-schema.png\"></p>\n<ul>\n<li><strong>Style</strong>, the tab containing the fields:</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/fe0ffcda-dcc9-4b22-bf53-bc641b1d4fe3/image-nestable-component-style-tab-schema.png\"></p>\n<ul>\n<li><strong>loading</strong> (Single-Option &gt; Source: Self) with the key-value pair options: lazy → <code>lazy</code> and eager → <code>eager</code>.</li>\n<li><strong>rounded</strong> (Boolean).</li>\n</ul>\n<p><strong>Card</strong></p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/272b7d5f-6649-4507-a442-7cbcad78bad4/card-nestable-component-schema.png\"></p>\n<p>A <strong>nestable</strong> component with the fields:</p>\n<ul>\n<li><strong>image</strong> (Blocks &gt; Allowed maximum <strong>1</strong> &gt; Allow only <strong>image</strong> components to be inserted)</li>\n<li><strong>title</strong> (Text)</li>\n<li><strong>subtitle</strong> (Text)</li>\n<li><strong>color</strong> (Plugin &gt; Custom type: <code>native-color-picker</code>)</li>\n</ul>\n<p><strong>Note</strong>: <em>To be able to see the custom type <code>native-color-picker</code> available in that list, you need to install the</em> <strong><em>Colorpicker</em></strong> <em>app in the space App Directory.</em></p>\n<ul>\n<li><strong><code>button_text</code></strong> (Text)</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8e0b9750-a06c-4ac2-bb20-cac1a7bfbc2b/card-component-final-result.png\"></p>\n<p><strong>Album</strong></p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c8098643-348d-46ba-ba89-8f7b6cbc83de/album-universal-component-schema.png\"></p>\n<p>A universal (mix between nestable &amp; content type) component with the field:</p>\n<ul>\n<li><strong>cards</strong> (Blocks &gt; Allow only <strong>card</strong> components to be inserted)</li>\n</ul>\n<h3>Step 4: Create The Main View, Layout, And Install Tailwind CSS In The Nuxt Project</h3>\n<p>Once we have defined the schema of our blocks in the Storyblok space, let’s go back to the code of our Nuxt 3 project and start creating the pages and components needed.</p>\n<p>The first step will be to delete the <code>app.vue</code> view from the root of the project and create a <code>pages</code> folder with the <code>[...slug].vue</code> view in it to render the pages dynamically by slug and fetch the data from the Storyblok space.</p>\n<ul>\n<li><strong>[…slug].vue</strong> (<code>pages/[…slug].vue</code>)</li>\n</ul>\n<pre><code>&lt;script setup&gt;\nconst { slug } = useRoute().params;\nconst url = slug || 'home';\n\nconst story = await useAsyncStoryblok(url, { version: 'draft' });\n&lt;/script&gt;\n\n&lt;template&gt;\n    &lt;div class=&quot;container&quot;&gt;\n      &lt;StoryblokComponent v-if=&quot;story&quot; :blok=&quot;story.content&quot; /&gt;\n  &lt;/div&gt;\n&lt;/template&gt;\n</code></pre>\n\n<p>In the template, we use the <code>StoryblokComponent</code> component that the SDK provides us to represent the specific blocks coming from the <a href=\"https://www.storyblok.com/docs/api/content-delivery/v2\">Content Delivery API</a>, in this case, the <code>page</code>.</p>\n<p>And since our goal is to generate a static page, we’re using the <code>useAsyncStoryblok</code> composable provided by the SDK too, which uses <a href=\"https://v3.nuxtjs.org/api/composables/use-async-data/\"><code>useAsyncData</code></a> under the hood.</p>\n<p>Next, let’s create a default layout, so our page has some basic styles and metadata.</p>\n<ul>\n<li><strong>default.vue</strong> (<code>layouts/default.vue</code>)</li>\n</ul>\n<div>\n<pre><code>&lt;template&gt;\n  &lt;main class=&quot;min-h-screen bg-[#1A0F25] text-white&quot;&gt;\n    &lt;slot /&gt;\n  &lt;/main&gt;\n&lt;/template&gt;\n\n&lt;script setup&gt;\nuseHead({\n  title: 'Pokemon cards album',\n  meta: [\n    { name: 'description', content: 'The Pokemon album you were looking for with optimized images.' }\n  ],\n  htmlAttrs: {\n    lang: 'en'\n  }\n})\n&lt;/script&gt;\n</code></pre>\n</div>\n\n<p>As Tailwind CSS is used for styling this demo example, let’s install and configure it in the Nuxt 3 project using the <a href=\"https://tailwindcss.nuxtjs.org/getting-started/setup\">Nuxt Tailwind module</a>. For that, run:</p>\n<div>\n<pre><code>yarn add -D @nuxtjs/tailwindcss # npm install -D @nuxtjs/tailwindcss\n</code></pre>\n</div>\n\n<p>Then add the code below to the modules in <code>nuxt.config.ts</code>:</p>\n<pre><code>export default defineNuxtConfig({\n  modules: [\n        // ...\n        '@nuxtjs/tailwindcss'\n    ]\n})\n</code></pre>\n\n<p>Create <code>tailwind.config.js</code> by running <code>npx tailwindcss init</code> and copy/paste this code:</p>\n<pre><code>module.exports = {\n  content: [\n    'storyblok/**/*.{vue,js}',\n    'components/**/*.{vue,js}',\n    'pages/**/*.vue'\n  ],\n  theme: {\n    container: {\n      center: true,\n      padding: '1rem',\n    },\n  },\n  plugins: [],\n}\n</code></pre>\n\n<p>Finally, create an <code>assets</code> folder in the root of the project, and inside, include a <code>css</code> folder with a file named <code>tailwind.css</code> that the Nuxt Tailwind module will use to get the Tailwind styles:</p>\n<pre><code>@tailwind base;\n@tailwind components;\n@tailwind utilities;\n</code></pre>\n\n<p>Now the project is ready to represent all the defined styles!</p>\n<h3>Step 5: Define The Components Related To The Blocks In The Nuxt Project</h3>\n<p>Let’s create a new folder called <code>storyblok</code> under the project’s root. The Storyblok SDK will use this folder to auto-import the components only if used on our pages.</p>\n<p>Start by adding the components:</p>\n<ul>\n<li><strong>Page.vue</strong> (<code>storyblok/Page.vue</code>)</li>\n</ul>\n<div>\n<pre><code>&lt;template&gt;\n  &lt;StoryblokComponent v-for=&quot;item in blok.body&quot; :key=&quot;item._uid&quot; :blok=&quot;item&quot; /&gt;\n&lt;/template&gt;\n\n&lt;script setup&gt;\ndefineProps({ blok: Object })\n&lt;/script&gt;\n</code></pre>\n</div>\n\n<p>All components will expect the <code>blok</code> prop, which contains an object with the fields’ data of that specific block. In this case, the content type <code>page</code> will have only the body field, an array of objects/components.</p>\n<p>Using the <code>v-for</code>, we iterate the body field and represent the items dynamically using <code>StoryblokComponent</code>.</p>\n<ul>\n<li><strong>Album.vue</strong> (<code>storyblok/Album.vue</code>)</li>\n</ul>\n<div>\n<pre><code>&lt;template&gt;\n  &lt;div\n    v-editable=&quot;blok&quot;\n    class=&quot;container grid grid-cols-[repeat(auto-fit,332px)] justify-center gap-10 py-12&quot;\n  &gt;\n    &lt;StoryblokComponent v-for=&quot;card in blok.cards&quot; :key=&quot;card._uid&quot; :blok=&quot;card&quot;\n    /&gt;\n  &lt;/div&gt;\n&lt;/template&gt;\n\n&lt;script setup&gt;\ndefineProps({ blok: Object })\n&lt;/script&gt;\n</code></pre>\n</div>\n\n<p>The same will happen in this component, but instead of being the <code>blok.body</code> field, it will be the <code>blok.cards</code> field.</p>\n<ul>\n<li><strong>Card.vue</strong> (<code>storyblok/Card.vue</code>)</li>\n</ul>\n<div>\n<pre><code>&lt;template&gt;\n  &lt;article v-editable=&quot;blok&quot; class=&quot;bg-[#271B46] rounded-xl p-4 pb-6&quot;&gt;\n    &lt;StoryblokComponent v-if=&quot;blok.image[0]&quot; :blok=&quot;blok.image[0]&quot; /&gt;\n    &lt;header class=&quot;pt-4 flex gap-4 items-center&quot;&gt;\n      &lt;div class=&quot;rounded-full w-8 h-8&quot; :style=&quot;<code>background-color: ${blok.color.color}</code>&quot;&gt;&lt;/div&gt;\n      &lt;h3 class=&quot;flex flex-col&quot;&gt;\n        {{ blok.title }}\n        &lt;span class=&quot;font-sans font-thin text-xs&quot;&gt;{{ blok.subtitle}}&lt;/span&gt;\n      &lt;/h3&gt;\n      &lt;button class=&quot;ml-auto bg-purple-900 rounded-full px-4 py-1&quot;&gt;{{ blok.button_text }}&lt;/button&gt;\n    &lt;/header&gt;\n  &lt;/article&gt;\n&lt;/template&gt;\n\n&lt;script setup&gt;\ndefineProps({ blok: Object })\n&lt;/script&gt;\n</code></pre>\n</div>\n\n<p>As <code>card</code> is one of the last levels of nested blocks, we won’t iterate in this component, but we will directly represent the fields in the HTML.</p>\n<h3>Step 6: Create The Image Component Property By Property</h3>\n<p>Let’s build a generic image component in Vue, using the parameters coming from the Storyblok <code>image</code> block and taking advantage of the Image Service CDN to render an optimized image.</p>\n<h4>The Foundation Of The Image Component</h4>\n<p>Let’s define the core functionality of the image component with the <code>original_image</code>, <code>width</code>, and <code>height</code> properties that come from the image block in our space and create a custom method called <code>createImage</code> that returns the URL of the optimized image using the Image Service CDN:</p>\n<pre><code>&lt;template&gt;\n  &lt;picture v-editable=&quot;blok&quot;&gt;\n    &lt;img\n      :src=&quot;createImage(filename, width, height)&quot;\n      :width=&quot;width&quot;\n      :height=&quot;height&quot;\n      :alt=&quot;alt&quot;\n      class=&quot;shadow-lg w-full&quot;\n    /&gt;\n  &lt;/picture&gt;\n&lt;/template&gt;\n\n&lt;script setup&gt;\nconst props = defineProps({ blok: Object })\n\nconst { width, height } = props.blok\nconst { filename, alt, focus } = props.blok.original_image\n\nconst createImage = (original, width, height, focal = focus) =&gt; {\n  return `${original}/m/${width}x${height}/filters:focal(${focal})`\n};\n&lt;/script&gt;\n</code></pre>\n\n<h4>Adding Lazy Or Eager Loading</h4>\n<p>Once we have the image’s base, we can start adding new properties, such as <code>loading</code>, and specifying it as an attribute in the <code>img</code> tag:</p>\n<pre><code>&lt;template&gt;\n  &lt;picture v-editable=&quot;blok&quot;&gt;\n    &lt;img\n      // all other attributes\n      :loading=&quot;loading&quot;\n    /&gt;\n  &lt;/picture&gt;\n&lt;/template&gt;\n\n&lt;script setup&gt;\nconst props = defineProps({ blok: Object })\n\nconst { /* all other properties */, loading } = props.blok\n// ...\n&lt;/script&gt;\n</code></pre>\n\n<h4>Adding Responsive Images Using Width Descriptors</h4>\n<p>If we need to represent different sizes of the same image on our website, using the responsive image technique, we can specify the widths and conditions using the <code>responsive_widths</code> and <code>responsive_conditions</code> properties.</p>\n<div>\n<pre><code>&lt;template&gt;\n  &lt;picture v-editable=&quot;blok&quot;&gt;\n    &lt;img\n      // all other attributes\n      :srcset=&quot;srcset&quot;\n      :sizes=&quot;blok.responsive_conditions&quot;\n    /&gt;\n  &lt;/picture&gt;\n&lt;/template&gt;\n\n&lt;script setup&gt;\nconst props = defineProps({ blok: Object })\n\n// all other properties\nlet srcset = ref('')\n\nif (props.blok.responsive_widths) {\n  const aspectRatio = width / height\n  const responsiveImages = props.blok.responsive_widths.split(',')\n\n  let widthsSrcset = ''\n  responsiveImages.map(imageWidth =&gt; {\n    widthsSrcset += <code>${createImage(filename, imageWidth, Math.round(imageWidth / aspectRatio))} ${imageWidth}w,</code>\n    return true\n  })\n\n  srcset.value = widthsSrcset\n}\n&lt;/script&gt;\n</code></pre>\n</div>\n\n<h4>Adding Responsive Images Using Density Descriptors</h4>\n<p>When our site is used on different devices with different pixel densities, we must display our image in the appropriate resolution. By checking the <code>density_2x</code> and <code>density_3x</code> boxes to true and creating an image for each density with the following code, we can patch this problem.</p>\n<p><strong>Note</strong>: <em>The original image must be large enough to work with a size three times larger than the image used in the viewport.</em></p>\n<div>\n<pre><code>&lt;template&gt;\n  &lt;picture v-editable=&quot;blok&quot;&gt;\n    &lt;img\n      // all other attributes\n      :srcset=&quot;srcset&quot;\n    /&gt;\n  &lt;/picture&gt;\n&lt;/template&gt;\n\n&lt;script setup&gt;\nconst props = defineProps({ blok: Object })\n\n// all other properties\nlet srcset = ref('')\n\nif (props.blok.density_2x || props.blok.density_3x) {\n  let densitiesSrcset = <code>${createImage(filename, width, height)} 1x</code>\n  densitiesSrcset += props.blok.density_2x ? <code>, ${createImage(filename, width &amp;#42; 2, height &amp;#42; 2)} 2x</code> : ''\n  densitiesSrcset += props.blok.density_3x ? <code>, ${createImage(filename, width &amp;#42; 3, height &amp;#42; 3)} 3x</code> : ''\n\n  srcset.value = densitiesSrcset\n}\n&lt;/script&gt;\n</code></pre>\n</div>\n\n<h4>Adding Different Images For Different Devices</h4>\n<p>When using the art direction technique, we will define one <code>source</code> tag per element in the  <code>art_direction</code> array field. We will use that data to render a different image according to the specified <code>media_condition</code>.</p>\n<div>\n<pre><code>&lt;template&gt;\n  &lt;picture v-editable=&quot;blok&quot;&gt;\n    &lt;template v-if=&quot;art_direction&quot;&gt;\n      &lt;source\n        v-for=&quot;{ image, media_condition, width, height } in art_direction&quot;\n        :media=&quot;media_condition&quot;\n        :srcset=&quot;createImage(image.filename, width, height, image.focus)&quot;\n        :width=&quot;width&quot;\n        :height=&quot;height&quot;\n      &gt;\n    &lt;/template&gt;\n    &lt;!-- Base Image --&gt;\n  &lt;/picture&gt;\n&lt;/template&gt;\n\n&lt;script setup&gt;\nconst props = defineProps({ blok: Object })\n\n// all other properties\nconst { art_direction } = props.blok\n&lt;/script&gt;\n</code></pre>\n</div>\n\n<p>In the example repository for this demo, you can find <strong>Image.vue</strong> (<code>storyblok/Image.vue</code>), <a href=\"https://github.com/Dawntraoz-Storyblok/sb-pokemon-gallery/blob/main/storyblok/Image.vue\">the resulting image component</a>, combining all the cases above.</p>\n<p><strong>Note</strong>: <em>These implementations are the only possible ways to solve the problems we have seen during this article.</em></p>\n<h3>Measuring Performance To Test The Image Component</h3>\n<p>It’s time to measure the performance results with and without the custom image component to demonstrate how the above optimizations improve our site.</p>\n<p>If we generate a report with Lighthouse from our website representing the images as they originally came from the headless CMS without going through the Image Service CDN or applying any optimization technique other than the definition of the <code>width</code> and <code>height</code> attributes in the <code>img</code> tag, the result we get is:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1875076d-30ec-4307-b109-f06e9b9594c2/mobile-performance-report-scores-without-optimizations.png\"></p>\n<p>As we can see, the performance is already negatively affected, with only five unoptimized images in place. But at least the report not only gives us bad news but also provides us with a list of opportunities to improve the results and solve the problems.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6fa234a8-7f09-4e11-87a0-8b6dcf43355e/lighthouse-report-recommendations.png\"></p>\n<p>Once we apply the improvements mentioned above using the image component we have developed and giving the necessary values in the CMS headless, the result is impeccable:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/383a22e0-3053-4cc1-9c76-e0d24137d5d6/performance-report-after-using-the-image-vue-component-optimized.png\"></p>\n<p>The next step will be to educate our content editors, designers, and developers to synchronize between them what values are required for each case and prepare self-defined presets in our Storyblok space to make their work a lot easier.</p>\n<h3>Simplifying Image Optimization With Next-generation Frameworks</h3>\n<p>What if I tell you that if you use a framework like Nuxt, Next, or Astro to build your applications, you don’t need to develop a custom image component? They have already created one for you. These being <a href=\"https://v1.image.nuxtjs.org/\">Nuxt Image</a>, <a href=\"https://nextjs.org/docs/api-reference/next/image\">Next Image</a> and <a href=\"https://docs.astro.build/es/guides/integrations-guide/image/\">Astro Image</a>, among others.</p>\n<p>These components are extensions to the <code>&lt;img&gt;</code> tag, which includes a number of built-in performance optimizations to help us achieve a better web experience.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a8574678-f1a8-470d-bb22-2bc6ea6c0ce5/nuxt-image-social-sharing-image.png\"></p>\n<p>By simply installing or using the component provided, we achieve the same result. To test the Nuxt Image in our project, let’s install it by running <code>yarn add -D @nuxt/image-edge</code> and adding the module to <code>nuxt.config.ts</code> with Storyblok as Image CDN provider:</p>\n<pre><code>export default defineNuxtConfig({\n  modules: [\n    // ...\n    '@nuxt/image-edge',\n  ],\n    image: {\n    storyblok: {\n      baseURL: 'https://a.storyblok.com'\n    }\n  }\n})\n</code></pre>\n\n<p>By replacing the <code>Image.vue</code> component with the code below, we will get similar behavior to our custom component but using the Nuxt Image enhancements:</p>\n<p><strong>Note</strong>: <em>To render different images per device, we will have to add the <code>source</code> as in the custom component. This is not something that Nuxt Image supports yet.</em></p>\n<div>\n<pre><code>&lt;template&gt;\n  &lt;picture v-editable=&quot;blok&quot;&gt;\n    &lt;NuxtImg\n      provider=&quot;storyblok&quot;\n      :src=&quot;filename&quot;\n      :width=&quot;width&quot;\n      :height=&quot;height&quot;\n      :[srcset]=&quot;densitiesSrcset&quot;\n      :sizes=&quot;widthsPerSize&quot;\n      :modifiers=&quot;{ filters: { focal: focus } }&quot;\n      :loading=&quot;loading&quot;\n      :alt=&quot;alt&quot;\n    /&gt;\n  &lt;/picture&gt;\n&lt;/template&gt;\n\n&lt;script setup&gt;\nconst props = defineProps({ blok: Object })\n\nconst { width, height, loading, responsive_widths, density_2x, density_3x } = props.blok\nconst { filename, alt, focus } = props.blok.original_image\n\nlet srcset = responsive_widths ? '' : 'srcset'\nlet densitiesSrcset = ''\nif (density_2x || density_3x) {\n  densitiesSrcset = <code>${filename}/m/${width}x${height}/filters:focal(${focus}) 1x</code>\n  densitiesSrcset += density_2x ? <code>, ${filename}/m/${width &amp;#42; 2}x${height &amp;#42; 2}/filters:focal(${focus}) 2x</code> : ''\n  densitiesSrcset += density_3x ? <code>, ${filename}/m/${width &amp;#42; 3}x${height &amp;#42; 3}/filters:focal(${focus}) 3x</code> : ''\n}\n\nlet widthsPerSize = ''\nif (responsive_widths) {\n  const sizes = ['sm', 'md', 'lg', 'xl']\n  widthsPerSize = responsive_widths.split(',').map((w, i) =&gt; <code>${sizes[i]}:${w}px</code>).join(' ')\n}\n&lt;/script&gt;\n</code></pre>\n</div>\n\n<p>Looking at the code, you might think it’s not much different from the one we have created before, but the truth is that if tomorrow you consider changing the Image Service or you don’t define the <code>width</code> and <code>height</code> of the image, Nuxt Image will do the dirty work for you.</p>\nConclusion\n<p>Image optimization, like web performance, is not a short-term task but constant work to progressively improve the website. That is why there are three things we must always keep in mind:</p>\n<h3>1. Stay Up To Date</h3>\n<p>The most important thing to keep your images in the best possible condition is to keep up with the latest trends in image optimization and web performance.</p>\n<p>Following the work of expert authors in the field, such as <a href=\"https://www.smashingmagazine.com/author/addy-osmani/\">Addy Osmani</a> and <a href=\"https://www.smashingmagazine.com/author/barry-pollard/\">Barry Pollard</a>, can help you learn about new improvements in image optimization in advance. Likewise, renowned websites such as <a href=\"https://www.smashingmagazine.com/\">Smashing Magazine</a>, <a href=\"https://web.dev/\">web.dev</a>, and <a href=\"https://almanac.httparchive.org/es/2022/\">Web Almanac</a> by Google, <a href=\"https://developer.mozilla.org/\">Mozilla docs</a>, among others, will let you know the state of the web and the latest developments.</p>\n<h3>2. Constantly Monitor The Status Of Your Images</h3>\n<p>Another crucial point to keep our website in good shape is to <a href=\"https://developer.mozilla.org/en-US/docs/Learn/Performance/Measuring_performance\">measure web performance</a> continuously, in this case, emphasizing metrics related to image loading. You can start now by visiting <a href=\"https://web.dev/measure/\">Lighthouse</a> and <a href=\"https://pagespeed.web.dev/\">PageSpeed Insights</a>.</p>\n<blockquote>Web performance involves measuring the speeds of an app and then monitoring its performance, ensuring that what you’ve optimized stays optimized. This involves a number of metrics and tools to measure those metrics.<br><br>— <a href=\"https://developer.mozilla.org/\">MDN</a></blockquote>\n\n<p>Some tools like <a href=\"https://webperformancereport.com/\">WebPerformance Report</a> send you a weekly report by email on the performance status of your website. This can allow you to be aware of any changes in browsers or web performance techniques, as you have a report that corroborates the good status of your website over time.</p>\n<p>Moreover, there are always tools out there that allow us to ensure that the optimization quality of our images is the best we can offer. For example, <a href=\"https://kornel.ski/dssim\">RGBA Structural Similarity</a>, a tool that calculates the (dis)similarity between two or more PNG and/or JPEG images using an algorithm that approximates human vision, maintained by <a href=\"https://github.com/kornelski/\">@kornelski</a>, can help us to check that we aren’t losing too much quality when compressing and thus better choose our compression parameters.</p>\n<h3>3. Align With Your Team, Create Standards</h3>\n<p>Most of the implemented solutions in this article are just possible proposals to optimize the images of our websites. Still, it is expected that you come up with new unique solutions agreed upon with your team of content creators, designers, and developers.</p>\n<p>We must all be on the same page when creating a quality project; communication will allow us to solve problems more quickly when they occur. By creating standards or presets when uploading images and defining their size and different resolutions, we will simplify the work of our colleagues and ensure that it is a joint effort.</p>\n<p>I hope the techniques presented will help or inspire you when dealing with images in current or future projects. Here are the main links to the demo project:</p>\n<ul>\n<li><a href=\"https://app.storyblok.com/#!/build/172320\">Copy of the Storyblok space created</a></li>\n<li><a href=\"https://github.com/Dawntraoz-Storyblok/sb-pokemon-gallery\">GitHub repository</a></li>\n<li><a href=\"https://sb-pokemon-gallery.dawntraoz.com/\">Live demo site</a></li>\n</ul>\n<p><em>Many thanks to <a href=\"https://joanleon.dev/\">Joan León</a> (<a href=\"https://twitter.com/nucliweb\">@nucliweb</a>) and <a href=\"https://www.smashingmagazine.com/author/vitaly-friedman/\">Vitaly Friedman</a> (<a href=\"https://twitter.com/vitalyf\">@vitalyf</a>), for reviewing the article and giving me powerful feedback.</em></p>\n"
}