{
  "title":"What’s New In DevTools: Halloween Edition 🎃",
  "date":"2022-10-20T14:00:00.000000Z",
  "author":null,
  "id":"https://smashingmagazine.com/2022/10/devtools-updates-halloween-edition/",
  "link":"https://smashingmagazine.com/2022/10/devtools-updates-halloween-edition/",
  "content":"<p>I can’t believe it’s already been nine months since I last wrote about <a href=\"https://www.smashingmagazine.com/2022/01/devtools-updates-2022/\">the new DevTools features</a> across browsers! You folks are due for an update. And what an update this is going to be!</p>\n<p>Our friendly DevTools teams at Mozilla, Google, Microsoft, and Apple have once again been hard at work. And in this article, I’ll attempt to summarize the most impactful new features that are now available in browser developer tools.</p>\n<p>So much has happened over these past few months that I may have missed a few things, but hopefully, you’ll find something that helps you in this article. There should be a little bit for everyone, whatever your level of experience with web development is, and whatever browser you use.</p>\n<p>So, without further ado, let’s jump right in.</p>\n<p><strong>Note</strong>: <em>Because Edge is based on Chromium, the open-source browser engine that also powers Chrome, all of the Chrome features listed below are also available in Edge (unless otherwise noted).</em></p>\nCSS Debugging\n<p>We’ve got a lot of long-awaited and profoundly impacting new features in CSS lately.</p>\n<p>To name just a few: </p>\n<ul>\n<li><a href=\"https://developer.mozilla.org/docs/Web/CSS/CSS_Container_Queries\">Container Queries</a> help us style components based on the size of their containers,</li>\n<li>The <a href=\"https://developer.mozilla.org/docs/Web/CSS/:has\"><code>:has()</code></a> pseudo-class lets us style elements based on what they contain, and </li>\n<li><a href=\"https://developer.mozilla.org/docs/Learn/CSS/Building_blocks/Cascade_layers\">CSS Cascade Layers</a> make it easy to gracefully handle increasing complexity in our websites’ code.</li>\n</ul>\n<p>But, although these features are amazing, shipping support for them in browsers is only part of the story. For people to comfortably use them, documentation and tooling are necessary too.</p>\n<p>We’re in luck because both Container Queries and CSS Cascade Layers have associated DevTools features now.</p>\n<p>Specifically, Container Queries are supported in Safari WebInspector and Chrome DevTools where information about the corresponding <code>@container</code> at-rules is displayed when viewing CSS in the Styles sidebar.</p>\n<p>Here is an example in Safari WebInspector:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ca81b6e3-aa8f-4f9a-860b-6bcf0e4b6bff/safari-container-queries-code.png\"></p>\n<p>Chrome, Safari, and Firefox DevTools also now have support for CSS Cascade layers in their Elements (or Inspector) tools. The layer to which a particular rule belongs is now displayed next to that rule:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d2b86cbb-1cac-427b-b945-7ba736347165/18-devtools-updates-halloween-edition.png\"></p>\n<p>Maybe a little less popular, but still very useful, the <a href=\"https://developer.mozilla.org/docs/Web/CSS/color_value/hwb\"><code>hwb()</code></a> CSS function makes it possible to express colors in a more natural way based on hue and an amount of whiteness and blackness.</p>\n<p><code>hwb()</code> is now supported in all major browsers, and Chrome (and Chromium-based browsers), as well as Firefox, both have support for it in DevTools. That means they will show <code>hwb</code> in the autocomplete list when editing CSS in the Styles (or Rules) sidebar and will show the same color swatch used for other color formats too.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e194a91a-c8d5-419e-9cc4-eaae4f7cb0cf/16-devtools-updates-halloween-edition.png\"></p>\n<p>Next, it has also become easier to edit CSS in the Styles sidebar and get meaningful autocompletion results across browsers.</p>\n<p>Chrome now previews all CSS variable values when autocompleting the <code>var()</code> function, not just colors, and it also displays <code>@supports</code> and <code>@scope</code> at-rules.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ca9f2972-5960-4d95-a474-9856795ed882/1-devtools-updates-halloween-edition.png\"></p>\n<p>Safari now uses fuzzy matching when auto-completing CSS, making it much faster to type property names and values.</p>\n<p>And Firefox added support for the <a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/color_value/color-mix\"><code>color-mix()</code></a> function in its auto-complete too.</p>\n<p>Talking about Firefox, the browser has had the amazing <strong>Inactive CSS</strong> feature <a href=\"https://hacks.mozilla.org/2019/10/firefox-70-a-bountiful-release-for-all/#developertools\">since 2019</a>, which lets you know when a particular CSS declaration doesn’t have an impact on the current element.</p>\n<p>Firefox continued to improve this feature over time and recently added more coverage for use cases such as warning when <code>border-image-*</code> is used on elements within a table with <code>border-collapse</code> or warning when width or height are used on ruby elements.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/82e91f9d-366a-4729-a300-d2960e864fb0/10-devtools-updates-halloween-edition.png\"></p>\n<p>And, while we’re on the topic of inactive CSS, the Chrome team is actually working on a similar feature. In fact, it’s <a href=\"https://devtoolstips.org/tips/en/find-inactive-styles/\">already available in Chrome</a> (and all Chromium-based browsers) by enabling the <strong>CSS authoring hints</strong> experiment under <code>Settings (F1) &gt; Experiments</code> in DevTools and should become available by default with Chrome 108.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f52f9b62-910a-4ea8-9a39-af09a1cbca53/11-devtools-updates-halloween-edition.png\"></p>\n<p>Over the past few years, browser DevTools has gotten fantastic layout debugging tools to inspect, understand, and tweak grid and flex layouts. More recently, Safari has been adding more features in this area as well.</p>\n<p>You can now use CSS alignment controls in the <em>Styles</em> sidebar and inspect Flexbox layouts too.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1b88dbca-94b7-4196-8757-a878928766f0/17-devtools-updates-halloween-edition.png\"></p>\nJavaScript Debugging\n<p>Let’s change gears a bit and talk about JavaScript debugging.</p>\n<p>It’s very common to use external libraries and frameworks in a JavaScript codebase, to avoid having to re-implement things that have already been solved. For some years already, DevTools have allowed users to ignore third-party scripts when debugging (see docs for <a href=\"https://developer.chrome.com/docs/devtools/javascript/reference/#ignore-list\">Chrome</a>, <a href=\"https://learn.microsoft.com/en-us/microsoft-edge/devtools-guide-chromium/javascript/guides/mark-content-scripts-library-code\">Edge</a>, <a href=\"https://firefox-source-docs.mozilla.org/devtools-user/debugger/how_to/ignore_a_source/index.html\">Firefox</a>).</p>\n<p>Hiding scripts makes it easier to debug your code. It avoids ending up in foreign-looking library code when stepping through your own logic.</p>\n<p>Recently, Firefox shipped a new feature that builds on top of this. You can now ignore <strong>pieces of code within a file</strong>. If you have a function that keeps getting called all the time but isn’t interesting for what you’re trying to debug, you can simply ignore that one function now.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c23f6d6c-d8a6-4e9a-8bab-ed1e4645f568/7-devtools-updates-halloween-edition.png\"></p>\n<p>Over in Chrome (and Chromium), a whole lot of small and not-so-small JavaScript debugging improvements were made:</p>\n<p>The Page source tree was improved, and there’s now a way to group sources by authored (to show the original source files, thanks to source maps) or deployed (to show the actual files on the server).</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b63e2fde-eb8a-4fa2-8479-86e89986bfab/20-devtools-updates-halloween-edition.png\"></p>\n<p>It is now also possible to live edit the code of a function while debugging. If you’re paused at a breakpoint inside a function and want to test a quick fix, you can edit the code right there and save the file. The function will be restarted with the new code.</p>\n<p>Next, stack traces for asynchronous operations are now reported entirely, showing you the full story of what happened before your current breakpoint, even if those things happened asynchronously.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9e7729cb-b97e-4e3c-bb11-dc6f34a0ab36/9-devtools-updates-halloween-edition.png\"></p>\n<p>Stack traces now also automatically ignore known third-party scripts, making it much easier to debug your own code.</p>\nPerformance Investigation\n<p>Web performance is probably an area where we depend on tools even more than in other areas. You can’t really guess what’s running slow or eating too much memory until you profile your webpage. Fortunately, we keep on getting new options to investigate performance and memory problems, making our lives easier.</p>\n<p>In fact, Chrome shipped an entirely new panel dedicated just to this! </p>\n<p><strong>Note</strong>: <em>This panel is available in Chrome only and not in other Chromium-based browsers.</em></p>\n<p>The <a href=\"https://developer.chrome.com/docs/devtools/performance-insights/\"><strong>Performance Insights</strong></a> panel shipped with Chrome 102 and has gradually gotten better and better, with recent additions like <strong>First Contentful Paint</strong>, <strong>Last Contentful Paint</strong>, <strong>Time To Interactive</strong> metrics and <strong>text flashes</strong> identification.</p>\n<p>Think of the Performance Insights panel as a simpler version of the (sometimes scary) Performance panel:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8d89e536-f185-4599-bcac-ad3713ab1272/19-devtools-updates-halloween-edition.png\"></p>\n<p>Talking about the Performance panel, it recently got a brand new <a href=\"https://developer.chrome.com/docs/devtools/evaluate-performance/reference/#interactions\"><strong>Interactions track</strong></a> in Chromium-based browsers, giving you a way to know when user events occur and how long they last, making it easier to debug responsiveness issues.</p>\n<p>Edge has also been busy shipping new features in this area.</p>\n<p>In the Performance tool, source maps can now be used to display original function names, even when sharing recorded profiles with other people:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/70c3bf36-d680-439e-ac60-758c19805a82/21-devtools-updates-halloween-edition.png\"></p>\n<p>In the Memory tool, you now get a summary of your <a href=\"https://learn.microsoft.com/microsoft-edge/devtools-guide-chromium/memory-problems/heap-snapshots\">heap snapshots</a> organized by node types. Heap snapshots are hard to dig through, and these node types make it easier to see what is using the most memory on your webpage. There are also new ways to filter memory retainers to find memory leak culprits quickly.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ab8190cb-3509-496f-85cf-d96ae922f2e3/13-devtools-updates-halloween-edition.png\"></p>\n<p>Finally, Firefox has also been active in this area over the past few months. A number of years ago, Firefox created a brand new <a href=\"https://profiler.firefox.com/\">Performance tool</a> for its own use. The idea, at the time, was to have a tool to debug performance problems in the browser code itself. But over time, the tool was adapted to become useful to web developers too.</p>\n<p>And now, the final changes have been made, and the old Firefox DevTools’ Performance panel has fully been replaced with the new one:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/abc943ba-91c4-4679-851a-5f82088bb850/8-devtools-updates-halloween-edition.png\"></p>\nNetwork Debugging\n<p>Debugging your frontend code is important, but sometimes problems can happen in the network layer of your app when communicating with your server. Thankfully, a few very useful features were recently added to the Network tools in various browsers.</p>\n<p>In Edge, a new column was added to the Network log. The <strong>Fulfilled by</strong> column makes it easier to debug your service worker logic and Progressive Web Apps.</p>\n<p>You can now discover straight away whether a request was handled by the service worker, the browser cache, or your server.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/dd080aaa-77f2-4442-82de-88fa5318e33e/15-devtools-updates-halloween-edition.png\"></p>\n<p>Firefox just shipped a completely redesigned version of its <strong>Edit and Resend</strong> feature. This feature has been available in Firefox for a long time already and is a great way to debug your server-side APIs or just test something quickly.</p>\n<p>With it, you can right-click on any HTTP request displayed in the Network tool, select <code>Edit and Resend</code>, then manipulate the request parameters, headers, and body, and finally send the modified request.</p>\n<p>Firefox completely redesigned it recently. It’s now much easier to edit the parameters before sending a new request.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/acc5b5a0-8f29-47ec-bcf7-b13344fb2ebb/24-devtools-updates-halloween-edition.png\"></p>\n<p>And finally, Safari has added quite a few great features in this area too. You can now block network requests entirely, and you can also locally override requests by using regular expressions.</p>\nEditor Integration\n<p>Microsoft also does VSCode, which is a very popular code editor amongst web developers, and some time ago, the Edge team released <a href=\"https://marketplace.visualstudio.com/items?itemName=ms-edgedevtools.vscode-edge-devtools\">the Edge Tools extension for VS Code</a>. The extension gives you an embedded browser and the browser DevTools right in VS Code alongside your code.</p>\n<p>This year, the team continued to work on the extension and added more features. In particular, the following things are now possible:</p>\n<ul>\n<li>The extension now has the <strong>Console</strong> and <strong>Application</strong> tools available. Previously, only the <strong>Elements</strong> and <strong>Network</strong> tools were available. Console logs used to go to VSCode’s output, but now they also go to the Console tool in the embedded DevTools.</li>\n<li>The embedded browser has been completely redesigned and features a lot of emulation and rendering options to test your webpage under different conditions. For example, you can emulate different media types or the prefers-code-scheme media feature. You can also emulate different color vision deficiencies.</li>\n<li>Next, you can launch the embedded browser and DevTools simply by right-clicking an HTML file in VS Code.</li>\n<li>Finally, you can use VS Code’s <strong>Quick Fix</strong> options to automatically fix a number of issues reported by the extension in your code.</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9fe7485c-9493-486a-90b2-807ca647dd69/4-devtools-updates-halloween-edition.png\"></p>\n<p>One more thing, if you like using Visual Studio (not VS Code), note that the team released an extension for it too. Check out the <a href=\"https://marketplace.visualstudio.com/items?itemName=ms-edgedevtools.VisualStudioEdgeDevTools\">Edge Developer Tools for Visual Studio</a> extension.</p>\nTest Automation\n<p>It’s possible to automate browsers nowadays, and it can be very useful for testing. With browser automation libraries such as <a href=\"https://webdriver.io/\">WebDriver</a>, <a href=\"https://pptr.dev/\">Puppeteer</a>, and <a href=\"https://playwright.dev/\">Playwright</a>, you can write tests that mimic what users would do on your website and verify that these scenarios continue working over time, as you make changes to your product.</p>\n<p>This area is in constant evolution; in particular, the WebDriver spec is evolving with a new <a href=\"https://w3c.github.io/webdriver-bidi/\">bi-directional</a> version. Also, the Chrome DevTools team has been innovating quite a lot lately. They shipped a new tool called the <a href=\"https://developer.chrome.com/docs/devtools/recorder/\"><strong>Recorder</strong></a> last year and have been improving it over time.</p>\n<p>Here are some of the new features that got added to the panel in recent months:</p>\n<ul>\n<li>It’s now possible to wait until elements are visible and clickable before continuing a recording.</li>\n<li>Element selectors are better supported.</li>\n<li>You can import and export recorded flows as JSON.</li>\n<li>Double-click, mouse over, and right-click events can be recorded too.</li>\n<li>There’s also an option to replay a recording slowly or step-by-step.</li>\n<li>And, finally, the Recorder tool now supports extensions to export recordings to a variety of test automation formats, such as <strong>Cypress</strong>, <strong>WebPageTest</strong>, <strong>Nightwatch</strong>, or <strong>WebdriverIO</strong>.</li>\n</ul>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/71088936-4fcc-426f-a0b4-ed378b28d09f/23-devtools-updates-halloween-edition.png\"></p>\nMiscellaneous Updates\n<p>Phew, that was a lot! But we’re not done. Let’s wrap this up with a list of somewhat random but very useful features.</p>\n<p>Chrome made a lot of source maps and stack traces improvements, providing a more stable and easier-to-use debugging experience. If you usually debug your JavaScript code with logs, now may be a good time to give <a href=\"https://developer.chrome.com/docs/devtools/javascript/\">breakpoint debugging</a> a try and see if it speeds things up for you.</p>\n<p>Talking about logging, they also made it possible to properly style logs with <a href=\"https://en.wikipedia.org/wiki/ANSI_escape_code\">ANSI escape codes</a>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/5fac6de0-f25a-4c87-98b8-dcb301fa1ee5/3-devtools-updates-halloween-edition.png\"></p>\n<p>Next, you can now pick colors from anywhere on your screen when changing colors in the Styles sidebar. </p>\n<p><strong>Note</strong>: <em>This was made possible thanks to the <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/EyeDropper_API\">EyeDropper API</a>, which you can also use on your web pages.</em></p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/050f11ca-ae01-4e11-b464-f521a06efdd4/12-devtools-updates-halloween-edition.png\"></p>\n<p>Edge shipped a feature to publish and retrieve production source maps from Azure, making it much easier to securely debug your code in production even when you don’t want to publish source maps and original source code to your server.</p>\n<p>Read more about <a href=\"https://learn.microsoft.com/en-gb/microsoft-edge/devtools-guide-chromium/javascript/publish-source-maps-to-azure\">publishing your source maps</a> and <a href=\"https://learn.microsoft.com/en-gb/microsoft-edge/devtools-guide-chromium/javascript/consume-source-maps-from-azure\">consuming them from DevTools</a>.</p>\n<p>The team also opened a <a href=\"https://github.com/MicrosoftEdge/DevTools\">new public feedback repository on GitHub</a> which you can use to report ideas, issues, and features or just discuss them.</p>\n<p>Finally, they shipped a redesigned <strong>Welcome</strong> tool where you can find all sorts of useful videos and links to documentation.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e857c21c-ab2e-4c29-a7b5-91f8733a8b48/6-devtools-updates-halloween-edition.png\"></p>\n<p>Switching to Firefox, the DevTools team continued to keep their <strong>Compatibility</strong> panel up to date with new <a href=\"https://github.com/mdn/browser-compat-data\">browser compatibility data</a>, so you can get relevant cross-browser support issues right when debugging your CSS.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bb686ebd-a76b-4943-b4b1-22694531771b/5-devtools-updates-halloween-edition.png\"></p>\n<p>The team also made it possible to disable and re-enable any event listener for a given element in the Inspector.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/879b4dbb-ead9-4f62-8315-176e9e437762/14-devtools-updates-halloween-edition.png\"></p>\n<p>Finally, Edge just shipped a cool new experimental feature that enables one to type commands and access common browser and DevTools features from one keyboard shortcut.</p>\n<p><a href=\"https://learn.microsoft.com/en-gb/microsoft-edge/devtools-guide-chromium/experimental-features/edge-command-palette\">The Command palette experiment</a> lets you enter commands in the browser by pressing Ctrl+Q (note that prior to Edge 108, the shortcut was Ctrl+Shift+Space).</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/14592039-7182-4ea9-9a35-4193c740b696/2-devtools-updates-halloween-edition.png\"></p>\n<p>And that’s it for today. I hope you found a few things that will be useful for your web development projects.</p>\n<p>DevTools has gotten impressively full of features over the years, and it’s <a href=\"https://www.smashingmagazine.com/2022/05/whats-that-dev-tool/\">hard to keep track</a>, but here are a few pointers that I hope will make it easier to discover new features:</p>\n<ul>\n<li>The <a href=\"https://www.youtube.com/playlist?list=PLNYkxOF6rcIBDSojZWBv4QJNoT4GNYzQD\">Chrome DevTools What’s New</a> video playlist on YouTube.</li>\n<li>The <a href=\"https://www.youtube.com/watch?v=LJxjFo4DuA0&amp;list=PL4z1-7pjJU6wCla3QZuWuWjsCB2hCnTvr\">Edge DevTools What’s New</a> video playlist on YouTube.</li>\n<li>The <a href=\"https://twitter.com/firefoxdevtools\">@FirefoxDevTools</a> Twitter, where new features are often announced.</li>\n<li>The <a href=\"https://webkit.org/blog/category/web-inspector/\">WebInspector category</a> on the WebKit blog.</li>\n</ul>\n<p>And with this, thanks for reading, and if you have great DevTools tips you want to share with everyone, please drop us a comment!</p>\n"
}