{
  "title":"State Of CSS Survey: Influence The Future Of CSS",
  "date":"2022-10-24T19:00:00.000000Z",
  "author":null,
  "id":"https://smashingmagazine.com/2022/10/state-css-survey-2022/",
  "link":"https://smashingmagazine.com/2022/10/state-css-survey-2022/",
  "content":"<p>This year, I joined the team and <a href=\"https://lea.verou.me/2022/07/help-design-the-state-of-css-survey-2022/\">helped design the survey together with the community</a> which led to a <a href=\"https://lea.verou.me/2022/10/state-of-css-2022-now-open/\">number of improvements</a>. If you write CSS frequently, investing a few minutes to fill it in could come back to you hundredfold, since implementers make decisions on what to work on based on the developer pain points identified through the survey every year. In fact, Chrome is funding work on the survey for this very reason.</p>\nPast Surveys\n<p>So, how did past surveys help web developers? Let’s look at the impact in Chrome, as described to us by <a href=\"https://twitter.com/stubbornella\">Nicole Sullivan</a>, Product Manager for Chrome at Google:</p>\n<blockquote>“I showed the <a href=\"https://2019.stateofcss.com/opinions/#missing-features?source=smashing_magazine_css_survey\">‘Missing features’ section</a> to my team before the pandemic and we got to work on it. Several things on that list are underway.”</blockquote>\n\n<p>Indeed, literally everything in that list is now being worked on or finished unless there was no (stable) specification for it:</p>\n<ul>\n<li>✅ <strong>Container queries</strong><br>Size queries have <a href=\"https://caniuse.com/css-container-queries\">shipped in Chrome 106</a> , style queries behind a flag.</li>\n<li>✅ <strong>Parent selector/:has selector</strong><br><a href=\"https://caniuse.com/css-has\">Shipped in Chrome 105</a>.</li>\n<li>✅ <strong>Nesting</strong><br>Currently underway, delayed a bit due to discussions in the CSS Working Group about last minute changes to the syntax.</li>\n<li>🟡 <strong>Functions</strong><br>No specification to implement yet, but is being worked on in the CSS WG.</li>\n<li>✅ <strong>Scoping</strong><br>Experimental implementation in Chrome 105 behind a flag.</li>\n<li>🟡 <strong>Mixins</strong><br>No specification to implement yet, but ideas are being explored in the CSS WG.</li>\n<li>✅ <strong>Subgrid</strong><br>Implementation underway.</li>\n</ul>\n<p>Let’s look at the <a href=\"https://2020.stateofcss.com/en-US/opinions/#currently_missing_from_css?source=smashing_magazine_css_survey?source=smashing_magazine_css_survey\">corresponding section in the 2020 results</a>. A lot of overlap, but some additional items:</p>\n<ul>\n<li>✅ <strong>Form elements styling</strong><br>Work is underway on a <a href=\"https://hidde.blog/custom-select-with-selectmenu/\">stylable &lt;selectmenu&gt; element</a> to replace &lt;select&gt;, and an <a href=\"https://open-ui.org/prototypes/selectmenu\">experimental implementation exists in Chrome</a> behind a flag.</li>\n<li>🟡 <strong>Conditional logic</strong><br>No specification to implement, but several proposals are being explored in in the CSS WG.</li>\n<li>✅ <strong>Masonry layout</strong><br><a href=\"https://www.smashingmagazine.com/native-css-masonry-layout-css-grid/\">Already worked on</a>, experimental implementation in Firefox Nightly.</li>\n</ul>\n<p>The <a href=\"https://2021.stateofcss.com/en-US/opinions/#currently_missing_from_css_wins?source=smashing_magazine_css_survey\">2021 corresponding section</a> includes roughly the same items, with one new thing: <strong>color functions</strong>. And lo and behold, the color functions for which there is a stable specification are being implemented in Chrome as we speak, and Chrome has funded specification work on the rest. </p>\n<p>And it’s not just Chrome. The focus of <a href=\"https://web.dev/interop-2022/\">Interop 2022</a> was largely shaped by these results.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ea87f3fc-d587-446b-a80b-524d55f245ec/currently-missing-from-css.png\"></p>\nWhat’s Next?\n<p>We’re taking on the world of styles and selectors to try and identify upcoming trends, and figure out what featurs and tools to learn next. What’s more, the survey results will also help browser vendors prioritize their roadmaps and work towards better compatibility between browsers. </p>\n<p>What do you want to see more of in CSS? Better typography? New responsive layout features? New features to improve maintainability? Layout? Components? Something else? The sky is the limit! Make sure to <a href=\"https://stateofcss.com/en-us/?source=smashing_magazine_css_survey\">share your CSS dreams with us in the survey</a>, and they may well start coming true.</p>\n"
}