{
  "title":"How I Escaped My Troubles Through Science - Issue 104: Harmony",
  "date":"2021-08-25T13:00:00.000000-07:00",
  "author":null,
  "id":"http://nautil.us/issue/104/harmony/how-i-escaped-my-troubles-through-science?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "link":"http://nautil.us/issue/104/harmony/how-i-escaped-my-troubles-through-science?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "content":"<img src=\"http://static.nautil.us/18717_ec3fafed7bab31c3deaae02f52e5505a.png\"><br><p align=\"center\">“Occasionally, when Ammu listened to songs that she loved on the radio, something stirred inside her. A liquid ache spread under her skin, and she walked out of the world like a witch, to a better, happier place …” —Arundhati Roy, <i>The God of Small Things</i></p><p></p><p>We’ve all felt the need. To just drop whatever loads we’re bearing, retreating to some private realm where our worldly concerns fade into oblivion. Freed from responsibilities, anxieties, hurts, and other miscellaneous burdens, if only transiently.</p><p>My earliest recollection of the urge must’ve been when I was around 5. My mother was colorfully scolding me the way Indian mothers do, for something I probably did but nevertheless felt unjustly prosecuted for. Turning to the sky beyond the window of our apartment building, I remember becoming consumed by what it would be like to be the letter R. Just being the letter R. Where I could exist wherever it was that letters existed, in solid form, bathed in saturated white light, finding solace in the emptiness, where feelings didn’t exist.</p><p>After a sleepless night in an orange jumpsuit in a maximum-security immigration-detention facility, I was taken back to the airport.</p> <p>The urge to retreat from reality can take on a compulsive nature for some, whether it’s into the worlds in video games, literature, or some other obsession. For others, the choice instead is to palliate reality through alcohol or other assorted fixes. Although I’m no stranger to any of these, the most soothing flight from the mundane I’ve come to seek comfort in over the years has been the retreat into my work. The <i>real</i> stuff of my work that is, not the worldly responsibilities that go along with it. Although I do take great pride in the latter, nothing comes close to providing me the solace, sometimes even deliverance, as some of my flights into the corner realms of theoretical physics. I recognize the solipsism and selfishness in this, but also the act of self-preservation that it represents.</p><strong>THE HIGH OF DISCOVERY:</strong> “It’s a rush that never gets old, no matter how niche or subtle the result, no matter how few people end up caring about it, let alone citing your paper,” writes Subodh Patil (above), about cracking a scientific problem. “To me, it’s the real stuff of being a physicist. Of being alive.”William Barker<p>Perhaps the seeds were planted in a somewhat difficult childhood and adolescence growing up in Hong Kong and onto a young adulthood, struggling to navigate the different worlds I had to straddle as a many-time immigrant. Perhaps it was perpetuated by the need to seek refuge whenever something about the world would confuse or frighten me. Although I didn’t know it at the time, my reflexive retreats into abstract realms was the nursery in which my individuality was fostered as a teenager. It wasn’t just that my parents would leave me alone when I was hunched over a desk, scribbling on scraps of paper or buried in a book; that nursery was an invisible and formidable shield against any of their expectations that conflicted with the personhood I was beginning to assert. A struggle for the self that many immigrant children have to confront in some way.</p><p>But there was another edge to it. Like many of my fellow travelers, what drew me to the worlds of theoretical physics was also seeded in my earliest existential doubts, and the struggle to come to terms with the answers the people around me seemed to content themselves with.</p><p></p><p>I will never forget my first real bout with a question. I was a few years into grad school at Brown University, and just beginning to find my legs as a researcher. My first two papers had just come out, and I had just moved in with my girlfriend at the time in New Haven, commuting to Providence for my weekly meetings with my advisor. In a matter of days, the ground beneath my feet fell out from under me.</p><p>In the drawn out aftermath of 9/11, immigration problems entirely of my own making resulted in my being denied entry to the United States after a visit to Mumbai, to which my folks had moved back. I was ruled inadmissible over a run-in with the law many years before, when I was a teenager. It didn’t result in any charges, but did manage to linger on a computer somewhere. After a sleepless night in an orange jumpsuit in a maximum-security immigration-detention facility, I was taken back to the airport where I was told by Customs and Border Patrol agents that I’d probably never see these shores again. I did. But only after six of the longest months of my life, spent in a daze of uncertainty and anxiety over whether I’d ever be able to go back to my former existence. During this limbo, I frequented the Tata Institute for Fundamental Research in Mumbai, where my advisor had arranged a precious desk for me so that I could keep working. It was home to a vibrant community of string theorists who warily welcomed me. I was thrust into an intellectual hothouse of blackboard discussions, and seminars that would always go way over the allotted time that helped me momentarily forget why I was there.</p><p>Without the ability to scribble anything in the margins, I’d while away the commutes manipulating symbols the best I could in my mind.</p> <p>Several of the researchers at the Tata Institute were working on what seemed like impossibly simple transcriptions of string theory known as matrix models. As the name suggests, matrix models encode the complicated dynamics of objects within string theory into the dynamics of two-by-two arrays of numbers, or matrices, familiar to anyone who’s ever taken a linear algebra class. People were beginning to notice structures arising within matrix models that made them wonder if it could really be a description of M-theory, the supposed parent theory from which all string theories descend.</p><p>I was hooked. I started devouring papers on the subject, many of which I could barely understand. I also had the nerve to find minor gaps in certain derivations that just didn’t sit right with me. The researchers I spoke to brushed them off as inconsequential, but I just couldn’t let go of the doubts.</p> <p>There are different types of infinity. The most familiar perhaps, is one you can count your way toward. One, two, three, and so on, to countable infinity, denoted somewhat biblically as ℵ0, or aleph-zero. The other should also be familiar, but slightly more abstract: <i>un</i>countable infinity, or ℵ1. It represents the number of real numbers between zero and one. That these infinities are not the same was proved in the late 19th century by Georg Cantor in a manner <a href=\"https://en.wikipedia.org/wiki/Cantor's_diagonal_argument\">so simple</a>, you could sketch it out to your friends on a bar napkin. It’s one of the most beautiful and profound results in all of mathematics, one that I would rederive for myself multiple times over the years and still scarcely believe. (In fact, many of Cantor’s contemporaries didn’t believe it, either. He died alone and in penury in a sanatorium, the result of a steady decline in health after years of ridicule and professional humiliation.)</p> <p>The thing about matrices is that they can also have a very large number of entries, even up to countable infinity. These so-called infinite-dimensional matrices have a very different algebra from finite-dimensional ones. The thing about certain matrix models is that their finite-dimensional versions are supposed to be taken only as approximations to the underlying dynamics they’re trying to capture, becoming exact only in the infinite-dimensional limit. I thought about this for weeks. Weeks where crippling anxiety had reduced me to a displaced and disjointed shadow of my former self.</p><p>In the searing heat, I would commute almost two hours each way, from the Tata Institute to my parents’ apartment in the far northern suburbs. Mumbai commuter trains are not for the faint-hearted. Riders cram themselves into carriages running at thrice their capacity, in a self-organized human jigsaw that would sometimes find you dangling outside the permanently open doors of carriage, where at least you could breathe freely. Collective suffering, however artificially induced, unfailingly brings out the best in people. The unspoken kindness and indifference with which people would elbow past each other, occasionally trampling on each other’s feet on their way in and out of the train, is a lesson in letting go I update myself with every time I’m back in Mumbai.</p><p>I’d always be reading physics papers on these long commutes. One arm wedged against my body, holding a paper at head height, the other, finding some form of grip to maintain a precarious balance as the carriage swayed back and forth, my center of gravity now in a collective with other bodies packed tightly against mine. Without the ability to scribble anything in the margins, I’d while away the commutes manipulating symbols the best I could in my mind.</p><p>On one such journey, I came to with a pounding sensation in my head, which was now wedged between my knees. A fellow commuter was holding out a bottle of water for me, another was handing me back <a href=\"https://arxiv.org/abs/hep-th/9910053\">the crumpled paper</a> I was reading. I don’t remember how I got there, but the evidence suggested I had passed out and was shepherded to the nearest seat. Taking advantage of the predicament, I assured everyone I was okay, and remained slouched over for the rest of my commute, crying silently into my duffle bag.</p><p>I’ve come to appreciate that you form personal relationships with some of the problems you end up working on.</p> <p>Not knowing what else to do, I would lose myself for hours on end over the following days in the algebra of matrices, of strings ending on membranes, of the mathematics of infinity. No flashes of insight, no grand epiphanies, just slow and steady deliberation over subtle details. The dull aches that had characterized my inner state for months up till then transiently tempered. Finding uncomplicated pleasures in the purity and simplicity of the abstractions in front of me. I had slowly come to realize that there was a straightforward way to map the multiplication of infinite-dimensional matrices into the calculus of continuous functions. I saw that, in fact, my earlier doubts were founded. I had cracked an opening to an extension of a particular matrix model that hadn’t been noticed before.</p><p>I called it a <i>central extension</i>, which was familiar terminology from other infinite-dimensional algebras seen in string theory. It was then that I finally felt a gush of joy, as after all that steady deliberation, new solutions that hadn’t been noticed before starting falling out naturally. They had the geometry of cylinders, and warped planes. <i>Fuzzy</i> cylinders and <i>fuzzy</i> planes, whose geometry is quantum rather than continuum. It’s a rush that never gets old, no matter how niche or subtle the result, no matter how few people end up caring about it, let alone citing your paper. To me, it’s the real stuff of being a physicist. Of being alive.</p><p>A few months later, I received a new visa to return to the U.S. with a waiver for the inadmissibility that kept me out many months earlier. I felt incredibly lucky, blessed, and privileged, given what my lawyer had conveyed to me would be the likeliest outcome. I wrote up my results in what was to become my first and only purely theoretical <a href=\"https://iopscience.iop.org/article/10.1088/1126-6708/2005/01/007\">paper on string theory</a>, dryly thanking all the folks who made my life bearable over the course of it in the acknowledgements. What I really wanted to say to them was thank you for keeping me sane. Thank you for helping me through the worst of all of this by paving the way for the flights of imagination that turned into this paper.</p><p>“On the days that the radio played Ammu’s songs, everyone was a little wary of her. They sensed somehow that she lived in the penumbral shadows between two worlds, just beyond the grasp of their power.”</p><p>I’ve come to appreciate that you form personal relationships with some of the problems you end up working on. You’re never quite the same person after having encountered them, and they’ll always remain in you somewhere long after. Over the years, I’ve learned to become better at picking them, but it hasn’t always worked out. Some have induced an obsession so unhealthy, that I’ve been unable to work on anything else for over a year, even if it was looking like the task I had set for myself was an impossible task.</p><p>Now that I’m at a station in my professional life where I’m kept up at night by concerns that go far beyond myself, such indulgent bouts are fewer and further between. But they still come and go, and it’s the only thing that still, selfishly, feels like the real thing. What could have ended up as a crippling dysfunction in any other incarnation turned out to be my survival kit, not just in life, but in my chosen craft. A sort of existential protest perhaps that from time to time, I will escape, therefore I am.</p><p></p><p><i>Subodh Patil is an assistant professor at the Lorentz Institute for Theoretical Physics at Leiden University. He tweets on occasion at @_subodhpatil.</i></p><p><i>Lead image: Triff / Shutterstock</i></p><br><a href=\"http://nautil.us/issue/104/harmony/how-i-escaped-my-troubles-through-science?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication\">Read More…</a>"
}