{
  "title":"The Math That Says Egalitarianism Is Possible - Issue 104: Harmony",
  "date":"2021-08-11T13:00:00.000000-07:00",
  "author":null,
  "id":"http://nautil.us/issue/104/harmony/the-math-that-says-egalitarianism-is-possible?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "link":"http://nautil.us/issue/104/harmony/the-math-that-says-egalitarianism-is-possible?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "content":"<img src=\"http://static.nautil.us/18660_5dbf1b07990a76375db518236bc93f06.png\"><br><p>Last month, having returned to Earth aboard his Blue Origin spacecraft, Jeffrey Bezos, the chairman of Amazon and, as of this month, the richest person alive with over $200 billion, made an awkward show of gratitude. On stage at a press conference in Van Horn, Texas, sitting alongside the ship’s three other passengers, Bezos, wearing a pretentious cowboy hat, said he wanted to thank every Amazon employee and customer because, “You guys paid for all of this.”</p><p>The immediate reaction from the audience and Bezos’ co-“astronauts” was a kind of perfunctory laughter. They all seemed to think he must be joking, or at least couldn’t be serious. Even Wally Funk, the 82-year-old aviator sitting to Bezos’ left, rolled her eyes and opened her mouth tall in faux amusement. The backlash, from pundits and elected officials, was rapid. Congresswoman Alexandria Ocasio-Cortez said, on Twitter, “Yes, Amazon workers did pay for this—with lower wages, union busting, a frenzied and inhumane workplace, and delivery drivers not having health insurance during a pandemic.”</p><p>For Paul Hooper, an evolutionary anthropologist, the indignant reactions to Bezos’ gesture of humility illustrates a sort of social paradox in American society. “We’re a highly stratified society. It’s clear that we have classes,” Hooper said. “Yet we also have a competitive humility that goes on even with really famous and really rich people. They are asked to present a modicum of virtue that the chimpanzee alpha does not care about. We maintain this constant negotiation of not only where we stand, but how we should stand with respect to each other. That’s rife through our social life at all scales.”</p><strong>HUMAN POSSIBILITIES:</strong> Paul Hooper spent time among nomads in different countries to better grasp the fundamental principles that govern human societies. “You start to get a sense of the broad variation that’s possible in terms of human behavior and human social organization,” he said.Courtesy of Paul Hooper<p>In a recent <a href=\"https://www.nature.com/articles/s41562-021-01059-y#Equ15\">paper</a> in <i>Nature Human Behavior</i>, Hooper explains how egalitarianism—a culture of resistance against unequal treatment and opportunity—can evolve in a society and stay strong. Becoming a truly egalitarian society would mean, for example, curtailing vast disparities in wealth and other resources, so that the pursuit of happiness isn’t so skewed in favor of the few. When I asked Hooper if he saw the backlash to Bezos as egalitarianism in action, he said, “Absolutely. The way that people react to that kind of thing is exactly what I’m talking about.”</p><p>Hooper is a senior researcher at the Economic Science Institute at Chapman University, and studies, among other things, what drives wealth inequality and egalitarianism.* He started out studying history and loved learning about the Mongol Empire, but got frustrated that historians didn’t have the tools that he wanted to use to investigate how human society works scientifically. Now, he says, he’s helping to modernize anthropology into a discipline that’s more “computational,” involving a mix of theoretical modeling and statistics.</p><p>In our conversation, over Zoom, he considered his words carefully, fixing his gaze away from the camera for stretches at a time to ponder his response. This fit with the patient, inquisitive, analytic demeanor of someone who conducted ethnographic fieldwork in places like Bolivia, Mongolia, and Siberia to challenge his own assumptions about what human societies can be like. I brought up Bezos, and then asked Hooper to explain what, at bottom, fuels the possibility of egalitarianism in the first place, beginning with how he defines the term.</p><p></p><p><b>Was the backlash against Jeff Bezos’ recent show of “gratitude” for his Amazon employees a sign that egalitarianism is strong in our culture?</b></p><p>I think that, while on the face of it, the inequalities are increasing, that’s likely to increase the demand for egalitarian behavior. It’s not letting dominance pass you by, but saying, “I’m actually going to do something about this.” So, the very fact that it’s getting worse may create the conditions for it to swing the other way. If you can affect the importance of cooperation, and if you can affect who has to cooperate with whom, then as long as the push is big enough, it should have an effect. With the dominants, the rich—you need to wire them up to everybody else, because then everybody else can have an influence on them and say, “Whoa, Mr. Big Shot.” Then they start to feel bad. They start to realize they’re losing friends. If the dominants or the rich or the elites are up in their fortresses, then there’s no room for any of this.</p><p><b>Have community and social capital been too de-emphasized in our vision of what a desirable lifestyle looks like?</b></p><p>Yes, in a way that has made us vulnerable. Many of us are drawn into a jet-setting sort of lifestyle, where we go to college in one place and get a job for a few years in another. There’s a real loss of place and people that I’ve seen that I think is at the heart of a lot of the egalitarian actions that we try to model. If we can pay as much attention to our social capital as our material capital, that would put us in a position to be happier and more equal.</p><p>I feel like there’s untapped creative potential in determining the nature of our own society.</p> <p><b>What did you learn about egalitarianism living among people in Siberia and Mongolia?</b></p><p>One thing that piqued my interest when I was in Siberia and Mongolia was the radically different notions of property rights among nomads. I grew up mostly in Colorado and New Mexico. We have this feeling of open fields and blue skies and freedom. Going to Mongolia, where people had been basically ranchers and cowboys for 6,000 years now, and there’s no fences, and the animals and people know where to go, was striking. Some of my stereotypes about nomads were false. The idea that there’s no fixed pattern, or people just wander and go wherever the grass is. In particular ecologies, there’s quite real property rights in the sense that: “This is our camp, and we’re going to be here next year, and nobody else who knows what they’re doing is going to come camp there out of respect for us and our family and our place in the community.” It doesn’t come down to a deed or a title. It’s a matter of community regulation—who has the right to claim what—and for the most part it’s a functional system. It’s what they’ve been doing for long before anybody showed up and tried to introduce taxation. Those are the kinds of things that get me excited.</p><p><b>What are the things that lead society into a stark dominance hierarchy?</b></p><p>The best predictor of dominance hierarchies in which it’s clear who’s on top and who’s on bottom is the existence of concentrated, clumped resources that are efficient to defend. Essentially the first six pristine civilizations formed where there was extremely concentrated, high-productivity agricultural soil. That provided the nucleus, the birthplace for those highly unequal, larger-scale systems to grow.</p><p>The coastal sites that Native Americans inhabited were also so productive and defensible that you ended up seeing these large-scale towns defended with walls and small-scale armies. You go a few hundred miles inland, and the resources are plants scattered more widely, or game that’s moving around, and you don’t see anything like that. You see small settlements and little benefit to saying, “This is my patch.” Because, claim it now, and the animals are just going to leave.</p><p>Groups that don’t have strong private property norms—where if you’re using something, you have a right to it, and once you stop using it, then somebody else can step in—don’t breed the kind of inequality that happens if you own a particular patch of agricultural soil year after year, and you always have the productivity that comes off of it.</p><p><b>So, if resources are hard to defend, that guards against domineering inequality. What else helps to guard against that?</b></p><p>There’s been an argument that, as humans developed the use of tools that we hold in our hands and use to kill animals, we started to also use those to kill other human beings. That, the argument goes, actually levels the playing field in terms of fighting ability, and increases the cost of fighting for everybody. These are the costs of competition.</p><p>Think about wrestling versus getting stabbed. Whenever you expect to get hurt, you’ll do less of that thing. Leveling coalitions basically stand up to dominants and punish them when they’re aggressive. We specifically focus on retaliating against the dominant by saying, “I refuse to cooperate with you.” You can also get levelers that say, “I’m not going to start any fights, but if you fight me, I’m going to fight you back.”</p><p>That’s another strategy we talk about in the model, and that can do something similar. Gains to cooperation are the benefits that you get from cooperating with somebody. It’s: “How beneficial are your friends to you? How much is their friendship worth to you in evolutionary currency?”</p><p><b>What hasn’t been done before, you say, is combining these factors into a single “evolutionary model.” What do you mean by that?</b></p><p>It’s a mathematical model we use to ask, “Given a set of assumptions and given particular environmental conditions, if natural selection were to act on a population, what would the result be?”</p><p><b>Part of what’s new in your work is the way you marry a couple of popular games—hawk-dove and the prisoner’s dilemma—to create your model. How do they work?</b></p><p>Hawk-dove is a game of whether to be aggressive or dominant, or not. When there’s a resource that can either be shared or fought over, hawks fight over it and doves share it. Hawks, when they encounter doves, take the whole thing. It’s the classic game to represent animal dominance interactions. We chose to use it in this model to represent those behaviors—like stealing from someone, or taking their spot, or beating them up—that seem to be remarkably absent in egalitarian hunter-gatherers and other groups. We wanted to say, “What would make you go from a situation where you had a good number of people in the population who are willing to be aggressive, to a situation in which hardly anyone is willing to be aggressive, because they know it’s in their best interest to not be a jerk?”</p><p>The prisoner’s dilemma is the classic representation of a cooperation game where, by cooperating, two individuals are able to generate more resources than they generate on their own. But there’s a temptation to defect, or free ride. So, cooperation should not evolve in a prisoner’s dilemma unless there’s some special conditions, like an opportunity for repeated interaction or relatedness between the players. So it was a way for us to represent this dimension of cooperation that in the hunter-gatherer context would amount to something like food sharing or cooperative hunting.</p><p>The very fact that inequality is getting worse may create the conditions for it to swing the other way.</p> <p><b>Why combine hawk-dove and prisoner’s dilemma in a single evolutionary model?</b></p><p>We had an inkling that this could be key to explaining the lack of aggressive behavior: Can one game end up having a spillover effect on the other game and end up squashing dominance?</p><p><b>So, what happens in the evolutionary model when you press “go,” so to speak?</b></p><p>I always like a very pessimistic starting point: Let’s assume everybody’s a hawk and nobody’s cooperating. It’s a Hobbesian, shitty world. Then you ask: Under what conditions does that population evolve to go someplace else entirely different? The absolute key is the net benefits of cooperation, if those outweigh the short-term benefits of aggression.</p><p>What happens in the model is new strategies arise through mutation. Suddenly, out of nowhere, we have a leveler, a mutant baby. And the question is: Does the leveler succeed evolutionarily and increase in the population, or are they snuffed out immediately?</p><p>As long as the benefits of dominance are less than the benefits of cooperation, then it’s actually in the dominant’s interest, when they encounter the leveler, to give in, basically, because the leveler, on its first turn after someone plays hawk on it, will be like, “No. I’m a leveler and you played hawk. I’m never going to cooperate with you unless you play dove.”</p><p>If the balance is correct, then it’s in the interest of the dominant to take heed and say to the leveler, “I’d rather have the benefits of cooperation than just to take your stuff today, so I’m going to start playing dove.” The same conditions that make it worth being a leveler also make it worth paying attention to a leveler, because that benefit of cooperation is out there, and as long as it’s valuable enough, it’ll drive someone to say, “I’m going to put away my bullying because I’d rather get the benefits of playing along,” essentially.</p><p><b>What does the model end up predicting about cooperation and egalitarianism?</b></p><p>What it predicts is that more equal conditions arise because of the importance of cooperation. Any time that there’s dominance interactions and cooperation, it’s not just any old circumstance that we expect levelers to be able to create more equality. It’s specifically only when the net benefit of cooperation, the extra resources that we generate by working together, is greater than what you would get by being aggressive that levelers can invade and cause it to become more equal.</p><p><b>Would you characterize modern society as more of an egalitarian situation, or some kind of dominance hierarchy?</b></p><p>Given the institutional protections of civil liberties that have evolved in the past two centuries, there’s a lot of scope for egalitarian living nested within the context of a larger society. There’s ways, particularly in our face-to-face interactions with our peers and the people that we choose to interact with, that we replicate a lot of the egalitarian practices that you see in hunter-gatherer societies.</p><p>The ǃKung people of Southern Africa, for example, consciously avoid bragging. It would be considered rude for you, if you were a hunter, to walk back into camp with a kill on your back and say, “I killed this,” and give it to everyone else. What they end up doing is dropping the carcass off about 20 feet away from camp and walking in as if they got nothing. Somebody else from the camp will retrieve the animal and bring it in and start distributing it. It’s almost a competitive humility.</p><p>At the macro level, today’s reliance on capital is a ramped-up version of what we see with earlier agricultural societies, except the scale of the system and its productivity, and so its capacity for inequality, dwarfs that of the agricultural period. The distribution and size of firms has gone up over the past century, and that’s been a part of a process of consolidation and movement of wealth concurrent with increases in inequality and distribution of that capital. With few exceptions, most of us are living in really unequal countries in terms of distribution of income and capital. We’re a highly stratified society.</p><p>The benefit of cooperation is there. If it’s valuable enough, someone will say, “I’m going to put away my bullying because I’d rather get the benefits of playing along.”</p> <p><b>Why do you say that it’s of great societal interest to understand how egalitarianism, an active suppression of dominance, can get off the ground?</b></p><p>We know how harmful inequality can be, and we know it’s been steadily on the rise, maybe since the ’50s. It’s at record-high levels, and we see it manifesting in measurable ways that are real and they show up in the news. It’s clear that we have classes. That manifests in so many different ways, not only directly, in terms of what resources people have access to, but also gradients in health and mental well being. All of the material inequality ends up manifesting in terms of embodied inequality. If we had a better theory to understand what leads to more inequality, and especially what leads to less inequality, I think it could alleviate some real human suffering.</p><a title=\"Italic\" class=\"redactor_btn_italic\" tabindex=\"-1\"/><p><b>How do we embody inequality?</b></p><p>As an example, we can think about income and neighborhood in urban settings, like Denver or San Francisco. When you’re facing low income, no savings or capital, and barriers to accessing health care and nutritional food, it ends up creating wealth gradients of, for example, metabolic syndrome and Type II diabetes. Last year, the best predictor of mortality in COVID-19 was diabetes. A good proportion of the differential mortality for low-income folks along racial lines is downstream of this economic gradient of chronic disease.</p><p><b>How hard is it to bring about egalitarianism?</b></p><p>While the space for egalitarianism to arise is substantial, it’s much smaller than the space where it can’t arise, because it’s rare in nature, probably in the universe, to have really high benefits of cooperation. It takes special circumstances. Humans happen to be super cooperative, and that puts us more squarely in that space more often.</p><p><b>It requires cultural evolution, right?</b></p><p>Yes. It’s going to manifest as a culture of humility or a culture of resistance, a culture of calling out the rulers for their injustices. We see that through all of history. Now we’re able to start to use mathematics to understand it in a more analytical way, but it’s a very old idea. I go back and forth between feeling like, “This is happening all around us,” versus, “This happens once in a blue moon.” It’s kind of how politically pessimistic or optimistic I’m feeling.</p><p><b>How are you feeling now?</b></p><p>I feel hopeless at the macro level. But still I feel like there’s untapped creative potential in determining the nature of our own society. Everything in this model works because of social action, because one strategy imposes constraints on the whole rest of the society, and then the society changes. We see radical, enormous shifts in social norms and institutions through history. I know that we haven’t explored all of the possibility space yet. If we could tap that potential, and we could make egalitarianism essentially truly a self-perpetuating cultural unit that also preserves itself, then it’ll stay around. It’ll be a new kind of society. The math points to those possibilities, so I’m not entirely pessimistic. There’s amazing untapped potential that comes down to face-to-face relationships that endure over time.</p><p></p><p><i>Brian Gallagher is an associate editor at</i> Nautilus. <i>Follow him on Twitter <a href=\"https://twitter.com/bsgallagher\">@bsgallagher.</a></i></p><p><i>Lead image: Hyejin Kang / Shutterstock</i></p><p><i>* This article originally stated that Paul Hooper currently serves as the Santa Fe Institute’s director of education. He used to have this position, in 2018. He no longer does. We regret the error.</i></p><br><a href=\"http://nautil.us/issue/104/harmony/the-math-that-says-egalitarianism-is-possible?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication\">Read More…</a>"
}