{
  "title":"Nature’s Antifreeze - Issue 104: Harmony",
  "date":"2021-08-11T13:00:00.000000-07:00",
  "author":null,
  "id":"http://nautil.us/issue/104/harmony/natures-antifreeze?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "link":"http://nautil.us/issue/104/harmony/natures-antifreeze?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "content":"<img src=\"http://static.nautil.us/18656_bf0c0d36a5a3f240ccbc590fca184a7f.png\"><br><p>The idea of cryogenically freezing a person to preserve their body until many years into the future has long been a staple of science-fiction stories. However, the need to reliably store biological materials such as cells or tissue is a common concern for scientific research and, increasingly, for society too.</p><p>Whether it’s the dark, suffocating deep sea or the scalding, bubbling thermal pools, life finds a way to call it home. So, it isn’t a surprise that fish living in the freezing cold waters of the Arctic and Antarctic could provide the inspiration for a new generation of cryoprotectant molecules.</p><p>The fish, and other cold-temperature extremophiles, produce proteins that can recognize and bind to ice as it is forming, acting like an anti-freeze. Ice crystals can do a lot of damage to the body, from causing proteins to clump together to weakening the structures that hold tissue together.</p><p>It opens up new options. Our cultural imagery of frozenness is about to change.</p> <p>This led Matthew Gibson, a professor of chemistry at Warwick University in the United Kingdom, to attempt to recreate the abilities of ice-binding proteins using synthetic polymers. These have the advantage of being easier to adjust or “tune” to suit their purpose and to manufacture at scale.</p><p>“We can make it a bit more tunable, as you’ve got literally thousands of different monomers you could use to make a polymer,” Gibson says. “Our aim, if we can mimic some of those properties, is to apply these to improve or change how we freeze cells.”</p><p>Through a project called<a href=\"https://cordis.europa.eu/project/id/789182\"> Cryostem</a>, Gibson tested these polymers by adding them to samples of bone marrow stem cells, which are often frozen when being transported for a transplant. The current system involves adding solvents to protect the cells when freezing. However, it isn’t ideal. A significant proportion of the cells do not survive and the solvent itself can affect them.</p><p>Gibson has been able to show that his<a href=\"https://pubs.acs.org/doi/10.1021/acsabm.0c00638\"> polymers can decrease the amount of solvent</a> needed for cryopreservation, reducing the damage done to the cells. This approach could also help biomedical research, allowing scientists to reliably store and thaw a wider range of cells in the laboratory.</p><p>He is now expanding this work through another project,<a href=\"https://cordis.europa.eu/project/id/866056\"> Ice Pack</a>, to apply cryoprotectant polymers to the growing field of biologic treatments. Traditional pharmaceuticals are typically small molecules that can be put into a tablet form and will be stable in the medicine cabinet for months. Now, more and more of the modern best-selling drugs are proteins, such as antibodies to treat arthritis or cancer, which need to be stored much more carefully.</p><p>More delicate still are cell-based therapies like CAR T cells, which are modified immune cells used to treat cancer. Now, cell-based therapies are rare and expensive, but in the future, they may become more common. “They have quite a complex process, where they’re collected from the donor and then they need modifying, freezing, and shipping,” Gibson says. “Anything you can do to make sure they’re protected as best as they can, or make the cold chain easier, is going to have a big effect on patient outcome.”</p><p>Zoom out from individual proteins or cells and the picture becomes even more complicated. “Ice can form inside and outside the cell,” explains Ilja Voets, a chemical engineer at Eindhoven University of Technology in the Netherlands. “Depending on where the ice forms, it is disruptive to cellular structures or extra-cellular structures; for example, the extra-cellular matrix in which the cells are embedded.”</p><p>Freezing a person to preserve their body has long been a staple of science-fiction stories.</p> <p>The challenge of freezing samples of tissue is another area where analogues of ice-binding proteins could help. Working with the<a href=\"https://cordis.europa.eu/project/id/101001965\"> Protect</a> project, Voets is particularly interested in the freezing and thawing of heart cells and tissue. Currently, only about half of the cells are usable after freezing when studying cultures in the laboratory. This becomes even more difficult when studying tissue samples.</p><p>Typically, in heart cells, Voets explains, “the preservation conditions are optimal for one cell type, but not for the other types, or not for the tissue as a whole.” It is a big challenge but the ice-binding protein analogues don’t have to preserve the tissue perfectly to be useful. “There’s a very strong regenerative ability of tissues. So in some cases, if the damage is modest, then the tissue can repair itself and it can still be used.”</p><p>Voets is using high-resolution microscopy to understand how different types of ice-binding protein analogues are able to prevent ice formation. This will help to create improved versions that can reduce freeze injury to tissue. The potential to reliably bank your own tissue samples, to be thawed if needed in the future, is “one of the ultimate dreams,” Voets says.</p><p>“Say someone has an infarct [a region of dead cells]. You will be able to transplant heart tissue from that very specific patient because you have banked it. That’ll be fantastic, and it could lower the risk of rejection as well. There’s a lot of things that we could gain from being able to bank more types of cells and tissues.”</p><p>Advances in cryopreservation are already making an impact on society. Some companies offer egg-freezing services as a perk to employees who want to delay having a child. This essentially defers the decision-making of how to align the competing needs of professional advancement and childcare, says Thomas Lemke, a professor of sociology, who focuses on biotechnology, at Goethe University in Germany. “This is what is often called a technological fix for a societal problem,” he says.</p><p>This technological fix places further burden on the individual to adapt so that society doesn’t need to change. Lemke says there is a real danger that it could become a societal expectation. Cryopreservation could become the ultimate insurance policy. Private companies already offer banking for umbilical cord blood, which is rich in stem cells. Perhaps in the future, we will also be able to bank heart tissue.</p><p>Lemke is studying the societal impacts of this “suspended life,” as he calls it, through the research project,<a href=\"https://cordis.europa.eu/project/id/788196\"> Cryosocieties</a>. He is examining how cryopreservation practices have developed and how they influence our decision-making. Whereas societies have often associated coldness with death, cryopreservation creates new opportunities from medical care to biodiversity.</p><p>“It’s no longer the state of non-transformation, of remaining inert. But rather, it mobilizes things and opens up options,” Lemke says. “Our cultural imagery of frozenness is about to change.”</p><p></p><p><i>Ian Le Guillou is a freelance science writer based in Paris, France. This article was originally published in</i> <a href=\"https://ec.europa.eu/research-and-innovation/en/horizon-magazine/antifreeze-fish-inspire-new-cryoprotectants-human-cells-and-tissues\">Horizon<i>, the EU Research and Innovation magazine</i></a><i>.</i></p><p><i>Lead image: marinat197 / Shutterstock</i></p><br><a href=\"http://nautil.us/issue/104/harmony/natures-antifreeze?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication\">Read More…</a>"
}