{
  "title":"What’s Fueling Today’s Extreme Fires - Issue 104: Harmony",
  "date":"2021-08-04T13:00:00.000000-07:00",
  "author":null,
  "id":"http://nautil.us/issue/104/harmony/whats-fueling-todays-extreme-fires?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "link":"http://nautil.us/issue/104/harmony/whats-fueling-todays-extreme-fires?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "content":"<img src=\"http://static.nautil.us/18636_54821d182370046edc3fa2d37a254cdc.png\"><br><p>As I write this at the end of July, 79 wildfires are burning across 12 states in the U.S. In Oregon, a mammoth fire has engulfed some 400,000 acres—an area half the size of Rhode Island—and destroyed hundreds of buildings and vehicles, including more than 160 homes. Smoke from wildfires in the western half of the continent has darkened skies over cities in the east, including Toronto, where I am. People in Boston, New York, and Washington D.C. are struggling with hazy, smoke-filled skies.</p><p>The recent rash of news stories about wildfires has implied wildfires are getting more frequent and burning more intensely, fueled by climate change. Janice Coen is a project scientist at the<a href=\"https://staff.ucar.edu/users/janicec\"> National Center for Atmospheric Research</a> in Boulder, Colorado. She has devoted her career to studying wildfires and the complex relationships among those fires, weather systems, and the atmosphere. She uses infrared imagery and computer models to try to predict where such fires will ignite and how they evolve over time, and the connections between wildfires and climate.</p><strong>FIRE FIGHTERS:</strong> Scientists who analyze fires constitute a “very strange field,” says Janice Coen. “In atmospheric science, a lot of us have similar backgrounds. But a lot of people are foresters, and that’s not physics, it’s ecology. They see the world and try to look for cause and effect, and it kind of confuses them when you talk about computational fluid dynamics models. I get a call every week from somebody modeling fires with machine learning. There’s so many things coming together.”Courtesy of Janice Coen<p>In an interview over Zoom, Coen tells me climate change plays a significant role in wildfires. However, she says, “It’s not as obvious as ‘the world’s getting hotter’ or ‘the world’s getting drier.’” The geophysics of wildfires is complex, but Coen relishes the challenge of explaining them. She says her research center is “trying to teach me to give the media soundbites of 30 seconds.” But, she adds with a laugh, her answers “are more like Thanksgiving dinners!”</p><p>And nourishing ones at that. As we discuss “fire whirls,” how fires create their own weather system, prescribed burns, and our warming world, Coen brings the science alive with authority and clarity.</p><p></p><p><b>Are wildfires becoming more extreme or frequent? Or both?</b></p><p>There’s a lot of year-to-year variability. Some years have been above average in terms of area burned, while others have been lower. We generally don’t report on that, right? It’s not a headline story. But trends can last for several decades at a time. It’s important to remember that even if you were to look at average global temperature, it could go up for 50 years, and that doesn’t mean humans are influencing the climate. Or could stay the same for 50 years, and that doesn’t mean we’re not. There’s a lot of natural variability, and humans are adding to that.</p><p><b>At the very least, it often seems like the world is burning.</b></p><p>Pretty much all of us who haven’t yet retired have only lived in this period where temperatures overall are warming. That does have an overall effect on wildfires, though the effect on individual fires can be different. For example, we’ve seen the jet stream shifting north, so there’s a dynamic effect. California has been seeing more Diablo winds, Santa Ana winds. That’s when you have a high pressure in the Great Basin over Nevada, pushing air down offshore, creating these strong winds over the Sierras and the coastal ranges. But as the jet stream shifts north, the predictions are we won’t see as many of them in the future. Also, when we talk about wildfires, it’s very much a<a href=\"https://en.wikipedia.org/wiki/Power_law\"> power law distribution</a>. Only a few percent of ignitions ever get above 100 hectares, and those few fires account for more than 85 percent of the area burned. So we’re really talking about a few extreme events.</p><p>Winds spreading a fire are entirely generated by the fire. We’ve measured them at 100 mph.</p> <p><b>Do we know what’s triggering these extreme events?</b></p><p>They tend to fall on one end of that spectrum, either from wind-driven events where there are strong winds pushing the fire downslope, or the other end of the spectrum, where it’s hot and dry, but the winds are weak and perhaps blowing onshore. If you get an ignition at a fortuitous place, like at the base of a canyon, it can start to burn and release energy, creating a plume of rising, buoyant air above it, that draws air into its space, fanning the flames and pushing the fire forward, creating a stronger plume. This internal dynamic feedback loop can make the fire run very quickly uphill. So those tend to be the two extremes.</p><p>When we look at these extreme events, they’re often—I hate the term—“a perfect storm” of underlying susceptibility to fire. That could be a persistent dry period, with a locally appropriate weather pattern that could spread fires. Last year, the entire Southwest had a high vapor pressure deficit, and then a fortuitous ignition. In the northeast corner of California, fires are often driven by the outflow from thunderstorms.</p><p>But when we look in the weather history, we can identify what these patterns are. They have similar features in Colorado, where I live. Our big events historically have been when we have an unseasonal downslope wind event, so we have winds coming from the northwest across the Rockies, and you get some interesting gravity wave dynamics that drive winds down the east slope at 90 to 100 miles per hour. We usually get them in November and December because of the weather patterns, but when we get them in July, that overlaps with fire season, when the fields are susceptible. And with an ignition, either from lightning or humans, we’ve got these catastrophic fires.</p><p><b>I recently read about the phenomenon “<a href=\"https://www.theweathernetwork.com/ca/videos/gallery/watch-pyrocumulonimbus-clouds-forming-in-these-incredible-timelapses-from-bc/sharevideo/6261715574001/forecasts\">pyrocumulonimbus</a>,” or “pyroCb.” What is that?</b></p><p>When a fire is burning through vegetation, it releases heat and water vapor—water in the form of a gas—into the air above it, and that makes it more buoyant than the air outside, so it rises and creates this “fire flow.” If that’s sufficiently moist and the fire is strong enough, it will lift it to the point where it expands and cools, causing the water vapor in the air to condense into a cloud over the fire. That’s a pyrocumulus.</p><p>If it’s a sufficiently strong fire, it can drive it deeper [upward] into the atmosphere, forming ice particles. It can even rise into the stratosphere, like some of the British Columbia fires in recent years, producing deep cumulus, way up past where jet airplanes fly, creating these smoke plumes that go up to where the air is moving very quickly toward the east. It has the potential to create plumes that produce smoke that descends somewhere on the East Coast.</p><p>Those are problematic in the long term because when you create this cloud and you produce particles, it can turn into precipitation, which fall and evaporate, creating a gust front, which can change the wind direction; the fire can suddenly turn toward the firefighters. Those have been associated with a number of fatalities, including the<a href=\"https://www.azcentral.com/story/news/local/arizona-wildfires/2019/06/30/yarnell-hill-fire-arizona-will-remember-19-firefighters-who-died/1563796001/\"> Yarnell Hill Fire</a> in Arizona in 2013.</p><p><b>What does it mean for a fire to create its own weather system?</b></p><p>Although this comes up when we’re discussing extreme weather, fire affects the atmosphere even with a simple, small grass fire. For example, if you start a fire from uniform fuels, in a straight line, with a uniform wind pushing it forward, it won’t go forward in a straight line, but instead it’ll bow into an elliptical shape. And that’s because of the nature of convection; it’s more comfortable if it collapses to a column than if it rises in a line. So it’s a really basic aspect of fire behavior.</p><p>But that term also comes up when we’re talking about more extreme events, where the wind is pushing the plume faster than the fire can keep up. In these big plume-driven events, we’ve measured winds at over 100 miles per hour, within the fire. The winds spreading the fire are entirely generated by the fire. We call them “fire-induced winds.” And those can be ten times stronger, or more, than the winds in the fire’s environment. They can rip trees out of the ground; they can snap large trees.</p><p><b>Tell us about “fire tornadoes” or firenados.”</b></p><p>They’re also called “<a href=\"https://www.youtube.com/watch?v=y4S-C4HMHCs\">fire whirls</a>.” I’ve been able to model some of them, like one in the<a href=\"https://www.cnn.com/2018/08/04/us/carr-fire-week-wrap/index.html\"> Carr Fire</a> outside Redding, California, a few years ago. It was a giant fire whirl with winds over 100 miles per hour. It formed when winds that were coming from the west over the coastal range came down into Redding, which is at the top of the Sacramento Valley, and intersected with winds coming north up the valley, creating a shear zone where winds were coming from different directions. As the fire ran across it, the shear zone tilted that vorticity up into the vertical to create a long-lasting, very strong fire whirl, which spread for several minutes through town, causing immense destruction. So that would be another phenomenon that is created entirely by the winds generated by the fire.</p><p>There was such a persistent smoke plume that crops suffered because of the decrease in solar radiation.</p> <p><b>Can you predict where or when some of those exotic phenomena, like the fire-whirls, are likely to happen?</b></p><p>We’re able to predict many of these fire phenomena, like the fire whirls. Sometimes you get a pair of these rotating columns that tilt forward at the leading edge of the fire, and where those come together, they can accelerate the fire between them, or slow it down. When helicopters go over a ridge, sometimes they experience a sudden downdraft, where they drop 100 feet or so, which is very dangerous because they’re not very high to begin with. Those sudden descents are produced by the fire winds, and those we can capture in our models. It’s complicated, and it requires special expertise, but it is possible to do all these amazing things—predict changes in wind direction and how events will unfold. I think within the next 10 years, we ought to be able to predict where fire whirls are likely to form.</p><p><b>Let’s get back to the connection between these extreme wildfire events and global climate change. What else can you say about that?</b></p><p>Whenever there’s a giant fire, people either say, “Oh, it was fuel accumulation,” or, “Oh, it was climate change.” But it’s this alignment of factors, some of which change over much slower periods than others. When we take it apart and look at those slower-changing factors, we see certain aspects are affected by climate, like canopy moisture: Tree canopies are affected by slow-changing things like drought and insects; seasonal changes. There are certain fires which they can affect, and others where they would have a minimal impact. Attributing fire behavior to climate varies a lot from fire to fire.</p><p>We have to look at how weather patterns are changing over time. When my colleague [Andreas Prein] looked at the historical record of downslope wind events, he found an increase over the past 50 years. That means if you’re in Vancouver or Washington or Oregon, you might see more of those downslope wind events. And if that overlaps with a dry period—we also have to think about weather, particularly the dryness— if those summers extend longer into the fall and overlap these wind events, then we might see more extreme fires, like we saw last year in Oregon and Washington. It’s really complicated how these different scales come together and produce extreme fires in different areas. It’s not as obvious as “the world’s getting hotter” or “the world’s getting drier.”</p><p>Near a fire whirl, helicopters experience a sudden downdraft, where they drop 100 feet or so.</p> <p><b>I’ve also read there can be cooling that occurs when smoke from the fire starts to block out sunlight. Is that significant?</b></p><p>Yes. The smoke from the fires can trail out for very long distances. I remember during the<a href=\"https://www.fs.fed.us/rm/pubs/rmrs_gtr114.pdf\"> Hayman Fire</a> [in Colorado] in 2002, we had a very deep smoke plume that went up into the atmosphere, one of those generated by a wind event, so there were strong winds drawing the smoke plume across eastern Colorado. And under the smoke plume, the temperature had gone down 10 degrees Fahrenheit, so it was much cooler under it; and that, no doubt, affected the weather. So it can become a dominant regional weather factor.</p><p>During the<a href=\"https://www.cbc.ca/news/canada/british-columbia/state-emergency-bc-wildfires-1.4803546\"> 2018 wildfires in British Columbia</a>, there was such a persistent smoke plume that people claimed to have detected a reduction in crop generation under it, because of the decrease in solar radiation. So persistent deep fires have the potential to create regional climate disturbances that affect not only your weather, but also the food you eat.</p><p><b>How important are prescribed fires—fires set intentionally, in a controlled manner—as a strategy for mitigating the potential damage from wildfires?</b></p><p>Prescribed fires are used to reduce fuel in ecosystems where fire is a natural disturbance, and it’s a good thing. We need to learn to look out the window and see a smoke plume and say, “That’s a good fire; it’s doing good things for the landscape.” Certain fires we don’t like because they impact our cities, and our communities, and the wildlands. But many of these fires serve a good purpose. But there are risks associated with them. Here in Colorado, we had a prescribed fire that escaped control. That’s not unusual, but it killed people, and that sets back the use of that tool, making land managers resort to other tools that are perhaps more clumsy and less effective, like mechanical thinning.</p><p>People want to use it more, but I think it’s overstated as a solution. The 2018 Camp Fire in Paradise, California, was the most destructive fire in having killed at least 85 people. In that case, the fire was re-running through previous fire scars because local weather patterns had made it a really windy spot. The Camp Fire, in its early period, ran through mostly grass. That was a previous fire scar. So we can’t attribute every catastrophic fire to not having done a lot of thinning.</p><p><b>As a scientist, you want to learn as much as you can about these complex systems; but obviously there’s also work for the policymakers and politicians. What sort of interplay between scientists and policymakers should be happening to mitigate the harm caused by these fires?</b></p><p>In our federal government, there are a variety of agencies that have a stake in it, but no one really controls fire. There’s been a lot of activity in the private sector in terms of bringing new tools and trying new things. But now we’re drowning in new tools, each of which has promised to be innovative and solve the fire problem. There’s a lot of money flying around, and it’s a very interesting, chaotic time. It seems to me it’s obviously a weather problem and a physics problem—but a lot of the policies are made using antiquated models. With the tools we have, we should be able to make better predictions about, for example, prescribed fires. Many people will say the problem isn’t a lack of technology, but that it comes down to other factors, like policy and regulation. And the culture of politics is much more challenging than the technology.</p><p></p><p><i>Dan Falk (@danfalk) is a science journalist based in Toronto. His books include </i>The Science of Shakespeare <i>and</i> In Search of Time.</p><p><i>Lead image: stockpexel / Shutterstock</i></p><br><a href=\"http://nautil.us/issue/104/harmony/whats-fueling-todays-extreme-fires?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication\">Read More…</a>"
}