{
  "title":"The Beauty of Crossed Brain Wires - Issue 104: Harmony",
  "date":"2021-08-18T13:00:00.000000-07:00",
  "author":null,
  "id":"http://nautil.us/issue/104/harmony/the-beauty-of-crossed-brain-wires?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "link":"http://nautil.us/issue/104/harmony/the-beauty-of-crossed-brain-wires?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "content":"<img src=\"http://static.nautil.us/17320_e98f2cd4e9f56a133abed423adb51d83.png\"><br><p>When I was about 6, my mind did something wondrous, although it felt perfectly natural at the time. When I encountered the name of any day of the week, I automatically associated it with a color or a pattern, always the same one, as if the word embodied the shade. Sunday was dark maroon, Wednesday a sunshiny golden yellow, and Friday a deep green. Saturday was interestingly different. That day evoked in my mind’s eye a pattern of shifting and overlapping circular forms in shades of silver and gray, like bubbles in a glass of sparkling water.</p><p>Without knowing it, I was living the unusual mental state called synesthesia, aptly described by synesthesia researcher Julia Simner as a “condition in which ordinary activities trigger extraordinary experiences.” More exactly, it is a neurological event where excitation of one of the five senses arouses a simultaneous reaction in another sense or senses (the Greek roots for “synesthesia,” also spelled “synaesthesia,” translate as “joined perception”). Some 4 percent of the population experiences this kind of cross-sensory linking, and studies have shown it’s more prevalent in creative people. Artists who’ve reported extraordinary experiences of synesthesia range from 19th-century composer Nikolai Rimsky-Korsakov to contemporary artist David Hockney to pop music star Lady Gaga.</p><strong>BORN THIS WAY:</strong> Lady Gaga (above) has said she “hears music all at once and in lots of colors.” Musicians including Jean Sibelius and Duke Ellington have said they’ve experienced synesthesia, which shows up often in creative people, researchers have found.FashionStock.com / Shutterstock<p>For me, the words “Sunday,” “Monday,” and so on, generated internal visions of color and pattern. Most synesthetic reactions also involve color in response to lexical stimuli—words written or spoken (“word-color” synesthesia), and letters, numbers, and symbols (“grapheme-color” synesthesia)—or to music and sound (“colored-hearing” synesthesia). Researchers have also observed dozens of other types of stimulus-reaction combinations: taste evoking a visual image, such as the flavor of chicken producing a 3-D shape; physical touch inducing the sensation of smell; and somehow the most extraordinary pairing, words generating the sensation of taste, such as “jail” creating the flavor of bacon.</p><p>At one time, strange pairings like these were little understood and even feared as signs of pathology. Now we know more, but many questions remain and synesthesia still carries an exotic aura. At the same time, it is a new tool to explore the human brain and mind, creativity, and consciousness.</p><p></p><p>Reports of sensory cross-connections go far back. In 1690, the English philosopher John Locke wrote of a blind man who associated the sound of a trumpet with the color scarlet, although it is unclear if this was synesthesia or a metaphor, a recurring issue in synesthesia research. In 1812, however, a German physician wrote a definitive description of seeing colored letters. Other physicians reported similar experiences in patients and the reports drew attention from scientists, clinicians, and artists. French poets Arthur Rimbaud and Charles Baudelaire extolled the romantic idea that the senses should intermingle.</p><p>But 19th-century scientific and clinical understanding was limited, and synesthetes were often reluctant to come out of the closet for fear of appearing “odd” or worse. Some synesthetes were diagnosed with conditions such as schizophrenia when their cross-sensory effects were taken as delusions or hallucinations. Or clinicians denied that synesthesia existed, interpreting patient’s statements like this “music looks red” as over-enthusiastic metaphor.</p><p>“When I see equations, I see the letters in colors,” Richard Feynman said.</p> <p>Fortunately the scientific study of synesthesia grew from the late 19th century into the 20th, mainly using interviews and group surveys. In 1895, psychologist Mary Whiton Calkins at Wellesley College analyzed her students’ self-reported responses about synesthetic manifestations and speculated about their causes. But like every other scientist at the time, she had no way to probe the phenomenon at a deep neural level. Nevertheless, research continued and led to several international conferences on the subject in the 1930s.</p><p>But by then, research had diminished. One problem was the difficulty of tracking the many forms of synesthesia. Another is the same reason that human consciousness is hard to study—the synesthetic experience is internal and subjective. It’s problematic to analyze a neural event when the only evidence is the subject’s personal account. The entire field of psychology recognized this in that same era when it turned away from studying internal experiences.</p><p>In the 1980s, however, new approaches made synesthesia amenable to more rigorous and objective study and research has blossomed, with about 1,000 new publications since 2000. One big step has been the acceptance of a consensus definition of synesthesia. Its key features are that a subject involuntarily experiences vivid responses to stimuli that combine two or more different sensory modalities, and that the responses are constant over time; for instance, a given word always induces the same color in a particular subject (the colors themselves are unique to each person). The psychologist Simon Baron-Cohen and colleagues introduced this last benchmark in 1987 as an objectively measurable standard of genuineness. True synesthetes give the same responses to the same stimuli when tested and retested over long time intervals. Childhood synesthesia generally continues into adulthood, though not always. I lost my automatic color associations by the time I was 12. Today I can only remember the colors. (You can check yourself <a href=\"https://www.synesthete.org/\">online</a> for evidence of synesthesia.)</p><p>Besides these tests, new neuroimaging techniques have established synesthesia as a real neurological process. One widely used method is functional magnetic resonance imaging (fMRI) of the brain. Unlike regular MRI, which shows the anatomy of the brain (or other internal organs), fMRI identifies which parts of the brain are active, nearly in real time. Since 2002, some fMRI investigations of grapheme-color synesthesia—the most widely studied kind—have shown that graphemes stimulate the V4 region of the brain. This area deals specifically with color within the visual cortex, the part of the brain that processes what the eyes see (the auditory cortex and other specialized areas handle the remaining senses). This is consistent with a model where the regions of the brain that analyze graphemes and that deal with color are somehow hyper-connected to create a synesthetic event. But not all fMRI data show the same result, nor is it clear if it is the visual perception of a grapheme or its conceptual meaning that is the trigger.1</p><p>Remarkably, even with advanced methods, other basic questions have lingered since the 19th century. How prevalent is synesthesia in the general populace? Different studies had given values from over 20 percent to less than 1 percent, a disparity partly due to the use of self-reported data. To remedy this, in 2006 Simner, then at the University of Edinburgh, and her colleagues carried out a controlled approach. They interviewed nearly 1,700 subjects and tested them for consistency over time. The certified synesthetes constituted 4.4 percent of the group, 1 for every 23 people—rare, but not vanishingly so. The data also showed that the most common subvariant is the one I experienced: colored days of the week.</p><p></p><p>Surveys and tests illuminate possible connections between synesthesia and artistic or creative ability. Catherine Mulvenna at University College London, who has written about this elusive connection, asks, Is synesthesia “a driving force or a mere idiosyncratic quirk” in artists? As Mulvenna points out, one connection of synesthesia with creativity is personal testimony from creative people. This often comes across as compelling evidence of true synesthesia. Vladimir Nabokov wrote in his autobiography <i>Speak, Memory</i> of his “colored hearing,” in which the letters x and k are respectively a steely blue and a huckleberry blue. Richard Feynman has related, “When I see equations, I see the letters in colors … light-tan j’s, slightly violet-bluish n’s, and dark brown x’s flying around.” Hockney sees colors when he hears music, which he uses when he does stage design for ballets and operas.</p><p>Many people with musical talent give detailed accounts of how music makes colors for them. Besides Rimsky-Korsakov, Jean Sibelius feared mockery for revealing his synesthesia, as did violinist Itzhak Perlman. In the worlds of jazz and popular music, Duke Ellington sensed both colors and textures from music, seeing dark blue burlap or light blue satin for specific notes played by certain musicians; the late jazz pianist Marian McPartland saw the key of D as daffodil yellow and B major as maroon; and Lady Gaga said in an interview, “I do hear music all at once and in lots of colors. It’s like a painting.”</p><p>Synesthetes were diagnosed as schizophrenics and suffering from delusions.</p> <p>Research supports these accounts. Self-reported synesthetes appear at a relatively high rate among artistic types, and one study using objective testing found 7 percent synesthetes among 99 art students compared to 2 percent in a control group. There is also evidence of associations between synesthesia and elements of creativity, but one stumbling block is the lack of a satisfactory definition of creativity. As Mulvenna writes, “Creativity is a complex construct to define, almost to the point of infamy within fields of systematic investigation.”</p><p>Nevertheless, researchers have uncovered suggestive correlations between synesthesia and creativity, at least as defined by psychological testing. In 2016, Charlotte Chun and Jean-Michel Hupe at the University of Toulouse, compared a selected group of 29 artistic synesthetes to 36 controls. Testing for aspects of creativity and related abilities such as mental imagery showed higher scores for the synesthetes, but with smaller differences than in earlier studies. These outcomes and other research results point to qualities that synesthetes consistently display, which may explain their creative tendencies: cognitive traits such as a disposition to think in images and sensitivity to color; and the psychological personality trait called “openness to experience,” exemplified by intellectual curiosity and an active imagination.</p><p></p><p>Examining the synesthesia-creativity link is an important long-term effort, but there is a deeper question for synesthesia itself: What are its roots? In 2018, neuroscientists Simon Fisher and Amanda Tilot at the Max Planck Institute for Psycholinguistics, Nijmegen, the Netherlands, and colleagues published genetic data for synesthetes from three unrelated families where the condition is prevalent.2 Earlier work had not found individual genes that are responsible for synesthesia, but the new researchers cast a wide net. They obtained DNA from four to five synesthetes and at least one nonsynesthete from each family, spread over generations. All the synesthetes displayed the colored-hearing variant called “sound-color.”</p><p>Using gene sequencing, the researchers identified 37 genes that indicate a tendency toward synesthesia. No single gene was seen in all three families, confirming that the inheritance of synesthesia is not tied to just one gene or group of them. But 6 of the 37 genes were linked to the development of axons, the long thin part of a neuron that communicates with other brain neurons through electrical impulses. Equally intriguing, the six genes are also linked to the early childhood development of the visual and auditory cortices, and the parietal cortex, the “association area” of the brain that integrates information across sensory modes for effective overall functioning.</p><p>Synesthesia researchers have entered the final frontier of brain studies: consciousness.</p> <p>Since then, Fisher and Tilot have extended their new genetic understanding to study links between synesthesia and other neural conditions.3 The genetic results and these overlaps are important because, as Fisher told me in an email, they “give us insights into shared neurobiological mechanisms … increasing our understanding of how synesthesia develops.” The genetic links to the development of the sensory cortices of the brain, along with fMRI brain scanning results, seem to support a theory based on hyper-connectivity among brain regions as a basis for synesthesia. More complete genetic data may also ultimately show why the synesthesia genes have survived the evolutionary process, perhaps because they offer adaptive advantages such as seeding creativity.</p><p>Synesthesia researchers have now entered the final frontier of brain studies: consciousness. They believe a new understanding of synesthesia can help solve the hard problem of how subjective experience can arise from the physical brain. Myrto Mylopoulos, a philosopher of mind at Carleton University in Canada, and Tony Ro, a neuroscientist at the City University of New York, have written that synesthesia research can broadly test theories of consciousness because the varied forms of synesthesia involve all the senses and cognitive elements.4 The authors with other researchers believe that the empirical approach to finding or confirming a theory of consciousness is to examine its neural correlates, the objectively testable brain functions that must accompany subjective experiences.</p><p>Pursuing this idea, Mylopoulos and Ro considered how synesthesia can act as a test bed to choose among theories of consciousness, and examined prevalent candidates, none of which is as yet supported by much empirical evidence. “Higher order” theory assumes that conscious states are those that a person is aware of being in, which comes from another mental state operating at a higher level; but in “first-order” theory there is no need for a higher state because even a perceptual state such as viewing a flower is considered to be a conscious state. Significantly, these differences produce characteristic neural correlates operating in different parts of the brain for each theory. The authors conclude that the scope of synesthetic events spread over the brain and its functions can yield “initial clues as to the neural correlates of conscious perceptual experiences more generally,” and help guide researchers toward a valid theory of consciousness.</p><p>As for me, I miss seeing the vivid colors of the days of the week that once enriched my internal vision. The colors now exist only in memory. But I would like to believe that synesthesia’s link to creativity has enlarged my own mind, especially in my career-long devotion as a scientist and writer to interdisciplinary work. Even under strict scientific study, and centuries after its first observations, synesthesia retains its power to make ordinary life both more marvelous and complex.</p><p></p><p><i>Sidney Perkowitz is Candler Professor of Physics Emeritus at Emory University. His latest books are</i> Physics: A Very Short Introduction <i>and</i> Real Scientists Don’t Wear Ties. <i>He is at work on a book about the use of science in the police and justice systems.</i></p><p></p><p><b>References</b></p><p>1. For a recent overview of synesthesia research, see Ward, J. &amp; Simner, J. Synesthesia: the current state of the field, in Sathian, K. &amp; Ramachandran, V.S. (Eds.) <i>Multisensory Perception: From Laboratory to Clinic</i> Academic Press, London, U.K. (2019).</p><p>2. Tilot, A.K., <i>et al.</i> Rare variants in axonogenesis genes connect three families with sound-color synesthesia. <i>Proceedings of the National Academy of Sciences</i> <b>115</b>, 3168–3173 (2018).</p><p>3. Tilot, A.K. <i>et al.</i> Investigating genetic links between grapheme–colour synaesthesia and neuropsychiatric traits. <i>Philosophical Transactions of the Royal Society B</i> <b>374</b>, 20190026 (2019). See also<a href=\"https://www.mpi.nl/page/join-our-synaesthesia-genetics-research\"> https://www.mpi.nl/page/join-our-synaesthesia-genetics-research</a>.</p><p>4. Mylopoulos, M. &amp; Ro, T. Synesthesia and consciousness: exploring the connections, in Deroy, O. (Ed.) <i>Sensory Blending: On Synaesthesia &amp; Related Phenomena</i> Oxford University Press, Oxford, U.K. (2017).</p><p></p><p><i>Lead image: agsandrew / Shutterstock</i></p><p><i>This article first appeared online in our “Energy” issue in June, 2020.</i></p><br><a href=\"http://nautil.us/issue/104/harmony/the-beauty-of-crossed-brain-wires?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication\">Read More…</a>"
}