{
  "title":"Why Your Sleeping Brain Replays New Rewarding Experiences - Facts So Romantic",
  "date":"2021-08-06T06:15:00.000000-07:00",
  "author":null,
  "id":"http://nautil.us/blog/why-your-sleeping-brain-replays-new-rewarding-experiences?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "link":"http://nautil.us/blog/why-your-sleeping-brain-replays-new-rewarding-experiences?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "content":"<img src=\"http://static.nautil.us/18646_837d74cd0d4fbc51ead6d12738e01cba.jpg\"><br><p><i>It turned out that, yes, the participants’ brains revealed they were doing a kind of “neural replay” of the game they had been manipulated to win.</i>Illustration by Kateryna Kon / Shutterstock</p><p>During this Olympics, I’ve been rooting for Kelleigh Ryan, who is on the women’s foil team. She’s from Ottawa, where I live. Whenever she scored a point, she’d emit a victory scream, probably feeling a rush of pleasure. Watching her on television, I did, too.</p><p>Getting better at something involves emotion. When we do well, we have good feelings—pride, pleasure, excitement—and these emotions help reinforce whatever behaviors we just engaged in. Similarly, the pain of failure makes recent behaviors less likely in the future. This is conditioning, and we’ve all experienced it—when we’re awake. But what about when we sleep?</p><p>These rehearsals might not even be conscious!</p>\n<p>Sleep reinforces memories. We know this because after half an hour of sleep, people can remember things better than when they spend half an hour doing something else, like watching TV. Studies of rats <a href=\"https://www.nature.com/articles/nn1825\">show</a> that their brains rehearse running through mazes while they sleep, in a process known as sleep replay. Memory’s function is to store information that will be useful. Because of this, our mind prioritizes remembering some things over others. Studies have <a href=\"https://psycnet.apa.org/record/2010-14184-001\">shown</a>, for example, that it’s easier to remember things that are useful for survival. Might sleep similarly focus on things that are particularly good or bad for us, like food and dangerous animals, and ignore things that are irrelevant to our well-being, like the exact shape of a cloud?</p><p>A recent <a href=\"https://www.nature.com/articles/s41467-021-24357-5\">study</a> by the University of Geneva’s Virginie Sterpenich and colleagues tried to find out. They had subjects play two computer games, which were designed to be engaging and to use two very different brain areas. One game involved picking a target face out of a set of 18, and the other game involved navigating through a Duke Nukem-derived 3D maze. The face game players use areas of the brain specializing in recognizing faces—the fusiform and occipital face areas. The maze game players use the parahippocampal place areas, grey matter regions that compute scene recognition and memory. The subjects did both of these tasks while Sterpenich and her team scanned their brains using both an electroencephalogram (EEG), which measures electrical activity over time, and functional magnetic resonance imaging (fMRI), which provides information about what parts of the brain are active by measuring the amount of blood flow happening all over the brain. </p><p>What the subjects didn’t know is that the games were rigged. The players only won one of the games, but thought that their winning and losing was a result of their performance. If our brains are more likely to rehearse things they are rewarded for, then, when sleeping, they should rehearse the game they won more often than the game they lost. After the games were over, the participants went to sleep in a brain scanner. The researchers used an AI trained on the EEG and fMRI data to recognize which game was being played while awake, to decode the sleeping players’ brain scans and see if they were thinking about one game or the other during sleep. (Once the AI learns how to identify a task in somebody who is awake—when scientists know what task they’re doing—they can apply it to the brain activity observed during sleep and see which task the players’ brain scans most resembles.)</p><p>It turned out that, yes, the participants’ brains revealed they were doing a kind of “neural replay” of the game they had been manipulated to win. If you had been one of the players who won the face game, then you would have been more likely to have replayed the face game during sleep (compared to the maze game that you lost). The reward you felt after “winning” the face game made a neural replay of it more likely to arise in your sleep. Not only did the detector identify this, but the brain areas associated with the rewarded games (face or space areas) were preferentially active.</p><p>This suggests that our minds are rehearsing things during sleep and that they preferentially feature things that are good for us over experiences that don’t matter to us. Does this have anything to do with dreaming? Well, none of the participants entered rapid-eye movement (REM) sleep, which is when most dreams happen, during their time in the sleep lab. (REM tends to happen later in the night.) The neural replay happened only during slow-wave sleep, when dreams tend to be infrequent, dull, and go unremembered. The participants might not even have been aware of the rehearsal their brains were engaged in. These rehearsals might not even be conscious!</p><p>Other evidence <a href=\"https://www.cambridge.org/core/journals/behavioral-and-brain-sciences/article/abs/did-ancestral-humans-dream-for-their-lives/D31EF7CC5A54FF4567C8CFCBE8F1790E\">suggests</a> that dreaming during REM sleep tends to be more negative—bad dreams are more common than good ones. This leads to the interesting idea that positive experiences are rehearsed during non-REM sleep, and negative ones are rehearsed during REM sleep.</p><p>I can’t help but think that Keilleigh’s victory scream enhanced her pleasure at scoring her points. It’s interesting to think that it made her more likely to rehearse fencing that night, when her adrenaline calmed down and she was ready to sleep. She got beaten in the quarter final, by Larisa Korobeynikova, from Russia. She didn’t medal, but tonight her brain might be preparing for the next challenge.</p><p><i>Jim Davies is a professor at the Department of Cognitive Science at Carleton University. He is co-host of the award-winning podcast Minding the Brain. His new book is </i>Being the Person Your Dog Thinks You Are: The Science of a Better You<i>.</i></p><br><a href=\"http://nautil.us/blog/why-your-sleeping-brain-replays-new-rewarding-experiences?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication\">Read More…</a>"
}