{
  "title":" Electrons May Very Well Be Conscious - Facts So Romantic",
  "date":"2021-08-02T22:00:00.000000-07:00",
  "author":null,
  "id":"http://nautil.us/blog/-electrons-may-very-well-be-conscious?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "link":"http://nautil.us/blog/-electrons-may-very-well-be-conscious?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "content":"<img src=\"http://static.nautil.us/18034_061302bf5f62eaa1ff5b3ff03c19b13b.png\"><br><p><i>Panpsychists look at the many rungs on the complexity ladder of nature and see no obvious line between mind and no-mind.</i>Illustration by Yurchanka Siarhei / Shutterstock</p><p>Last year, the cover of <i>New Scientist</i> ran the headline, “Is the Universe Conscious?” Mathematician and physicist Johannes Kleiner, at the Munich Center for Mathematical Philosophy in Germany, told author Michael Brooks that a mathematically precise definition of consciousness could mean that the cosmos is suffused with subjective experience. “This could be the beginning of a scientific revolution,” Kleiner <a href=\"https://www.newscientist.com/article/mg24632800-900-is-the-universe-conscious-it-seems-impossible-until-you-do-the-maths/\">said</a>, referring to <a href=\"https://arxiv.org/abs/2002.07655\">research</a> he and others have been conducting. </p><p>Kleiner and his colleagues are focused on the Integrated Information Theory of consciousness, one of the more prominent theories of consciousness today. As Kleiner notes, IIT (as the theory is known) is thoroughly panpsychist because all integrated information has at least one bit of consciousness. </p><p>You might see the rise of panpsychism as part of a Copernican trend—the idea that we’re not special. The Earth is not the center of the universe. Humans are not a treasured creation, or even the pinnacle of evolution. So why should we think that creatures with brains, like us, are the sole bearers of consciousness? In fact, panpsychism has been around for thousands of years as one of various solutions to the <a href=\"http://nautil.us/issue/79/catalysts/where-is-my-mind\">mind-body problem</a>. David Skrbina’s 2007 book, <i>Panpsychism in the West</i>, provides an excellent history of this intellectual tradition.</p><p>Electrons may have some type of extremely rudimentary mind.</p> <p>While there are many versions of panpsychism, the version I find appealing is known as <i>constitutive panpsychism</i>. It states, to put it simply, that all matter has some associated mind or consciousness, and vice versa. Where there is mind there is matter and where there is matter there is mind. They go together. As modern panpsychists like Alfred North Whitehead, David Ray Griffin, Galen Strawson, and others have argued, all matter has some capacity for feeling, albeit highly rudimentary feeling in most configurations of matter. </p><p>Panpsychists look at the many rungs on the complexity ladder of nature and see no obvious line between mind and no-mind. Philosopher Thomas Nagel famously asked in 1974 what is it like to be a bat, to echolocate and fly? We can’t know with any certainty, but we can reasonably infer, based on observation of their complex behaviors and the close genetic kinship between all mammals and humans—and the fact that evolution proceeds incrementally—that bats have a rich inner life. By the same logic, we can look steadily at less-complex forms of behavior that allow us to reasonably infer some kind of mind associated with all types of matter. Yes, including even the lowly electron. </p><p>While inanimate matter doesn’t evolve like animate matter, inanimate matter does behave. It does things. It responds to forces. Electrons move in certain ways that differ under different experimental conditions. These types of behaviors have prompted respected physicists to suggest that electrons may have some type of extremely rudimentary mind. For example the late <a href=\"http://nautil.us/issue/43/heroes/my-life-with-the-physics-dream-team\">Freeman Dyson</a>, the well-known American physicist, stated in his 1979 book, <i>Disturbing the Universe</i>, that “the processes of human consciousness differ only in degree but not in kind from the processes of choice between quantum states which we call ‘chance’ when made by electrons.” Quantum chance is better framed as quantum choice—choice, not chance, at every level of nature. David Bohm, another well-known American physicist, argued similarly: “The ability of form to be active is the most characteristic feature of mind, and we have something that is mind-like already with the electron.”</p><p>Many biologists and philosophers have recognized that there is no hard line between animate and inanimate. J.B.S. Haldane, the eminent British biologist, supported the view that there is no clear demarcation line between what is alive and what is not: “We do not find obvious evidence of life or mind in so-called inert matter…; but if the scientific point of view is correct, we shall ultimately find them, at least in rudimentary form, all through the universe.”</p><p>Niels Bohr, the Danish physicist who was seminal in developing quantum theory, stated that the “very definitions of life and mechanics … are ultimately a matter of convenience…. [T]he question of a limitation of physics in biology would lose any meaning if, instead of distinguishing between living organisms and inanimate bodies, we extended the idea of life to all natural phenomena.”</p><p>More recently, University of Colorado astrobiologist Bruce Jakosky, who has worked with NASA in the search for extraterrestrial life, asked rhetorically: “Was there a distinct moment when Earth went from having no life to having life, as if a switch were flipped? The answer is ‘probably not.’”</p><p>Theoretical physicist Sabine Hossenfelder, author of the 2018 book <i>Lost in Math</i>, has taken a contrary position. “[I]f you want a particle to be conscious, your minimum expectation should be that the particle can change,” she argued in a post titled “<a href=\"http://nautil.us/blog/electrons-dont-think\">Electrons Don’t Think</a>.” “It’s hard to have an inner life with only one thought. But if electrons could have thoughts, we’d long have seen this in particle collisions because it would change the number of particles produced in collisions.” </p><p>Yet “change” means many different things, including position in space over time. What Dyson is getting at in his remark about electrons and quantum theory is that the probabilistic distribution-outcomes of quantum experiments (like the double-slit experiment) are better explained as the product, not of pure chance (another way of saying “we don’t know”), but of numerous highly rudimentary choices by each electron in each moment about where and how to manifest. </p><p>Whitehead’s <a href=\"https://www.utsc.utoronto.ca/~seager/whitehead.htm\">variety of panpsychism</a>, still the most worked-out version of panpsychism today, re-envisions the nature of matter in a fundamental way. For Whitehead, all actual entities, including electrons, atoms, and molecules, are “drops of experience” in that they enjoy at least a little bit of experience, a little bit of awareness. At first blush it’s a strange perspective but eventually makes a great deal of sense. </p><p>Rather than being unchanging things moving around in a container of space-time—the modern view in a nutshell—Whitehead conceives of particles like electrons as a chain of successive iterations of a single electron that bear a strong likeness to each other in each iteration, but are not identical to each other. Each iteration is a little different than the last. There is no static and unchanging electron. The degree to which each iteration is more or less different than the last iteration is the place for an iota of choice, and mind. This iota of choice compounds upwards and, through the course of biological evolution, results in the complex types of mind and choice that we humans and other mammals enjoy. </p><p>Whitehead, a mathematical philosopher, fleshed out in detail this process of “concrescence,” the oscillating nature of entities like electrons moment to moment, in his philosophical works <i>Science and the Modern World</i>, <i>Process and Reality</i>, and <i>Modes of Thought</i>. These are sometimes difficult works but are well worth the struggle to get through if you’re interested in basing physics on a more empirical metaphysical foundation.</p><p>Many modern thinkers have come to embrace Whitehead and panpsychism to varying degrees, including Bohm, whose <i>Wholeness and the Implicate Order</i>, his <i>magnum opus</i> on modern physics and the nature of reality, refers to Whitehead as an inspiration. </p><p>I am fleshing out in my work how we can turn these “merely” philosophical considerations about the nature of mind throughout nature into a testable set of experiments, with some early thoughts sketched <a href=\"https://blogs.scientificamerican.com/observations/wheres-my-consciousness-ometer/\">here</a>. Such experiments move debates about panpsychism out of the realm of philosophy and more firmly into the realm of science. </p><p>So, yes, there is plenty of room in modern physics for electrons to “think.” </p><p><i>Tam Hunt is a scholar and writer affiliated with the University of California, Santa Barbara. He is the author of the book </i><a href=\"https://www.amazon.com/Eco-Ego-Eros-Philosophy-Spirituality-ebook/dp/B00I1XCHKY/ref=sr_1_2?keywords=eco+ego+eros&amp;qid=1584222364&amp;sr=8-2\">Eco, Ego, Eros</a><i>, that explores panpsychism across various fields, and of the </i><a href=\"https://www.frontiersin.org/articles/10.3389/fnhum.2019.00378/full\">General Resonance Theory</a><i> of consciousness, which is panpsychist in orientation. He blogs at </i><a href=\"https://medium.com/@aramis720\">medium.com</a><i>. </i></p><p><i>This classic Facts So Romantic post was originally published in May 2020.</i></p><br><a href=\"http://nautil.us/blog/-electrons-may-very-well-be-conscious?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication\">Read More…</a>"
}