{
  "title":"The Economic Case for Vaccine Passports - Facts So Romantic",
  "date":"2021-08-17T11:15:00.000000-07:00",
  "author":null,
  "id":"http://nautil.us/blog/the-economic-case-for-vaccine-passports?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "link":"http://nautil.us/blog/the-economic-case-for-vaccine-passports?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "content":"<img src=\"http://static.nautil.us/18666_585b11f7affe2ed49f3076c6c6bc3d36.jpg\"><br><p><i>Requiring vaccine passports would not violate any individual rights that a well-ordered society would choose to defend.</i>Photograph by FrankHH / Shutterstock</p><p>The latest surge in COVID-19 cases in the United States has been called a pandemic of antivaxxers and conspiracy theorists. But it is more than that. </p><p>Children under 12, for example, are ineligible for vaccination, yet surprisingly susceptible to the Delta variant. Many immunocompromised adults also cannot be vaccinated, or remain highly vulnerable to infection even when fully vaccinated. And breakthrough cases among even the fully vaccinated have increased sharply with the spread of Delta.</p><p>These developments have spawned calls for vaccine passports—proof of vaccination for group gatherings in enclosed spaces. Many have denounced any such requirement as a violation of their rights, without specifying exactly what those rights are or explaining why society should enforce them.</p><p>Vaccine passports don’t raise novel or complex issues.</p> <p>People want to do what they want to do, which helps explain the popularity of slogans about individual rights and freedoms. But rights are costly to define and enforce, and having more liberty along some dimensions often means having less along others. It therefore behooves us to think carefully about which freedoms we value most highly and which rights are most worth defending. These choices are better guided by careful assessment of the relevant costs and benefits than by simple slogans about freedom.</p><p>Does requiring vaccine passports violate any individual rights that a well-functioning society would choose to defend? I will consider this question within a framework that is deeply hostile to regulation and therefore biased against the requirement—the framework outlined by the 19th-century British philosopher and political economist John Stuart Mill. Mill is rightly celebrated as one of history’s most eloquent champions of individual liberty. Among the very substantial proportion of the current U.S. population that remains open to rational deliberation, even the staunchest opponents of government regulation will be prepared to accept the legitimacy of any restriction that passes muster within Mill’s framework. My claim is that vaccine passports clearly meet that test.</p><p>In one of the most widely quoted passages from his 1859 treatise, <i>On Liberty</i>, Mill wrote, </p><p>…the sole end for which mankind are warranted, individually or collectively, in interfering with the liberty of action of any of their number, is self-protection. That the only purpose for which power can be rightfully exercised over any member of a civilized community, against his will, is to prevent harm to others. His own good, either physical or moral, is not sufficient warrant. </p><p>He cannot rightfully be compelled to do or forbear because it will be better for him to do so, because it will make him happier, because, in the opinion of others, to do so would be wise, or even right… The only part of the conduct of anyone, for which he is amenable to society, is that which concerns others. In the part which merely concerns himself, his independence is, of right, absolute. Over himself, over his own body and mind, the individual is sovereign.</p><p>Mill’s advocacy of his harm principle sprang from his respect for individual autonomy, from his belief that although we might often err, we ourselves are far better than others to chart the course of our own lives. But if Mill been writing as a 21st-century behavioral scientist, he might have embraced a less narrow interpretation of his harm principle. For as is now well documented, we are broadly aware that our own choices sometimes serve us poorly. Shortsightedness, for example, leads many to accept enormous future costs in return for trivial current benefits, choices that we later regret. The 60-year-old who is dying from a radiation-induced cancer may wish that it hadn’t been legal for his 20-year-old self to have accepted employment as a cleanup worker at a radiation spill. An appreciation of the strength and ubiquity of this present bias might have persuaded Mill that the 60-year-old self was in fact harmed by his very different 20-year-old self’s choice.</p><p>Fortunately, the question of whether Mill’s harm principle should apply to vaccine passports doesn’t require a judgment about whether such indirect paternalism is ever permissible. A passport requirement would clearly prevent contemporaneous harm to other people, not just later versions of ourselves. It would substantially reduce the frequency of COVID-19 transmission. It would protect others against serious illness, hospitalization, and death. It would prevent the health care system from being overwhelmed. It would accelerate the rate at which normal activity could resume. That vaccine passports would prevent enormous direct harm to others is simply beyond question.</p><p>Mill’s harm principle is a necessary, but not sufficient, condition for regulation. Showing that vaccine passports would prevent substantial harm to others does not prove that they should be required. After all, many actions cause significant harm to others, yet are permitted because available alternatives would cause even greater harm. </p><p>A case in point: The late advice columnist Ann Landers described a letter from a man who felt guilty about an act of cruelty he had committed decades earlier as a high school student. He and some friends called a classmate one evening to announce that she had been voted the ugliest girl in their senior class. The girl’s anguished cry as she hung up the phone had haunted the man ever since. The harm to the recipient of this call clearly outweighed whatever entertainment it afforded the callers, even neglecting their subsequent feelings of remorse. Yet the callers did not break any law or violate any regulation. That’s because the right to speak freely has enormous value, even though in some cases it causes far more harm than good. If we could craft speech laws that could discriminate perfectly between cases, we would. But we cannot. </p><p>With such concerns in mind, we should ask whether vaccine passports might entail negative consequences that could outweigh the obvious harms they would prevent. One obvious example is that vaccine passports would be certain to trigger the ire of those who see them as an infringement of their rights. But against those sentiments we would need to weigh the resentment kindled in others who would see that resumption of normal life has been impeded by antivaxxers. And since the second group is so much larger than the first (70 percent of all eligible Americans have now had at least one vaccine dose), the net effect of these opposing concerns would be to reinforce the case for vaccine passports.</p><p>We should also ask whether requiring vaccine passports would actually achieve the desired results. Counterfeiting is the most obvious concern. Businesses that currently demand proof of vaccination from customers or employees now rely on the small white cards people are given when they receive their shots. Accounts of online <a href=\"https://www.ama-assn.org/delivering-care/public-health/vaccine-passports-benefits-challenges-and-ethical-concerns\">auctions for forgeries</a> of these cards suggest that they may often be an unreliable indicator of vaccine status. </p><p>As international experience <a href=\"https://www.bbc.com/news/world-europe-56522408\">suggests</a>, however, this threat is easily parried. The European Union, for example, has introduced vaccine passports—available free of charge in either digital or not-easily-copied paper form—in all 27 member nations, as well as Switzerland, Iceland, Norway, and Liechtenstein. And earlier this year, Israel introduced a vaccine pass that greatly accelerated the reopening of that country’s economy.</p><p>In short, vaccine passports don’t raise novel or complex issues. The U.S. has a long history of requiring evidence of vaccination against childhood illnesses for attendance in public schools. This requirement was met by stiff opposition, to be sure, but here, too, its absence would have generated a far larger volume of resistance. More important, the requirement prevented many needless deaths and serious illnesses, and made possible the virtual elimination of many of the covered illnesses.</p><p>As President Biden appears aware, requiring vaccine passports would generate enormous political pushback. Showing that the requirement clearly satisfies John Stuart Mill’s harm principle will not spur Marjorie Taylor Greene and Rand Paul to lobby in favor of it. But the president’s obligation is to support policies that best serve the interests of all citizens, not just those who press ill-founded claims about individual freedom. Mill’s harm principle, the most freedom-respecting framework we have for thinking about the question, shows clearly that requiring vaccine passports would not violate any individual rights that a well-ordered society would choose to defend. </p><p>And because they would save many lives and speed our return to normal life, we should require them.</p><p><i>Robert H. Frank is a New York Times economics columnist and the author, most recently, of </i>Under the Influence: Putting Peer Pressure to Work<i>. Follow him on Twitter <a href=\"http://twitter.com/econnaturalist\">@econnaturalist</a>.</i></p><br><a href=\"http://nautil.us/blog/the-economic-case-for-vaccine-passports?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication\">Read More…</a>"
}