{
  "title":"Twilight of the Nautilus - Issue 104: Harmony",
  "date":"2021-08-11T13:00:00.000000-07:00",
  "author":null,
  "id":"http://nautil.us/issue/104/harmony/twilight-of-the-nautilus?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "link":"http://nautil.us/issue/104/harmony/twilight-of-the-nautilus?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "content":"<img src=\"http://static.nautil.us/18650_8286a932fdc96dc15d69fedad733e501.png\"><br><p>We were all very tired. My crew and I had been tracking nautiluses off tiny Ndrova Island in Papua New Guinea for close to a week. Every day we spent 16 hours on small dugout canoes and then got eight hours of fitful sleep on the deck of a Melanesian sea craft. Rice and fresh tuna for breakfast, lunch, or dinner. In the open boats, the sun, the wind, the rain, the dark, all seemed to merge. Time melted in fatigue.</p><p>A week before, we had fitted the nautiluses with acoustic transmitters that gave their position and depth. To track them, we had to stay within a kilometer as they bumped through a muddy habitat near the ocean bottom and climbed up the coral reefs lining the small islands here. We sat above them in small boats and canoes, dangling hydrophones over the side to pick up the faint acoustic signals.</p><strong>CAPTAIN NAUTILUS:</strong> Author Peter Ward holds an Allonautilus aboard an outrigger off Ndrova Island in Papua New Guinea. Ward has been tracking and studying the cephalopod for more than 40 years.Gregory Barord<p>It was 2015 and we were tracking the two different kinds of nautiliuses—Nautilus and its descendent, Allonautilus—found here and virtually nowhere else on Earth. Both varieties were going extinct from overfishing and changing ocean conditions. We wanted to know how they were managing to survive. Could they cross large bodies of water to find sufficient food?</p><p>In 1984, I had done this same kind of work, in exactly this place, but with inferior equipment. Now, 31 years later, my memory jangled. Major changes had occurred. Back then the water was blessedly cool as it rose up reef walls from deep ocean zones. To dive was to escape the heat of this place, a geographic hot spot athwart the equator. Now the rising water, deficient in oxygen and nutrients, was a warm death to the reefs it once sustained.</p><p>In less than a century, climate change has upended conditions that have sustained life in the Mesophotic Zone for millions of years.</p> <p>I was most struck by the absence of sharks. In 1984, we were repeatedly chased from the water. On one occasion, my dive buddy slammed his large camera against the head of an especially aggressive black tip as we scrambled over the transom and into our boat. Not so in 2015. We dived every day for two weeks. We never saw a single shark. Not even a tiny, white-tipped reef shark. I knew where they were. Or at least where their fins were. Hanging in the Thailand, Cambodia, Hong Kong, and mainland Chinese stores by the tens of thousands, waiting to become soup.</p><p>Our transmitters, miracles of miniature electronics that looked like AA batteries (albeit $1,000 each; pretty pricey for AA’s!), picked up the nautiluses as they swam above the bottom of the ocean. Each second, they sent us their position, their depth, and the temperature of the water they were in. They didn’t descend below 800 meters because at that depth the ocean pressure would cause their shells to implode. Our tracking showed they followed the ocean bottom contour toward shallower water, where there was more food, but also more danger. Their predators, sharks and large fish, are visual hunters, so the nautiluses were safer in the darker, deeper depths. At least they once were.</p><p>In 2015, our research brought me a revelation that my colleagues in marine biology and paleontology and I are still sorting out today. Although the nautilus doesn’t face as many predators, whose own hunter, humans, have reduced their numbers, the buoyant, deep-sea organism with the beautiful spiral shell faces a bigger problem. The water temperature in the ocean layer, defined as the Mesophotic Zone, through which the nautilus travels, is growing so warm that it’s destroying the life of all the organisms that thrive there.</p><p>“Canary in the coal mine” has become a hoary environmental saw. But it’s still a useful one. Canaries are more sensitive than humans to increases in carbon dioxide and methane, when combined with lowered oxygen. It was wise for early miners to use the birds to detect when gas accumulations in mines rose to levels that would kill them. The nautilus is the prototypical animal in the Mesophotic Zone. Its survival now foretells the fate of the oceans’ ecological health.</p><p></p><p>The Mesophotic Zone ranges from 100 meters to 500 meters deep, where light, when it penetrates to the bottom, is a dim twilight, even at noon. The animals in this twilight zone share many characteristics, but among the most important is slow growth, leading to extended adolescence, low fecundity once maturity is attained, and long lifespans.</p><p>Because light is so low, the animals, the bony fish, sharks, and many kinds of mobile invertebrates, largely eschew bright color displays. To find food they largely use chemoreception—like a dog hunting for that elusive kibble on a dark floor at night, they can pinpoint food by smell—rather than vision. They all live life in the slow lane, using techniques to jealously guard their energy, given food is often scarce. This is the case with nautilus and another bellwether species, the coelacanth. The coelacanth is a giant blue fish with lobe fins that are a “missing link” to the limbs of the first amphibians, and ultimately our limbs, making the coelacanths our own deep ancestors. But coelacanths still exist, at the depths and sometimes the same localities of nautiluses, true snapshots of bygone geological eras.</p><strong>FINDING NAUTILUS:</strong> In New Guinea, Peter Ward outfitted nautiluses with transmitters to follow the endangered animals as they bobbed through warming layers of the ocean in search of sufficient food.Peter Ward<p>The two animals have come down to us from impossibly long ago. Both first appeared in the fossil record in their present guises about 100 million years ago. (The very first nautiloids appeared 500 million years ago, and the first coelacanth-like fish almost 400 million years ago, based on well dated fossils of each.) Recent studies using oxygen isotopes of their skeletons, and technique that yields temperature of skeletal growth, reveal the nautilus and coelacanth first evolved when they were shallow-water species. But sometime around 60 million years ago, their species migrated down into the Mesophotic Zone, while the fossil record tells us that all those that stayed in the more flourishing shallows went extinct.</p><p>In deep water, both species can live for a very long time, at least a century. A key to their longevity is they evolved to live at extremely low metabolic rates. Nautiluses can bump across the ocean bottoms with almost no energetic effort, using their 90 tentacles to chemically search for that perhaps once-a-month windfall of a dead fish falling down the reef cliff onto their muddy habitat. But their genius is their buoyant shell. They expend virtually no energy in searching for food. Their body plan involves one of the greatest evolutionary trade-offs of all time. Swimming takes energy. Breathing takes energy. For the nautilus, the energy expended for swimming also allows for respiration. The coelacanth has perfected life in the slow lane in a different way. Almost uniquely among animals, their normal position is head down, tail up, perfectly vertical and still. So here we have a 100-million-year-old fish, bright blue, 6 feet long, standing on its head and rarely feeding, like a deep-water Zen master.</p><p>I was most struck by the absence of sharks. In 1984, we were repeatedly chased from the water. Not now.</p> <p>In the past, both species largely subsisted on the food from above, from animals that lived in shallow waters. Plankton and organic-rich sediments tumbled down the long stony walls of coral reefs. The greatest treasures were bodies of animals that sank to the bottom, to be fought over by the animals adapted to search for meat. Neither the nautilus nor coelacanth appear to be predators of live animals. They exploit a scavenging lifestyle instead, the great jackals of the sea.</p><p>Coral reefs are the palaces of the Mesophotic Zone. They thrum with life. Trying to count the number of different species visible on a thriving reef is like trying to count the stars in the sky. A more accurate analogy may be plants in a rainforest, as reefs harbor so many kinds of life.</p><p>Reefs are often and not inaccurately described as “superorganisms.” They are immense, composed of millions of organic parts, and function as conduits taking sunlight and turning it into both plant and animal flesh. The tiny animals making up a coral colony can only exist by keeping a greenhouse full of tiny, photosynthesizing algae deep within its transparent flesh. That goes for the different types of reefs, including barrier reefs, atolls, lagoon reefs, and shallow fringing reefs. They all have anatomical parts that evolved to acquire energy, grow, and for as long as possible, stave off death.</p><p>And they have staved off death for more than 500 million years. If we could enter a souped-up time machine and hire a local airplane to photograph reefs during the geological periods Ordovician, Devonian, Permian, Triassic, and Cretaceous, each of which experienced a mass extinction of organisms, we would find the majestic reefs relatively unchanged.</p><p>Reefs’ resilience is aided by vertical walls. The walls have specific shapes at specific places, on a transect from deep to shallow water. In fact, of all underwater environments, the vertical, stony walls that mark the deep-water edges of coral reefs are among the most sublime, colorful, and ancient of Earth’s biologically produced habitats.</p><p>The deep water in front of coral reefs is normally cold and nutrient-rich. Because cold water contains more oxygen than warmer water, this nutrient- and oxygen-rich resource is as necessary for the life and growth of reef tracts as fresh water and fertilizer are to a garden. What’s more, the perpetual winds of the coral-living latitudes push ocean water in unvarying directions. This causes the deep, cold water to rise into the warmer, often oxygen-deprived surface waters where corals most actively grow. This process is called upwelling and results in the richest fisheries in the world. Along with nourishing coral, it allows for the rich sardine and herring fisheries of western South America, western South Africa, western North Africa, and California.</p><p></p><p>In less than a century, climate change has upended conditions that have sustained life in the Mesophotic Zone for millions of years. Global warming, generated by human activity, has penetrated surface water and caused the water in front of reefs to become lethally warm and anoxic. Our work showed that the same species I studied at this place in 1984 were living and growing in water temperatures 3 to 5 centigrade cooler than now.</p><p>One of nature’s greatest symbiotic partnerships is between coral and a tiny organism called zooxanthellae. Zooxanthellae adsorb the coral’s respired carbon dioxide and phosphatic wastes and are in turn protected from predation in the open sea. The corals get a different benefit. Zooxanthellae allow the coral to build gigantic, hard skeletons. But when the oxygen-deprived warm water hits the zooxanthellae, they feel poisoned, and their reaction is to flee. When the zooxanthellae escape their coral hosts, they leave the once colorful coral animal transparent, so that the white calcareous skeleton of the coral is now visible. We call this coral bleaching.</p><p>It is not only the shallow reef being killed by the increasing upwelling of giant “blobs” of the warm water. The entire ecosystem of animals and plants in the once oxygen-rich environments of the Mesophotic Zone is encountering death by poison.</p><strong>TWILIGHT ZONE:</strong> Peter Ward on a dive off the coast of Ndrova Island, just north of Papua New Guinea, the only region on Earth home to the Allonautilus (his left hand) and Nautilus (right hand).Gregory Barord<p>During our work in that hot equatorial visit in 2015, we brought back tiny slivers of nautilus shells for analysis in giant mass spectroscopes. Long gone are the days when we would collect and kill for science. For the past decade, we’ve returned all the nautiluses we caught to the sea. The bits of their shell edges gave us sad evidence of the warming of the Mesophotic Zone.</p><p>More than 80 years ago, the great Chicago chemist Harold Urey discovered the temperature of skeletons in many kinds of invertebrates, including the nautilus, can be determined with mass spectrometry. The instrument measures the fractionation of molecules; in this case, the isotopic composition of oxygen in seawater baked into the nautilus shell. The readings told us the fractionation, a function of temperature, represented significant warming between 1984 and 2015 in the nautilus habitats off Ndrova Island. That suggested the nautilus was moving toward deeper, cooler waters. But depth exacts its own lethal penalty. Higher pressure slows their growth, and slow growth of juveniles has been a death sentence for them.</p><p>We had been put down remote video systems that allowed us to make estimates of population numbers. Nautiluses and Allonautiluses are so efficient in finding the meat in deep-water crab traps, the preferred mode of capture by illegal shell traders, that they have been easy to catch. Traders have reported up to 50 nautiluses on a particularly good haul. That’s led to the assumption that there are millions of these archaic animals crisscrossing the deeps in front of coral reefs. But our estimates are that there might be 10 nautiluses per square kilometer where there is no nautilus trapping, and maybe 1 per kilometer in the Philippines and Indonesia, sites of the most virulent trapping. A square kilometer of ocean bottom is a very large area. That so few nautiluses live in that area, even in the best of circumstances, represents a life on the edge.</p><p>Perhaps if Nautiluses and Allonautiluses only had to survive the warming depths, they would do as they have always done—eke by. If they were only fished by those who can sell a single, freshly killed Allonautilus for $1,000—a sum more than the annual income in the area where they are found—perhaps there would be a world in a thousand years with this iconic animal. But the nautilus and coelacanth are being rapidly killed simply for food by fishing communities in the tropics, whose livelihoods are slowly being destroyed by climate change and overfishing. Like so much in our warming world, the delicate balance of the Mesophotic Zone, and the ancient animals in it, are being crushed by the human thumb of extinction.</p><p></p><p><i>Peter Ward is a professor of biology and Earth and space sciences at the University of Washington. He began field research on living nautiluses in 1975 at age 25. He continues this work today.</i></p><p></p><p><b>Additional Reading</b></p> <p>Barord, G.J., <i>et al.</i> Comparative Population Assessments of Nautilus sp. in the Philippines, Australia, Fiji, and American Samoa Using Baited Remote Underwater Video Systems. <i>PLoS ONE</i> <b>9</b> e100799 (2014).</p><p>Vandepas, L.E., Dooley, F.D., Barord, G.J., Swalla, B.J., &amp; Ward, P.D. A revisited phylogeography of Nautilus pompilius. <i>Ecology and Evolution</i> <b>6</b>, 4924-4935 (2016).</p> <p>Ward, P., Dooley, F., &amp; Barord, G. Nautilus: Biology, Systematics, and Paleobiology as viewed from 2015. <i>Swiss Journal of Palaeontology</i> <b>135</b>, 169-185 (2016).</p><br><a href=\"http://nautil.us/issue/104/harmony/twilight-of-the-nautilus?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication\">Read More…</a>"
}