{
  "title":"The Natural Harmony of Faces - Issue 104: Harmony",
  "date":"2021-08-04T13:00:00.000000-07:00",
  "author":null,
  "id":"http://nautil.us/issue/104/harmony/the-natural-harmony-of-faces?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "link":"http://nautil.us/issue/104/harmony/the-natural-harmony-of-faces?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "content":"<img src=\"http://static.nautil.us/18639_d58046673cab7fe068e4a84318bca447.png\"><br><p>Researching my upcoming book on film, <i>Suddenly Something Clicked</i>, I was struck by something that had not occurred to me in 50 years of film editing. In closeups and medium closeups, cinematographers tended to place the eyes of actors along a line corresponding to the golden ratio division of the vertical dimension of the frame. In correspondence with cinematographers Vittorio Storaro (<i>Apocalypse Now</i>), John Seale (<i>The English Patient</i>), Caleb Deschanel (<i>The Lion King</i>), and directors Francis Coppola and Carroll Ballard, it became clear that this was not a conscious decision on their part. Seale put it succinctly when he wrote “I just try to make the face feel comfortable within the frame.”</p><p>The golden ratio is represented by the Greek letter phi (φ) and has held a strong grip on human imagination since it was discovered by the geometers of the ancient world. It’s represented by a bisected line whose shorter section is in the same relationship to the longer section, as the longer section is to the whole line. This ratio works out to be an irrational number, 1.618034…, and was especially valued by the astronomer Johannes Kepler, who named it as one of the two great treasures of geometry, the other one being the Pythagorean theorem. The golden ratio is the limit of the Fibonacci series, and it can be found in many unexpected places in the natural world—in the structure of DNA, the spirals of galaxies and hurricanes, the growth patterns of leaves and seeds, and many other places, including, I would suggest, in cinematography and the architecture of the human face.</p><p>I’ve learned that in the great proportion of human faces among all races, and across history, judging by painting and sculpture, our eyes fall at the golden ratio line between the hairline and chin. Furthermore, there are golden ratio proportions between other significant zones of the face: the distance of eyes to lips compared to the distance of lips to chin; eyes to nostrils :: nostrils to lips; eyes to nostrils :: nostrils to chin. There are variations, of course. Jay Leno has a disproportionately large chin, and Helen Hunt has a very tall forehead. But the overwhelming tendency is for the human face to show these proportions. This is particularly true in art, painting or sculpting an idealized face.</p><p>My tentative conclusion about cinematography was that when the face is the subject of the composition, the face feels “most comfortable within the frame” when the eyes fall along the same golden ratio line of the frame as the eyes fall within the face. A kind of compositional harmonic. Cinematographers can vary this, depending on the aesthetic of the film. Placing the eyes above the line tends to make the character more dominant, and below the line tends to emphasize the character’s relative weakness. Extreme diversions from this can be seen in films by Pawel Pawlikowski; for example, in his Academy Award winning <i>Ida</i>.</p><p>The short film below is an exploration of those zones of the face and their mathematical relationships. Why these relationships exist, and are so consistent, is a deeper mystery.</p>  <p></p><p><i>Walter Murch has been working in film for more than 50 years, as an editor, sound designer, writer, and director. He edited and sound-designed many films for Francis Coppola (</i>The Godfather Trilogy, The Conversation, Apocalypse Now<i>) and Anthony Minghella (</i>The English Patient, The Talented Mr. Ripley, Cold Mountain<i>). His interest in science can be seen in his editing of Mark Levinson’s film</i> Particle Fever <i>(2013), about the search for the Higgs Boson.</i></p><br><a href=\"http://nautil.us/issue/104/harmony/the-natural-harmony-of-faces?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication\">Read More…</a>"
}