{
  "title":"Why You May Have More Friends Than Your Friends Do - Facts So Romantic",
  "date":"2021-08-20T12:00:00.000000-07:00",
  "author":null,
  "id":"http://nautil.us/blog/why-you-may-have-more-friends-than-your-friends-do?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "link":"http://nautil.us/blog/why-you-may-have-more-friends-than-your-friends-do?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "content":"<img src=\"http://static.nautil.us/18681_e633725b1ff30de3c9fd8212087f931b.jpg\"><br><p><i>What should you do if you are worried about your popularity? Relax. Despite what Facebook tells us, it’s the quality of friendships that count, not the quantity, and certainly not your average popularity.</i>Photograph by Ivelin Radkov / Shutterstock</p><p>There’s a rude charm to the title, “Why Your Friends Have More Friends Than You.” It’s catchy, like the title of an antagonistic explainer: Here are the causes of your lackluster social life. It sounds more like a <i>New York Times</i> op-ed than an academic paper. But in fact, “Why Your Friends Have More Friends Than You” is a 1991 <a href=\"http://wiskundemeisjes.nl/wp-content/uploads/2010/04/Why-your-friends-have-more-friends-than-you-do.pdf\">paper</a> from Scott Feld published in the <i>American Journal of Sociology</i>. It now has some claim to fame for introducing into popular culture the so-called “friendship paradox,” which researchers have used to <a href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0092413\">detect</a> the early onset of contagious outbreaks and <a href=\"https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.91.247901#fulltext\">design</a> effective vaccination strategies. New research, published in the <i>Journal of Complex Networks</i>, suggests the paradox is more nuanced than Feld figured it to be.</p><p>The paradox stems from our poor intuitions about networks and averages. If you were to guess how many friends you have, compared to the number of friends your friends have, how would you fare? You may say it’s your friends that have more friends than you, if you’re feeling modest. But it’s also the case that some of those friends who have more friends than you <i>also</i> have friends who have more friends than them, and so on. The friendship paradox says that this is true for everyone—on average, everyone has friends with more friends than they have.</p><p>We have a paradox of paradoxes.</p> <p>How is that possible? The paradox goes beyond friendship. It holds true any time you have a network of objects where any two of them are either connected or not connected. Mathematicians call the objects “nodes,” the connections “edges,” and the whole network a “graph.” Two nodes are “neighbors” if they are connected by an edge, and the number of neighbors of a node is called its “degree.” You can define a sort of “net popularity” of a node by taking its degree and subtracting the average degree of its neighbors. For example, if I am friends with Annika, Bing Wen, Carolina, and Daud, and Annika has (including me) three friends, Bing Wen has five friends, Carolina has seven friends, and Daud has five friends, then my net popularity is:</p><p> 4 – (3+5+7+5)/4 = -1. </p><p>It is a mathematical fact that if you average over all of the net popularities in a network, then that average will be negative: Your friends have more friends than you do. You are more likely to be Carolina’s friend than Annika’s, exactly because Carolina has more friends. If someone has lots of friends, one of them is more likely to be you. In his paper, Feld suggested that this might be psychologically significant. People, when they wonder how many friends they ought to have, could be looking at the number of friends their friends have as a point of comparison, which will almost always leave them feeling inadequate. A 2017 <a href=\"https://epjdatascience.springeropen.com/articles/10.1140/epjds/s13688-017-0100-1\">paper</a> identified a “happiness paradox” and suggested that it might be related to the friendship paradox—perhaps your friends are also happier than you are because they are more popular. </p><p>But in a new <a href=\"https://academic.oup.com/comnet/article/9/2/cnab011/6287259\">paper</a>, a trio of researchers from the Santa Fe Institute and the University of Michigan, who study physics and networks, show that the truth of the friendship paradox isn’t as gloomy as it might seem. There are some networks where the friendship paradox doesn’t meaningfully manifest at all. The authors—George Cantwell, Alec Kirkley, and Mark Newman—confirmed this by comparing their mathematical results against over 30 real-world networks, including among <a href=\"https://www.worldscientific.com/doi/abs/10.1142/S0219525903001067\">jazz musicians</a>, <a href=\"https://www.pnas.org/content/98/2/404/\">collaborating scientists</a>, <a href=\"https://link.springer.com/article/10.1023/A:1015457400897\">drug users</a>, and <a href=\"https://link.springer.com/article/10.1007/s00265-003-0651-y\">dolphins</a>. So, if you were ever bummed out in the way Feld suggested, cheer up—the reality is much more complicated than the headline. You might be more popular than one single number makes it seem.</p><p>Statisticians have long understood that there are different ways to compute the “average” of something, with different advantages and disadvantages. The method I described above—add up all of the values and divide by the number—is more technically known as the “mean.” One disadvantage of the mean is that it is particularly sensitive to extra values. This is often referred to as the Bill Gates effect: if 10 middle-class people are sitting in a bar and Bill Gates walks in, the average income in the bar jumps from five to nine digits. This jump doesn’t really show the real-world experience of the bar-goers, however. (Except they get to brag that they had a drink with Bill Gates.)</p><p>Similarly, Cantwell and his colleagues give the example of 1,000 people who are all friends with each other except two—call them Avital and Boris. Those two are friends with everyone else but not with each other. That means that 998 people will have 999 friends each, and 2 people will have 998 friends each. For most people, the net popularity will be:</p><p>999 – (999 + 999 + … + 999 + 998 + 998)/999 ≈ .002</p><p>But for Avital and Boris, the net popularity will be:</p><p>998 - (999 + 999 + … + 999 + 999 + 998)/999 ≈ -0.999</p><p>Due to the Bill Gates effect, the average net-popularity of the entire friend network will be pulled negative by Avital and Boris, despite everyone else in that network actually being more popular, on average, than their friends. </p><p>The simplest way to choose a network at random is to pick a probability, say 25 percent, and give every two nodes an edge 25 percent of the time and no edge 75 percent of the time. This is called a <i>Poisson random graph</i>, after the French mathematician Siméon Poisson. Cantwell and his colleagues show that, although the mean net popularity of such a graph will usually be around -1, confirming the mathematical friendship paradox, in fact, a large fraction of the nodes will have <i>positive</i> net-popularity. As the average number of neighbors of a node gets large, the fraction of nodes with positive net-popularity gets closer and closer to 50 percent. For these graphs, as they say, “no meaningful ‘friendship paradox’ applies.”</p><p>So now we have a paradox of paradoxes; the friendship paradox is true mathematically, but very often has no practical consequence due to the Bill Gates effect. What should you do if you are worried about your popularity? Relax. Despite what Facebook tells us, it’s the quality of friendships that count, not the quantity, and certainly not your average popularity. Enjoy your time with whatever friends you have. And if you see Bill Gates, tell him to call me.</p><p><i>Joshua Holden is professor of mathematics at the Rose-Hulman Institute of Technology and the author of </i>The Mathematics of Secrets: Cryptography from Caesar Ciphers to Digital Encryption.</p><br><a href=\"http://nautil.us/blog/why-you-may-have-more-friends-than-your-friends-do?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication\">Read More…</a>"
}