{
  "title":"The Ecology of Good Weed - Issue 104: Harmony",
  "date":"2021-08-25T13:00:00.000000-07:00",
  "author":null,
  "id":"http://nautil.us/issue/104/harmony/the-ecology-of-good-weed?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "link":"http://nautil.us/issue/104/harmony/the-ecology-of-good-weed?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "content":"<img src=\"http://static.nautil.us/18712_42b5ce9d23645f2bae146063b2218ae7.png\"><br><p>In high school, Daniel Stein built a solar-powered car and drove it across the country. “I got to see the possibility of doing something with my own hands and seeing the success of taking action for what you believe in,” he says, some 30 years later. It’s a slow winter day on the farm as a bearded Stein prepares seeds for the planting season. Soon he will be donning a straw hat, a clean shave, and a T-shirt, most likely swag from his or neighboring farms, as he works the land.</p><p>Today Stein and his wife Taylor Thornton operate an award-winning homestead called Briceland Forest Farm. The couple and their two young sons live in southern Humboldt—one of a triad of counties, alongside Mendocino and Trinity, that comprise the Emerald Triangle. This Northern California sprawl of coast, cliffs, and woods is world famous for its cannabis.</p><p>Indeed, cannabis is Stein’s main cash crop, enabling him to diversify Briceland’s output, growing a variety of vegetables for local restaurants and farmers’ markets. The farm is grounded in the values of “regenerative farming”—“no till,” “living soil”—which lay the foundation for Stein’s mission: to remediate the Earth and sustainably grow food, medicine, and a good high.</p><strong>HIGHER AND HIGHER:</strong> Daniel Stein on his regenerative farm, inspecting his very healthy cannabis. If only selling and distributing his crop could be as satisfying as growing it.Courtesy of Briceland Forest Farm<p>Like many in the Triangle, Stein is a second-generation farmer, tending a 5,000-square-foot plot inherited from his parents—hippies who bought the land for cheap in the 1970s during the “Back to the Land” movement. Young people from cities like New York, such as Stein’s parents, trekked out west to live off the grid, in harmony with nature. To support themselves, they “guerrilla-grew” cannabis in the shadows of the backcountry, hidden in clandestine corners among the forest, mountains, and mist.</p><p>Like his parents, Stein has rejected a life and career in the confines of institutions, with their bureaucracies and environmental sins. “The status quo is comfortable with taking more than giving, using fossil fuels and being extractive, rather than being regenerative and finding creative methods to live,” he says.</p><p>Unlike many of the first hippie farmers, though, Stein has managed to sustain his farm by relying on ecological science—and endless hard work. When he says he lives in harmony with nature, he’s not talking so much about metaphysics but sound ecological principles that propel his business and preserve the land.</p><p>The most obvious break with the first Back-to-the-Landers who went to pot is that Stein grows marijuana legally. Times of course have changed over the past 25 years, with California having legalized medical marijuana in 1996 and then “adult use” (recreational) in 2016. Cannabis is a key component of the ecosystem that allows his entire farm to flourish. In an irony, though, that the flower children could never imagine, growing legal pot has tangled Stein in the red tape he has spent his life avoiding. The regulations that come with selling cannabis from sustainable farms like his constitute the most invasive species in his life. He’s working on a solution.</p><p></p><p>Briceland Forest Farm is nestled beneath skyscraping redwoods and off a hilly road near the town of Redway, population 1,225. The farm abounds with perennials. Its grounds are full of carrots, beets, potatoes, lettuce, tomatoes, cucumbers, zucchinis, eggplants, corn, peppers, melons, shishitos, arugula, radishes, and cilantro—not to mention varieties of cannabis. “About everything you can imagine in a farmers’ market, we do in small amounts,” Stein says.</p><p>The farm, with its regenerative methods, is certified organic. Andrew Smith, chief scientist at the Rodale Institute, a nonprofit which created the term “regenerative organic,” explains that soil health is at the heart of the regenerative movement. The healthier the soil, the greater its capacity for carbon sequestration, and the greater the farm’s biodiversity, the healthier soil. Regenerative farming “benefits human health, as well, by eliminating the use of chemicals like fertilizers and pesticides,” Smith says.</p><p>Unlike many of the first hippie farmers, Stein relies on ecological science.</p> <p>A key component of the practice is not tilling the soil. Untilled soil, Stein explains, retains nutrients important to plants’ growth. It also sequesters carbon, helping reduce the release of carbon dioxide, the main global warming gas, into the atmosphere. Traditionally, and especially in industrial agriculture, farmers prepare the soil by tilling it with a tractor. Tilling churns the surface of the soil, aerates it, and allows it to be mixed with plant material or fertilizer for the next planting.</p><p>“For the first few years of tilling, you get good returns on your soil and your crops grow great,” Stein says. “But what you’re doing is pulverizing diversity within the soil, killing earthworms, fungi, and a lot of the microfauna, and making a soil that’s primarily bacterial dominant. And bacterial-dominant soil is a threat to soil diversity.”</p><p>Without tilling, Stein says, “You end up with a more resilient system, which creates healthier plants and a longer term, more sustainable soil.” Untilled soil, he explains, is “like a sponge,” noting its capacity to hold water and nutrients, which renders them more available to the plants. A no-till system also finds its own balance of fungi, earthworms, microbials, beneficial nematodes, and other flora and fauna beneath the surface of the earth. This method allows farmers to leave plant roots in the ground, even after harvest.</p><p>“The plants take atmospheric carbon and create a carbon structure of roots within the soil,” Stein says. “When you cut the plant and it dies, there’s all that carbon from the atmosphere that’s now deep in the soil profile and becomes stable soil carbon.”</p><p>In the 10 years since founding Briceland, Stein says he’s increased his soil’s stable carbon by about 4 to 5 percent; on less than an acre, he’s been able to sequester more carbon every year than what a car driving across the country and back would produce and put into the atmosphere. “It doesn’t make us carbon neutral,” he says, “but it’s a good-hearted attempt.”</p><p></p><p>Soil health is the foundational element of a regenerative farm. It’s also helped Stein produce a bounty of quality cannabis and highs, and win the area’s top cannabis award, the Emerald Cup, in 2017, for cultivation practices that “go beyond sustainability in that they heal, improve, and remediate.”</p><p>A key method of maintaining soil health is “cover cropping,” or growing plants not necessarily meant to be eaten or sold. Along with his vegetable crops and cannabis, Stein plants grasses and legumes, including oats, beans, and peas. The fast-growing grasses create additional nutrients in the soil. To aid the process, Stein coats the grasses and legumes with layers of fresh compost, wood chips, manure, and straw.</p><p>Along with cover cropping, Stein creates fungal beds and swales (meant to absorb surface runoff back into the soil); this allows vegetation to pull nutrients (that would otherwise pollute the environment) from water as it flows off the property. On his farm, he uses stored winter rainwater, which in Humboldt yields about 80 inches. During the growing season in spring and summer, there is almost no rain, so he draws from a water catchment pond, where he stores it from the wet through dry season.</p><strong>THE HAPPY FARMER:</strong> “Growing and selling veggies isn’t the most profitable business or the most glamorous,” Daniel Stein says. “But it is fulfilling in a way none of the many other jobs I have done in my life have been.”Courtesy of Briceland Forest Farm<p>Stein’s regenerative methods feed both the soil and the quality of his pot. To nourish his cannabis plants, he explains, he must make the right moves throughout the seasons. During harvest in early October, Stein cuts the cannabis plants, leaving the roots in the ground, and puts a layer of compost on the beds; he then seeds the cover crop into the compost, without removing mulch from the previous year.</p><p>Cover crops photosynthesize throughout the winter, bringing up more nutrients from the soil to make them available for the upcoming cannabis planting season in the spring. Once the spring comes along, Stein crimps the cover crop down with flattening boards, then covers it with more compost to start decomposing—facilitating the best possible environment in which to plant the cannabis.</p><p>Growing legal pot has tangled Stein in the red tape he has spent his life avoiding.</p> <p>Tina Gordon of Moon Made Farms, another regenerative cannabis farm in Humboldt County, explains that “companion planting,” which may include nettles or comfrey, is another key tenet. “When there’s diversity, you’re feeding the soil,” she says. “We also use the plants right next to the cannabis to make teas that we then feed back to the cannabis.” Gordon also plants flower gardens that attract bees to the cultivation site. “The more flowers, the more bees, the more bees the healthier, more robust the crops,” she says.</p><p>Throughout the growing season, Stein feeds his cannabis with “fermented plant juice.” He creates the juice by taking plants called “dynamic accumulators,” like horsetail or nettle, that are good at absorbing certain nutrients and minerals, and soaking them in water with a bit of added sugar. “With regenerative practices, you’re creating a balanced ecosystem in the soil,” Stein explains. “You’re giving the plant all that it could possibly want so that it gets to express itself to its fullest, without ever being in want of the proper nutrients and minerals.” A plant’s relationship with soil biology and the plants around it creates a web of mutual support, he adds. “To me, that pure expression of the plant creates a better product, and because of the complexity of the plant life, I know that all the minerals, nutrients, vitamins, and enzymes are available within our soil.”</p><p>Stein says his growing methods allow him to design a specific type of high. He implements certain techniques to bring out the plant’s terpenes, or aromatic compounds, which give the plant its flavor and influence the quality of the high. During the late stages of flowering, the amount and type of stress that a plant endures—such as watering or companion planting—will impact how it expresses its terpenes. “I like having chamomile or yarrow around them to help produce essential oils and terpenes,” Stein says. One of his strains, “Cuddle Bud,” is named for producing a high that’s “sweet, physical, warm, and loving,” he says.</p><p></p><p>Stein is a prolific poster on Facebook. “I love what we do,” he wrote in July. “Growing and selling veggies isn’t the most profitable business or the most glamorous. It is really physically demanding, and the hours seem to never end, but it is fulfilling in a way none of the many other jobs I have done in my life have been. Being outside, working with natural cycles and soil is great. It is endlessly challenging in good and hard ways and always changing.”</p><p>There is, though, one challenge that bedevils Stein, and that is selling his pot. It’s a major challenge because cannabis amounts to most of Briceland Forest Farm’s income. For one thing, it’s expensive to grow pot. Annual fees amount to more than $20,000 a year, he says, and that’s just for “a very small family producer—just us and one helper doing the whole operation, including the veggies.” There’s a cultivation tax that costs $150 for every pound produced, and it doesn’t matter how much that pound is sold for (even if it only sells for $150). “Taxes are not based on our profits, but are a flat tax across the board,” Stein says.</p><p>Stein’s strain, “Cuddle Bud,” produces a high that’s “sweet, physical, warm, and loving.”</p> <p>The biggest legal hassle of selling cannabis, according to Stein, is the California state law mandating multiple middlemen, including distributors, lab testers, and dispensaries. Stein sells his veggies directly to consumers through farmer’s markets and community-supported agriculture subscription services. But each time his cannabis changes hands, each intermediary step takes about 20 percent off the profit. It’s the “cumbersomeness of the laws,” he says, which makes selling weed on the legal, regulated market so difficult. “It doesn’t matter if you grow 10 acres or 10 square feet,” Stein says. “The greater percentage of your profits go to bureaucratic necessities, without much of a reward system for exemplary practices or motivation to stay small and focused on boutique craft cannabis.”</p><p>Essentially, the legal pot market penalizes organic farmers. Due to the California Environmental Air Quality Act, cannabis is considered a “product” rather than a “crop,” explains Kristin Nevedal, board chair and co-founder of the International Cannabis Farmers Association. The idea behind the designation is to keep outdoor cannabis production from impacting the surrounding environment—even if that impact is positive, as in the case of regenerative agriculture. The law incentivizes cannabis farmers to cultivate in a closed environment, like a greenhouse or indoor facility, though it’s nearly impossible to implement regenerative practices in an enclosed system. Regulations also mandate that farmers provide a map of their cultivation activities and have everything approved. So those who implement crop rotation practices may need to apply for a license modification every year. Indoor cultivation sites also qualify for exemptions that outdoor sites don’t.</p><p>“The law in California has been structured around big business and has often approached cannabis as an industrial product and catered to large grows or indoor grows,” Stein says. Big growers can get their per unit cost down, he explains, while small farmers like him, who prioritize land practices, still have to go through all the same legal processes and pay the same fees. He notes that at least the regulations mandate third-party testing for toxic herbicides and pesticides.</p><p>But in September 2020, California passed a law that is changing the fortunes of organic pot growers. The law establishes “appellations of origin” for cannabis that’s grown in certain geographic areas of the state. Weed grown within a certain terroir, such as in Mendocino County, can receive a special designation, reminiscent of the terroirs used in the wine industry, such as Bourdeaux in Southern France and Napa in Northern California.</p><p>“There’s this idea that there are lots of factors that go into a product that are of the place where it is grown,” he says. “You can feel, taste, and experience it in the cannabis.” Soil types, growing practices, and other markers link multiple farms in an area and give consumers a sense of where the cannabis comes from. “Having this experience where you can create something of a place and share it with people who can learn to recognize those differences on their own—I’m glad we’re laying down the tracks now, so later on we can use that as a tool for communication with our customers,” Stein says.</p><p>Stein is proud to have revived and sustained the land he inherited from his parents. His regenerative approach to farming has allowed his family’s environmental values to live on. “Small farmers are less likely to exploit land, people, and situations to make money,” says Stein. “It’s all right in front of us, we want to see it cared for.”</p><p></p><p><i>Madison Margolin is a New York/California-based journalist covering cannabis, psychedelics, and Jewish culture. She is the co-founder of the Jewish Psychedelic Summit and</i> DoubleBlind <i>magazine, where she works as an editor. Her writing has appeared in</i> Rolling Stone, Playboy, Vice, <i>and </i>Tablet.</p><p><i>Lead photo courtesy of Briceland Forest Farm.</i></p><br><a href=\"http://nautil.us/issue/104/harmony/the-ecology-of-good-weed?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication\">Read More…</a>"
}