{
  "title":"Why Do We Have to Die? - Issue 104: Harmony",
  "date":"2021-08-04T13:00:00.000000-07:00",
  "author":null,
  "id":"http://nautil.us/issue/104/harmony/why-do-we-have-to-die?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "link":"http://nautil.us/issue/104/harmony/why-do-we-have-to-die?utm_source=RSS_Feed&utm_medium=RSS&utm_campaign=RSS_Syndication",
  "content":"<img src=\"http://static.nautil.us/18642_3467a9a96db4f23d5f45b0f5eaeaff06.png\"><br><p>Epidemics have a way of making one wonder about death. To put it plainly, in the raw form it takes as it first rises from our hearts: <i>Why?</i> Why on Earth does it have to be this way?</p><p>In <i>The Plague</i>, <a href=\"http://nautil.us/issue/49/the-absurd/ingenious-albert-camus\">Albert Camus</a>’ novel of harrowing disease in an Algerian city, Father Paneloux, a faithful Jesuit, steps to the pulpit and offers his explanation. “This same pestilence which is slaying you,” Paneloux says, “works for your good and points your path.” In another sermon, Paneloux goes further: “The suffering of children was our bitter bread, but without this bread our soul would perish from its spiritual hunger.”</p><p>A young Charles Darwin, too, wondered about this problem, and for a while, he thought perhaps he had found an answer. Indeed his argument had something in common with Paneloux’s sermon: Death and suffering were linked inescapably to a higher good, though Darwin’s good was different from Paneloux’s. Where the Jesuit placed spiritual direction and nourishment, Darwin inserted the evolution of wondrous living things. The final paragraph of <i>On the Origin of Species</i> includes this remarkable sentence: “Thus, from the war of nature, from famine and death, the most exalted object which we are capable of conceiving, namely, the production of the higher animals, directly follows.”</p><strong>Numbering Our Lineage:</strong> Genomic analysis can, rather amazingly, give us an estimate of the population size along the lineage from the chimp-human ancestor to humans.Great Pics - Ben Heine / Shutterstock<p>Setting vast spiritual questions aside, there is a narrow sense in which Darwin was perfectly right: Embedded in the theory of evolution by natural selection is the idea that life is paid for with death. I mean this not in the poetic or sentimental sense that the price we pay for our time here on Earth is the sadness of our final departure. I mean it, rather, in the more prosaic and definite sense that the attributes we observe and admire in living creatures—precise adaptive fit to an environment, intricacy of construction, astonishing and diverse capabilities—are all built by a process that requires a certain quantity of death.</p><p>One can even calculate, under reasonable assumptions, just how much death. What Darwin did not realize, as he formulated his theodicy, is that sex tips the calculations strongly in our favor.</p><p></p><p>In matters of life and death, we ought to be precise, so consider a simple example, the sort of scenario theoreticians would call a toy model. Imagine a species that consists of 100,000 individuals, living in Edenic and equitable balance with their resources. Every individual gets to produce exactly one offspring, replacing him or herself in the population. Lovely. But what must become of this Eden if the species is to evolve?</p><p>Say one individual is born with a beneficial genetic mutation—a change in her material of inheritance, her DNA, that makes her better adapted than all her peers. She can hide better or forage faster; hunt more effectively or battle more powerfully—whatever the mutation is, it gives her a leg up.</p><p>How many useful deaths did it take to transform the chimp-human ancestor into Homo sapiens?</p> <p>For this new mutation to climb in frequency from 1 in 100,000 to 2 in 100,000, the individual who carries it must produce not one but two offspring. But the population, we’ve said, is held steady, by some limited resource, at 100,000 individuals. So for one extra individual bearing the new mutation to enter the population, one extra individual who does not bear the new mutation must die, making room for improvement, so to speak. More generally, one extra death is required for each incremental increase in the beneficial mutation’s prevalence. For the new mutation to increase by 1 percent in our population of 100,000, 1,000 extra deaths must occur. For the new mutation to be shared by the whole population—for it to <i>go to fixation</i>, as evolutionary biologists would put it—100,000 extra deaths must occur. Thus, the dues of evolution are paid in the currency of death.</p><p>We ought to add some nuance. For each incremental increase in the frequency of the beneficial mutation, it’s not technically a death that’s called for, but only the failure of one individual to survive and reproduce. Maybe someone just doesn’t get to have her allotted offspring. The point is only that the parent’s genetic lineage must come to an end. But in nature, that usually means mortality for either the prospective parent or the offspring. A reasonable shorthand is, well, just death.</p><p>When we add just a bit more biological realism to our toy model, the situation looks grimmer still. As you may recall, nearly all animals are diploid, meaning they carry two copies of their genome. Many new mutations are only semi-dominant—that is, they compromise with the other copy in their host’s genome in determining the way the host looks or acts. The great population geneticist J.B.S. Haldane wrote down a simple mathematical model to estimate how many extra deaths would be required for a new advantageous mutation to spread through the whole population of a diploid organism. Using our toy model just a moment ago, we reasoned that the number of extra deaths, spread over the entire history of the evolutionary change, would be about equal to the population size in any single generation (our 100,000). In his model of diploids with semi-dominant mutations, Haldane found that the number was more like 30 times the population size in any single generation.</p><p></p><p>What I’ve been referring to as “extra” deaths could also be called “useful” deaths, for they are the deaths that cause an uptick in the prevalence of a beneficial mutation; the deaths that, from an evolutionary point of view, aren’t for nothing.</p><p>Instead of our imaginary and idealized species of 100,000 individuals, let’s consider a real example. The most recent common ancestor of chimpanzees and humans was an ape that moved on all fours, had a skeleton a lot like a modern chimp’s, and, perhaps most important of all, had a chimp-sized brain, not our inflated <i>sapiens</i> brain. To a very close approximation, all the evolutionary changes that transformed our chimp-human ancestor into modern humans involved genetic mutations increasing in frequency in the population of proto-humans. So how many useful deaths did it take to transform the chimp-human ancestor into <i>Homo sapiens</i>?</p><p>We don’t know exactly how many mutations were favored by natural selection as the chimp-human ancestor evolved into modern <i>Homo sapiens</i>. But for purposes of this argument, we don’t really need an exact number, just a reasonable, order-of-magnitude estimate, and that’s perhaps within reach. Based on recent published analyses of human and chimp genomes, I did a back-of-the-envelope calculation to estimate the number of positively selected mutations in the lineage that leads from the chimp-human ancestor to humans. I came up with 100,000. (Said envelope, in case you’re interested, can be read below.)</p> <p>We want to do our best to estimate (very roughly) how many positively selected mutations there have been in the lineage leading from the chimp-human ancestor to humans.</p><p>There are about 30,000 non-synonymous substitutions in protein-coding genes between chimps and humans.4 For protein-coding regions, a widely circulated estimate is that 10 to 20 percent of amino acid differences between humans and chimps have been fixed by positive selection.1 This estimate itself rests on a lot of big assumptions, but it is consistent with some other studies of samples of proteins, and probably reasonable.</p><p>So that’s (30,000 non-synonymous substitutions) * (0.15 positively selected) * (0.5 along the lineage leading to humans rather than chimps) = 2,250 positively selected mutations driven to fixation.</p><p>Functional regulatory regions appear to compose at least 7 percent of the genome.11 They evolve faster than protein-coding genes, and the fraction of changes that are positively selected is likely higher. The evidence for this is that the rate of sequence turnover events (defined as loss or gain of purifying selection) in regulatory regions is 2.5 turnover events per neutral substitution, whereas it is 0.23 turnovers events per neutral substitution in coding regions.11 This would seem to suggest that regulatory regions are extremely active in evolution, and therefore we could expect a significantly higher fraction of positively selected mutations than we see in coding regions. This is also consistent with studies of specific regulatory regions in model organisms as well as humans.4, 5, 7, 9-11 This is clearly the roughest guess of our calculation, but in conversations with population geneticists, I heard estimates of the rate of selectively driven divergence within functional regulatory regions that ranged from one-tenth of the neutral rate up to the neutral rate. (The idea is not that functional regulatory regions are neutral, but that they are subject to purifying selection on certain sites and positive selection on other sites, which together balance out to something approaching the neutral rate.) If we assume the rate is one tenth the neutral rate of divergence, we have:</p><p>(3.2 billion base pairs) * (0.07 functional regulatory fraction of genome) * (0.001 positively selected mutations, which is one tenth the neutral rate) * (0.5 on the human lineage) = 112,000.</p><p>An interesting implication here is that substitutions within protein-coding sequences are a very small part of evolutionary change compared with evolution outside of protein-coding sequences, in functional regulatory sequences.</p><p>Multiplying 100,000 positively selected mutations by Haldane’s 306 by the population size of 50,0003, 12 for each substitution gives you 150 billion useful deaths. If most evolution is due to selection on standing variation instead of new mutations, you can cut this number in half (very roughly, of course).</p><p>The number of generations is 7 million years8 divided by 20 years per generation,8 equals 350,000. The total number of deaths in the lineage leading from the chimp-human ancestor is the number of generations times the population size of 50,000, equals 17.5 billion.</p><p>All of these numbers are <i>preposterously</i> rough, but you see the general point. Unless we think about the effect of sex, there hasn’t been enough death in the history of our lineage to achieve the evolutionary change that we observe. Add sex, and this difficulty is resolved.</p><p></p><p><b>References</b></p><p>1. Boyko, A.R., <i>et al.</i> Assessing the evolutionary impact of amino acid mutations in the human genome. <i>PLoS Genetics</i> <b>4</b>, e1000083 (2008).</p><p>2. Castillo-Davis, C.I. The evolution of noncoding DNA: How much junk, how much func? <i>Trends in Genetics</i> <b>21</b>, 533-536 (2005).</p><p>3. Chen, F.C. &amp; Li, W.H. Genomic divergences between humans and other hominoids and the effective population size of the common ancestor of humans and chimpanzees. <i>American Journal of Human Genetics</i> <b>68</b>, 444-456 (2001).</p><p>4. The Chimpanzee Sequencing and Analysis Consortium. Initial sequence of the chimpanzee genome and comparison with the human genome. <i>Nature</i> <b>437</b>, 69-87 (2005).</p><p>5. Enard, D., Messer, P.W., &amp; Petrov, D.A. Genome-wide signals of positive selection in human evolution. <i>Genome Research</i> <b>24</b>, 885-895 (2014).</p><p>6. Haldane, J.B.S. The cost of natural selection. <i>Journal of Genetics</i> <b>55</b>, 512-524 (1957).</p><p>7. Kohn, M.H. Rapid sequence divergence rates in the 5 prime regulator regions of young <i>Drosophila melanogaster</i> duplicate gene pairs. <i>Genetics and Molecular Biology</i> <b>31</b>, 575-584 (2008).</p><p>8. Langergraber, K.E., <i>et al.</i> Generation times in wild chimpanzees and gorillas suggest earlier divergence times in great ape and human evolution. <i>Proceedings of the National Academy of Sciences</i> <b>109</b>, 15716-15721 (2012).</p><p>9. Loehlin, D.W., Ames, J.R., Vaccaro, K. &amp; Carroll, S.B. A major role for noncoding regulatory mutations in the evolution of enzyme activity. <i>Proceedings of the National Academy of Sciences</i> <b>116</b>, 12383-12389 (2019).</p><p>10. Peyregne, S., Boyle, M.J., Dannemann, M., &amp; Prüfer, K. Detecting ancient positive selection in humans using extended lineage sorting. <i>Genome Research</i> <b>27</b>, 1563-1572 (2017).</p><p>11. Rands, C.M., Meader, S., Ponting, C.P., &amp; Lunter, G. 8.2% of the human genome is constrained: variation in rates of turnover across functional element classes in the human lineage. <i>PLoS Genetics</i> <b>10</b>, e1004525 (2014).</p><p>12. Tenesa, A. <i>et al.</i> Recent human effective population size estimated from linkage disequilibrium. <i>Genome Research</i> <b>17</b>, 520-526 (2007).</p>  <p>Genomic analysis can also (rather amazingly) give us an estimate of the population size along the lineage from the chimp-human ancestor to humans. Obviously, this number changed a lot over the course of the millions of years it took for the chimp-human ancestor to give rise to <i>Homo sapiens</i>. There were periods of expansive population as well as severe bottlenecks. A reasonable middle-ground is on the order of 50,000.</p><p>Recall that, in Haldane’s improvement to our toy model, pushing a new mutation from a single copy to predominance and finally to fixation required 30 times as many “extra” or “useful” deaths as there were individuals in the population during a single generation. So that means the minimal number of useful deaths required to transform the chimp-human ancestor into a bona fide <i>Homo sapiens</i> would be 100,000 (that’s the number of selected mutations) times 50,000 (that’s the population size) times 30 (Haldane’s factor). That gives us an answer of 150 billion useful deaths.</p><p>What Darwin did not realize is that sex tips the calculations strongly in our favor.</p> <p>Hmmm. That’s a really big number. How many deaths altogether, useful or not, were there along the lineage from the chimp-human ancestor to modern humans? Based on our estimate of the population size (which we just used), the average generation time (which we can make a pretty good guess at), and the total time since chimps and humans split (a number that comes from both archaeology and genetics), we can do another simple calculation to estimate the total number of deaths. I just worked it out, and it comes to ... 17.5 billion.</p><p>Oops. How can the number of useful or extra deaths that natural selection needs to evolve a human from its ancestor be larger than the total number of deaths that have taken place? Well, it can’t. So what’s the explanation?</p><p>In large part, it’s sex. Say a certain man has a beneficial mutation. And say a certain woman has one of her own, only it’s different: It confers a different advantage, and it’s located somewhere else in the genome. And say, finally, this man and this woman get together and have kids. One of those kids might get both beneficial mutations, while another kid might get neither. When the doubly lucky kid survives and reproduces, while the doubly unlucky kid doesn’t, a single death becomes doubly useful: It pays for the simultaneous rise in frequency of two beneficial mutations.</p><p>You can repeat the argument for parents who have two mutations, three, and so on. Thanks to sex, a single death can push many beneficial mutations toward their ultimate fixation. We can conclude, therefore, that although the price of life is death, sex improves the exchange rate.</p><p></p><p>Later in life Darwin seems to have relinquished any notion that the theory of natural selection might redeem death and suffering, and thus vindicate a benevolent God. In fact, an epidemic appears to have played a pivotal role in shifting his views. What shattered his faith once and for all was watching his beloved little girl Annie suffer and die from scarlet fever and perhaps tuberculosis. After that, Darwin’s views seem to have had less in common with Father Paneloux’s than they did with those of Dr. Rieux, Camus’ heroic narrator, who works tirelessly to stop the plague. Rieux vehemently rejects Paneloux’s sermon. The scourge is a scourge, he argues, and there’s no vindicating it.</p><p>And yet, though Darwin may have found no ultimate vindication for death in the creation of beautiful living things, he would continue to find profound joy in such beauty. In sexual selection, he discovered the origin of life’s most extravagant displays. He attributed a great deal of importance to that process in the descent of <i>Homo sapiens</i> from hominid ancestors. To my knowledge, though, he never realized what Haldane and genomics have helped us to see here, that sex can greatly reduce the toll required for a certain measure of evolution.</p><p></p><p><i>Aaron Hirsh is a writer and biologist with strong interests in education, evolution, and the environment. His first book,</i> <a href=\"https://www.amazon.com/Telling-Our-Way-Sea-Discovery/dp/1250050316\">Telling Our Way to the Sea</a>, <i>won a National Outdoor Book Award for Natural History Writing and was a finalist for the William Saroyan International Prize. He is now working on another book about the history and fate of our planet. Aaron is also currently board chair for Ecology Project International.</i></p><p><i>Lead image: gopixa / Shutterstock</i></p><p><i><i>This article <i>was originally titled “The Price of Life Is Death, but Sex Improves the Exchange Rate,” and </i>first appeared in our “Love &amp; Sex” issue in July 2020.</i></i></p><br><a href=\"http://nautil.us/issue/104/harmony/why-do-we-have-to-die?utm_source=RSS_Feed&amp;utm_medium=RSS&amp;utm_campaign=RSS_Syndication\">Read More…</a>"
}