{
  "title":"Sterba on the problem of evil",
  "date":"2021-08-13T16:24:45.972000-07:00",
  "author":"Edward Feser",
  "id":"tag:blogger.com,1999:blog-8954608646904080796.post-1202389208296958503",
  "link":"http://edwardfeser.blogspot.com/2021/08/sterba-on-problem-of-evil.html",
  "content":"<p></p><div class=\"separator\"><a href=\"https://1.bp.blogspot.com/-RA1EufkZGbI/YRb_CC2hoLI/AAAAAAAAD5k/PODM2vp9aB4SANweQ8fTv3qSTp_UwlgCQCLcBGAsYHQ/s229/02.jpg\"><img border=\"0\" height=\"184\" src=\"https://1.bp.blogspot.com/-RA1EufkZGbI/YRb_CC2hoLI/AAAAAAAAD5k/PODM2vp9aB4SANweQ8fTv3qSTp_UwlgCQCLcBGAsYHQ/w143-h184/02.jpg\" width=\"143\"></a></div>Recently my article <span class=\"MsoHyperlink\"><a href=\"https://www.mdpi.com/2077-1444/12/4/268/htm\">“The Thomistic Dissolution of the Logical Problem of Evil”</a></span> appeared in the journal <i>Religions</i>.  It was part of a <span class=\"MsoHyperlink\"><a href=\"https://www.mdpi.com/journal/religions/special_issues/god_compatible_evil\">special issue</a></span> devoted to critical responses to James Sterba’s book <span class=\"MsoHyperlink\"><i><a href=\"https://www.amazon.com/Good-God-Logically-Possible/dp/3030054683/ref=sr_1_1?dchild=1&amp;keywords=Is+a+Good+God+Logically+Possible&amp;qid=1628878667&amp;sr=8-1\">Is a Good God Logically Possible?</a></i></span>  Sterba has now <span class=\"MsoHyperlink\"><a href=\"https://www.mdpi.com/2077-1444/12/7/536/htm\">replied to his critics</a></span>.  What follows are some remarks about what he says about my own contribution.  (Keep in mind that what I have to say below presupposes my earlier essay and that I’m not going to repeat here everything I said there.)<span><a name=\"more\"/></span><p></p> <p class=\"MsoNormal\"><i><span>Analogical language</span></i></p> <p class=\"MsoNormal\"><span>Sterba makes five main points.<span>  </span>The first has to do with the Thomistic view that language about God has to be understood in an analogical way.<span>  </span>He writes:</span></p> <p class=\"MsoNormal\"><i><span>Now Feser recognizes that when we apply predicates to God and ourselves, such as being just or merciful or permitting evil, claiming our assertions are true, we have to be speaking analogically. <span> </span>Even metaphorical statements made about God… which also purport to be true have to be conveying their truth, when they are true, through nonliteral, analogical language.<span>  </span>Yet what Feser fails to recognize is that I am always using the same analogical language of which he approves, as is illustrated, for example, by my repeated appeal to “the analogy of an ideally just and powerful state” throughout my book.</span></i></p> <p class=\"MsoNormal\"><span>End quote.<span>  </span>It seems to me that Sterba here misunderstands what Thomists mean by analogy.<span>  </span>For one thing, he at least appears to conflate “analogical” language with “nonliteral” language.<span>  </span>But nonliteral or metaphorical language is only one kind of analogical language, and when Thomists say that we need to understand predications of power, knowledge, goodness, etc. to God in an analogical way, they are not saying that these predications are nonliteral.<span>  </span>They <i>are</i> literal.<span>  </span>They just aren’t <i>univocal</i>.<span>  </span>(On the other hand, and in fairness to Sterba, he does seem to use “metaphorical” in a way that is possibly meant to distinguish it from other kinds of analogical language.<span>  </span>So I’m not certain about whether Sterba does suppose that all analogical language is nonliteral.)</span></p> <p class=\"MsoNormal\"><span>Sterba also seems to conflate (a) using language in an analogical sense with (b) drawing an analogy.<span>  </span>That is also a mistake, as can be seen from the fact that even thinkers who insist that theological language is univocal rather than analogical (such as Scotists) are not saying that we should never draw analogies when talking about God.</span></p> <p class=\"MsoNormal\"><span>Again, the key here is to understand that when Thomists say that language about God is to be understood analogically, they do <i>not</i>mean that it should be understood nonliterally.<span>  </span>They insist that there is a third <i>literal</i>sort of linguistic usage in between the equivocal and univocal uses.<span>  </span>God is, for example, <i>literally</i> powerful, not merely metaphorically powerful.<span>  </span>It’s just that the word “power” doesn’t have exactly the same sense as it does when we say e.g. that a corporate executive is powerful or that a cannon is powerful, even if it doesn’t have an entirely disconnected sense either.</span></p> <p class=\"MsoNormal\"><span>Naturally, this raises questions about exactly what literal but analogical usage involves, and crucial to understanding that is to note the distinction between the <i>analogy of attribution</i> and the <i>analogy of proportionality</i>, and, where the latter is concerned, the further distinction between <i>proper proportionality</i> and <i>improper (or merely metaphorical) proportionality</i>.<span>  </span>I spell out these distinctions in <span class=\"MsoHyperlink\"><i><a href=\"https://www.amazon.com/Scholastic-Metaphysics-Contemporary-Introduction-Scholasticae/dp/3868385444/ref=sr_1_3?crid=YKH1TDZBC6UQ&amp;dchild=1&amp;keywords=feser+scholastic+metaphysics&amp;qid=1628880225&amp;sprefix=feser+scholastic+%2Caps%2C261&amp;sr=8-3\">Scholastic Metaphysics</a></i></span>, at pp. 256-63, and of course there is a huge literature on the topic. <span> </span>(<span class=\"MsoHyperlink\"><a href=\"https://www.catholicworldreport.com/2021/01/18/what-is-analogy-a-thomistic-introduction/\">Here is a useful primer</a></span> from Joe Trabbic.) <span> </span>The point to emphasize for present purposes is that for the Thomist, the key to understanding theological language is the analogy of proper proportionality and, to some extent, the analogy of attribution – and <i>not</i> the analogy of improper or metaphorical proportionality.</span></p> <p class=\"MsoNormal\"><span>Yet the latter is what Sterba seems to have in mind when he talks about “analogical” language.<span>  </span>This is evident not only from his apparent conflation of “analogical” and “nonliteral,” but also from the example he gives.<span>  </span>He says that he is using analogical language when he compares God to “an ideally just and powerful state.”<span>  </span>But God is not literally a state, so that this is a case of merely metaphorical or improper proportionality.<span>  </span>And again, that is not the kind of analogical language that the Thomist has in mind in characterizing theological language as analogical.</span></p> <p class=\"MsoNormal\"><span>There are deep semantic and metaphysical issues here the neglect of which vitiates not only Sterba’s argument, but much that is written today on the problem of evil by theists and atheists alike.</span></p> <p class=\"MsoNormal\"><i><span>Drawing good out of evil</span></i></p> <p class=\"MsoNormal\"><span>In my article I appealed to Aquinas’s view that God permits evil to exist because he draws a greater good out of it, and that no amount of evil could possibly outweigh the supreme good of the beatific vision.<span>  </span>Sterba responds:</span></p> <p class=\"MsoNormal\"><i><span>Here, Feser understands, as do I, the beatific vision to be friendship with God. <span> </span>However, I also argue that God’s offer of friendship cannot be logically dependent on his permission of horrendous evil consequences because if it were, his power would be impossibly limited. <span> </span>So, it must always be logically possible for God to offer us his friendship without first permitting horrendous evil consequences of immoral actions to be inflicted on ourselves or anyone else, and if God were all-good, then he would always be doing just that</span></i><span>.</span></p> <p class=\"MsoNormal\"><span>End quote.<span>  </span>This seems to me to beg the question.<span>  </span>Thomists, like most other theists, hold that omnipotence does not include the power to do the logically impossible.<span>  </span>And they would also hold that the particular goods that God draws out of the evil that exists would not otherwise be logically possible.<span>  </span>Sterba seems here simply to assume, without argument, that one or both of these suppositions are false.<span>  </span></span></p> <p class=\"MsoNormal\"><span>In general, Sterba’s approach to the problem of evil both in his reply and his book seems to take for granted a conception of human life that Thomists, and indeed traditional Christian theology in general, simply would not agree with.<span>  </span>In particular, he writes as if determining whether things go well overall for a human being is a matter of determining how they go for him in <i>this</i> life.<span>  </span>But from the point of view of traditional Christian theology, what ultimately matters is the <i>next</i> life, not this one.<span>  </span>This life is merely a preparation for the next.<span>  </span>Hence, to judge the overall quality of a human life requires, most importantly, reference to the afterlife.<span>  </span>If you considered only what happened in this life to, say, the Christian martyrs, you might think they lived among the most <i>un</i>fortunate of lives.<span>  </span>But if instead you consider the reward this gained them in Heaven, they would have to be judged as having the most <i>fortunate </i>of lives.</span></p> <p class=\"MsoNormal\"><span>Of course, the atheist will not agree that there is such a thing as an afterlife.<span>  </span>But the point is that if he simply assumes this as a component of his atheistic argument from evil, then the argument will beg the question.</span></p> <p class=\"MsoNormal\"><span>Sterba also seems to assume that if God exists, there is at least a very strong presumption that there would be no suffering, so that the fact that there <i>is </i>suffering is very surprising and indeed problematic if theism is true.<span>  </span>But Thomists and traditional Christian theology more generally would reject that assumption too.<span>  </span>They would say that suffering is to be <i>expected</i>given our nature as finite and corporeal creatures in a world interacting with other finite creatures.<span>  </span>To be sure, our nature is good as far as it goes.<span>  </span>But it is limited, and given those limits we are subject to injury, disease, ignorance, error, and the ramifications of those.<span>  </span>We are also liable to <i>moral </i>failures, and as these mount, the damage done to the character of individuals and to the social orders of which they are parts also snowballs and ramifies.<span>  </span>Given the facts of the natural moral law, we also come to merit the positive infliction of further harms as punishment for our evildoing.<span>  </span>In these ways, suffering is deeply ingrained into the very nature of human life, and therefore precisely what we should expect.</span></p> <p class=\"MsoNormal\"><span>It would take <i>super</i>natural assistance – that is to say, special divine action to raise us <i>beyond</i> the limits of our nature – to prevent this outcome from occurring.<span>  </span>And such assistance was indeed offered to our first parents.<span>  </span>Had they not rejected the offer, nature would not have taken its course.<span>  </span>That is the sense in which the evil that afflicts us is the consequence of Original Sin.<span>  </span>It’s not that the Fall introduced into the natural order evil that would <i>not </i>have otherwise been there.<span>  </span>It’s rather that it lost for us the <i>super</i>natural prevention of evil that <i>would</i> have been there.</span></p> <p class=\"MsoNormal\"><span>So, again, suffering is to be <i>expected</i> given our nature, rather than something that should surprise us.<span>  </span>But then, why is it nevertheless not removed given that through Christ we can be <i>restored</i>to grace?<span>  </span>There are several reasons.<span>  </span>One of them is that grace, the supernatural order of things, builds on nature rather than smothering it.<span>  </span>By leaving in place much of the effects of Original Sin, God allows us to see much more clearly than would otherwise be possible the unbridgeable gap between what we are capable of just given our own limited nature, and what we require in order to achieve the beatific vision.<span>  </span>We see our <i>need</i> for grace better than we otherwise would.</span></p> <p class=\"MsoNormal\"><span>For another thing, since we have in fact sinned, we merit punishment.<span>  </span>Even the repentant do not get off scot-free.<span>  </span>We need to do penance, either in this life or in Purgatory.<span>  </span>And the evils we accept in a penitential spirit in this life are preferable to those we face in Purgatory.<span>  </span>We can also accept unmerited suffering in the spirit in which Christ did so, as a sacrifice for <i>others</i> who need penance.<span>  </span>More generally, we can gain virtues such as patience, compassion, and courage.</span></p> <p class=\"MsoNormal\"><span>Much more could be said, but that is enough to make the point that from the point of view of traditional Christian theology, suffering is an integral part of the natural and supernatural order of things, rather than something we should be surprised by.<span>  </span>That’s part of why the Cross is so central a symbol in Christian spirituality.<span>  </span>If you look at the world the way that the heroes of scripture, the Fathers of the Church, and the saints do, the idea that what we should expect from God is (say) some kind of bourgeois consumer paradise – and that we should shake an accusing fist at him for failing to provide it – just seems bizarre, even superficial in the extreme.</span></p> <p class=\"MsoNormal\"><span>I’m well aware that this view of things is bound to seem very strange to an atheist or indeed to the average citizen of modern, affluent, secularized Western society.<span>  </span>But the point is that by approaching the problem of evil as if this traditional Christian view of things weren’t true, the atheist once again simply begs the question.<span>  </span>Sure, <i>if </i>you look at the nature and purpose of human life the way the secularist does, <i>then</i> the existence of suffering seems baffling.<span>  </span>But traditional Christian theology does <i>not </i>look at things that way.<span>  </span>And Sterba has given us no non-question-begging reason to do so.</span></p> <p class=\"MsoNormal\"><i><span>Freedom from what?</span></i></p> <p class=\"MsoNormal\"><span>In response to my point that those who are deprived of political freedoms and the like by oppressors do not thereby lose their free will, and that that is what matters most to their salvation, Sterba objects:</span></p> <p class=\"MsoNormal\"><i><span>Yet the failures of even the most brutal and oppressive dictators to take away the inner freedom of their subjects does nothing to exonerate them for the evil they do by depriving their subjects of their external freedom. <span> </span>Why should it be any different for God who could prevent all horrendous evil consequences, as needed, and thereby secure our external freedom as needed?</span></i></p> <p class=\"MsoNormal\"><span>End quote.<span>  </span>Sterba’s analogy fails, for two reasons.<span>  </span>First, because unlike the dictator, God merely <i>permits</i> rather than <i>inflicts </i>the loss of freedom in question.<span>  </span>Second, because unlike the dictator or any other human being, God is capable of drawing out from this loss a good that infinitely outweighs it. </span></p> <p class=\"MsoNormal\"><span>Sterba’s objection also greatly exaggerates the significance of the worldly freedoms that are lost, relative to what we gain in the hereafter.<span>  </span>That too may sound shocking from a modern secularist liberal point of view, but then, neither Thomism nor traditional Christian theology more generally looks at human life from that point of view in the first place.<span>  </span>Freedom to vote, to criticize state policy, to have a job one likes, etc. are all well and good.<span>  </span>But they are ultimately much less important than freedom from moral vice (a freedom which is still possible, even when political freedoms are lost, as long as we have free will). <span> </span></span></p> <p class=\"MsoNormal\"><span>As St. Augustine says, we have as many masters as we have vices, and they enslave us in a much worse way than human tyrants do.<span>  </span>The reason is that losing the freedom to vote, to work, etc. won’t keep us from the beatific vision, but losing the freedom from bondage to sin <i>will </i>keep us from it.<span>  </span>And that is what matters most in the end.<span>  </span>So, if a world where the loss of freedoms of the kind Sterba is talking about is part of an overall order where there is an increase in freedom of the kind Augustine is talking about – with the salvation that that entails – then that is a much greater overall good than one in which the former, lesser freedoms are maximized and the latter, greater ones are less in supply.</span></p> <p class=\"MsoNormal\"><i><span>Divine authorship</span></i></p> <p class=\"MsoNormal\"><span>In response to my comparison of the created world to a story and of God to the author of the story, Sterba writes:</span></p> <p class=\"MsoNormal\"><i><span>No doubt an author who chooses to fill his novel with an endless string of holocausts each worse than the last has not done anything morally wrong. <span> </span>Yet it does not follow that a God who permits the horrendous consequences of a similar endless string of holocausts which he could have easily prevented without loss of greater good consequences or prevention of greater evil consequences has likewise not done anything morally wrong</span></i><span>.</span></p> <p class=\"MsoNormal\"><span>End quote.<span>  </span>This misses the point I was making with the author analogy.<span>  </span>The point is not that God is blameless for the specific reasons an author is blameless (which include the fact that the characters, unlike us, are not real).<span>  </span>Rather, the point is that God’s causality differs from ours in something like the way an author’s causality differs from that of his characters, and this difference in causality entails that laws of nature and the natural moral law do not intelligibly apply to God.<span>  </span>He is outside the causal order in something like the way an author is outside the order of the story.<span>  </span>But the relevant moral categories in terms of which the “logical problem of evil” judges God to be guilty of wrongdoing can intelligibly apply only to creatures <i>within</i>that order.</span></p> <p class=\"MsoNormal\"><i><span>Divine morality</span></i></p> <p class=\"MsoNormal\"><span>Replying to my claim that, since God is not a rational animal and therefore not governed by natural law, the Pauline Principle does not apply to him, Sterba says:</span></p> <p class=\"MsoNormal\"><i><span>Yet, earlier, Feser recognized that certain virtues, such as being just and merciful, which do not make any direct reference to our appetites, do apply to God. <span> </span>Likewise, here, the Pauline Principle, which does not make any direct reference to our appetites, applies analogically to God in the same way that being just and merciful apply analogously to God</span></i><span>.</span></p> <p class=\"MsoNormal\"><span>End quote.<span>  </span>It seems to me that Sterba has missed my point, which was that God’s being rational and our being rational does not by itself entail that the same predicates can in every case intelligibly be applied both to us and to God.<span>  </span>I am not saying that <i>none</i> of the same predicates can intelligibly be applied.<span>  </span>But those that do apply must be understood in a way that reflects the differences between God and created things (e.g. God is not in the created order, does not fall under a genus, etc.).<span>  </span>God’s lack of appetites is one of the differences, but it is hardly the only one.<span>  </span>The problem with applying the Pauline Principle to God is that it could intelligibly apply to him only if God were part of the moral community – which, since he is not even part of the causal order of which the moral community is a component, he is not.</span></p> <p class=\"MsoNormal\"><span>That’s enough for now, and no doubt Sterba would have had more to say in response to my paper if had had time and space.  As it is, he had to reply to <i>fifteen</i>other contributors!  I thank him for his good sportsmanship and for an intelligent, civil, and productive exchange.</span></p>"
}