{
  "title":"Aquinas on humor and social life",
  "date":"2021-08-31T19:16:08.632000-07:00",
  "author":"Edward Feser",
  "id":"tag:blogger.com,1999:blog-8954608646904080796.post-6980641873306120823",
  "link":"http://edwardfeser.blogspot.com/2021/08/aquinas-on-humor-and-social-life.html",
  "content":"<p></p><div class=\"separator\"><a href=\"https://1.bp.blogspot.com/-1H2EX0sxpkY/YS7iNNBiCuI/AAAAAAAAD6M/E4aUGcG3AmUZT2TEH9t0vJhFh0XwOFJuQCLcBGAsYHQ/s300/010.jpg\"><img border=\"0\" height=\"170\" src=\"https://1.bp.blogspot.com/-1H2EX0sxpkY/YS7iNNBiCuI/AAAAAAAAD6M/E4aUGcG3AmUZT2TEH9t0vJhFh0XwOFJuQCLcBGAsYHQ/w179-h170/010.jpg\" width=\"179\"></a></div>In <i>Summa Theologiae</i> <a href=\"https://www.newadvent.org/summa/3168.htm#article2\">II-II.168.2-4</a>, Aquinas discusses the essential role that play and humor have in human life.  They are necessary for the health of the individual, insofar as in their absence the mind becomes weary and tense.  And they are necessary for the health of social life, which would be similarly strained without the ability to laugh and play together.  The virtue of <i>wittiness</i> is the character trait that facilitates this human need.  Naturally, as in every other area of human life, we can sin by excess, as when we joke in an inappropriate manner or at an inappropriate time, or are in our general manner of life insufficiently serious about serious matters.  But we can also sin by deficiency, by being insufficiently pleasant and willing to engage in play with our fellows.  Aquinas writes:<span><a name=\"more\"/></span><p></p> <p class=\"MsoNormal\"><i><span>Anything conflicting with reason in human action is vicious. <span> </span>It is against reason for a man to be burdensome to others, by never showing himself agreeable to others or being a kill-joy or wet blanket on their enjoyment. <span> </span>And so Seneca says, “Bear yourself with wit, lest you be regarded as sour or despised as dull.” <span> </span>Now those who lack playfulness are sinful, those who never say anything to make you smile, or are grumpy with those who do</span></i><span>.<span>  </span>(<i>ST</i> II-II.168.4, Gilby translation)</span></p> <p class=\"MsoNormal\"><span>Addressing the question whether “comedians” or “play-actors” sin by excess by virtue of devoting themselves entirely to mirth, Aquinas answers in the negative:</span></p> <p class=\"MsoNormal\"><i><span>As stated, play is necessary for the intercourse of human life. <span> </span>Now whatever is useful to human intercourse may have a lawful employment ascribed to it. <span> </span>Wherefore the occupation of play-actors, the object of which is to cheer the heart of man, is not unlawful in itself; nor are they in a state of sin provided that their playing be moderated, namely that they use no unlawful words or deeds in order to amuse, and that they do not introduce play into undue matters and seasons.<span>  </span><span> </span>And although in human affairs, they have no other occupation in reference to other men, nevertheless in reference to themselves, and to God, they perform other actions both serious and virtuous, such as prayer and the moderation of their own passions and operations, while sometimes they give alms to the poor. <span> </span>Wherefore those who maintain them in moderation do not sin but act justly, by rewarding them for their services</span></i><span>. (<i>ST</i> <a href=\"https://www.newadvent.org/summa/3168.htm#article3\">II-II.168.3</a>)</span></p> <p class=\"MsoNormal\"><span>In light of such considerations, we can see that the current tendency toward the politicization of every aspect of social life, including even sports and entertainment, is evil.<span>  </span>And it would remain evil even if the political causes in question were themselves good (as, these days, they typically are not).<span>  </span>You cannot have the fellow-feeling required for a society to hold together without some area of life in which disputes are put on hold, tensions are eased, and common goods are enjoyed.<span>  </span>In American life, sports, popular culture, holidays, and the like have long performed that function, especially as the country has gotten more secular.<span>  </span>But as “wokeness” has extended its tentacles into even these areas of life, there is little if anything left to do the job.<span>  </span></span></p> <p class=\"MsoNormal\"><span>In the case of humor, this has manifested itself in the prevalence of “clapter” comedy, where the point is not to be funny and to get the audience to laugh, but rather to signal your purported political virtue and invite the audience to show theirs by applauding.<span>  </span>The result is not to mitigate social tensions but to exacerbate them.<span>  </span>Such “comedians” no longer function to smooth social interaction between people of different opinions, values, and backgrounds.<span>  </span>Rather, their purpose is to lead one faction in denigrating another.<span>  </span>It’s the “Two Minutes Hate” of Orwell’s <i>1984</i>, but with strained chuckles rather than full-throated shrieks.<span>  </span></span></p> <p class=\"MsoNormal\"><span>This is inevitable given the nature of woke politics and its <a href=\"https://www.catholicworldreport.com/2021/01/31/the-gnostic-heresys-political-successors/\">paranoid vision of human life</a>.<span>  </span>When everything is interpreted as “oppression,” “micro-aggressions,” and the like, everything becomes deadly serious.<span>  </span>Even comedy is no laughing matter.<span>  </span>Envy is often said to be the only sin that gives the sinner no pleasure.<span>  </span>That <a href=\"https://edwardfeser.blogspot.com/2020/06/envy-cancels-justice.html\">envy is the deep root of wokeness</a> is evidenced by, among other things, the fact that the woke are so humorless, angry, and miserable – that the wokester is, to borrow Aquinas’s words, “burdensome,” “grumpy,” a “kill-joy or wet blanket” on the enjoyments of the fellow members of his society. </span></p> <p class=\"MsoNormal\"><span>“Clapter” “comedy” contrasts sharply with the essentially non-partisan approach of late night comics like Johnny Carson, Jay Leno, or even David Letterman in his earlier years.<span>  </span>That style of comedy is often mocked or dismissed today, but it performed the important social function of helping to soften tensions between citizens of diverse values and opinions and shore up a sense of common humanity and citizenship.<span>  </span>Not that Carson et al. saw matters in so highfalutin a way.<span>  </span>They just had the normal, healthy human being’s visceral understanding that not everything is political, and that their audiences were entitled</span> <span>at the end of a long day to relax and have a laugh rather than to be hectored. </span></p> <p class=\"MsoNormal\"><span>However, it is important to emphasize that the point is <i>not </i>that all comedy ought to be non-political, and it is not an essentially “right-wing” point either.<span>  </span>Larry David (for example) is almost always funny, even when his targets are right-of-center.<span>  </span>The reason is that his aim is <i>to be funny</i> rather than to make some political statement, and when such political humor is done well even its targets can (if they have a sense of humor about themselves) appreciate it.<span>  </span>And right-wingers too are certainly capable of being humorless and of politicizing everything.<span>  </span>But it is wokeness rather than any right-wing pathology that is currently in the ascendency in comedy and other areas of mainstream entertainment, as Bill Maher, Joe Rogan, Jerry Seinfeld, and other non-right-wingers have lamented.</span></p> <p class=\"MsoNormal\"><span>Related posts:</span></p> <p class=\"MsoNormal\"><span><a href=\"http://edwardfeser.blogspot.com/2014/09/thomas-aquinas-henry-adams-steve-martin.html\">Thomas Aquinas, Henry Adams, Steve Martin</a></span></p> <p class=\"MsoNormal\"><span><a href=\"http://edwardfeser.blogspot.com/2014/10/meta-comedy.html\">Meta-comedy</a></span></p> <p class=\"MsoNormal\"><span><a href=\"http://edwardfeser.blogspot.com/2015/08/is-it-funny-because-its-true.html\">Is it funny because it’s true?</a></span></p> <p class=\"MsoNormal\"><span><a href=\"http://edwardfeser.blogspot.com/2015/08/the-comedy-keeps-coming.html\">The comedy keeps coming</a></span></p> <p class=\"MsoNormal\"><span><a href=\"http://edwardfeser.blogspot.com/2015/09/risible-animals.html\">Risible animals</a></span></p> <p class=\"MsoNormal\"><span><a href=\"https://edwardfeser.blogspot.com/2011/09/pop-culture-roundup.html\">Pop culture roundup</a></span></p>"
}