{
  "title":"Confucius on our times",
  "date":"2021-08-24T16:55:47.666000-07:00",
  "author":"Edward Feser",
  "id":"tag:blogger.com,1999:blog-8954608646904080796.post-897890178084872457",
  "link":"http://edwardfeser.blogspot.com/2021/08/confucius-on-our-times.html",
  "content":"<p></p><div class=\"separator\"><a href=\"https://1.bp.blogspot.com/-ShGYiNhwVL0/YSWGy52yQ6I/AAAAAAAAD6E/LRU7KGLit607gu3Krw3W50MofV_X7wVswCLcBGAsYHQ/s304/05.jpg\"><img border=\"0\" height=\"210\" src=\"https://1.bp.blogspot.com/-ShGYiNhwVL0/YSWGy52yQ6I/AAAAAAAAD6E/LRU7KGLit607gu3Krw3W50MofV_X7wVswCLcBGAsYHQ/w134-h210/05.jpg\" width=\"134\"></a></div>What is essential to a well-functioning society?  In a famous passage from <span class=\"MsoHyperlink\"><i><a href=\"http://classics.mit.edu/Confucius/learning.html\">The Great Learning</a></i></span> traditionally attributed to Confucius (551-479 B.C.), the philosopher says:<p></p> <p class=\"MsoNormal\"><i><span>The ancients who wished to illustrate illustrious virtue throughout the kingdom, first ordered well their own states.<span>  </span>Wishing to order well their states, they first regulated their families.<span>  </span>Wishing to regulate their families, they first cultivated their persons.<span>  </span>Wishing to cultivate their persons, they first rectified their hearts.<span>  </span>Wishing to rectify their hearts, they first sought to be sincere in their thoughts.<span>  </span>Wishing to be sincere in their thoughts, they first extended to the utmost their knowledge.<span>  </span>Such extension of knowledge lay in the investigation of things.<span></span></span></i></p><a name=\"more\"/><i></i><p></p> <p class=\"MsoNormal\"><i><span>Things being investigated, knowledge became complete.<span>  </span>Their knowledge being complete, their thoughts were sincere.<span>  </span>Their thoughts being sincere, their hearts were then rectified.<span>  </span>Their hearts being rectified, their persons were cultivated.<span>  </span>Their persons being cultivated, their families were regulated.<span>  </span>Their families being regulated, their states were rightly governed.<span>  </span>Their states being rightly governed, the whole kingdom was made tranquil and happy.</span></i></p> <p class=\"MsoNormal\"><i><span>From the Son of Heaven down to the mass of the people, all must consider the cultivation of the person the root of everything besides.<span>  </span>It cannot be, when the root is neglected, that what should spring from it will be well ordered</span></i><span>.</span></p> <p class=\"MsoNormal\"><span>End quote.<span>  </span>These words from the great man of the East would be warmly endorsed in the West by ancient thinkers like Plato and Aristotle and medieval thinkers like Thomas Aquinas.<span>  </span>But they run counter to the modern West’s liberalism, including the libertarian brand of liberalism that too often passes for “conservatism.”<span>  </span>The liberal attitude is that the moral character of individuals does not matter for social order so long as the right rules and institutions are in place.<span>  </span>Part of Confucius’s point, and that of any conservatism worthy of the name, is that rules and institutions are ineffectual without individuals willing to subordinate their desires to them.<span>  </span>And individuals who do not seek the good (so as to “rectify their hearts”) and the true (thus pursuing the “investigation of things”) can neither curb bad desires nor cultivate good ones.<span>  </span>The brute force of legal coercion cannot substitute for this missing moral fiber.<span>  </span>As we read in chapter 2 of <i>The Analects</i>:</span></p> <p class=\"MsoNormal\"><i><span>The Master said: “Lead them by political maneuvers, restrain them with punishments: the people will become cunning and shameless.<span>  </span>Lead them by virtue, restrain them with ritual: they will develop a sense of shame and a sense of participation.”</span></i><span> (<span class=\"MsoHyperlink\"><a href=\"https://www.amazon.com/Analects-Confucius-Norton-Paperback/dp/0393316998/ref=sr_1_2?dchild=1&amp;keywords=simon+leys&amp;qid=1629665508&amp;sr=8-2\">Simon Leys translation</a></span>)</span></p> <p class=\"MsoNormal\"><span>And again:</span></p> <p class=\"MsoNormal\"><i><span>Someone said to Confucius: “Master, why don’t you join the government?”<span>  </span>The Master said: “In the </span></i><span>Documents<i> it is said: ‘Only cultivate filial piety and be kind to your brothers, and you will be contributing to the body politic.’<span>  </span>This is also a form of political action; one need not necessarily join the government.”</i></span></p> <p class=\"MsoNormal\"><span>And in chapter 12:</span></p> <p class=\"MsoNormal\"><i><span>The Master said: “I could adjudicate lawsuits as well as anyone.<span>  </span>But I would prefer to make lawsuits unnecessary.”</span></i><span> (Leys translation)</span></p> <p class=\"MsoNormal\"><span>In such passages, Confucius reminds us that the personal is the political, not in the totalitarian sense that absorbs the personal up into the political and tries to mold attitudes and actions via state coercion, but on the contrary in the humane sense that devolves the political down to the personal level, in the recognition that social order depends more fundamentally on prevailing morals and mores than on legislation.</span></p> <p class=\"MsoNormal\"><span>In <span class=\"MsoHyperlink\"><i><a href=\"https://www.amazon.com/Our-Oriental-Heritage-Story-Civilization/dp/1567310125/ref=tmm_hrd_swatch_0?_encoding=UTF8&amp;qid=1629578495&amp;sr=8-6\">Our Oriental Heritage</a></i></span>, the first volume of his famous Story of Civilization series, Will Durant glosses the passage quoted above from <i>The Great Learning</i> as follows:</span></p> <p class=\"MsoNormal\"><i><span>This is the keynote and substance of the Confucian philosophy; one might forget all other words of the Master and his disciples, and yet carry away with these “the essence of the matter,” and a complete guide to life.<span>  </span>The world is at war, says Confucius, because its constituent states are improperly governed; these are improperly governed because no amount of legislation can take the place of the natural social order provided by the family; the family is in disorder, and fails to provide this natural social order, because men forget that they cannot regulate their families if they do not regulate themselves; they fail to regulate themselves because they have not rectified their hearts – i.e., they have not cleansed their own souls of disorderly desires; their hearts are not rectified because their thinking is insincere, doing scant justice to reality and concealing rather than revealing their own natures; their thinking is insincere because they let their wishes discolor the facts and determine their conclusions, instead of seeking to extend their knowledge to the utmost by impartially investigating the nature of things</span></i><span>. (p. 668)</span></p> <p class=\"MsoNormal\"><span>If this analysis applied in Confucius’s day 2,500 years ago, and when Durant wrote these words in 1935, it applies a thousandfold today.<span>  </span>Consider what, specifically, Confucius would regard as among the marks of either a well-ordered character or a disordered one. <span> </span>Chapter 1 of <i>The Analects</i> expresses what is perhaps the best-known of Confucian themes:</span></p> <p class=\"MsoNormal\"><i><span>Master You said… “To respect parents and elders is the root of humanity” …</span></i></p> <p class=\"MsoNormal\"><i><span>Master Zeng said: “When the dead are honored and the memory of remote ancestors is kept alive, a people’s virtue is at its fullest.”</span></i><span>(Leys translation)</span></p> <p class=\"MsoNormal\"><span>Chapter 4 admonishes us as follows:</span></p> <p class=\"MsoNormal\"><i><span>The Master said: “Do not worry if you are without a position; worry lest you do not deserve a position.<span>  </span>Do not worry if you are not famous; worry lest you do not deserve to be famous.”</span></i><span> (Leys translation)</span></p> <p class=\"MsoNormal\"><span>Chapter 12 advises:</span></p> <p class=\"MsoNormal\"><i><span>The Master said: “The practice of humanity comes down to this: tame the self and restore the rites… The practice of humanity comes from the self, not from anyone else.”</span></i><span> (Leys translation)</span></p> <p class=\"MsoNormal\"><span>In <span class=\"MsoHyperlink\"><a href=\"http://classics.mit.edu/Confucius/analects.4.4.html\">chapter 16</a></span>, we read:</span></p> <p class=\"MsoNormal\"><i><span>Confucius said, “There are three things which the superior man guards against.<span>  </span>In youth, when the physical powers are not yet settled, he guards against lust.<span>  </span>When he is strong and the physical powers are full of vigor, he guards against quarrelsomeness.<span>  </span>When he is old, and the animal powers are decayed, he guards against covetousness…</span></i><span></span></p> <p class=\"MsoNormal\"><i><span>There are three things of which the superior man stands in awe.<span>  </span>He stands in awe of the ordinances of Heaven.<span>  </span>He stands in awe of great men.<span>  </span>He stands in awe of the words of sages.<span>  </span>The mean man does not know the ordinances of Heaven, and consequently does not stand in awe of them.<span>  </span>He is disrespectful to great men.<span>  </span>He makes sport of the words of sages.” </span></i></p> <p class=\"MsoNormal\"><span>And in chapter 17, we’re told:</span></p> <p class=\"MsoNormal\"><i><span>The Master said: “I detest purple replacing vermilion; I detest popular music corrupting classical music; I detest glib tongues overturning kingdoms and clans…</span></i></p> <p class=\"MsoNormal\"><i><span>I cannot abide these people who fill their bellies all day long, without ever using their minds!”</span></i><span> (Leys translation)</span></p> <p class=\"MsoNormal\"><span>Needless to say, the modern character type is the opposite of that of which Confucius would approve.<span>  </span>Youthful insolence is esteemed and ancestors and tradition are held in contempt. “Irreverent,” “subversive,” “rebel,” and the like are stock terms of approbation.<span>  </span>Power and fame are prized for their own sakes, regardless of merit.<span>  </span>The self is not tamed but indulged, driven by covetousness, lust, and the filling of the belly.<span>  </span>Tastes become ever more vulgar; the very notions of great men and sages, let alone heavenly ordinances, are sneered at; and popular opinion is molded instead by the glib tongues of a relentlessly cynical, mocking, and quarrelsome commentariat.<span>  </span>Longstanding morals and customs have been shredded and social order increasingly depends instead on legislation, regulation, and the threat of litigation.<span>  </span>Confucius, <span class=\"MsoHyperlink\"><a href=\"https://americanmind.org/salvo/woke-ideology-is-a-psychological-disorder/\">like Plato in his analysis of democratic egalitarianism</a></span>, might as well have been describing twenty-first century America.</span></p> <p class=\"MsoNormal\"><span>As hearts are ever further from rectification and thoughts from sincerity, people increasingly conform their ideas about the nature of things to their wishes, rather than conforming their wishes to the nature of things.<span>  </span>Among the consequences is <span class=\"MsoHyperlink\"><a href=\"https://www.theamericanconservative.com/dreher/how-to-understand-woke-jargon/\">the ideologization of language</a></span>, so that it distorts reality rather than revealing it and becomes <span class=\"MsoHyperlink\"><a href=\"https://www.theamericanconservative.com/dreher/media-construction-of-woke-reality-soft-totalitarianism/\">a tool for manipulation</a></span> rather than rational discourse.<span>  </span>Confucius warned of this too, in a famous passage from <span class=\"MsoHyperlink\"><a href=\"http://classics.mit.edu/Confucius/analects.3.3.html\">chapter 13</a></span>of <i>The Analects</i>:</span></p> <p class=\"MsoNormal\"><i><span>Tsze-lu said, “The ruler of Wei has been waiting for you, in order with you to administer the government.<span>  </span>What will you consider the first thing to be done?”<span>  </span>The Master replied, “What is necessary is to rectify names.”<span>  </span>“So! Indeed!” said Tsze-lu. “You are wide of the mark!<span>  </span>Why must there be such rectification?”<span>  </span>The Master said, “How uncultivated you are, Yu!<span>  </span>A superior man, in regard to what he does not know, shows a cautious reserve.<span>  </span>If names be not correct, language is not in accordance with the truth of things.<span>  </span>If language be not in accordance with the truth of things, affairs cannot be carried on to success.”</span></i></p> <p class=\"MsoNormal\"><span>Unfortunately, we are very far from having a government capable of rectifying names.<span>  </span><span class=\"MsoHyperlink\"><a href=\"https://www.theamericanconservative.com/dreher/assabiya-collapse-of-us-elite-afghanistan-lee-smith/\">Nor could disillusioned citizens trust it to do so if it tried</a></span>.<span>  </span>One more passage from <i>The Analects</i>, from <span class=\"MsoHyperlink\"><a href=\"http://classics.mit.edu/Confucius/analects.3.3.html\">chapter 12</a></span>:</span></p> <p class=\"MsoNormal\"><i><span>Tsze-kung asked about government.<span>  </span>The Master said, “The requisites of government are that there be sufficiency of food, sufficiency of military equipment, and the confidence of the people in their ruler.”<span>  </span>Tsze-kung said, “If it cannot be helped, and one of these must be dispensed with, which of the three should be foregone first?” “The military equipment,” said the Master.<span>  </span>Tsze-kung again asked, “If it cannot be helped, and one of the remaining two must be dispensed with, which of them should be foregone?”<span>  </span>The Master answered, “Part with the food.<span>  </span>From of old, death has been the lot of all men; but if the people have no faith in their rulers, there is no standing for the state.”…</span></i></p> <p class=\"MsoNormal\"><i><span>The Duke Ching, of Ch’i, asked Confucius about government.<span>  </span>Confucius replied, “There is government, when the prince is prince, and the minister is minister; when the father is father, and the son is son.”<span>  </span>“Good!” said the duke; “if, indeed, the prince be not prince, the minister not minister, the father not father, and the son not son, although I have my revenue, can I enjoy it?”</span></i></p> <p class=\"MsoNormal\"><span>End quote.<span>  </span>Ours is indeed an age in which fathers do not act like fathers, and authorities in general do not act like authorities.<span>  </span>They either shirk their duties and flatter the mob, or go to the opposite extreme of exerting power <a href=\"https://edwardfeser.blogspot.com/2020/09/the-rule-of-lawlessness.html\">in an arbitrary and despotic way</a>.<span>  </span>But that is, in the long run, inevitable in a liberal polity, where neither citizens nor rulers understand leadership in paternal terms, but rather as merely one more prize to be competed for in the marketplace.<span>  </span><span class=\"MsoHyperlink\"><a href=\"https://edwardfeser.blogspot.com/2020/11/tyranny-of-sovereign-individual.html\">Sovereign individuals</a></span> get the leaders they deserve – good and hard, <span class=\"MsoHyperlink\"><a href=\"https://fee.org/articles/12-hl-mencken-quotes-on-government-democracy-and-politicians/\">as one of our own sages once put it</a></span>.</span></p>"
}