{
  "title":"Adventures in the Old Atheism, Part V: Woody Allen",
  "date":"2021-08-07T14:14:47.212000-07:00",
  "author":"Edward Feser",
  "id":"tag:blogger.com,1999:blog-8954608646904080796.post-8309730945883442774",
  "link":"http://edwardfeser.blogspot.com/2021/08/adventures-in-old-atheism-part-v-woody.html",
  "content":"<p></p><div class=\"separator\"><a href=\"https://1.bp.blogspot.com/-dx0AOk0whoM/YQ73Tt9pzbI/AAAAAAAAD5Y/_Xm2mOrXY8Q261T7jlr5U1aFY9Tz_KjawCLcBGAsYHQ/s372/08.jpg\"><img border=\"0\" height=\"202\" src=\"https://1.bp.blogspot.com/-dx0AOk0whoM/YQ73Tt9pzbI/AAAAAAAAD5Y/_Xm2mOrXY8Q261T7jlr5U1aFY9Tz_KjawCLcBGAsYHQ/w278-h202/08.jpg\" width=\"278\"></a></div><br>So far in this series we’ve considered <span class=\"MsoHyperlink\"><a href=\"https://edwardfeser.blogspot.com/2016/06/adventures-in-old-atheism-part-i.html\">Nietzsche</a></span>, <span class=\"MsoHyperlink\"><a href=\"https://edwardfeser.blogspot.com/2016/08/adventures-in-old-atheism-part-ii-sartre.html\">Sartre</a></span>, <span class=\"MsoHyperlink\"><a href=\"https://edwardfeser.blogspot.com/2019/02/adventures-in-old-atheism-part-iii-freud.html\">Freud</a></span>, and <span class=\"MsoHyperlink\"><a href=\"https://edwardfeser.blogspot.com/2020/01/adventures-in-old-atheism-part-iv-marx.html\">Marx</a></span>.  None of them is exactly a laugh riot.  So let’s now take a look at the lighter side of atheistic disenchantment and nihilism, in the work of that most philosophical of American comic filmmakers, Woody Allen.  We’ve noted how one of the features that distinguishes the New Atheism from the Old is its shallow optimism.  New Atheists typically refuse to see any good in religion at all, and thus can foresee no loss whatsoever in the prospect of its disappearance.  Allen is as free of that sophomoric attitude as any Old Atheist, which gives him at least some of the relative sobriety of the members of that club.<span><a name=\"more\"/></span><p></p> <p class=\"MsoNormal\"><span>Not that Allen is Captain Gravitas.<span>  </span>The loss of meaning and morality in a world without God is a longstanding theme of his movies.<span>  </span>But it is <a href=\"https://www.youtube.com/watch?v=rianV8GrnkQ\">played strictly for laughs</a>in a goofball comedy like <i><a href=\"https://en.wikipedia.org/wiki/Love_and_Death\">Love and Death</a></i>, whereas in a drama like <i><a href=\"https://en.wikipedia.org/wiki/Hannah_and_Her_Sisters\">Hannah and Her Sisters</a></i> it is remedied for one character who is going through an existential crisis <a href=\"https://www.youtube.com/watch?v=vjH8V-D3ZuA\">by watching a Marx Brothers movie</a> and deciding to try to enjoy life to the extent he can.<span>  </span>This is pretty banal stuff, albeit those are both very good movies.<span>  </span>And the atrocious <i><a href=\"https://en.wikipedia.org/wiki/Whatever_Works\">Whatever Works</a></i>exhibits the same banality, but on steroids.<span>  </span>(How bad a flick is it?<span>  </span>So bad that Allen somehow managed to make <i>Larry David</i> unfunny.)<span>  </span></span></p> <p class=\"MsoNormal\"><span>All the same, Allen has also explored the theme in a more serious way, in the marvelous <i><a href=\"https://en.wikipedia.org/wiki/Crimes_and_Misdemeanors\">Crimes and Misdemeanors</a></i>.<span>  </span>Martin Landau’s character Judah Rosenthal is a successful ophthalmologist whose life is unraveling because the woman with whom he has been committing adultery threatens to expose the affair to his wife.<span>  </span>He wrestles with his gangster brother’s proposal to solve the problem by having the woman killed, at first appalled by it but eventually consenting.<span>  </span>He is then racked with guilt, the religious teaching of his father, which he had always rejected, now coming alive for him at last.<span>  </span>He toys with the idea that God does exist after all and that he stands under divine judgment, and considers confessing his crimes.<span>  </span>In the end, however, when he realizes that he is not going to be caught, he gets over his guilt, abandons his tentative belief in God, and cynically returns to his life of affluence.</span></p> <p class=\"MsoNormal\"><span>Meanwhile, Judah’s friend and patient Ben, played by Sam Waterston, is a rabbi who gradually loses his eyesight but remains devout and hopeful.<span>  </span>Woody Allen’s own character Cliff Stern is also going through a crisis, as his marriage is collapsing and his filmmaking career is going nowhere.<span>  </span>Unlike Judah, though, Cliff is not a cynic, and is trying to get a documentary made about a philosophy professor whose ideas he finds inspiring.<span>  </span>But his rival Lester, a fellow filmmaker played by Alan Alda, is a phony and a blowhard but one who nevertheless achieves the recognition and financial and romantic successes that elude Cliff.</span></p> <p class=\"MsoNormal\"><span>One of the themes of the movie, then, is that in a Godless universe there is no moral order, so that the wicked prosper and the good suffer.<span>  </span>The good, and the religious in particular, are also portrayed as naïve and in thrall to wishful thinking.<span>  </span>As <a href=\"https://www.youtube.com/watch?v=gxuzQ30HLl8\">this interesting analysis</a>points out, the wearing of eyeglasses serves in the movie as a subliminal marker of those who are, either permanently or temporarily, dominated by moral or religious illusions.<span>  </span>The characters who do not wear them are those who, though hard and cynical, nevertheless see reality for what it is.</span></p> <p class=\"MsoNormal\"><span>All the same, one of the most interesting features of <i>Crimes and Misdemeanors</i> is that, despite its atheistic worldview, the movie does not portray the devout with contempt, and even affords them a certain nobility. <span> </span>Ben, the rabbi, is represented throughout as admirable, gentle, and a voice of moral reassurance.<span>  </span>Sol, Judah’s father, is stolid and even patient with, if exasperated by, his skeptical relatives.<span>  </span>He defends his faith with stubborn confidence, but in a manner that is nevertheless measured and without anger or fanaticism.<span>  </span>Meanwhile, the characters whose atheism is most pronounced, Judah’s aunt May and Judah himself, are represented as coldly amoral.</span></p> <p class=\"MsoNormal\"><span>This is a far cry from the simplistic picture of the dispute between atheism and religion that one finds in a Dawkins or a Hitchens.<span>  </span>And the point is not that all atheists are like Judah – of course they aren’t – but rather that Allen is, unlike your central casting New Atheist, able to take a critical distance on his unbelief (at least in this movie – in <i>Whatever Works</i>, not so much).<span>  </span>He is willing to entertain the possibility that even if atheism is true, it may have horrific implications, and that even if no religion is true, religion may afford moral depth and consolation that is otherwise unavailable.</span></p> <p class=\"MsoNormal\"><span>In <a href=\"https://www.youtube.com/watch?v=xubKqMY2tPg\">one of the film’s best scenes</a>, Judah imagines being back at one of the Seder meals of his childhood, listening to his father Sol spar with his atheist aunt May.<span>  </span>May insists that the hard truth is that “might makes right.”<span>  </span>Sol, meanwhile, serenely affirms that “if necessary, I will always choose God over truth.”</span></p> <p class=\"MsoNormal\"><span>Naturally, this can be read as simple irrationalism, but there is another way to interpret it.<span>  </span>To me, it is reminiscent of Socrates’ famous remark in Plato’s <i>Republic</i>:</span></p> <p class=\"MsoNormal\"><i><span>The good therefore may be said to be the source not only of the intelligibility of the objects of knowledge, but also of their being and reality; yet it is not itself that reality, but is beyond it, and superior to it in dignity and power</span></i><span>. (p. 234 of the <a href=\"https://www.amazon.com/Republic-Penguin-Classics-Plato/dp/0140455116/ref=sr_1_8?dchild=1&amp;keywords=plato+republic&amp;qid=1628366690&amp;sr=8-8\">Desmond Lee translation</a>)</span></p> <p class=\"MsoNormal\"><span>For “the good,” read Sol’s reference to God, and for “being and reality,” read his reference to truth.<span>  </span>Plato takes the Form of the Good to be so fundamental to the order of things that it is prior even to being and reality themselves, being their source.<span>  </span>It is a kind of <i>super</i>-reality or <i>super</i>-being.<span>  </span>Sol, arguably, thinks of God in a similar way.<span>  </span>So fundamental is the notion of God to the very intelligibility of things that, for Sol, he is a more ultimate reality even than truth of the ordinary sort.<span>  </span>That is, admittedly, to read into Allen’s scene more than he probably had in mind.<span>  </span>It seems clear enough, though, that Sol is portrayed as more than <i>merely</i>putting forward irrationalism or fideism – that Allen acknowledges in him a kind of dignity and moral gravitas <i>despite</i>his eschewal of logic and evidence as May (and Allen) understand them.</span></p> <p class=\"MsoNormal\"><span>These remarks are, of course, not intended to be metaphysically rigorous.<span>  </span>At the end of the day, I don’t think it makes sense to think of the good as beyond being or truth.<span>  </span>On the contrary, as the doctrine of the transcendentals holds, being, truth, and goodness are really all <a href=\"https://edwardfeser.blogspot.com/2017/04/empirical-science-and-transcendentals.html\">the same thing looked at from different points of view</a>.<span>  </span>And as longtime readers know, I also think that the relationship between morality and theism is <a href=\"https://edwardfeser.blogspot.com/2014/04/a-second-exchange-with-keith-parsons.html\">more complicated than either Allen or pop Christian apologists suppose</a>.<span>  </span>The point is that, however one works out the philosophical details, there is a nuance in the treatment of religion in <i>Crimes and Misdemeanors</i> that is absent from New Atheist polemic, or even from some of Allen’s other work.</span></p> <p class=\"MsoNormal\"><span>In chapter 2 of his recent book <i><a href=\"https://www.amazon.com/Meaning-Belief-Religion-Atheists-Point/dp/0674088832/ref=sr_1_1?dchild=1&amp;keywords=The+Meaning+of+Belief%3A+Religion+from+an+Atheist%E2%80%99s+Point+of+View&amp;qid=1628368650&amp;sr=8-1\">The Meaning of Belief: Religion from an Atheist’s Point of View</a></i>, Tim Crane draws a distinction between pessimistic and optimistic atheist responses to the disenchantment of the world.<span>  </span>Both responses urge that we resolutely do our best to supply some sort of meaning and morality to the inherently meaningless and amoral world revealed by science (more accurately, by the philosophical naturalist’s <i>interpretation</i>of science).<span>  </span>But the optimistic atheist thinks that the situation could never really have been other than this, and that the religious view of the world is simply based on a confusion.<span>  </span>To abandon religion is to abandon something that never made sense in the first place, and thus involves no real loss.<span>  </span>The transcendent meaning and morality the religious believer affirms is simply unintelligible on analysis, and thus could never have existed.</span></p> <p class=\"MsoNormal\"><span>The pessimistic atheist, by contrast, thinks that the religious view of things is intelligible, and that the world <i>could</i>in principle have had the transcendent meaning and moral order that the religious believer attributes to it.<span>  </span>It’s just that, as it turns out, that’s not the way the world happens to be.<span>  </span>Hence the pessimistic atheist, unlike the optimistic atheist, feels a real sense of loss upon the abandonment of religious belief.<span>  </span>Allen’s attitude toward disenchantment is clearly of the pessimistic sort, as is, arguably, the attitude of most of the best-known Old Atheists in general.</span></p>"
}