{
  "title":"Divine freedom and necessity",
  "date":"2022-10-28T21:31:21.706000Z",
  "author":"Edward Feser",
  "id":"tag:blogger.com,1999:blog-8954608646904080796.post-2977635389509149084",
  "link":"http://edwardfeser.blogspot.com/2022/10/divine-freedom-and-necessity.html",
  "content":"<p></p><div class=\"separator\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhGf9j8EwQoKypiyiI6GDGoP4jWLvC8dB6goRbGk_TZl6jrR0hGLbt9V_qR3wwdlc8sqVqLpIGHwrL2BwdMTyTQqtBA2zSNCIZxb_uRmOTRKcGfgam7YxwSwLON4Q7V0ZEUmwRRnEK9YBXA_ZjlMjlH5bny3Qlg58kCWZi7xe8zo4ooZafG_1GQhmFMtw/s254/0124.JPG\"><img border=\"0\" height=\"254\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhGf9j8EwQoKypiyiI6GDGoP4jWLvC8dB6goRbGk_TZl6jrR0hGLbt9V_qR3wwdlc8sqVqLpIGHwrL2BwdMTyTQqtBA2zSNCIZxb_uRmOTRKcGfgam7YxwSwLON4Q7V0ZEUmwRRnEK9YBXA_ZjlMjlH5bny3Qlg58kCWZi7xe8zo4ooZafG_1GQhmFMtw/s1600/0124.JPG\" width=\"156\"></a></div>In <span class=\"MsoHyperlink\"><a href=\"http://edwardfeser.blogspot.com/2022/10/divine-freedom-and-heresy.html\">a recent article</a></span>, I commented on Fr. James Dominic Rooney’s <span class=\"MsoHyperlink\"><a href=\"https://churchlifejournal.nd.edu/articles/the-incoherencies-of-hard-universalism/\">critique</a></span>of David Bentley Hart.  My focus was, specifically, on Fr. Rooney’s objections to Hart’s view that God’s creation of the world follows inevitably from his nature.  That position, as Rooney points out, is heretical.  In the comments section <span class=\"MsoHyperlink\"><a href=\"https://afkimel.wordpress.com/2022/10/18/fr-rooney-takes-on-dbh-and-universalism/\">at Fr. Aidan Kimel’s blog</a></span>, Hart defends himself, objecting both to Rooney’s characterization of his position and to the claim that it is heretical.  Let’s take a look.<span><a name=\"more\"></a></span><p></p> <p class=\"MsoNormal\"><span>First, recall the passage from Hart’s book <i>You Are Gods</i> that provided the basis for Fr. Rooney’s charge:<span>  </span></span></p> <p class=\"MsoNormal\"><i><span>For God, deliberative liberty – any “could have been otherwise,” any arbitrary decision among opposed possibilities – would be an impossible defect of his freedom.<span>  </span>God does not require the indeterminacy of the possible in order to be free… And in the calculus of the infinite, any tension between freedom and necessity simply disappears; there is no problem to be resolved because, in regard to the transcendent and infinite fullness of all Being, the distinction is meaningless… And it is only insofar as God is not a being defined by possibility, and is hence infinitely free, that creation inevitably follows from who he is</span></i><span>.<span>  </span><i>This in no way alters the truth that creation, in itself, “might not have been,” so long as this claim is understood as a modal definition, a statement of ontological contingency, a recognition that creation receives its being from beyond itself and so has no necessity intrinsic to itself.</i></span></p> <p class=\"MsoNormal\"><span>End quote.<span>  </span>Hart here says that “creation <i>inevitably follows</i> from who [God] is.”<span>  </span>He denies that there is “<i>any</i> ‘could have been otherwise,’” any “indeterminacy of the possible,” where divine action is concerned.<span>  </span>He says that this is consistent with the thesis that the world might not have been just “so long as” this is understood to mean that the world receives its being from something beyond it.<span>  </span>The implication, given the preceding remarks, is that it has nothing to do with any possibility of God’s refraining from creating it.</span></p> <p class=\"MsoNormal\"><span>Now, given standard philosophical and theological usage of “necessary” and cognate terms, it is clear that Hart is asserting that God creates the world <i>of necessity</i>.<span>  </span>For example, in <i>The Encyclopedia of Philosophy</i>’s article on “Contingent and Necessary Statements,” necessity is characterized as “what must occur,” whereas contingency involves “what may or may not occur.”<span>  </span><i>The Cambridge Dictionary of Philosophy</i> defines “necessity” as “a modal property attributable to a whole proposition… just when it is not possible that the proposition be false.”<span>  </span>Wuellner’s <i>Dictionary of Scholastic Philosophy</i>defines “necessary” as “that which cannot not-be,” “that which must be and be as it is,” and “that which must act as it does and which cannot act otherwise.”<span>  </span>Obviously, Hart thinks God’s creation of the world <i>must </i>occur, given his nature.<span>  </span>He thinks that it is <i>not possible</i> that the proposition that <i>God creates the world</i> be false.<span>  </span>He thinks that God <i>must </i>act to create the world, that his act of creation <i>cannot not-be</i>.<span>  </span>Hence, again, given standard usage, Hart clearly thinks that God creates the world <i>of necessity</i>.</span></p> <p class=\"MsoNormal\"><span>I emphasize this because, in at least some of the remarks Hart makes in reply to Rooney, he seems to <i>deny</i> that he thinks that God creates of necessity.<span>  </span>He asks: “[W]here did I ever suggest God was prompted by a necessity beyond himself – or even within himself?”<span>  </span>And he says that “I’ve always maintained that ‘necessity’ is not a meaningful concept in relation to God,” and indeed that “creation is not necessary for God.”<span>  </span>On the other hand, he <i>also</i> says that “creation follows <i>necessarily</i> from who God freely is”; that “it is <i>impossible</i> that God – the Good as such – would not create”; and that “God as the good <i>cannot fail</i> to be… diffusive” by creating.<span>  </span>And these statements entail that God <i>does</i> create of necessity as the term “necessity” is standardly used.<span>  </span>And again, the remarks in <i>You Are Gods</i>entail it too.<span>  </span></span></p> <p class=\"MsoNormal\"><span>All told, then, it is clear that Hart does not deny, or at least cannot reasonably deny, that he holds that God creates the world of necessity.<span>  </span>Rather, the most that he can try to argue (albeit, I think, unpersuasively) is that the <i>specific sense</i> in which he thinks that God creates of necessity is compatible with divine freedom and with Christian orthodoxy.<span>  </span></span></p> <p class=\"MsoNormal\"><span>To be sure, there is <i>one</i> clear sense in which Hart thinks that God does not create of necessity, insofar as he holds that God is free of “necessitation under <i>extrinsic</i>coercion,” of “a necessity <i>beyond</i>himself.”<span>  </span>Like Fr. Rooney, me, and the Christian tradition in general, Hart agrees that nothing <i>outside </i>of God in any way compels him to create.<span>  </span>For that matter, there is also a sense in which Fr. Rooney, I, and the Christian tradition in general agree with Hart that God acts of necessity in <i>some</i>respects.<span>  </span>In particular, there is no disagreement with Hart when he writes: “Can God lie?<span>  </span>Can God will evil?<span>  </span>No and no, manifestly, because he is the infinite unhindered Good.”<span>  </span></span></p> <p class=\"MsoNormal\"><span>There is also agreement on all sides that there is no <i>arbitrariness</i> in God’s willing to create the world.<span>  </span>Hart characterizes Rooney’s position as “voluntarist,” apparently meaning that by rejecting Hart’s view that God’s nature makes it inevitable that he will create, Rooney must be committed to viewing creation as the product of a random choice with no rhyme or reason about it.<span>  </span>But Rooney takes no such position, nor does anything he says imply it.<span>  </span>Rooney, like the Christian tradition in general, would agree with Hart that God creates the world not arbitrarily but out of love.<span>  </span>What is at issue is whether this makes creation inevitable.<span>  </span></span></p> <p class=\"MsoNormal\"><span>In short, all sides agree that God is not compelled to create by anything outside him, that he cannot will evil, and that his will is not arbitrary or unintelligible.<span>  </span>What is at issue is rather this: Is there anything <i>internal</i>to the divine nature that entails that God <i>could not possibly</i> have refrained from creating the world?<span>  </span>Hart says there is, and Fr. Rooney and I (and, we claim, the mainstream Christian tradition in general) say that there is not.</span></p> <p class=\"MsoNormal\"><span>Why does Hart think so, and why does he think his view is compatible with the tradition?<span>  </span>In his comments at Fr. Kimel’s blog, there seem to be at least five considerations that he thinks support these claims:</span></p> <p class=\"MsoNormal\"><span>1. Hart says that “‘necessity’ is not a meaningful concept in relation to God” and that “necessity cannot attach to him who is perfect infinite act.”<span>  </span>The argument seems to be that since he is explicitly committed to these claims, he cannot fairly be accused of holding that God creates of necessity.<span>  </span>But there are several problems with this line of defense.</span></p> <p class=\"MsoNormal\"><span>First, the argument seems to boil down to mere semantic sleight of hand.<span>  </span>Again, Hart holds that “creation <i>inevitably follows</i> from who [God] is,” denies that there is “<i>any</i> ‘could have been otherwise’” where creation is concerned, and so forth.<span>  </span>This counts as holding that God creates of necessity <i>given the standard philosophical and theological use of “necessity.”</i><span>  </span>Hence, if Hart really is denying that he takes God to create of necessity, the denial rings true only if he is using the word in some idiosyncratic way.</span></p> <p class=\"MsoNormal\"><span>Second, the claim that “‘necessity’ is not a meaningful concept in relation to God” is simply not true in the classical theist tradition within which Hart, Rooney, and I are all operating.<span>  </span>That tradition holds, for example, that God <i>exists</i>of necessity insofar as he is subsistent being itself, pure actuality, and so on.<span>  </span>Hart might respond that he is not denying that there is necessity in God in <i>that</i>sense.<span>  </span>But then, it will not do to dismiss Fr. Rooney’s criticisms on the basis of the completely general assertion that “‘necessity’ is not a meaningful concept in relation to God.” </span></p> <p class=\"MsoNormal\"><span>Third, Hart is in any case not himself consistent on this point.<span>  </span>For in his comments at Fr. Kimel’s blog, he asserts that “creation follows <i>necessarily</i>from who God freely is,” and he compares God’s creation of the world to “a mother’s love for her child… [which] flows <i>necessarily</i>from her nature, unimpeded by exterior conditions.”<span>  </span>Even Hart, then, allows that there is a sense in which he is committed to the claim that God creates of necessity.</span></p> <p class=\"MsoNormal\"><span>2. That last remark from Hart is part of a second line of defense.<span>  </span>He writes:</span></p> <p class=\"MsoNormal\"><i><span>[I]t is impossible that God – the Good as such – would not create, not because he must, but because nothing could prevent him from acting as what he is.<span>  </span>Is a mother’s love for her child unfree because it flows necessarily from her nature, unimpeded by exterior conditions?</span></i></p> <p class=\"MsoNormal\"><span>End quote.<span>  </span>The argument here seems to be this.<span>  </span>There is a sense in which a mother’s love for her child flows of necessity from her nature, but we would not for that reason judge the acts that express this love to be unfree.<span>  </span>Similarly, if, as Hart claims, the act of creation flows of necessity from God’s nature, we shouldn’t judge that it is unfree.</span></p> <p class=\"MsoNormal\"><span>But that this is too quick should be obvious from the fact that, say, a dog’s nurturing of her puppies is also necessitated by her nature – and it <i>is</i> unfree.<span>  </span>Hence, there must be some <i>additional</i> factor in the cases of a human mother and of God that evidences that they are free in a way the dog is not.<span>  </span>What might that be?</span></p> <p class=\"MsoNormal\"><span>Well, in the case of the human mother, she could have decided not to have a child at all.<span>  </span>True, given that she does have the child, her nature, if unimpeded (by sin or by mental illness, say), will lead her inevitably to love the child.<span>  </span>But that’s a conditional necessity, and the antecedent could have failed to be true.<span>  </span>Unlike the dog (which has no choice in the matter) a human being can freely decide not to have children.<span>  </span>But analogously, even if God cannot fail to love the world <i>if </i>he creates it, his freedom is still manifest in the fact that he nevertheless could have refrained from creating it in the first place.</span></p> <p class=\"MsoNormal\"><span>Note that this is compatible with saying that God creates the world out of love, just as it is compatible with saying that a woman might decide to have a child out of love.<span>  </span>That she wills to express her love by having a child to whom she might show that love does not entail that it was inevitable that she would have the child.<span>  </span>And by the same token, that God wills to express his love by creating and showing his love to his creatures does not entail that it was inevitable that he would create.</span></p> <p class=\"MsoNormal\"><span>3. But in response to this, it seems that Hart would deploy a further argument.<span>  </span>At Fr. Kimel’s blog, a reader says: “Creation is unnecessary in that it adds nothing to God.<span>  </span>However, creation is inevitable given the boundless love of God.”<span>  </span>And to this, Hart replies: “Precisely.”<span>  </span>So, it seems that Hart would argue that, unlike a human mother’s love, God’s love is <i>boundless</i>, and that <i>this</i> is what makes his creative act inevitable.<span>  </span>For God to fail to create would entail some bound or limitation on God’s love.<span>  </span></span></p> <p class=\"MsoNormal\"><span>The problem with this is that it contradicts the reader’s first statement, to the effect that creation adds nothing to God.<span>  </span>For if God cannot be boundless in love without creating the world, then creation <i>does</i> add something to God – it <i>completes</i> or <i>perfects</i> his love.<span>  </span>This entails that God <i>needs creation</i> in order to be complete, perfect, unlimited, unbounded.<span>  </span>And this is no less heretical than is the claim that God creates of necessity.<span>  </span>Thus does the First Vatican Council <a href=\"https://www.ewtn.com/catholicism/library/first-vatican-council-1505\">teach that</a> “there is one true and living God, creator and lord of heaven and earth, almighty, eternal, immeasurable, incomprehensible, <b><i>infinite in</i></b> will, understanding and <b><i>every perfection</i></b>” (emphasis added). <span> </span>Of course, Hart would not be moved by the pronouncements of a Catholic council, but the doctrine is grounded in scripture and tradition. <span> </span>For example, Matthew 5:48 says: “You, therefore, must be perfect, <i>as your heavenly Father is perfect</i>.”<span>  </span>It is also a consequence of God’s pure actuality, for only what has some unactualized potential could fail to be perfect.</span></p> <p class=\"MsoNormal\"><span>In <a href=\"https://www.thepublicdiscourse.com/2022/03/80430/\">my review</a> of Hart’s <i>You Are Gods</i>, commenting on Hart’s view that creation follows inevitably from God’s nature, I noted that “it is hard to see how this is different from the Trinitarian claim that the Son is of necessity begotten by the Father; and if it isn’t different, then creation is no less divine than the Son is.”<span>  </span>Hart’s necessitarian view of creation is thus one of several respects in which, as I noted in the review, his position collapses into a kind of pantheism.<span>  </span>And as Pohle and Preuss note in their manual <i>God: His Knowability, Essence, and Attributes</i>, against the traditional doctrine of divine perfection, it is precisely “Pantheists [who] object that ‘God plus the universe’ must obviously be more perfect than ‘God minus the universe’” (p. 188).<span>  </span></span></p> <p class=\"MsoNormal\"><span>Now, some of Hart’s readers have objected to my characterization of him as a pantheist.<span>  </span>But “pantheism” covers a variety of related positions, and even if Hart is not committed to <i>everything</i> that has been associated historically with pantheism, it does not follow that there is no reasonable construal of the term on which his position amounts to pantheism.<span>  </span>And as I noted in <a href=\"https://edwardfeser.blogspot.com/2022/04/whose-pantheism-which-dualism-reply-to.html\">a recent exchange with Hart</a>, he has himself admitted this, <a href=\"https://afkimel.wordpress.com/2020/07/21/the-edward-feser-algorithm-how-to-review-a-book-you-have-not-read/#comment-31833\">saying</a>: “The accusation of pantheism troubles me not in the least… [T]here are many ways in which I would proudly wear the title…<span>  </span>I am quite happy to be accused of pantheism.”</span></p> <p class=\"MsoNormal\"><span>But whether or not Hart thinks pantheism can be reconciled with orthodoxy, his critics do not.<span>  </span>Hence, it will hardly do for him to try to defend the orthodoxy of his necessitarianism via lines of argument that seem to imply pantheism, since this will simply beg the question against his critics, who don’t accept pantheism any more than they accept necessitarianism.</span></p> <p class=\"MsoNormal\"><span>4. But Hart has another argument that might at first glance seem to be precisely the kind that should trouble his critics: </span></p> <p class=\"MsoNormal\"><i><span>A God who merely chooses to create – as one equally possible exercise of deliberative will among others – is either actualizing a potential beyond his nature (in which case he is not God, but a god only) or he is actualizing some otherwise unrealized potential within himself (in which case, again, he is not God, but a god only)</span></i><span>.<span>  </span></span></p> <p class=\"MsoNormal\"><span>End quote.<span>  </span>Given that God is pure actuality, doesn’t it follow that he cannot have potentials of either of the kinds here referred to by Hart?<span>  </span></span></p> <p class=\"MsoNormal\"><span>But as every Thomist knows, we need to draw a distinction between <i>active potency</i> and <i>passive potency</i>.<span>  </span>Passive potency is the capacity to be changed or altered in some way.<span>  </span>It is <i>passive</i> potency or potentiality, specifically, that God utterly lacks by virtue of being pure actuality.<span>  </span>Active potency, by contrast, is the capacity to effect a change in something else.<span>  </span>And as Aquinas <a href=\"https://www.newadvent.org/summa/1025.htm#article1\">writes</a>, <i>active </i>potency or potentiality is something that “we must assign to [God] in the highest degree.”</span></p> <p class=\"MsoNormal\"><span>Now, I assume that Hart accepts this distinction.<span>  </span>If he does, though, then he should realize that his argument does not succeed, because the position he rejects does not entail attributing any passive potential in God (which would indeed be problematic) but rather only active potency.<span>  </span>And if he does not accept the distinction, then his argument simply begs the question against his critics, who do accept it.</span></p> <p class=\"MsoNormal\"><span>5. Finally, Hart makes a point in defense of the orthodoxy of his position, claiming:</span></p> <p class=\"MsoNormal\"><i><span>Not that I give a toss about Roman dogma, but the fact remains that there is no doctrinal rule regarding the metaphysical content of the claim that God creates freely… [W]hat I have written on the matter is one very venerable way of affirming divine freedom in creation.</span></i></p> <p class=\"MsoNormal\"><span>End quote.<span>  </span>But I already explained what is wrong with this in my previous article.<span>  </span>For one thing, Hart is simply mistaken about Catholic doctrine.<span>  </span>The First Vatican Council <a href=\"https://www.ewtn.com/catholicism/library/first-vatican-council-1505\">teaches</a>:</span></p> <p class=\"MsoNormal\"><i><span>If anyone does not confess that the world and all things which are contained in it, both spiritual and material, were produced, according to their whole substance, out of nothing by God; <b>or holds that God did not create by his will free from all necessity, but as necessarily as he necessarily loves himself</b>; or denies that the world was created for the glory of God: <b>let him be anathema</b></span></i><span>.</span></p> <p class=\"MsoNormal\"><span>End quote.<span>  </span>Fr. Rooney, in his own article, cited other Catholic magisterial texts.<span>  </span>Contrary to what Hart says, then, it <i>is</i>in fact a matter of Catholic orthodoxy that divine freedom is not compatible with the view that creation was not “free from all necessity” so that God created the world “as necessarily as he necessarily loves himself.”</span></p> <p class=\"MsoNormal\"><span>Furthermore, I also noted in my previous article that the Catholic position has deep roots in scripture and the Fathers of the Church, citing texts from Clement of Alexandria, Basil the Great, Gregory of Nyssa, Athanasius, Augustine, and Theodoret.<span>  </span>Further evidence could be given.<span>  </span>For example, as Aquinas <a href=\"https://www.newadvent.org/summa/1019.htm#article10\">notes</a>, Ambrose teaches in <i>De Fide</i> II, 3: “The Holy Spirit divideth unto each one as He will, namely, according to the free choice of the will, <i>not in obedience to necessity</i>.”<span>  </span>And as Fr. Rooney has noted in the course of his recent exchanges on this topic at Twitter, Maximus the Confessor also denies that necessitation is compatible with divine freedom, writing: “If you say that the will is natural, and if that what is natural <i>is determined</i>, and if you say that wills in Christ are natural, then you actually <i>eliminate in him every voluntary movement</i>” (quoted in Filip Ivanovic, <a href=\"https://crkvenestudije-churchstudies.com/index.php/studies/article/view/620/570\">“Maximus the Confessor on Freedom”</a>).</span></p> <p class=\"MsoNormal\"><span>In responding to Fr. Rooney, Hart has been dismissive of any attempt to enlist the Fathers against him.<span>  </span>But he has not explained <i>exactly how</i> Rooney or I have misinterpreted them, or <i>exactly how</i>his position can be reconciled with the passages we have quoted.<span>  </span>His argument boils down to a sheer appeal to his own personal authority as a patristics scholar (never mind the fact that not all patristics scholars would agree with his interpretations).<span>  </span>Suppose Hart had cited some text from Aquinas in an argument against me or Fr. Rooney.<span>  </span>And suppose that Rooney or I responded by claiming that Hart had gotten Aquinas wrong, but did not explain exactly how, merely saying: “We’re Thomists, trust us.”<span>  </span>Hart and his fans would regard this as an unserious response, and rightly so.<span>  </span>But this sort of thing is no less unserious when Hart does it.</span></p> <p class=\"MsoNormal\"><span>All told, then, it is clear that Hart has failed successfully to rebut the criticisms Fr. Rooney and I raised in our earlier articles.</span></p>"
}