{
  "title":"Divine freedom and heresy",
  "date":"2022-10-21T00:02:02.879000Z",
  "author":"Edward Feser",
  "id":"tag:blogger.com,1999:blog-8954608646904080796.post-8593346016709691361",
  "link":"http://edwardfeser.blogspot.com/2022/10/divine-freedom-and-heresy.html",
  "content":"<p></p><div class=\"separator\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj5IzLT5azZZYbxuHYw_Ys-4Dz15gO_nbYoynOh58GuagbXK9N-9uqZRdjWyO0uP_eyUD6wStX2SHKvkxFxCp9foAaX_QufdOhN_52000h57SXLKlyTHE3tTTSm62OWRefRrZuYhtk5XtiXATUpvNNYxjtlwRSncwhCJ3XK5spBefGVbQohu9Wd2ef4lg/s264/040.JPG\"><img border=\"0\" height=\"220\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj5IzLT5azZZYbxuHYw_Ys-4Dz15gO_nbYoynOh58GuagbXK9N-9uqZRdjWyO0uP_eyUD6wStX2SHKvkxFxCp9foAaX_QufdOhN_52000h57SXLKlyTHE3tTTSm62OWRefRrZuYhtk5XtiXATUpvNNYxjtlwRSncwhCJ3XK5spBefGVbQohu9Wd2ef4lg/w169-h220/040.JPG\" width=\"169\"></a></div>I commend to you Fr. James Dominic Rooney’s excellent recent <i>Church Life Journal</i> article <span class=\"MsoHyperlink\"><a href=\"https://churchlifejournal.nd.edu/articles/the-incoherencies-of-hard-universalism/\">“The Incoherencies of Hard Universalism.”</a></span>  It is directed primarily at David Bentley Hart’s defense of universalism in his book <i>That All Shall Be Saved</i>, of which <span class=\"MsoHyperlink\"><a href=\"https://edwardfeser.blogspot.com/2020/07/hart-hell-and-heresy.html\">I have also been critical</a></span>.  Fr. Rooney sums up his basic argument as follows:<p></p> <p class=\"MsoNormal\"><i><span>If it is a necessary truth that all will be saved, something makes it so.<span>  </span>The only way it would be impossible for anyone to go to hell is,</span></i></p> <p class=\"MsoNormal\"><i><span>1. that God could not do otherwise than cause human beings to love him or</span></i></p> <p class=\"MsoNormal\"><i><span>2. that human beings could not do otherwise than love God.</span></i></p> <p class=\"MsoNormal\"><i><span>3. There is no third option.</span></i></p> <p class=\"MsoNormal\"><i><span>Both of these options, however, entail heresy.<span>  </span>This is why universalism has been seen as heretical by mainstream Christianity for millennia, for good reason</span></i><span>.<span></span></span></p><a name=\"more\"></a><p></p> <p class=\"MsoNormal\"><span>End quote.<span>  </span>The article goes on to criticize both options at length.<span>  </span>Here I want to focus just on the first one.<span>  </span>It is related not only to Hart’s universalism, but also to his pantheism, which, <span class=\"MsoHyperlink\"><a href=\"https://www.thepublicdiscourse.com/2022/03/80430/\">as I noted in a review</a></span> of his more recent book <i>You Are Gods</i>, Hart has now made explicit.<span>  </span>I there observed that:</span></p> <p class=\"MsoNormal\"><i><span>Hart takes creation to follow </span></i><span>of necessity<i> from the divine nature. <span> </span>For in God, he says, the distinction between freedom and necessity collapses, and “creation inevitably follows from who [God] is.” <span> </span>This is consistent with the thesis that “creation might not have been,” he says, as long as what this means is simply that creation derives from God, albeit of necessity. Yet it is hard to see how this is different from the Trinitarian claim that the Son is of necessity begotten by the Father; and if it isn’t different, then creation is no less divine than the Son is</i>.</span></p> <p class=\"MsoNormal\"><span>End quote.<span>  </span>Fr. Rooney cites the same passage from <i>You Are Gods</i>, which includes other remarks such as:</span></p> <p class=\"MsoNormal\"><i><span>For God, deliberative liberty – any “could have been otherwise,” any arbitrary decision among opposed possibilities – would be an impossible defect of his freedom. <span> </span>God does not require the indeterminacy of the possible in order to be free</span></i><span>… <i>And in the calculus of the infinite, any tension between freedom and necessity simply disappears; there is no problem to be resolved because, in regard to the transcendent and infinite fullness of all Being, the distinction is meaningless.</i></span></p> <p class=\"MsoNormal\"><span>End quote.<span>  </span>Note that Hart takes what amounts to a compatibilist view of divine freedom.<span>  </span>That is to say, he claims that God’s being free is compatible with his being unable not to create the world.<span>  </span>Now, as Rooney says, this contradicts Christian orthodoxy.<span>  </span>To be sure, the tradition affirms that God is unable positively to will <i>evil</i>, specifically, and that the ability to do so would indeed be a defect in his freedom.<span>  </span>But it also insists that he was nevertheless able not to create this particular world, or indeed any world at all.<span>  </span>For Christian orthodoxy, the claim is not (contra Hart) merely that the world could have failed to exist. <span> </span>It is that God could have refrained from bringing it into being.<span>  </span>It is a claim not merely about the nature of the <i>creation</i>, but also about the nature of the <i>creator</i>.<span>  </span></span></p> <p class=\"MsoNormal\"><span>Though Hart couldn’t care less about Catholic doctrine on this subject, it is worth noting that the Church has formally defined this teaching.<span>  </span>The First Vatican Council <span class=\"MsoHyperlink\"><a href=\"https://www.ewtn.com/catholicism/library/first-vatican-council-1505\">declares</a></span>: “If anyone… holds that God did not create by his will free from all necessity, but as necessarily as he necessarily loves himself… let him be anathema.”<span>  </span>Fr. Rooney calls attention to this and other relevant magisterial statements.<span>  </span></span></p> <p class=\"MsoNormal\"><span>But as Rooney also notes, this is by no means just a matter of current Catholic teaching.<span>  </span>It is the teaching of the tradition, going back to scripture and the Fathers of the Church.<span>  </span>Now, there are numerous passages from scripture and the Fathers that affirm God’s freedom.<span>  </span>Many of these, however, would no doubt be interpreted by Hart in a compatibilist way.<span>  </span>But there are also passages that rule out such an interpretation.<span>  </span></span></p> <p class=\"MsoNormal\"><span>For example, many divine actions are described in scripture in a manner that implies that God would not have taken them had certain contingent conditions been different, such as his punishment of sinners at the time of Noah and at Sodom and Gomorrah.<span>  </span>Of course, that does not entail that God really went through some reasoning process, as we do, before acting.<span>  </span>The point is that the clear implication of these texts is that people could have acted other than the way they did, and that had they done so, <i>God</i>would have done something other than what he actually did.<span>  </span></span></p> <p class=\"MsoNormal\"><span>II Maccabees 8:18 says that “almighty God… can by a mere nod destroy not only those who attack us but even the whole world.”<span>  </span>That implies that it is possible for God to refrain from conserving the world in being, and for traditional Christian doctrine his conservation of the world is the fundamental way in which he is its creator.<span>  </span>Matthew 19:26 says that “with God all things are possible,” which would not be true if God were by nature necessitated to create only the things he actually creates.</span></p> <p class=\"MsoNormal\"><span>The Fathers also understand divine freedom in a way that rules out God’s being necessitated to do what he does.<span>  </span>As David Bradshaw <span class=\"MsoHyperlink\"><a href=\"https://afkimel.files.wordpress.com/2018/07/divine-freedom-in-greek-fathers.pdf\">notes</a></span>, Clement of Alexandria says that “God does not do good by necessity, but by choice.”<span>  </span>(Does this conflict with the Christian doctrine that God cannot positively will evil?<span>  </span>No, because we can understand Clement as meaning, not that God could do evil instead of good, but rather that he could refrain from acting at all rather than doing some good action.)<span>  </span>Bradshaw also notes that Basil the Great rejects the idea that God creates “without choice, as the body is the cause of shadow and light the cause of brightness” (where he obviously takes these effects of the body and of light to be necessitated by them); and that Gregory of Nyssa holds that God created “<i>not by any necessity</i>… but because it was fitting.”<span>  </span></span></p> <p class=\"MsoNormal\"><span>Then there is this passage from Athanasius’s <i>Four Discourses against the Arians</i>, <span class=\"MsoHyperlink\"><a href=\"https://www.newadvent.org/fathers/28163.htm\">III.61</a></span>, which contrasts God the Son with the things He creates:</span></p> <p class=\"MsoNormal\"><i><span>Therefore if He be other than all things, as has been above shown, and through Him the works rather came to be, let not ‘by will’ be applied to Him, or He has similarly come to be as the things consist which through Him come to be.<span>  </span>For Paul, whereas he was not before, became afterwards an Apostle ‘by the will of God;’ and our own calling, as itself once not being, but now taking place afterwards, is preceded by will, and, as Paul himself says again, has been made ‘according to the good pleasure of His will’ (Ephesians 1:5).<span>  </span>And what Moses relates, ‘Let there be light,’ and ‘Let the earth appear,’ and ‘Let Us make man,’ is, I think, according to what has gone before, significant of the will of the Agent.<span>  </span>For things which once were not but happened afterwards from external causes, these the Framer counsels to make; but His own Word begotten from Him by nature, concerning Him He did not counsel beforehand</span></i><span>.</span></p> <p class=\"MsoNormal\"><span>End quote.<span>  </span>Athanasius here distinguishes what comes from God “by nature” from what comes from Him “by will.”<span>  </span>The Son proceeds from the Father by nature, whereas created things are made according to the divine will.<span>  </span>Since what proceeds from Him by nature is what proceeds <i>of necessity</i>, the implication is that what comes from God by will does <i>not</i> come from Him of necessity.<span>  </span>Athanasius also says that what comes about by God’s will involves “counsel” (or “deliberation,” as it has also been translated) and to say that something comes about this way implies that there could have been some alternative outcome.</span></p> <p class=\"MsoNormal\"><span>Similarly, in <i>The City of God</i>, <span class=\"MsoHyperlink\"><a href=\"https://www.newadvent.org/fathers/120111.htm\">Book XI, Chapter 24</a></span>, Augustine says that “God made what was made <i>not from any necessity</i>, nor for the sake of supplying any want, but solely from His own goodness, i.e., because it was good.”<span>  </span>And Theodoret writes:</span></p> <p class=\"MsoNormal\"><i><span>The Lord created all things whatsoever He pleased, as Holy Scripture testifies.<span>  </span>He did not, however, will all that it lay in His power to do, but only what seemed to Him to be sufficient.<span>  </span>For it would have been easy for Him to create ten or twenty thousand worlds</span></i><span>.<span>  </span>(<i>De curand. graec. affect.</i> 4, quoted in Pohle and Preuss, <i>God: The Author of Nature and the Supernatural</i>, at p. 44)</span></p> <p class=\"MsoNormal\"><span>This implies that there are things that God <i>could</i>do but <i>does not</i> in fact do, which entails that the products of divine power do not follow with necessity.<span>  </span></span></p> <p class=\"MsoNormal\"><span>Bradshaw argues that even Dionysius the Areopagite can, contrary to what is often thought, be interpreted as holding that God could have refrained from creating (though the exegetical issues are complicated and I leave it to the interested reader to look at Bradshaw’s paper for himself).<span>  </span>Bradshaw thus judges there to be an “apparent unanimity of [patristic] tradition regarding divine choice.”</span></p> <p class=\"MsoNormal\"><span>What became Catholic dogma is, then, well-grounded in Christian tradition, so that Fr. Rooney is, even by Hart’s lights, on solid ground in judging the view that creation follows of necessity from the divine nature to be heretical.<span>  </span>Yet in his brief comment on Fr. Rooney’s essay at Twitter, Hart remarks that “simply screaming ‘heretic’ isn't an argument.” </span></p> <p class=\"MsoNormal\"><span>But Rooney does not “scream,” and he does not merely make an accusation of heresy and leave it at that.<span>  </span>Rather, calmly and at length, he explains why Hart’s position is heretical in the sense of being incompatible with other non-negotiable claims of the Christian faith.<span>  </span>And this <i>is </i>indeed an argument <i>if </i>one’s interlocutor is himself a fellow adherent of that faith.</span></p> <p class=\"MsoNormal\"><span>The reason there is such a category as “heresy” in Christianity, whereas there is no such category in purely philosophical systems, is that Christianity claims to be grounded in special divine revelation.<span>  </span>Anything that purports to be a Christian position must be consistent with that revelation, and the notion of heresy is the notion of that which is not consistent with it.<span>  </span>Now, a Christian theologian who is accused of heresy might, of course, reasonably question whether the charge is just.<span>  </span>He can try to show that his position is, when correctly understood, compatible with Christian revelation.<span>  </span>But what he <i>cannot </i>reasonably do is dismiss considerations of orthodoxy and heresy <i>tout court</i>.<span>  </span>Again, by virtue of calling himself a Christian, he is committed to staying within the bounds of the revelation, and thus avoiding heresy.<span>  </span>And thus he is committed to acknowledging that to accuse a fellow Christian of heresy <i>is indeed an argument</i>.<span>  </span>It may or may not at the end of the day be a <i>good</i> argument, but it is an argument. </span></p> <p class=\"MsoNormal\"><span>As I have complained in <a href=\"https://edwardfeser.blogspot.com/2022/04/whose-pantheism-which-dualism-reply-to.html\">a recent exchange with Hart</a>, one of the problems with his recent work is that he is not consistent on this point.<span>  </span>When it suits his interests, he will appeal to orthodox Christian tradition, and claim that his own views are more consistent with it than those of his opponents.<span>  </span>But in other cases, he will dismiss the standard criteria of Christian orthodoxy and appeal instead to merits that his views purportedly exhibit independently of questions of orthodoxy.<span>  </span>As I there argued, Hart’s approach isn’t, at the end of the day, that of a Christian theologian.<span>  </span>Rather, it is that of a theologian who happens to have been influenced by Christian tradition, but whose ultimate criteria are to be found elsewhere.<span>  </span>The considerations raised by Fr. Rooney, and Hart’s failure to take them seriously, reinforce that conclusion.</span></p> <p class=\"MsoNormal\"><span>Related reading:</span></p> <p class=\"MsoNormal\"><span class=\"MsoHyperlink\"><span><a href=\"https://edwardfeser.blogspot.com/2020/07/hart-hell-and-heresy.html\">Hart, hell, and heresy</a></span></span><span></span></p> <p class=\"MsoNormal\"><span class=\"MsoHyperlink\"><span><a href=\"https://edwardfeser.blogspot.com/2020/07/scripture-and-fathers-contra.html\">Scripture and the Fathers contra universalism</a></span></span><span></span></p> <p class=\"MsoNormal\"><span class=\"MsoHyperlink\"><span><a href=\"https://edwardfeser.blogspot.com/2020/08/popes-creeds-councils-and-catechisms.html\">Popes, creeds, councils, and catechisms contra universalism</a></span></span><span></span></p> <p class=\"MsoNormal\"><span class=\"MsoHyperlink\"><span><a href=\"https://www.thepublicdiscourse.com/2022/03/80430/\">David Bentley Hart’s post-Christian pantheism</a></span></span><span></span></p> <p class=\"MsoNormal\"><span class=\"MsoHyperlink\"><span><a href=\"https://edwardfeser.blogspot.com/2022/04/whose-pantheism-which-dualism-reply-to.html\">Whose pantheism? Which dualism? A Reply to David Bentley Hart</a></span></span></p>"
}