{
  "title":"Adventures in the Old Atheism, Part VII: The influence of Kant",
  "date":"2022-11-11T02:24:21.727000Z",
  "author":"Edward Feser",
  "id":"tag:blogger.com,1999:blog-8954608646904080796.post-4697989236813850205",
  "link":"http://edwardfeser.blogspot.com/2022/11/adventures-in-old-atheism-part-vii.html",
  "content":"<p></p><div class=\"separator\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg2mDKkwcQBcH7XnkWd_bEwfffmHr4BhAE7X0OYkQcH7fdFlgZthWBZr-eKNW6baKIwNlwi7xnboBN59JWMawKunmwgWnsIAcRfEbcUVkW9NSKVFvbHNlCOoLJlZEC52U557_DqOwWDJM0c66cFCHEkjLmpi7ehhUvCCGH6TzFAKZZmOC7ePywIgtZxwQ/s364/0011.jpg\"><img border=\"0\" height=\"212\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEg2mDKkwcQBcH7XnkWd_bEwfffmHr4BhAE7X0OYkQcH7fdFlgZthWBZr-eKNW6baKIwNlwi7xnboBN59JWMawKunmwgWnsIAcRfEbcUVkW9NSKVFvbHNlCOoLJlZEC52U557_DqOwWDJM0c66cFCHEkjLmpi7ehhUvCCGH6TzFAKZZmOC7ePywIgtZxwQ/w296-h212/0011.jpg\" width=\"296\"></a></div><br>Immanuel Kant was, of course, not an atheist.  So why devote an entry to him in this series, thereby lumping him in with the likes of <span class=\"MsoHyperlink\"><a href=\"https://edwardfeser.blogspot.com/2016/06/adventures-in-old-atheism-part-i.html\">Nietzsche</a></span>, <span class=\"MsoHyperlink\"><a href=\"https://edwardfeser.blogspot.com/2016/08/adventures-in-old-atheism-part-ii-sartre.html\">Sartre</a></span>, <span class=\"MsoHyperlink\"><a href=\"https://edwardfeser.blogspot.com/2019/02/adventures-in-old-atheism-part-iii-freud.html\">Freud</a></span>, <span class=\"MsoHyperlink\"><a href=\"https://edwardfeser.blogspot.com/2020/01/adventures-in-old-atheism-part-iv-marx.html\">Marx</a></span>, <span class=\"MsoHyperlink\"><a href=\"https://edwardfeser.blogspot.com/2021/08/adventures-in-old-atheism-part-v-woody.html\">Woody Allen</a></span>, and <span class=\"MsoHyperlink\"><a href=\"https://edwardfeser.blogspot.com/2021/10/adventures-in-old-atheism-part-vi.html\">Schopenhauer</a></span>?  In part because Kant’s philosophy, I would suggest, inadvertently did more to bolster atheism than any other modern system, Hume’s included.  He was, as Nietzsche put it, a “catastrophic spider” (albeit not for the reasons Nietzsche supposed).  But also in part because, like the other thinkers in this series, Kant had a more subtle and interesting attitude about religion than contemporary critics of traditional theology like the New Atheists do.<span><a name=\"more\"></a></span> <p></p> <p class=\"MsoNormal\"><span>Why do I propose that Kant’s influence did even more to bolster modern atheism than Hume’s?<span>  </span>Because Kant offered a <i>positive</i> alternative to the traditional metaphysics that upheld theism, whereas Hume’s critique is essentially negative.<span>  </span>To be sure, contemporary commentators are correct to hold that it is too simple to read Hume as a mere skeptic, full stop.<span>  </span>True, he does try to undermine traditional metaphysical views about substance, causation, the self, moral value, etc.<span>  </span>But he also emphasizes that the hold such notions have over common sense cannot be shaken by philosophical skepticism, since they are too deeply rooted in human psychology.<span>  </span>And for purposes of “common life,” they are indispensable.<span>  </span>Hume’s aim is merely to clip the wings of highfalutin rationalist metaphysical speculation, not to undermine the convictions of the ordinary person.</span></p> <p class=\"MsoNormal\"><span>All the same, precisely for that reason, Hume’s account of <i>philosophy</i>, if not of common sense, is essentially destructive.<span>  </span>Moreover, a consistent Humean will have to take a much more modest view of natural science than contemporary atheists are wont to do – in part because of Hume’s attack on attempts to justify induction, and in part because the deliverances of modern physics are hardly less abstruse and remote from common life than the rationalist speculations he was so keen to shoot down.<span>  </span>A Humean must also give up a rationalistic ethics, given that, as he famously holds, there is nothing contrary to <i>reason</i> (but only to the sentiments of the average person) to prefer that the entire world be destroyed than that one should suffer a scratch to his finger.<span>  </span>Humean arguments entail a pessimism about the powers of human reason that doesn’t sit well with scientism or with dogmatic and triumphalist versions of atheism (even if many atheists and adherents of scientism naively suppose otherwise).</span></p> <p class=\"MsoNormal\"><span>Kant, by contrast, tied his critique of traditional metaphysics to an essentially positive and optimistic view of what reason could accomplish.<span>  </span>True, he did not think reason could penetrate into the natures of things as they are in themselves.<span>  </span>Since that’s what traditional metaphysics claimed to do, and natural theology is grounded in such metaphysics, his position entails a critique of traditional metaphysics and natural theology.<span>  </span>However, in Kant’s view this entailed no doubts about the rational foundations of morality or of science (which concerns the world as it appears to us rather than as it is in itself).<span>  </span>A consistent Humean has to put natural theology, natural science, and ethics in the same boat.<span>  </span>A consistent Kantian can leave natural theology in the boat by itself.</span></p> <p class=\"MsoNormal\"><i><span>Ultimate explanation</span></i></p> <p class=\"MsoNormal\"><span>All the same, Kant’s critique of natural theology did not stem from the view that it is an irrational enterprise. <span> </span>Quite the contrary.<span>  </span>The New Atheist supposes that all theology reflects an insufficient respect for reason.<span>  </span>Kant argues, by contrast, that in fact natural theology reflects an <i>excessive confidence</i> in the power of reason.<span>  </span>In particular, it reflects the conviction that ultimate explanation is possible, that the world can be made intelligible through and through.<span>  </span>Nor did Kant suppose that natural theology looked for such explanation in the crudely anthropomorphic “sky daddy” of New Atheist caricature.<span>  </span>Here is how he describes the basic impulse behind philosophical theism in the <i>Critique of Pure Reason</i>:</span></p> <p class=\"MsoNormal\"><i><span>Reason… is impelled… to seek a resting-place in the regress from the conditioned, which is given, to the unconditioned… This is the course which our human reason, by its very nature, leads all of us, even the least reflective, to adopt</span></i><span>…</span></p> <p class=\"MsoNormal\"><i><span>If we admit something as existing, no matter what this something may be, we must also admit that there exists something which exists </span></i><span>necessarily<i>.<span>  </span>For the contingent exists only under the condition of some other contingent existence as its cause, and from this again we must infer yet another cause, until we are brought to a cause which is not contingent, and which is therefore unconditionally necessary</i>…</span></p> <p class=\"MsoNormal\"><i><span>Now… that which is in no respect defective, that which is in every way sufficient as a condition, seems to be precisely the being to which absolute necessity can fittingly be described. <span> </span>For while it contains the conditions of all that is possible, it itself does not require and indeed does not allow of any condition, and therefore satisfies… the concept of unconditioned necessity</span></i><span>…</span></p> <p class=\"MsoNormal\"><i><span>The concept of an </span></i><span>ens realissimum<i> is therefore, of all concepts of possible things, that which best squares with the concept of an unconditionally necessary being; and… we have no choice in the matter, but find ourselves constrained to hold to it…</i></span></p> <p class=\"MsoNormal\"><i><span>Such, then, is the natural procedure of human reason</span></i><span>. <span> </span><i>It… looks around for the concept of that which is independent of any condition, and finds it in that which is itself the sufficient condition of all else, that is, in that which contains all reality.<span>  </span>But that which is all-containing and without limits is absolute unity, and involves the concept of a single being that is likewise the supreme being</i>. (pp. 495-97, Norman Kemp Smith translation)</span></p> <p class=\"MsoNormal\"><span>Reason, Kant says, cannot be satisfied as long as the explanations it posits make reference only to what is conditioned, to contingent things.<span>  </span><i>Ultimate</i>explanation must posit the existence of something which is absolutely <i>un</i>conditioned or <i>necessary</i>.<span>  </span>This something would be a single, unified “<i>ens realissimum</i>” or most real being, would be devoid of any defect, and would be the source of all other reality – it would possess “the <i>highest </i>causality… which contains primordially in itself the sufficient ground of every possible effect” (p. 499).<span>  </span>Naturally, it is not the likes of Zeus or Odin that Kant has in mind, but rather the Unmoved Mover of Aristotle and Aquinas, the One of Plotinus, the Necessary Being of Leibniz, and so on.</span></p> <p class=\"MsoNormal\"><span>The trouble with this sort of reasoning, Kant thinks, is not that its conclusion is false – again, he was no atheist – but rather that, given his epistemology, reason lacks the resources to transcend the empirical world and prove the existence of a necessary or unconditioned being outside it.<span>  </span>The notion of causality, he argues, applies only <i>within</i> the phenomenal world, the world of things as they appear to us, whereas reasoning to a necessary being would require applying it beyond that world, to the noumenal world or things as they are in themselves.<span>  </span>And we cannot, in his view, know the latter.</span></p> <p class=\"MsoNormal\"><span>By no means does this make reasoning to such a divine first cause superstitious or otherwise foolish.<span>  </span>After all, Kant also thinks that the notions of space and time apply only within the phenomenal world and not to things as they are in themselves.<span>  </span>You might think it <i>mistaken</i> to suppose that the notions of space and time apply to things as they are in themselves, but few would regard it as superstitious, or irrational, or otherwise contemptible to do so.<span>  </span>By the same token, there is nothing superstitious, irrational, or otherwise contemptible in the idea of a first uncaused cause, even if one supposes, with Kant, that reason is incapable of validly drawing the inference to it.<span>  </span></span></p> <p class=\"MsoNormal\"><span>Again, in Kant’s view, it is not the abandonment of reason, but rather the attempt to fulfill reason’s ultimate ambitions, that yields natural theology.<span>  </span>And reason will remain frustrated even in the face of Kantian attempts to show that this ambition cannot be fulfilled.<span>  </span>It is “quite beyond our utmost efforts to <i>satisfy</i> our understanding in this matter” but “equally unavailing are all attempts to induce it to acquiesce in its incapacity” (p. 513).</span></p> <p class=\"MsoNormal\"><i><span>The metaphysics of morals</span></i></p> <p class=\"MsoNormal\"><span>“As follows from these considerations,” Kant says, “the ideal of the supreme being is nothing but a <i>regulative principle</i> of reason, which directs us to look upon all connection in the world <i>as if</i> it originated from an all-sufficient necessary cause” (p. 517).<span>  </span>Note that Kant is not saying that this ideal is an unavoidable useful <i>fiction</i>, but rather that it is unavoidable and useful even if (in his view) <i>unprovable</i>.<span>  </span></span></p> <p class=\"MsoNormal\"><span>Even so, he does not regard the affirmation of God’s existence as groundless.<span>  </span>On the contrary, he famously argues that a rationale for affirming it is to be found in practical rather than pure reason, in ethics rather than in metaphysics.<span>  </span>Just as reason seeks an ultimate explanation, so too, Kant argues in the <i>Critique of Practical Reason</i>, it seeks the highest good.<span>  </span>And the highest good, he argues, would be the conjunction of moral virtue, which makes us worthy of happiness, with happiness itself.<span>  </span></span></p> <p class=\"MsoNormal\"><span>Now, we are obligated by the moral law to try to realize this highest good.<span>  </span>And since <i>ought </i>implies <i>can</i>, it must be possible to realize it.<span>  </span>Yet it is obviously not realized in this life, since virtuous people often suffer and evil people often live lives of comfort and pleasure.<span>  </span>Moreover, Kant thinks, its realization <i>cannot</i> be guaranteed in this life, since there is, he thinks, no inherent necessary correlation between the demands of the moral law and the causal order that governs the natural world.<span>  </span>We can make sense of such a correlation only if we postulate a supreme being who brings the two orders into correlation (in the afterlife).</span></p> <p class=\"MsoNormal\"><span>Kant does not take this to be a strict proof of God’s existence, but rather an argument to the effect that it is reasonable to affirm God’s existence.<span>  </span>And once again, the idea is not that theism involves believing something contrary to reason, but quite the opposite.<span>  </span>Affirming God’s existence is, in Kant’s view, precisely what is called for in order to make sense of what reason dictates in the realm of action.</span></p> <p class=\"MsoNormal\"><i><span>The afterlife of Hume and Kant</span></i></p> <p class=\"MsoNormal\"><span>It is widely supposed that Hume and Kant put paid to the arguments of natural theology.<span>  </span>But their critiques largely presuppose their background views in epistemology and metaphysics.<span>  </span>If you don’t buy those views (and I don’t) you needn’t accept their critiques.<span>  </span>Yet Hume’s and Kant’s general epistemological and metaphysical views are hardly uncontroversial, and many who suppose their critiques of natural theology to be compelling would not accept them (if, indeed, they even know much about them).<span>  </span></span></p> <p class=\"MsoNormal\"><span>Moreover, as I have argued, if you do accept these background views, then to be consistent you’d have to draw other conclusions that most New Atheist types would not want to draw.<span>  </span>Again, if you accept a Humean critique of natural theology, then to be consistent you should also be skeptical about the claims of natural science and ethics to tell us anything about objective reality.<span>  </span>And if you accept a Kantian critique of natural theology, then while you can consistently take natural science and ethics to have a rational basis, you cannot consistently treat theology with the contempt that Dawkins and Co. typically do.<span>  </span>Hence the lessons so many have drawn from Hume’s and Kant’s critiques is not the one either of those critiques actually supports.</span></p> <p class=\"MsoNormal\"><span>Related posts:</span></p> <p class=\"MsoNormal\"><span><a href=\"https://edwardfeser.blogspot.com/2010/10/catastrophic-spider.html\">The catastrophic spider</a></span></p> <p class=\"MsoNormal\"><span><a href=\"https://edwardfeser.blogspot.com/2014/05/sexual-cant-from-asexual-kant.html\">Sexual cant from the asexual Kant</a></span></p> <p class=\"MsoNormal\"><span><a href=\"https://edwardfeser.blogspot.com/2020/06/theology-and-analytic-posteriori.html\">Theology and the analytic a posteriori</a></span></p> <p class=\"MsoNormal\"><span><a href=\"https://edwardfeser.blogspot.com/2017/04/the-problem-of-humes-problem-of.html\">The problem of Hume’s problem of induction</a></span></p> <p class=\"MsoNormal\"><span><a href=\"https://edwardfeser.blogspot.com/2014/02/a-world-of-pure-imagination.html\">A world of pure imagination</a></span></p> <p class=\"MsoNormal\"><span><a href=\"https://edwardfeser.blogspot.com/2009/06/hume-science-and-religion.html\">Hume, science, and religion</a></span></p> <p class=\"MsoNormal\"><span><a href=\"https://edwardfeser.blogspot.com/2010/12/hume-cosmological-arguments-and-fallacy.html\">Hume, cosmological arguments, and the fallacy of composition</a></span></p>"
}